{
  "scraped_at": "2025-10-27T18:56:59.778546",
  "total_articles": 17,
  "category": "diving",
  "articles_per_category": 100,
  "articles": [
    {
      "url": "https://www.bbc.com/sport/diving/articles/cz9jdpgp22eo",
      "main_category": "sport",
      "detailed_category": "diving",
      "topic": "Reid proud of 'pushing boundaries' after retirement",
      "content": [
        "Scottish diver Grace Reid says she is proud to have \"pushed boundaries\" after bringing the curtain down on a \"whirlwind\" career.The two-time European and Commonwealth Games gold medallist, 29, announced her retirement on Wednesday.Reid, who also won two World Championship silver medals, has earned a reputation as a trailblazer for her sport in Scotland.\"Looking at some of the stuff I have achieved and the boundaries I have pushed there is a lot to be very proud of,\" she told BBC Scotland.\"I like to think one person could look at me and go, 'everyone told her she would never make that jump to the Olympics and get those really difficult dives' and I proved everyone wrong. \"I think if I could pick my legacy it would be that you are never down and out. The best things worth having are often really difficult, but that is what makes them so special.\"",
        "After taking the sport up at five, she admits \"baby Grace might have struggled to have conceived\" what she would go on to achieve.Her elite career began at the 2010 Commonwealth Games in Delhi, where - aged 14 - she was the youngest member of the Team Scotland squad. Since then she has racked up major medals and milestones.In 2016, she became the first Scot to win an individual European diving medal since 1954, taking bronze in the 3m springboard.In the same year she became the first British woman to make an Olympic final in the same discipline, finishing eighth.Two years later she won Commonwealth Games gold, a first ever women's diving medal at the event for Scotland and the first Scottish gold medal in the sport in 60 years.\"There have been so many highs, there have been a lot of lows, really difficult times, a lot of change, a lot of growth, firsts, records,\" Reid explained.\"It really has given me everything in every capacity, from a personal perspective and also from a sporting angle as well.\"Championing women in sport, young people in general and the benefits that sport has to offer is something that has been at the core of what I have done since I was little and that equal opportunity is something that I am very passionate about.\"Reid graduated from Edinburgh University earlier this year with an applied sport science degree.\"I would love to stay involved in sport,\" she added. \"What that actually looks like in what capacity I am still trying to figure that out but I know that my passion for sport is going to be used in some capacity, whatever role I end up doing.'Having my degree and having 20 years of experience in elite sport is quite a deadly combination.\"It is a lot to process so I am giving myself time to figure that out. It is exciting to think what I could be doing in a couple of months' time.\"",
        "Grace Reid competed at three Olympics",
        "Scottish diver Grace Reid says she is proud to have \"pushed boundaries\" after bringing the curtain down on a \"whirlwind\" career.",
        "The two-time European and Commonwealth Games gold medallist, 29, announced her retirement on Wednesday.",
        "Reid, who also won two World Championship silver medals, has earned a reputation as a trailblazer for her sport in Scotland.",
        "\"Looking at some of the stuff I have achieved and the boundaries I have pushed there is a lot to be very proud of,\" she told BBC Scotland.",
        "\"I like to think one person could look at me and go, 'everyone told her she would never make that jump to the Olympics and get those really difficult dives' and I proved everyone wrong.",
        "\"I think if I could pick my legacy it would be that you are never down and out. The best things worth having are often really difficult, but that is what makes them so special.\"",
        "Commonwealth champion Reid announces retirement",
        "After taking the sport up at five, she admits \"baby Grace might have struggled to have conceived\" what she would go on to achieve.",
        "Her elite career began at the 2010 Commonwealth Games in Delhi, where - aged 14 - she was the youngest member of the Team Scotland squad. Since then she has racked up major medals and milestones.",
        "In 2016, she became the first Scot to win an individual European diving medal since 1954, taking bronze in the 3m springboard.",
        "In the same year she became the first British woman to make an Olympic final in the same discipline, finishing eighth.",
        "Two years later she won Commonwealth Games gold, a first ever women's diving medal at the event for Scotland and the first Scottish gold medal in the sport in 60 years.",
        "\"There have been so many highs, there have been a lot of lows, really difficult times, a lot of change, a lot of growth, firsts, records,\" Reid explained.",
        "\"It really has given me everything in every capacity, from a personal perspective and also from a sporting angle as well.",
        "\"Championing women in sport, young people in general and the benefits that sport has to offer is something that has been at the core of what I have done since I was little and that equal opportunity is something that I am very passionate about.\"",
        "Reid graduated from Edinburgh University earlier this year with an applied sport science degree.",
        "\"I would love to stay involved in sport,\" she added. \"What that actually looks like in what capacity I am still trying to figure that out but I know that my passion for sport is going to be used in some capacity, whatever role I end up doing.",
        "'Having my degree and having 20 years of experience in elite sport is quite a deadly combination.",
        "\"It is a lot to process so I am giving myself time to figure that out. It is exciting to think what I could be doing in a couple of months' time.\""
      ]
    },
    {
      "url": "https://www.bbc.com/sport/olympics/articles/c20zv9p5yvxo",
      "main_category": "sport",
      "detailed_category": "diving",
      "topic": "Who is Celebrity Traitors' Tom Daley?",
      "content": [
        "Olympic gold medallist diver Tom Daley will be joining the star-studded round table of The Celebrity Traitors. Daley was 14 when he made his Olympic debut, representing Great Britain at the 2008 Beijing Summer Olympic Games.He has won all three types of medals (gold, silver and bronze) in his Olympic career.The 31-year-old retired from competing after the 2024 Paris Olympic games - he had previously taken two career breaks, in 2018 and 2021.Daley said he returned to diving in 2023 as his son wanted to see him compete.He is also known for his hobby in knitting and crocheting - he was seen knitting an Olympic jumper in the crowd while watching his fellow British divers compete at the 2024 Games.Daley, who is married to US film-maker Dustin Lance Black, posts videos of his life on YouTube.He also featured on 'Splash!' a TV series which followed celebrities learning to dive. \"I want to win. That's the whole point of the game. I'm there to have fun, but at the same time I want to do well,\" Daley said ahead of Celebrity Traitors.\"I'm spending this time away from my family so I'm fully putting myself into it and I want to do them proud.\"Fans will have to stay tuned to see whether Daley will be a Faithful or a Traitor.The Celebrity Traitors begins on Wednesday, 8 October at 21:00 on BBC One and iPlayer.",
        "Daley started his competitive career at the age of 12 and was named BBC Sport Young Personality of the Year in 2007, 2009 and 2010.He is Britain's most decorated Olympic diver, with five medals to his name including a gold in the men's 10m synchro, one silver and three bronze medals.Since his Olympic debut in 2008, Daley has featured in five Games.Daley also has five Commonwealth Games medals, four of which are gold.He has competed in and won medals at the National and European Championships and the world series. He was awarded an OBE in 2022 for his services to diving, LGBTQ+ and charity.This article is the latest from BBC Sport's Ask Me Anything team.",
        "Ask Me Anything is a service dedicated to answering your questions.We want to reward your time by telling you things you do not know and reminding you of things you do.The team will find out everything you need to know and be able to call upon a network of contacts including our experts and pundits.We will be answering your questions from the heart of the BBC Sport newsroom, and going behind the scenes at some of the world's biggest sporting events.Our coverage will span the BBC Sport website, app, social media and YouTube accounts, plus BBC TV and radio.",
        "Who has qualified for the 2026 World Cup so far?What is MND and are athletes more likely to be diagnosed?Who is Strictly contestant Karen Carney?",
        "Olympic gold medallist diver Tom Daley will be joining the star-studded round table of The Celebrity Traitors.",
        "Daley was 14 when he made his Olympic debut, representing Great Britain at the 2008 Beijing Summer Olympic Games.",
        "He has won all three types of medals (gold, silver and bronze) in his Olympic career.",
        "The 31-year-old retired from competing after the 2024 Paris Olympic games - he had previously taken two career breaks, in 2018 and 2021.",
        "Daley said he returned to diving in 2023 as his son wanted to see him compete.",
        "He is also known for his hobby in knitting and crocheting - he was seen knitting an Olympic jumper in the crowd while watching his fellow British divers compete at the 2024 Games.",
        "Daley, who is married to US film-maker Dustin Lance Black, posts videos of his life on YouTube.",
        "He also featured on 'Splash!' a TV series which followed celebrities learning to dive.",
        "\"I want to win. That's the whole point of the game. I'm there to have fun, but at the same time I want to do well,\" Daley said ahead of Celebrity Traitors.",
        "\"I'm spending this time away from my family so I'm fully putting myself into it and I want to do them proud.\"",
        "Fans will have to stay tuned to see whether Daley will be a Faithful or a Traitor.",
        "The Celebrity Traitors begins on Wednesday, 8 October at 21:00 on BBC One and iPlayer.",
        "Send us your questions",
        "Daley started his competitive career at the age of 12 and was named BBC Sport Young Personality of the Year in 2007, 2009 and 2010.",
        "He is Britain's most decorated Olympic diver, with five medals to his name including a gold in the men's 10m synchro, one silver and three bronze medals.",
        "Since his Olympic debut in 2008, Daley has featured in five Games.",
        "Daley also has five Commonwealth Games medals, four of which are gold.",
        "He has competed in and won medals at the National and European Championships and the world series.",
        "He was awarded an OBE in 2022 for his services to diving, LGBTQ+ and charity.",
        "This article is the latest from BBC Sport's Ask Me Anything team.",
        "Ask Me Anything is a service dedicated to answering your questions.",
        "We want to reward your time by telling you things you do not know and reminding you of things you do.",
        "The team will find out everything you need to know and be able to call upon a network of contacts including our experts and pundits.",
        "We will be answering your questions from the heart of the BBC Sport newsroom, and going behind the scenes at some of the world's biggest sporting events.",
        "Our coverage will span the BBC Sport website, app, social media and YouTube accounts, plus BBC TV and radio.",
        "Who has qualified for the 2026 World Cup so far?",
        "What is MND and are athletes more likely to be diagnosed?",
        "Who is Strictly contestant Karen Carney?"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/diving/articles/ced53vl8l04o",
      "main_category": "sport",
      "detailed_category": "diving",
      "topic": "Commonwealth champion Reid announces retirement",
      "content": [
        "Grace Reid has announced her retirement from diving at the age of 29, saying \"it's time for a new adventure and a new chapter\".The two-time European champion and double Commonwealth gold medallist took part in her third successive Olympics at Paris 2024 and won silver and bronze at European, world and World Cup level.Her last podium place came at last year's World Championships in Doha, taking second in the 1m springboard two years on from her 3m mixed synchro Commonwealth gold with compatriot James Heatly at Birmingham 2022.\"The biggest thing for me is a feeling that I'm leaving on my own terms and feeling like I've done everything I wanted to do in the sport,\" Reid told Scottish Swimming.",
        "\"After Paris a lot of people might have expected me to retire, but the biggest thing for me was loving my sport and getting to a point of feeling that I'd left no stone unturned – I achieved that this year on so many levels.\"Making another world championship team this summer, I just loved every second of it, but when I did my last dive in Singapore I knew that something was different.\"Everyone always said to me, 'well, you'll know when you know' and that couldn't be more true. I know in my heart that it's time for a new adventure and a new chapter.\"",
        "Reid explained \"it's hard to narrow down\" her proudest moments.\"I've got so much to be proud of that there's not one thing that I'm holding on a pedestal, that's for sure,\" she said.\"Obviously making my first Olympic Games, I think will always be a standout because it was something I dreamed about as a little girl and to be able to qualify for one, let alone three, it was just a huge milestone.\"Then I think probably winning gold at Europeans in front of a home crowd in Edinburgh, that's a memory I will hold on to for the rest of my days – to see my friends and family in the crowd as I had that moment and just knowing how I stepped up under pressure.\"My biggest supporters have definitely been my mum and dad, they have just been so unwavering in their support through good through bad. And, you know, I've been so lucky to have some incredible coaches that have guided me, in and out of the pool, and all the support staff; psychology, nutrition and just the physios that have held me together physically, as well as mentally.\"I can't thank everyone enough for every opportunity that they've given me to excel as much as I did.\"",
        "Grace Reid appeared at three successive Olympics",
        "Grace Reid has announced her retirement from diving at the age of 29, saying \"it's time for a new adventure and a new chapter\".",
        "The two-time European champion and double Commonwealth gold medallist took part in her third successive Olympics at Paris 2024 and won silver and bronze at European, world and World Cup level.",
        "Her last podium place came at last year's World Championships in Doha, taking second in the 1m springboard two years on from her 3m mixed synchro Commonwealth gold with compatriot James Heatly at Birmingham 2022.",
        "\"The biggest thing for me is a feeling that I'm leaving on my own terms and feeling like I've done everything I wanted to do in the sport,\" Reid told Scottish Swimming.",
        "\"After Paris a lot of people might have expected me to retire, but the biggest thing for me was loving my sport and getting to a point of feeling that I'd left no stone unturned – I achieved that this year on so many levels.",
        "\"Making another world championship team this summer, I just loved every second of it, but when I did my last dive in Singapore I knew that something was different.",
        "\"Everyone always said to me, 'well, you'll know when you know' and that couldn't be more true. I know in my heart that it's time for a new adventure and a new chapter.\"",
        "Reid frustrated by final display",
        "Reid and Goodfellow win gold in Edinburgh",
        "Reid & Heatly win gold as Scotland reach 51 medals",
        "Reid explained \"it's hard to narrow down\" her proudest moments.",
        "\"I've got so much to be proud of that there's not one thing that I'm holding on a pedestal, that's for sure,\" she said.",
        "\"Obviously making my first Olympic Games, I think will always be a standout because it was something I dreamed about as a little girl and to be able to qualify for one, let alone three, it was just a huge milestone.",
        "\"Then I think probably winning gold at Europeans in front of a home crowd in Edinburgh, that's a memory I will hold on to for the rest of my days – to see my friends and family in the crowd as I had that moment and just knowing how I stepped up under pressure.",
        "\"My biggest supporters have definitely been my mum and dad, they have just been so unwavering in their support through good through bad. And, you know, I've been so lucky to have some incredible coaches that have guided me, in and out of the pool, and all the support staff; psychology, nutrition and just the physios that have held me together physically, as well as mentally.",
        "\"I can't thank everyone enough for every opportunity that they've given me to excel as much as I did.\""
      ]
    },
    {
      "url": "https://www.bbc.com/sport/articles/cqxgrxnen5qo",
      "main_category": "sport",
      "detailed_category": "diving",
      "topic": "GB's Harper and Mew Jensen win diving silver at Worlds",
      "content": [
        "Great Britain's Yasmin Harper and Scarlett Mew Jensen claimed silver in the women's 3m synchronised diving final at the World Aquatics Championships.The pair, who won Team GB's first medal of the 2024 Olympics with a bronze in Paris, finished off with their highest score of 69.75 as they achieved 298.35 points in Singapore.China's Yiwen Chen and Jia Chen were top of the standings with 325.20 points, while Lia and Mia Cueva Lobato, of Mexico, were third with 294.36 points.Harper and Mew Jensen have now won three consecutive medals together at the World Aquatics Championships, having claimed silver in 2023 and bronze in 2024.In the men's 10m synchronised diving, GB's Kyle Kothari and Robbie Lee produced a strong last dive to finish fourth with 399.27 points as China's Zilong Cheng and Zifeng Zhu narrowly claimed gold with 429.63 points.",
        "In the swimming, American great Katie Ledecky won the 22nd world title of her career by claiming a dominant victory in the women's 1500m freestyle final.The 28-year-old finished in 15 minutes 26.44 seconds as she won a sixth World Championship gold in the event, with Italy's Simona Quadarella second in 15:31.79 and Australia's Lani Pallister third in 15:41.18.\"I love this race. This race was the race that I broke my first world record in in 2013,\" said Ledecky, who has won nine Olympic golds.\"Lots of great races and memories over the years at worlds. I'm happy I could do it in Singapore.\"Australia's Kaylee McKeown set a championship record to win the women's 100m backstroke final in 57.16 as she beat American rival Regan Smith, who was second in 57.35.Smith took McKeown's world record in the event in 2024 when she set a time of 57.13 but had to settle for silver behind the Australian in the 100m and 200m backstroke finals at the 2024 Olympics.\"It's always very nerve-wracking, especially off the back of the Olympics,\" said McKeown, who also won the 100m and 200m backstroke titles at the Olympics in Tokyo.\"I was probably a bit more nervous than I would like to have been tonight.\"Romania's David Popovici produced a strong finish to win his duel against American Luke Hobson in the men's 200m freestyle final.Popovici, who won Olympic gold in the discipline in 2024, touched the wall in 1:43.53, while second-placed Hobson came home in 1:43.84.\"Even better than the Olympics to be honest,\" said Popovici. \"You know why? I trained a lot for the Olympics but this year has been more relaxed and easygoing.\"I am very proud of myself.\"Elsewhere, South Africa's Pieter Coetze took gold in the men's 100m backstroke final in 51.85 as Briton Oliver Morgan finished fifth in 52.37, while Germany's Anna Elendt (1:05.19) won the women's 100m breaststroke final.",
        "Harper and Mew Jensen won bronze at the 2024 Olympics",
        "Great Britain's Yasmin Harper and Scarlett Mew Jensen claimed silver in the women's 3m synchronised diving final at the World Aquatics Championships.",
        "The pair, who won Team GB's first medal of the 2024 Olympics with a bronze in Paris, finished off with their highest score of 69.75 as they achieved 298.35 points in Singapore.",
        "China's Yiwen Chen and Jia Chen were top of the standings with 325.20 points, while Lia and Mia Cueva Lobato, of Mexico, were third with 294.36 points.",
        "Harper and Mew Jensen have now won three consecutive medals together at the World Aquatics Championships, having claimed silver in 2023 and bronze in 2024.",
        "In the men's 10m synchronised diving, GB's Kyle Kothari and Robbie Lee produced a strong last dive to finish fourth with 399.27 points as China's Zilong Cheng and Zifeng Zhu narrowly claimed gold with 429.63 points.",
        "In the swimming, American great Katie Ledecky won the 22nd world title of her career by claiming a dominant victory in the women's 1500m freestyle final.",
        "The 28-year-old finished in 15 minutes 26.44 seconds as she won a sixth World Championship gold in the event, with Italy's Simona Quadarella second in 15:31.79 and Australia's Lani Pallister third in 15:41.18.",
        "\"I love this race. This race was the race that I broke my first world record in in 2013,\" said Ledecky, who has won nine Olympic golds.",
        "\"Lots of great races and memories over the years at worlds. I'm happy I could do it in Singapore.\"",
        "Australia's Kaylee McKeown set a championship record to win the women's 100m backstroke final in 57.16 as she beat American rival Regan Smith, who was second in 57.35.",
        "Smith took McKeown's world record in the event in 2024 when she set a time of 57.13 but had to settle for silver behind the Australian in the 100m and 200m backstroke finals at the 2024 Olympics.",
        "\"It's always very nerve-wracking, especially off the back of the Olympics,\" said McKeown, who also won the 100m and 200m backstroke titles at the Olympics in Tokyo.",
        "\"I was probably a bit more nervous than I would like to have been tonight.\"",
        "Romania's David Popovici produced a strong finish to win his duel against American Luke Hobson in the men's 200m freestyle final.",
        "Popovici, who won Olympic gold in the discipline in 2024, touched the wall in 1:43.53, while second-placed Hobson came home in 1:43.84.",
        "\"Even better than the Olympics to be honest,\" said Popovici. \"You know why? I trained a lot for the Olympics but this year has been more relaxed and easygoing.",
        "\"I am very proud of myself.\"",
        "Elsewhere, South Africa's Pieter Coetze took gold in the men's 100m backstroke final in 51.85 as Briton Oliver Morgan finished fifth in 52.37, while Germany's Anna Elendt (1:05.19) won the women's 100m breaststroke final."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/articles/cgjy4yg3v8go",
      "main_category": "sport",
      "detailed_category": "diving",
      "topic": "McIntosh wins second gold as GB earn diving bronze",
      "content": [
        "Canadian teenager Summer McIntosh won another gold medal on Monday as she bids to make history at the World Aquatics Championships while Great Britain claimed a diving bronze.After winning the women's 400m freestyle final on Sunday, McIntosh has a chance to equal Michael Phelps' record of five individual titles at a single world championships.Her second final was in the 200m individual medley, and the 18-year-old won in two minutes 6.69 seconds, with American Alex Walsh second and Canada's Mary-Sophie Harvey third.Great Britain's Abbie Wood, 26, finished sixth as McIntosh stayed on course for a full house in Singapore.The three-time Olympic champion is also set to race in the 400m individual medley, 800m freestyle and 200m butterfly, with the latter being her next event on Wednesday.British divers Jack Laugher and Anthony Harding won bronze in the men's 3m synchronised final in what was almost a repeat of last year's Olympic podium.They were again third with a score of 405.33, while Mexico's Juan Celaya and Osmar Olvera were again second (449.28).But China's Olympic champion Wang Zongyuan has a new partner, Zheng Jiuyuan, and they proved too strong with 467.31.Harding said: \"We've had a difficult year with different amounts of time off and coming back after the Olympics with a change of clubs [from Leeds to Sheffield], but we wanted to come here and get another medal under the belt on our journey towards LA [2028 Olympics].\"Laugher added: \"I've still got a few bits to work on but I've gained a lot of knowledge moving forwards to the individual later this week.\"Andrea Spendolini-Sirieix chose not to travel, having struggled with \"mental blocks\", so Lois Toulson, with whom she won an Olympic bronze last year, has a new partner in Maisie Bond.In their first world final together, they were fifth in the women's 10m synchro platform, as was fellow Briton Ben Proud in the men's 50m butterfly despite finishing within 0.04secs of his national record.",
        "Summer McIntosh won four individual medals at the 2024 Olympics - three gold and one silver",
        "Canadian teenager Summer McIntosh won another gold medal on Monday as she bids to make history at the World Aquatics Championships while Great Britain claimed a diving bronze.",
        "After winning the women's 400m freestyle final on Sunday, McIntosh has a chance to equal Michael Phelps' record of five individual titles at a single world championships.",
        "Her second final was in the 200m individual medley, and the 18-year-old won in two minutes 6.69 seconds, with American Alex Walsh second and Canada's Mary-Sophie Harvey third.",
        "Great Britain's Abbie Wood, 26, finished sixth as McIntosh stayed on course for a full house in Singapore.",
        "The three-time Olympic champion is also set to race in the 400m individual medley, 800m freestyle and 200m butterfly, with the latter being her next event on Wednesday.",
        "British divers Jack Laugher and Anthony Harding won bronze in the men's 3m synchronised final in what was almost a repeat of last year's Olympic podium.",
        "They were again third with a score of 405.33, while Mexico's Juan Celaya and Osmar Olvera were again second (449.28).",
        "But China's Olympic champion Wang Zongyuan has a new partner, Zheng Jiuyuan, and they proved too strong with 467.31.",
        "Harding said: \"We've had a difficult year with different amounts of time off and coming back after the Olympics with a change of clubs [from Leeds to Sheffield], but we wanted to come here and get another medal under the belt on our journey towards LA [2028 Olympics].\"",
        "Laugher added: \"I've still got a few bits to work on but I've gained a lot of knowledge moving forwards to the individual later this week.\"",
        "Andrea Spendolini-Sirieix chose not to travel, having struggled with \"mental blocks\", so Lois Toulson, with whom she won an Olympic bronze last year, has a new partner in Maisie Bond.",
        "In their first world final together, they were fifth in the women's 10m synchro platform, as was fellow Briton Ben Proud in the men's 50m butterfly despite finishing within 0.04secs of his national record.",
        "Anthony Harding and Jack Laugher had previously won two silver medals together at the World Aquatics Championships",
        "Spendolini-Sirieix & Toulson snatch diving bronze",
        "Proud beats Mills to claim British 50m men's title"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/diving/articles/c4gkl0g1egno",
      "main_category": "sport",
      "detailed_category": "diving",
      "topic": "Spendolini-Sirieix to miss Worlds with 'mental blocks'",
      "content": [
        "Great Britain's Andrea Spendolini-Sirieix says she will not be compete at the 2025 World Aquatics Championships, which start this month, because she is struggling with \"mental blocks\".Spendolini-Sirieix, whose father Fred is a TV personality and stars in First Dates, won bronze alongside Lois Toulson in the synchronised 10m platform at the 2024 Paris Olympics.The World Aquatics Championships take place from 11 July to 3 August in Singapore.\"Unfortunately, I won't be attending the World Championships this year in Singapore,\" said Spendolini-Sirieix in a social media post.\"I've had a tough battle with mental blocks in diving this season, and I've tried to fight through them, but I've decided it would be best for me to take a break from the pool.\"I am getting all the help I need from my family, my coach and my support team at Aquatics GB and I am so thankful for their love and support.\"As an athlete, the words 'rest' and 'break' are foreign, but I know that this period will greatly help me in the long run.\"I am sad to not be joining my team and international friends out in Singapore, but I know they will do amazingly and I can't wait to see them shine.\"",
        "Spendolini-Sirieix was born in London to her Italian mother and French father",
        "Great Britain's Andrea Spendolini-Sirieix says she will not be compete at the 2025 World Aquatics Championships, which start this month, because she is struggling with \"mental blocks\".",
        "Spendolini-Sirieix, whose father Fred is a TV personality and stars in First Dates, won bronze alongside Lois Toulson in the synchronised 10m platform at the 2024 Paris Olympics.",
        "The World Aquatics Championships take place from 11 July to 3 August in Singapore.",
        "\"Unfortunately, I won't be attending the World Championships this year in Singapore,\" said Spendolini-Sirieix in a social media post.",
        "\"I've had a tough battle with mental blocks in diving this season, and I've tried to fight through them, but I've decided it would be best for me to take a break from the pool.",
        "\"I am getting all the help I need from my family, my coach and my support team at Aquatics GB and I am so thankful for their love and support.",
        "\"As an athlete, the words 'rest' and 'break' are foreign, but I know that this period will greatly help me in the long run.",
        "\"I am sad to not be joining my team and international friends out in Singapore, but I know they will do amazingly and I can't wait to see them shine.\""
      ]
    },
    {
      "url": "https://www.bbc.com/sport/diving/articles/cn9j874d2qno",
      "main_category": "sport",
      "detailed_category": "diving",
      "topic": "'Unexpected medal' stokes Olympic flame for Penman",
      "content": [
        "Scottish diver Noah Penman says a surprise European Championships silver medal is a huge confidence builder as he chases his Olympic dream.The 18-year-old, who was making his first senior individual appearance at a major event, narrowly missed out on gold in the men's 3m springboard final in Turkey.\"It was an unexpected medal,\" he told BBC Scotland. \"Most of the other guys in the competition were a few years older.\"The main goal was to gain experience of being in that senior competition environment, so to come away with a medal is great.\"To go out there and do what I love doing and to bring the medal home, it gives me great confidence to go into the season and the coming years toward the Los Angeles Olympics [in 2028].\"GB is a great diving nation, so to make that team is a very difficult task but I think getting the silver puts me in good stead to push on further, to make those world teams and go to the Olympics.\"Having shown real promise as a gymnast in his childhood, Penman made the sporting switch when his diving potential was spotted while in his final year at primary school in Aberdeen.Two European silvers and a bronze followed at junior level.\"I think gymnastics built a great base for me to go into diving,\" explained the Aberdeen Grammar School pupil, who is on his way to Edinburgh University.\"I started diving a bit later, through a talent identification programme where coaches from the local club go round the schools recruiting future prospects.\"I quickly turned to diving once I realised the love I had for the sport.\"",
        "Penman missed out on gold by just 1.55 points to Andrzej Rzeszutek of Poland - who is 15 years his senior",
        "Scottish diver Noah Penman says a surprise European Championships silver medal is a huge confidence builder as he chases his Olympic dream.",
        "The 18-year-old, who was making his first senior individual appearance at a major event, narrowly missed out on gold in the men's 3m springboard final in Turkey.",
        "\"It was an unexpected medal,\" he told BBC Scotland. \"Most of the other guys in the competition were a few years older.",
        "\"The main goal was to gain experience of being in that senior competition environment, so to come away with a medal is great.",
        "\"To go out there and do what I love doing and to bring the medal home, it gives me great confidence to go into the season and the coming years toward the Los Angeles Olympics [in 2028].",
        "\"GB is a great diving nation, so to make that team is a very difficult task but I think getting the silver puts me in good stead to push on further, to make those world teams and go to the Olympics.\"",
        "Having shown real promise as a gymnast in his childhood, Penman made the sporting switch when his diving potential was spotted while in his final year at primary school in Aberdeen.",
        "Two European silvers and a bronze followed at junior level.",
        "\"I think gymnastics built a great base for me to go into diving,\" explained the Aberdeen Grammar School pupil, who is on his way to Edinburgh University.",
        "\"I started diving a bit later, through a talent identification programme where coaches from the local club go round the schools recruiting future prospects.",
        "\"I quickly turned to diving once I realised the love I had for the sport.\""
      ]
    },
    {
      "url": "https://www.bbc.com/sport/diving/articles/cvg78dg94jyo",
      "main_category": "sport",
      "detailed_category": "diving",
      "topic": "Red Bull Cliff Diving champion Heslop to have back surgery",
      "content": [
        "Aidan Heslop, winner of the 2024 Red Bull Cliff Diving World Series, is to have back surgery after suffering a herniated disc in March.The 23-year-old became the youngest diver to win the competition last year aged 22.In a post on social media, Heslop said withdrawing from the first round of this year's competition in April was a \"tough decision\" but he hopes to be \"back fighting\" soon.\"I've had to make the tough decision to pull out of the first Red Bull Cliff Diving event of the season in the Philippines,\" Heslop wrote.\"I've been dealing with a herniated disc in my back for quite some time, and it's so bad now that I can't even touch my toes, let alone high dive. \"Nevertheless, I'm doing everything in my power to fix this injury and come back fighting for the rest of the season. So don't miss me too much.\"The second stage of the 2025 series takes place in Italy on 28-29 June, before the divers move onto Bosnia and Herzegovina in September.",
        "Aidan Heslop represented Wales at the 2022 Commonwealth Games",
        "Aidan Heslop, winner of the 2024 Red Bull Cliff Diving World Series, is to have back surgery after suffering a herniated disc in March.",
        "The 23-year-old became the youngest diver to win the competition last year aged 22.",
        "In a post on social media, Heslop said withdrawing from the first round of this year's competition in April was a \"tough decision\" but he hopes to be \"back fighting\" soon.",
        "\"I've had to make the tough decision to pull out of the first Red Bull Cliff Diving event of the season in the Philippines,\" Heslop wrote.",
        "\"I've been dealing with a herniated disc in my back for quite some time, and it's so bad now that I can't even touch my toes, let alone high dive.",
        "\"Nevertheless, I'm doing everything in my power to fix this injury and come back fighting for the rest of the season. So don't miss me too much.\"",
        "The second stage of the 2025 series takes place in Italy on 28-29 June, before the divers move onto Bosnia and Herzegovina in September."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/diving/articles/c230g4e313mo",
      "main_category": "sport",
      "detailed_category": "diving",
      "topic": "Houlden wins maiden World Cup gold in Canada",
      "content": [
        "Britain's Jordan Houlden claimed the first global title of his career as he won gold in the Diving World Cup in Canada.The 26-year-old triumphed in the men's 3m springboard event, setting the pace from his opening dive and finishing on 470.85 points, more than 30 clear of the USA's Carson Tyler with China's Zheng Jiuyan taking bronze.\"I did not expect this,\" he said. \"I thought I'd place around like fourth to eighth, nothing too extravagant. \"When the two Chinese messed up a little bit, it definitely pushed me. It also gave me some shakes as well.\"It was one of three medals for the British team at the event in Windsor.Olympic medallist Andrea Spendolini-Sirieix won women's 10m platform bronze for back-to-back medals after she was third in the opening leg of the World Cup in Mexico earlier this month.Spendolini-Sirieix, 20, scored 348.20 as she edged out 17-year-old compatriot Maisie Bond by 23.85 points for third place.China led the way with Yuxi Chen winning gold on 417.55, with Quan Hongchan 10 points behind.Bond and Lois Toulson later teamed up for bronze in the 10m synchro event, finishing on 275.16, narrowly ahead of Americans Lanie Gutch and Anna Lemkin (274.26).It was the second stop in the three-stage event, which concludes with the Super Final in Beijing from 2 to 4 May.",
        "Houlden reached the Olympic final in Paris where he finished fifth",
        "Britain's Jordan Houlden claimed the first global title of his career as he won gold in the Diving World Cup in Canada.",
        "The 26-year-old triumphed in the men's 3m springboard event, setting the pace from his opening dive and finishing on 470.85 points, more than 30 clear of the USA's Carson Tyler with China's Zheng Jiuyan taking bronze.",
        "\"I did not expect this,\" he said. \"I thought I'd place around like fourth to eighth, nothing too extravagant.",
        "\"When the two Chinese messed up a little bit, it definitely pushed me. It also gave me some shakes as well.\"",
        "It was one of three medals for the British team at the event in Windsor.",
        "Olympic medallist Andrea Spendolini-Sirieix won women's 10m platform bronze for back-to-back medals after she was third in the opening leg of the World Cup in Mexico earlier this month.",
        "Spendolini-Sirieix, 20, scored 348.20 as she edged out 17-year-old compatriot Maisie Bond by 23.85 points for third place.",
        "China led the way with Yuxi Chen winning gold on 417.55, with Quan Hongchan 10 points behind.",
        "Bond and Lois Toulson later teamed up for bronze in the 10m synchro event, finishing on 275.16, narrowly ahead of Americans Lanie Gutch and Anna Lemkin (274.26).",
        "It was the second stop in the three-stage event, which concludes with the Super Final in Beijing from 2 to 4 May."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/diving/articles/c0kx5k4lvmmo",
      "main_category": "sport",
      "detailed_category": "diving",
      "topic": "Britain's Spendolini-Sirieix wins World Cup bronze",
      "content": [
        "Britain's Olympic medallist Andrea Spendolini-Sirieix claimed 10m platform bronze in the Diving World Cup Super Final in Mexico.Spendolini-Sirieix, who won bronze alongside Lois Toulson in the synchronised 10m platform at the Paris Olympics, finished with a tally of 337.70 across five dives.China's Yuxi Chen (419.35) claimed gold with Hongchan Quan (414.40) taking silver.There was another British medal in the men's 3m synchronised as Olympic bronze medallists Anthony Harding and Jack Laugher won silver.The British pair earned a combined score of 396.06 for their five dives to finish 34.17 points shy of Mexican duo Osmar Olvera Ibarra and Juan Manuel Celaya Hernandez.",
        "Andrea Spendolini-Sirieix won 10m platform bronze at the 2024 World Cup",
        "Britain's Olympic medallist Andrea Spendolini-Sirieix claimed 10m platform bronze in the Diving World Cup Super Final in Mexico.",
        "Spendolini-Sirieix, who won bronze alongside Lois Toulson in the synchronised 10m platform at the Paris Olympics, finished with a tally of 337.70 across five dives.",
        "China's Yuxi Chen (419.35) claimed gold with Hongchan Quan (414.40) taking silver.",
        "There was another British medal in the men's 3m synchronised as Olympic bronze medallists Anthony Harding and Jack Laugher won silver.",
        "The British pair earned a combined score of 396.06 for their five dives to finish 34.17 points shy of Mexican duo Osmar Olvera Ibarra and Juan Manuel Celaya Hernandez."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/diving/articles/c0l11k4er46o",
      "main_category": "sport",
      "detailed_category": "diving",
      "topic": "GB's Olympic champion Lee retires from diving",
      "content": [
        "Olympic gold medallist Matty Lee has announced his retirement from diving.The 26-year-old won gold in the men's synchronised 10m platform at Tokyo 2020 alongside British team-mate Tom Daley.He missed last summer's Games in Paris after having surgery on his spine earlier in 2024.\"After 20 years in the sport, it's time for me to step away from diving,\" Lee said on Instagram on Thursday.\"This decision hasn't been easy, but after losing my dad in 2022, I struggled to find the same passion I once had, he was my why.\"Then came injuries, surgeries, and the realization that I don't want to be a broken man moving forward.\"Lee partnered with Noah Williams in recent years, winning Commonwealth gold and World Aquatics Championships silver together in 2022.With Daley, who retired from the sport in August, Lee claimed World Cup and European gold in 2021, as well as a bronze at the 2019 World Championships.\"Diving has given me the world, literally. The people I've met, the places I've travelled, the memories I've made. That's what I'll cherish the most,\" he added.Leeds-born Lee thanked his family and coaching team while he also paid tribute to Daley, adding: \"What a journey, what a moment we shared. Olympic champions forever.\"Lee won individual gold at the European Games, aged just 17, in 2015 and he made his World Championship debut later that year.Alongside Lois Toulson in the mixed synchronised 10m platform, he picked up silver medals at both the 2017 World Championships and 2018 European Championships.\"What's next? Honestly, I don't know. And that's both terrifying and exciting. But I do know this, there's more to life than diving, and I'm ready for it,\" Lee said.",
        "Lee won Olympic gold with Tom Daley at Tokyo 2020",
        "Olympic gold medallist Matty Lee has announced his retirement from diving.",
        "The 26-year-old won gold in the men's synchronised 10m platform at Tokyo 2020 alongside British team-mate Tom Daley.",
        "He missed last summer's Games in Paris after having surgery on his spine earlier in 2024.",
        "\"After 20 years in the sport, it's time for me to step away from diving,\" Lee said on Instagram on Thursday.",
        "\"This decision hasn't been easy, but after losing my dad in 2022, I struggled to find the same passion I once had, he was my why.",
        "\"Then came injuries, surgeries, and the realization that I don't want to be a broken man moving forward.\"",
        "Lee partnered with Noah Williams in recent years, winning Commonwealth gold and World Aquatics Championships silver together in 2022.",
        "With Daley, who retired from the sport in August, Lee claimed World Cup and European gold in 2021, as well as a bronze at the 2019 World Championships.",
        "\"Diving has given me the world, literally. The people I've met, the places I've travelled, the memories I've made. That's what I'll cherish the most,\" he added.",
        "Leeds-born Lee thanked his family and coaching team while he also paid tribute to Daley, adding: \"What a journey, what a moment we shared. Olympic champions forever.\"",
        "Lee won individual gold at the European Games, aged just 17, in 2015 and he made his World Championship debut later that year.",
        "Alongside Lois Toulson in the mixed synchronised 10m platform, he picked up silver medals at both the 2017 World Championships and 2018 European Championships.",
        "\"What's next? Honestly, I don't know. And that's both terrifying and exciting. But I do know this, there's more to life than diving, and I'm ready for it,\" Lee said."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/diving/articles/crr0xgnreq9o",
      "main_category": "sport",
      "detailed_category": "diving",
      "topic": "Daley diving coach Figueiredo to leave Aquatics GB",
      "content": [
        "Tom Daley's diving coach Jane Figueiredo is to leave Aquatics GB after 11 years in the role.Figueiredo helped Daley to four of his five Olympic medals, including gold alongside Matty Lee in the 10m synchro in Tokyo in 2021, and silver with Noah Williams in 10m synchro in Paris last summer.The 61-year-old guided her divers to eight Olympic medals in total, including podium finishes for Williams and Scarlett Mew Jensen in Paris, with GB enjoying their best-ever diving performance at a Games.\"The last 11 years with Aquatics GB and Dive London in the performance centre have just been incredible - probably the most exciting, most fun time of my career, leading Tom Daley and then the rest of the cohort of Olympians that have won medals over the past three cycles,\" she said.\"It's an important time for me personally, and it's certainly a personal decision - I'm not tired of coaching or tired of the place, I just want to put myself first now and take care of myself and make sure I spend some time with my loved ones.\"Aquatics GB Performance Director Chris Spice said: \"Jane's impact on Aquatics GB diving is visible not only on the continued success of her divers across multiple Olympics, World Championships and Europeans, but in the way she is viewed and valued by other coaches across international diving.\"The longevity of Tom Daley's success working with her is just one example - to have won medals at three Olympics and become world champion at three different World Championships as a combination speaks to that.\"Figueiredo, born in Zimbabwe, represented Portugal at the 1984 Los Angeles Olympics before competing and coaching at the University of Houston.In November, she was given a lifetime achievement award by the International Olympic Committee (IOC).Daley, Team GB's most decorated diver in Olympic history, retired from diving aged 30 shortly after returning from the Paris Games.",
        "Tom Daley (right) retired from diving after winning 10m synchronised platform silver with Noah Williams at Paris 2024",
        "Tom Daley's diving coach Jane Figueiredo is to leave Aquatics GB after 11 years in the role.",
        "Figueiredo helped Daley to four of his five Olympic medals, including gold alongside Matty Lee in the 10m synchro in Tokyo in 2021, and silver with Noah Williams in 10m synchro in Paris last summer.",
        "The 61-year-old guided her divers to eight Olympic medals in total, including podium finishes for Williams and Scarlett Mew Jensen in Paris, with GB enjoying their best-ever diving performance at a Games.",
        "\"The last 11 years with Aquatics GB and Dive London in the performance centre have just been incredible - probably the most exciting, most fun time of my career, leading Tom Daley and then the rest of the cohort of Olympians that have won medals over the past three cycles,\" she said.",
        "\"It's an important time for me personally, and it's certainly a personal decision - I'm not tired of coaching or tired of the place, I just want to put myself first now and take care of myself and make sure I spend some time with my loved ones.\"",
        "Aquatics GB Performance Director Chris Spice said: \"Jane's impact on Aquatics GB diving is visible not only on the continued success of her divers across multiple Olympics, World Championships and Europeans, but in the way she is viewed and valued by other coaches across international diving.",
        "\"The longevity of Tom Daley's success working with her is just one example - to have won medals at three Olympics and become world champion at three different World Championships as a combination speaks to that.\"",
        "Figueiredo, born in Zimbabwe, represented Portugal at the 1984 Los Angeles Olympics before competing and coaching at the University of Houston.",
        "In November, she was given a lifetime achievement award by the International Olympic Committee (IOC).",
        "Daley, Team GB's most decorated diver in Olympic history, retired from diving aged 30 shortly after returning from the Paris Games."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/diving/articles/c8xqedr50lro",
      "main_category": "sport",
      "detailed_category": "diving",
      "topic": "GB's Goodfellow announces retirement from diving",
      "content": [
        "Olympic medallist Daniel Goodfellow says now is the right time to \"start something new\" after announcing his retirement from diving. The 28-year-old Briton won bronze in the men's 10m synchro alongside Tom Daley at Rio 2016, a gold medal in the team event at the World Championships in Doha last year and is also a two-time Commonwealth Games champion. Writing on Instagram,, external he said he realised \"how fortunate and privileged\" he had been to be part of such a successful era of British diving. \"I leave the sport with no regrets, and I hope I've inspired at least one person the way I was,\" Goodfellow wrote. \"It never seems like It will end when you're living it, but after more than 20 years of training and competing, it feels like now is the right time to close this chapter and start something new. \" Team GB diving coach Jane Figueiredo said Goodfellow had been a pleasure to work with, while his former team-mate Matty Lee added he was \"very honoured to have shared the boards\" with him.",
        "Daniel Goodfellow won gold medals at the Commonwealth Games in 2018 and in 2022",
        "Olympic medallist Daniel Goodfellow says now is the right time to \"start something new\" after announcing his retirement from diving.",
        "The 28-year-old Briton won bronze in the men's 10m synchro alongside Tom Daley at Rio 2016, a gold medal in the team event at the World Championships in Doha last year and is also a two-time Commonwealth Games champion.",
        "Writing on Instagram,, external he said he realised \"how fortunate and privileged\" he had been to be part of such a successful era of British diving.",
        "\"I leave the sport with no regrets, and I hope I've inspired at least one person the way I was,\" Goodfellow wrote.",
        "\"It never seems like It will end when you're living it, but after more than 20 years of training and competing, it feels like now is the right time to close this chapter and start something new. \"",
        "Team GB diving coach Jane Figueiredo said Goodfellow had been a pleasure to work with, while his former team-mate Matty Lee added he was \"very honoured to have shared the boards\" with him."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/olympics/articles/cpdv5d36gyeo",
      "main_category": "sport",
      "detailed_category": "diving",
      "topic": "GB diving coach Figueiredo given IOC honour",
      "content": [
        "Team GB diving coach Jane Figueiredo has been given a lifetime achievement award by the International Olympic Committee (IOC).The team won five medals at the 2024 Paris Games, including Noah Williams and Tom Daley taking silver in the men's 10m synchro.Figueiredo, 60, has been the GB head diving coach since 2014.\"Coaching has been my passion since I was a young girl, and to receive this award is a dream come true,\" she said.Speaking about Figueiredo, Tokyo Olympics gold medallist Daley said: \"Throughout the years she has taught me what it means to be a real professional athlete.\"She has impacted so many people and not just me and my diving career, in and out of the pool.\"Figueiredo, born in Zimbabwe, represented Portugal at the 1984 Los Angeles Olympics before competing and coaching at the University of Houston.Ukrainian pole vault coach Vitaliy Petrov has also been given the award, with his athletes having set 36 world records and won six Olympic medals and 21 World Championship titles.Petrov coached star competitors including Sergey Bubka and Yelena Isinbayeva.\"I accept the IOC Coaches Lifetime Achievement Award with great pride, joy, and motivation to continue contributing to the development of the Olympic movement worldwide,\" said Petrov.\"I can only thank the athletes for the unforgettable moments I have lived with them and for the trust they put in me every single day.\"",
        "Jane Figueiredo coached Tom Daley to gold at the Tokyo Olympics",
        "Team GB diving coach Jane Figueiredo has been given a lifetime achievement award by the International Olympic Committee (IOC).",
        "The team won five medals at the 2024 Paris Games, including Noah Williams and Tom Daley taking silver in the men's 10m synchro.",
        "Figueiredo, 60, has been the GB head diving coach since 2014.",
        "\"Coaching has been my passion since I was a young girl, and to receive this award is a dream come true,\" she said.",
        "Speaking about Figueiredo, Tokyo Olympics gold medallist Daley said: \"Throughout the years she has taught me what it means to be a real professional athlete.",
        "\"She has impacted so many people and not just me and my diving career, in and out of the pool.\"",
        "Figueiredo, born in Zimbabwe, represented Portugal at the 1984 Los Angeles Olympics before competing and coaching at the University of Houston.",
        "Ukrainian pole vault coach Vitaliy Petrov has also been given the award, with his athletes having set 36 world records and won six Olympic medals and 21 World Championship titles.",
        "Petrov coached star competitors including Sergey Bubka and Yelena Isinbayeva.",
        "\"I accept the IOC Coaches Lifetime Achievement Award with great pride, joy, and motivation to continue contributing to the development of the Olympic movement worldwide,\" said Petrov.",
        "\"I can only thank the athletes for the unforgettable moments I have lived with them and for the trust they put in me every single day.\"",
        "Who are the Commonwealth Games winners and losers?",
        "Heslop wins 2024 Red Bull Cliff Diving World Series"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/diving/articles/czxrw27w8plo",
      "main_category": "sport",
      "detailed_category": "diving",
      "topic": "Heslop wins 2024 Red Bull Cliff Diving World Series",
      "content": [
        "Aidan Heslop has become the youngest diver to win the Red Bull Cliff Diving World Series at the age of 22.The Plymouth-born diver, who has twice been runner-up, finished fifth in the final event in Australia to secure victory.Heslop finished the eight-stage competition on 113 points, 16 clear of America's James Lichtenstien in second.The Red Bull Cliff Diving World Series sees divers compete from a 27m (88ft) high platform.Each diver is scored on four different dives, and the winner of each stage is the competitor with the highest collective score.Heslop won four of the eight stages in 2024, winning in the United States, Canada, Turkey and Northern Ireland.",
        "Aidan Heslop represented Wales at the 2022 Commonwealth Games",
        "Aidan Heslop has become the youngest diver to win the Red Bull Cliff Diving World Series at the age of 22.",
        "The Plymouth-born diver, who has twice been runner-up, finished fifth in the final event in Australia to secure victory.",
        "Heslop finished the eight-stage competition on 113 points, 16 clear of America's James Lichtenstien in second.",
        "The Red Bull Cliff Diving World Series sees divers compete from a 27m (88ft) high platform.",
        "Each diver is scored on four different dives, and the winner of each stage is the competitor with the highest collective score.",
        "Heslop won four of the eight stages in 2024, winning in the United States, Canada, Turkey and Northern Ireland."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/olympics/articles/czjy32kz9lxo",
      "main_category": "sport",
      "detailed_category": "diving",
      "topic": "Daley 'has transcended diving' - Williams",
      "content": [
        "Noah Williams says Tom Daley \"has transcended diving\" following the five-time Olympic medallist's decision to retire from the sport., externalWilliams, 24, won a silver medal alongside 30-year-old Daley in the men's synchronised 10m platform at the Paris Games last month. Daley first competed at Beijing 2008 at the age of 14 and went on to win 10m platform bronze at both London 2012 and the delayed Tokyo Games in 2021. He also won bronze in the men's synchronised 10m platform in Rio 2016, followed by gold in the event alongside Matt Lee in Tokyo.\"He is literally an icon of the Olympics for Team GB,\" Williams told  BBC Radio 5 Live Breakfast. Daley took two years out of diving following the Tokyo Olympics but he was persuaded to return to the pool by his son Robbie, now aged six. He has been a vocal supporter for LGBTQ+ rights in sport, and at the Commonwealth Games in 2022 Daley used his influence to highlight the difficulties  faced by openly gay athletes from countries where homosexuality is illegal. \"He's a massive activist for the gay community; he helps so many communities massively and has inspired so many people to take up not just diving, but sport in general,\" said Williams. \"He is the one person who has transcended diving in my opinion. \"I will miss him in training but I'm sure everyone will miss him competing and being around.\"",
        "Williams arrived home from Paris with two medals: his silver with Daley and an individual bronze in the men's 10m platform. As for what the future holds for the British diver, he says he will be taking some time to figure out his plans. \"The next six months are going to be a lot more chilled,\" he said. \"Well, I say chilled, I'm still doing a lot of fitness and activity, but less diving, because I'm not sure what I'm going to do, is the truth. \"I don't wan't to dive just because I'm good at it, because it does take a lot of mental energy, a big toll on you. \"I don't want to complain and say travelling because I love travelling and competing, but being away from family and friends a lot of the year, that stuff is genuinely quite hard.\" With the next Olympic Games taking place in Los Angeles in 2028, Williams says he is also assessing whether age may play a factor in his decision to go through another Olympic cycle. \"I saw a lot of people saying, 'Tom's retiring? But he's only 30', but I don't think they realise that 30 is actually old in the world of diving,\" he said. \"That's why, when he took two years out after Tokyo, no-one was particularly shocked. \"Even though I'm 24, I'm not far off being too old to dive - which seems crazy.\"",
        "Before their silver medal in Paris, Tom Daley and Noah Williams had trained together for a total of two months because Daley lives in Los Angeles",
        "Noah Williams says Tom Daley \"has transcended diving\" following the five-time Olympic medallist's decision to retire from the sport., external",
        "Williams, 24, won a silver medal alongside 30-year-old Daley in the men's synchronised 10m platform at the Paris Games last month.",
        "Daley first competed at Beijing 2008 at the age of 14 and went on to win 10m platform bronze at both London 2012 and the delayed Tokyo Games in 2021. He also won bronze in the men's synchronised 10m platform in Rio 2016, followed by gold in the event alongside Matt Lee in Tokyo.",
        "\"He is literally an icon of the Olympics for Team GB,\" Williams told  BBC Radio 5 Live Breakfast.",
        "Daley took two years out of diving following the Tokyo Olympics but he was persuaded to return to the pool by his son Robbie, now aged six.",
        "He has been a vocal supporter for LGBTQ+ rights in sport, and at the Commonwealth Games in 2022 Daley used his influence to highlight the difficulties  faced by openly gay athletes from countries where homosexuality is illegal.",
        "\"He's a massive activist for the gay community; he helps so many communities massively and has inspired so many people to take up not just diving, but sport in general,\" said Williams.",
        "\"He is the one person who has transcended diving in my opinion.",
        "\"I will miss him in training but I'm sure everyone will miss him competing and being around.\"",
        "This video can not be played",
        "Daley and Williams seal silver",
        "Williams arrived home from Paris with two medals: his silver with Daley and an individual bronze in the men's 10m platform.",
        "As for what the future holds for the British diver, he says he will be taking some time to figure out his plans.",
        "\"The next six months are going to be a lot more chilled,\" he said. \"Well, I say chilled, I'm still doing a lot of fitness and activity, but less diving, because I'm not sure what I'm going to do, is the truth.",
        "\"I don't wan't to dive just because I'm good at it, because it does take a lot of mental energy, a big toll on you.",
        "\"I don't want to complain and say travelling because I love travelling and competing, but being away from family and friends a lot of the year, that stuff is genuinely quite hard.\"",
        "With the next Olympic Games taking place in Los Angeles in 2028, Williams says he is also assessing whether age may play a factor in his decision to go through another Olympic cycle.",
        "\"I saw a lot of people saying, 'Tom's retiring? But he's only 30', but I don't think they realise that 30 is actually old in the world of diving,\" he said.",
        "\"That's why, when he took two years out after Tokyo, no-one was particularly shocked.",
        "\"Even though I'm 24, I'm not far off being too old to dive - which seems crazy.\"",
        "This video can not be played",
        "Tom Daley: I'm very proud - Five-time Olympic medallist retires from diving",
        "'Sensational' Paris Olympics come to an end",
        "Close finishes, fencing tantrums & shocking moments - the 2024 Olympic Awards"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/olympics/articles/c39k1vemny3o",
      "main_category": "sport",
      "detailed_category": "diving",
      "topic": "'I can look back and be proud' - Daley in his own words",
      "content": [
        "Sixteen years after he first stepped on the Olympic stage as a teenager, Tom Daley has retired.Britain's most decorated diver is ending his career with five Olympic medals to his name.He was 14 when he made his Games debut at Beijing 2008, and last Monday - 5,831 days on - returned for his fifth Games in Paris, winning silver alongside Noah Williams in the men's synchro 10m platform.Before Paris 2024, Daley spoke to BBC Sport about his emotional journey, during which he has won Olympic gold, dealt with the death of his father, married his partner Dustin Lance Black, become a father of two sons, stepped away from diving, then made a comeback. After the Games, the BBC caught up with him again to talk about his decision to retire.BBC Sport first ran a version of this piece on 24 July.",
        "Daley has grown up in the media spotlight from a young age. He won gold at the European Championships as a 13-year-old in 2008, finished seventh in the individual event at the Olympics, aged 14, later that year and came out as gay in 2013, shortly after winning his first medal at the London Games. Before the Olympics, he spoke to BBC Sport about those experiences.\"As a kid growing up, feeling different and feeling like I didn't quite fit in, I always felt like I had to overachieve to disguise the part of me that I always thought was considered wrong.\"I know how I felt in that period of time and it was like a very tortured soul.\"I struggled with all kinds of different things when it came to going away from home and being away like from my parents, going to unfamiliar territory.\"I was absolutely awful at staying away from home. I used to cry and never want to stay overnight without my parents.\"",
        "During his early career, Daley was taken to competitions and supported by his father, Rob. In 2006, Rob was diagnosed with a brain tumour and died in 2011, 14 months before the London Olympics.\"My dad was hugely dedicated to all of his kids, but in particular around my time.\"There was nothing that he wouldn't do if it was going to help either make me feel better in training and give me a better opportunity to be able to go and compete.\"He was there for every competition and every training session, no matter what it was.\"To know how much he sacrificed is very special.\"I hope that he never regretted spending that time with me, travelling the world and getting to see those competitions.\"Now, as a parent, I feel like I have to live by his example on that as well. I so wish that he got to see me win an Olympic medal.\"",
        "Daley won bronze at London 2012 and the Olympics four years later in Rio. In 2018 he and his husband Dustin Lance Black, a US film-maker, announced the birth of their son, Robbie, who was named after Daley's father. Their second son, Phoenix, was born in 2023.At the Tokyo Games in 2021, Daley won his first Olympic gold in the 10m synchronised event with partner Matty Lee. Afterwards, having moved to the US with his family, he effectively retired from diving before announcing his return after a two-year break in 2023. The decision came after a trip to the US Olympic and Paralympic museum in Colorado.\"At the end of the museum they had this video of what it means to be an Olympian and all of the effort you have to go to to get to the Olympic Games.\"I remember the video finishing and I was there crying.\"It was Robbie who turned and said, 'Papa, what's the matter?'\"Lance looked at me, saw me crying and thought, 'oh no. I know what this means...'\"I said, 'I just really miss diving in the Olympics', and Robbie said, 'but Papa, I want to see you dive in the Olympics' - and that was that.\"",
        "Daley had been one of the two British flagbearers for the opening ceremony and his husband and children were among a large contingent of family and friends at the Paris Aquatics Centre to give the British pair loud support.\"It's just so special,\" Daley said after they finished second behind China's Lian Junjie and Yang Hao. \"Doing it in front of my son who asked me to come back is so special. I now have one [medal] of every colour, I've completed the set.\"His two sons were wearing T-shirts that read 'That's my Papa' and the first flicker of emotion from Daley came as he blew a kiss to his family from the medal podium.On Monday, in an interview with Vogue,, external Daley confirmed his retirement, saying: \"It was emotional up there on the platform, knowing it was going to be my last competitive dive.\"But I have to make the decision at some point, and it feels like the right time. It’s the right time to call it a day.“I felt so nervous knowing it was my last Olympics. There was a lot of pressure and expectation. I was eager for it to be done, but when I saw my husband, kids, my friends and family in the audience, I was like, 'this is exactly why I did this'.In an interview with the BBC after arriving back into London with other members of Team GB, an emotional Daley added: \"Coming back to a reception like this is so special.\"It's always hard when you say goodbye to your sport. Lots of things to process, but it’s the right time.\"The support I've had has been incredible. Thank you to everyone who’s been with me. I guess it's the end of an era but I can look back on my 23 years and be very proud.\"",
        "This video can not be played",
        "Paris 2024: Tom Daley looks back on BBC interview from 2008",
        "Sixteen years after he first stepped on the Olympic stage as a teenager, Tom Daley has retired.",
        "Britain's most decorated diver is ending his career with five Olympic medals to his name.",
        "He was 14 when he made his Games debut at Beijing 2008, and last Monday - 5,831 days on - returned for his fifth Games in Paris, winning silver alongside Noah Williams in the men's synchro 10m platform.",
        "Before Paris 2024, Daley spoke to BBC Sport about his emotional journey, during which he has won Olympic gold, dealt with the death of his father, married his partner Dustin Lance Black, become a father of two sons, stepped away from diving, then made a comeback. After the Games, the BBC caught up with him again to talk about his decision to retire.",
        "BBC Sport first ran a version of this piece on 24 July.",
        "This video can not be played",
        "Tom Daley: I'm very proud - Five-time Olympic medallist retires from diving",
        "Daley has grown up in the media spotlight from a young age. He won gold at the European Championships as a 13-year-old in 2008, finished seventh in the individual event at the Olympics, aged 14, later that year and came out as gay in 2013, shortly after winning his first medal at the London Games. Before the Olympics, he spoke to BBC Sport about those experiences.",
        "\"As a kid growing up, feeling different and feeling like I didn't quite fit in, I always felt like I had to overachieve to disguise the part of me that I always thought was considered wrong.",
        "\"I know how I felt in that period of time and it was like a very tortured soul.",
        "\"I struggled with all kinds of different things when it came to going away from home and being away like from my parents, going to unfamiliar territory.",
        "\"I was absolutely awful at staying away from home. I used to cry and never want to stay overnight without my parents.\"",
        "Tom Daley and Matty Lee of Great Britain with their medals after their gold medal performance in the men's Synchronised 10m platform at the Tokyo Olympics in 2021",
        "During his early career, Daley was taken to competitions and supported by his father, Rob. In 2006, Rob was diagnosed with a brain tumour and died in 2011, 14 months before the London Olympics.",
        "\"My dad was hugely dedicated to all of his kids, but in particular around my time.",
        "\"There was nothing that he wouldn't do if it was going to help either make me feel better in training and give me a better opportunity to be able to go and compete.",
        "\"He was there for every competition and every training session, no matter what it was.",
        "\"To know how much he sacrificed is very special.",
        "\"I hope that he never regretted spending that time with me, travelling the world and getting to see those competitions.",
        "\"Now, as a parent, I feel like I have to live by his example on that as well. I so wish that he got to see me win an Olympic medal.\"",
        "Daley won bronze at London 2012 and the Olympics four years later in Rio. In 2018 he and his husband Dustin Lance Black, a US film-maker, announced the birth of their son, Robbie, who was named after Daley's father. Their second son, Phoenix, was born in 2023.",
        "At the Tokyo Games in 2021, Daley won his first Olympic gold in the 10m synchronised event with partner Matty Lee. Afterwards, having moved to the US with his family, he effectively retired from diving before announcing his return after a two-year break in 2023. The decision came after a trip to the US Olympic and Paralympic museum in Colorado.",
        "\"At the end of the museum they had this video of what it means to be an Olympian and all of the effort you have to go to to get to the Olympic Games.",
        "\"I remember the video finishing and I was there crying.",
        "\"It was Robbie who turned and said, 'Papa, what's the matter?'",
        "\"Lance looked at me, saw me crying and thought, 'oh no. I know what this means...'",
        "\"I said, 'I just really miss diving in the Olympics', and Robbie said, 'but Papa, I want to see you dive in the Olympics' - and that was that.\"",
        "Daley humorously recreated a famous scene from the film Titanic with fellow GB flagbearer Helen Glover on the Seine during the opening ceremony",
        "Daley had been one of the two British flagbearers for the opening ceremony and his husband and children were among a large contingent of family and friends at the Paris Aquatics Centre to give the British pair loud support.",
        "\"It's just so special,\" Daley said after they finished second behind China's Lian Junjie and Yang Hao. \"Doing it in front of my son who asked me to come back is so special. I now have one [medal] of every colour, I've completed the set.\"",
        "His two sons were wearing T-shirts that read 'That's my Papa' and the first flicker of emotion from Daley came as he blew a kiss to his family from the medal podium.",
        "On Monday, in an interview with Vogue,, external Daley confirmed his retirement, saying: \"It was emotional up there on the platform, knowing it was going to be my last competitive dive.",
        "\"But I have to make the decision at some point, and it feels like the right time. It’s the right time to call it a day.",
        "“I felt so nervous knowing it was my last Olympics. There was a lot of pressure and expectation. I was eager for it to be done, but when I saw my husband, kids, my friends and family in the audience, I was like, 'this is exactly why I did this'.",
        "In an interview with the BBC after arriving back into London with other members of Team GB, an emotional Daley added: \"Coming back to a reception like this is so special.",
        "\"It's always hard when you say goodbye to your sport. Lots of things to process, but it’s the right time.",
        "\"The support I've had has been incredible. Thank you to everyone who’s been with me. I guess it's the end of an era but I can look back on my 23 years and be very proud.\"",
        "This video can not be played",
        "Daley and Williams seal silver"
      ]
    }
  ]
}