{
  "scraped_at": "2025-10-27T18:56:59.793546",
  "total_articles": 12,
  "category": "gymnastics",
  "articles_per_category": 100,
  "articles": [
    {
      "url": "https://www.bbc.com/sport/gymnastics/articles/cze6lywkgwno",
      "main_category": "sport",
      "detailed_category": "gymnastics",
      "topic": "Three more medals for GB as Tweddle hails progress",
      "content": [
        "Former world champion Beth Tweddle hailed the progression of British gymnastics as three medals were won on the final day of the World Artistic Gymnastics Championships in Jakarta, Indonesia.Joe Fraser became the first British gymnast to win a medal in the high bar, finishing third, while the team continued their excellence on the floor with silver for Ruby Evans and bronze for Abigail Martin. Evans also became the first Welsh gymnast to win an individual medal at the World Championships.It capped a remarkable 24 hours for the British team after Jake Jarman and Luke Whitehouse secured a British one-two in the men's floor final on Friday.The haul made Britain the leading nation in the world in the floor discipline and Tweddle, who won Britain's first women's world floor title in 2009, told BBC Sport: \"It's just incredible to see the journey that British gymnastics as a whole has been on. \"Coming from where we were 20 years ago to now - four out of the six floor medals at this championships have come home to Great Britain.\"Britain's return of five medals across the championships has only ever been bettered by their six-medal haul in Liverpool in 2022, when Jessica Gadirova became Britain's second women's world floor champion.Dave Hart, British Gymnastics performance director, put this year's success down to a dedicated programme which sees coaches working closely with local clubs.\"It's been an incredible summation of a community's hard work,\" he said.\"We've got a world-class programme connected to our clubs. Seeing our coaching community come together and work with our gymnasts to deliver what we saw out there over the last few days is just outstanding.\"Evans, 18, finished runner-up behind Japan's Aiko Sugihara with a score of 13.666, while Martin came third in her first World Championships.The 17-year-old's mark of 13.466 was the same as Romanian gymnast Sabrina Maneca-Voinea, but she was awarded bronze because her execution score was higher.Fraser, 26, became the first British gymnast to be crowned world champion in the parallel bars in 2019 and this time clinched a historic first bronze in the high bar. His score of 14.700 saw him finish behind American Brody Malone, who won gold, and Japan's Daiki Hashimoto.",
        "This video can not be played",
        "GB women win floor silver and bronze at Gymnastic Championships",
        "Former world champion Beth Tweddle hailed the progression of British gymnastics as three medals were won on the final day of the World Artistic Gymnastics Championships in Jakarta, Indonesia.",
        "Joe Fraser became the first British gymnast to win a medal in the high bar, finishing third, while the team continued their excellence on the floor with silver for Ruby Evans and bronze for Abigail Martin.",
        "Evans also became the first Welsh gymnast to win an individual medal at the World Championships.",
        "It capped a remarkable 24 hours for the British team after Jake Jarman and Luke Whitehouse secured a British one-two in the men's floor final on Friday.",
        "The haul made Britain the leading nation in the world in the floor discipline and Tweddle, who won Britain's first women's world floor title in 2009, told BBC Sport: \"It's just incredible to see the journey that British gymnastics as a whole has been on.",
        "\"Coming from where we were 20 years ago to now - four out of the six floor medals at this championships have come home to Great Britain.\"",
        "Britain's return of five medals across the championships has only ever been bettered by their six-medal haul in Liverpool in 2022, when Jessica Gadirova became Britain's second women's world floor champion.",
        "Dave Hart, British Gymnastics performance director, put this year's success down to a dedicated programme which sees coaches working closely with local clubs.",
        "\"It's been an incredible summation of a community's hard work,\" he said.",
        "\"We've got a world-class programme connected to our clubs. Seeing our coaching community come together and work with our gymnasts to deliver what we saw out there over the last few days is just outstanding.\"",
        "Evans, 18, finished runner-up behind Japan's Aiko Sugihara with a score of 13.666, while Martin came third in her first World Championships.",
        "The 17-year-old's mark of 13.466 was the same as Romanian gymnast Sabrina Maneca-Voinea, but she was awarded bronze because her execution score was higher.",
        "Fraser, 26, became the first British gymnast to be crowned world champion in the parallel bars in 2019 and this time clinched a historic first bronze in the high bar.",
        "His score of 14.700 saw him finish behind American Brody Malone, who won gold, and Japan's Daiki Hashimoto.",
        "This video can not be played",
        "GB's Joe Fraser wins bronze in high-bar at Gymnastics Championships"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/gymnastics/articles/c1m3eye1kpxo",
      "main_category": "sport",
      "detailed_category": "gymnastics",
      "topic": "Jarman wins world floor gold in GB one-two",
      "content": [
        "Jake Jarman won gold at the the World Artistic Gymnastics Championships as Great Britain claimed a one-two finish in the men's floor final.Jarman, who took the bronze medal in the event at the 2024 Paris Olympics, finished top with a score of 14.866 in Jakarta, Indonesia.His compatriot Luke Whitehouse followed closely behind to come second with 14.666 to secure his first medal at a World Championships, having won the past three European titles on floor.Olympic champion Carlos Yulo of the Philippines rounded off the podium, taking bronze with 14.533.The previous world floor champion, Israel's Artem Dolgopyat, could not compete following Indonesia's decision to not grant visas to the Israel team because of the country's military offensive in Gaza.",
        "This video can not be played",
        "Brits Jake Jarman and Luke Whitehouse top floor in World Gymnastics Championships",
        "Jake Jarman won gold at the the World Artistic Gymnastics Championships as Great Britain claimed a one-two finish in the men's floor final.",
        "Jarman, who took the bronze medal in the event at the 2024 Paris Olympics, finished top with a score of 14.866 in Jakarta, Indonesia.",
        "His compatriot Luke Whitehouse followed closely behind to come second with 14.666 to secure his first medal at a World Championships, having won the past three European titles on floor.",
        "Olympic champion Carlos Yulo of the Philippines rounded off the podium, taking bronze with 14.533.",
        "The previous world floor champion, Israel's Artem Dolgopyat, could not compete following Indonesia's decision to not grant visas to the Israel team because of the country's military offensive in Gaza."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/gymnastics/articles/cly9jznqnveo",
      "main_category": "sport",
      "detailed_category": "gymnastics",
      "topic": "Liverpool to bid for 2030 World Gymnastic Championships",
      "content": [
        "British Gymnastics plans to bid for the 2030 World Championships to be hosted at M&S Bank Arena in Liverpool.A formal bid will be submitted in December with a decision on the host country set to be announced in May 2026.If successful, it would be the second time the Championships have been held in Liverpool - also doing so in 2022 - with Glasgow, London and Birmingham previously hosting too.\"The opportunity for any gymnast to compete in front of a passionate home crowd is something really special, and we'd love for our British team to be able to experience that in 2030 as part of their build-up to the Brisbane 2032 Olympics,\" said Sarah Powell, chief executive of British Gymnastics.\"We have seen with the women's Rugby World Cup and the football Euros that hosting major events can harness the nation's passion and be a catalyst for greater impact. \"So, this World Championships bid is a chance to achieve so much more and have a lasting impact far beyond the week of incredible sporting drama that will unfold in the arena itself.\"",
        "Ten British gymnasts are competing in the 2025 edition which began on Sunday and concludes on Saturday in Jakarta, Indonesia.The 2030 World Championships will provide gymnasts with the first opportunity to qualify for the 2032 Olympics.",
        "The UK has hosted the World Gymnastic Championships on four previous occasions",
        "British Gymnastics plans to bid for the 2030 World Championships to be hosted at M&S Bank Arena in Liverpool.",
        "A formal bid will be submitted in December with a decision on the host country set to be announced in May 2026.",
        "If successful, it would be the second time the Championships have been held in Liverpool - also doing so in 2022 - with Glasgow, London and Birmingham previously hosting too.",
        "\"The opportunity for any gymnast to compete in front of a passionate home crowd is something really special, and we'd love for our British team to be able to experience that in 2030 as part of their build-up to the Brisbane 2032 Olympics,\" said Sarah Powell, chief executive of British Gymnastics.",
        "\"We have seen with the women's Rugby World Cup and the football Euros that hosting major events can harness the nation's passion and be a catalyst for greater impact.",
        "\"So, this World Championships bid is a chance to achieve so much more and have a lasting impact far beyond the week of incredible sporting drama that will unfold in the arena itself.\"",
        "Ten British gymnasts are competing in the 2025 edition which began on Sunday and concludes on Saturday in Jakarta, Indonesia.",
        "The 2030 World Championships will provide gymnasts with the first opportunity to qualify for the 2032 Olympics.",
        "IOC to tell members not to host events in Indonesia"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/gymnastics/articles/cvgwxp8rrz7o",
      "main_category": "sport",
      "detailed_category": "gymnastics",
      "topic": "Evans in tears at coach retirement before Worlds",
      "content": [
        "Ruby Evans admits the retirement of her long-time coach and mentor has left her in tears as she prepares for the World Artistic Gymnastics Championships.The 18-year-old became an Olympian and double European silver medallist under the guidance of Welsh national coach Tracey Skirton-Davies.But the coach's decision to step away from the sport, external in September after more than 20 years in the role has left Evans devastated at losing her \"second mum\".\"It has had a big impact. I'm not an emotional person but I have just been crying all the time,\" said Evans.\"The coaches in British (Gymnastics) are really good and have been really supportive but I want my coach back because no-one really understands you as much as your own personal coach.\"Her family were kind of like my second family to me, so it has been really hard. I've had a few mental breakdowns, so it has been difficult.\"",
        "It has hardly been the ideal preparation for her second World Championships, which begin on Sunday in Jakarta.She has recovered from ligament injuries in both ankles at the start of the year before the change of coach.\"I'm hoping I got all my falls out in Paris, so it doesn't happen in the Worlds,\" she said.\"I did a PB (personal best) on floor in qualification but I had a silly slip off the bar. I still don't know what happened.\"Beam I fell three times but I got my dismount back out, which was good, but it was just a hard competition in general.\"I forget about it, it's probably not the best thing, but I just think, oh well, that's done now.  I'm not going to think about my falls going into Worlds because I've done so many more routines since then.\"\"The Worlds are one of the best competitions, so I'm really happy to be selected.\"",
        "Her selection has also brought a new role for Evans in the Great Britain team with so many younger athletes breaking into the squad.\"In past years I've been the baby of all the teams and I've had to step up and be the oldest in the younger category,\" she said.\"We don't really see it as I'm the leader, I'm just the most experienced in the team.\"I can't tell if I love or hate it. It's been hard to step up and have the  pressure of making sure everyone's doing everything. I'm just getting used to it.\"Evans may no longer be the baby of the squad but having become the first Welsh female gymnast to appear at the Olympics since 1996, she is still targeting the next games at Los Angeles in 2028.However she has one more item to tick on her bucket list, wearing the red of Wales at next year's Commonwealth Games.She said: \"I've always wanted to do that so it would be special. I love Wales, it's home.\"",
        "Ruby Evans was the first Welsh female gymnast to appear at the Olympics in 28 years at Paris 2024",
        "Ruby Evans admits the retirement of her long-time coach and mentor has left her in tears as she prepares for the World Artistic Gymnastics Championships.",
        "The 18-year-old became an Olympian and double European silver medallist under the guidance of Welsh national coach Tracey Skirton-Davies.",
        "But the coach's decision to step away from the sport, external in September after more than 20 years in the role has left Evans devastated at losing her \"second mum\".",
        "\"It has had a big impact. I'm not an emotional person but I have just been crying all the time,\" said Evans.",
        "\"The coaches in British (Gymnastics) are really good and have been really supportive but I want my coach back because no-one really understands you as much as your own personal coach.",
        "\"Her family were kind of like my second family to me, so it has been really hard. I've had a few mental breakdowns, so it has been difficult.\"",
        "Skirton-Davies was like a \"second mum\" to Evans",
        "It has hardly been the ideal preparation for her second World Championships, which begin on Sunday in Jakarta.",
        "She has recovered from ligament injuries in both ankles at the start of the year before the change of coach.",
        "\"I'm hoping I got all my falls out in Paris, so it doesn't happen in the Worlds,\" she said.",
        "\"I did a PB (personal best) on floor in qualification but I had a silly slip off the bar. I still don't know what happened.",
        "\"Beam I fell three times but I got my dismount back out, which was good, but it was just a hard competition in general.",
        "\"I forget about it, it's probably not the best thing, but I just think, oh well, that's done now.  I'm not going to think about my falls going into Worlds because I've done so many more routines since then.\"",
        "\"The Worlds are one of the best competitions, so I'm really happy to be selected.\"",
        "GB's Jarman & Evans win silver in mixed team event",
        "'I feel amazing' - gymnast Evans on Olympic selection",
        "Her selection has also brought a new role for Evans in the Great Britain team with so many younger athletes breaking into the squad.",
        "\"In past years I've been the baby of all the teams and I've had to step up and be the oldest in the younger category,\" she said.",
        "\"We don't really see it as I'm the leader, I'm just the most experienced in the team.",
        "\"I can't tell if I love or hate it. It's been hard to step up and have the  pressure of making sure everyone's doing everything. I'm just getting used to it.\"",
        "Evans may no longer be the baby of the squad but having become the first Welsh female gymnast to appear at the Olympics since 1996, she is still targeting the next games at Los Angeles in 2028.",
        "However she has one more item to tick on her bucket list, wearing the red of Wales at next year's Commonwealth Games.",
        "She said: \"I've always wanted to do that so it would be special. I love Wales, it's home.\""
      ]
    },
    {
      "url": "https://www.bbc.com/sport/gymnastics/articles/cy8v70331gro",
      "main_category": "sport",
      "detailed_category": "gymnastics",
      "topic": "IOC says sport must be 'safe space' amid Israel gymnast row",
      "content": [
        "The International Olympic Committee says sport must remain a \"safe space\" after it found \"no resolution\" to allow Israel's athletes to take part in the World Artistic Gymnastics Championships.Indonesia said it would not grant visas to the Israel team for the event in Jakarta from 19-25 October because of the country's military offensive in Gaza.The Israeli Gymnastics Federation (IGF) said the decision set a \"dangerous precedent\" and was critical of the International Gymnastics Federation (FIG).A request from the IGF for urgent provisional measures to guarantee Israeli participation, or to move or cancel the event, was rejected by the Court of Arbitration for Sport (Cas) earlier this week.Any lingering hopes the impasse could be resolved before the event starts on Sunday now look to be over after the IOC issued a lengthy statement, external on Friday.The International Olympic Committee (IOC) said it had contacted FIG as well as the government of Indonesia and its Olympic authorities \"to help facilitate a solution\" but \"unfortunately, no resolution has been found\".\"The IOC very much regrets the situation, especially after the remarkable step towards a peace agreement at the peace summit in Egypt, as witnessed by the president of Indonesia,\" the statement said.\"The IOC executive board will discuss the specific situation of Indonesia – for all stakeholders involved – at its next meeting. \"Sport must remain a safe space for athletes to fulfil their dreams, and athletes must not be held responsible for political decisions.\"Indonesia, the world's most populous Muslim nation, has no formal diplomatic ties with Israel but the IGF says it had been given assurances its delegation would be welcome.Among the athletes unable to compete are defending world floor champion Artem Dolgopyat.The 28-year-old won Olympic floor gold at the Tokyo 2020 Olympics and silver in Paris last year. He is also a two-time European champion.The IOC reiterated its position that \"eligible athletes, teams and sports officials\" must be able to compete in competition \"without any form of discrimination from the host country\" in accordance with the Olympic charter.It added that it was the \"direct responsibility\" of the hosting country to ensure this \"principle is fully respected\".Indonesia has cited its long-standing political and diplomatic principles for the decision.During the 1962 Asian Games, Indonesia similarly barred Israeli athletes - leading to its exclusion from the 1964 Tokyo Olympics by the IOC.Although that ruling was overturned, Indonesia boycotted the Games.In March 2023 Indonesia was stripped of its right to host football's Under-20 World Cup after the governor of Bali, where the draw was due to take place, refused to host the Israel team.Six months later, Israel launched its offensive in response to the Hamas-led attack on southern Israel on 7 October 2023, in which 1,200 people were killed and 251 taken hostage back to Gaza.Since then more than 67,000 people have been killed by Israel's offensive, according to Gaza's Hamas-run health ministry. Its figures are seen as reliable by the United Nations and other international bodies.More than nine in 10 residential buildings have been damaged or destroyed, according to the UN.Last month the UN commission of inquiry formally declared Israel has committed genocide against Palestinians in Gaza - though Israel rejected this.On Monday, 20 living Israeli hostages and hundreds of Palestinian detainees were reunited with their families as part of a ceasefire deal.",
        "Israel's Artem Dolgopyat is a a two-time Olympic floor medal winner",
        "The International Olympic Committee says sport must remain a \"safe space\" after it found \"no resolution\" to allow Israel's athletes to take part in the World Artistic Gymnastics Championships.",
        "Indonesia said it would not grant visas to the Israel team for the event in Jakarta from 19-25 October because of the country's military offensive in Gaza.",
        "The Israeli Gymnastics Federation (IGF) said the decision set a \"dangerous precedent\" and was critical of the International Gymnastics Federation (FIG).",
        "A request from the IGF for urgent provisional measures to guarantee Israeli participation, or to move or cancel the event, was rejected by the Court of Arbitration for Sport (Cas) earlier this week.",
        "Any lingering hopes the impasse could be resolved before the event starts on Sunday now look to be over after the IOC issued a lengthy statement, external on Friday.",
        "The International Olympic Committee (IOC) said it had contacted FIG as well as the government of Indonesia and its Olympic authorities \"to help facilitate a solution\" but \"unfortunately, no resolution has been found\".",
        "\"The IOC very much regrets the situation, especially after the remarkable step towards a peace agreement at the peace summit in Egypt, as witnessed by the president of Indonesia,\" the statement said.",
        "\"The IOC executive board will discuss the specific situation of Indonesia – for all stakeholders involved – at its next meeting.",
        "\"Sport must remain a safe space for athletes to fulfil their dreams, and athletes must not be held responsible for political decisions.\"",
        "Indonesia, the world's most populous Muslim nation, has no formal diplomatic ties with Israel but the IGF says it had been given assurances its delegation would be welcome.",
        "Among the athletes unable to compete are defending world floor champion Artem Dolgopyat.",
        "The 28-year-old won Olympic floor gold at the Tokyo 2020 Olympics and silver in Paris last year. He is also a two-time European champion.",
        "The IOC reiterated its position that \"eligible athletes, teams and sports officials\" must be able to compete in competition \"without any form of discrimination from the host country\" in accordance with the Olympic charter.",
        "It added that it was the \"direct responsibility\" of the hosting country to ensure this \"principle is fully respected\".",
        "Indonesia has cited its long-standing political and diplomatic principles for the decision.",
        "During the 1962 Asian Games, Indonesia similarly barred Israeli athletes - leading to its exclusion from the 1964 Tokyo Olympics by the IOC.",
        "Although that ruling was overturned, Indonesia boycotted the Games.",
        "In March 2023 Indonesia was stripped of its right to host football's Under-20 World Cup after the governor of Bali, where the draw was due to take place, refused to host the Israel team.",
        "Six months later, Israel launched its offensive in response to the Hamas-led attack on southern Israel on 7 October 2023, in which 1,200 people were killed and 251 taken hostage back to Gaza.",
        "Since then more than 67,000 people have been killed by Israel's offensive, according to Gaza's Hamas-run health ministry. Its figures are seen as reliable by the United Nations and other international bodies.",
        "More than nine in 10 residential buildings have been damaged or destroyed, according to the UN.",
        "Last month the UN commission of inquiry formally declared Israel has committed genocide against Palestinians in Gaza - though Israel rejected this.",
        "On Monday, 20 living Israeli hostages and hundreds of Palestinian detainees were reunited with their families as part of a ceasefire deal."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/gymnastics/articles/c9wvj1v812po",
      "main_category": "sport",
      "detailed_category": "gymnastics",
      "topic": "'It's a good rivalry' - Jarman and Hepworth in vault battle at Worlds",
      "content": [
        "2025 World Artistic Gymnastics ChampionshipsVenue: Indonesia Arena, Jakarta, Indonesia Date: 19-25 OctoberCoverage: All-around finals, 22-23 October (12:00-15:30 BST), and apparatus finals, 24-25 October (07:30-12:30), on BBC Two, iPlayer and BBC Sport website and app.",
        "Great Britain's Harry Hepworth and Jake Jarman hope to use their \"good rivalry\" to push each other to success at the World Artistic Gymnastic Championships in Jakarta, Indonesia.Hepworth, who won bronze at the 2024 Paris Olympics, and reigning vault world champion Jarman will compete on the world stage for individual medals despite being close Team GB team-mates. \"It's a good rivalry,\" Hepworth told BBC Sport. \"It's not toxic in any way and I think that's what has helped us get to where we are now.\"We just push each other. We are both doing insanely difficult vaults and understand how hard it is to perfect them.\"Jarman will bid to defend his title by building on his performance at May's European championships, which saw him score a near-perfect 15.2 for his first vault.He hopes to contain his \"excitement\" this time round, which he admits affected the execution of his second vault in that competition and cost him his third European vault title. \"That competition was a bit of a learning curve for me,\" he said. \"It was the first time I had nailed a vault like that in an event final.\"Normally, I tell myself to settle down and bring the energy levels down for the next performance, but that time round it was a bit of a shock.\"I was overwhelmed by excitement, so for my second vault my legs went to jelly and I took a couple more steps than I needed to.\"I need to iron out the smaller mistakes. I have to be a perfectionist when it comes to training these vaults.\"No team competition takes place at the world championships following an Olympics year, so individual medals only are stake.The top 24 gymnasts in the all-around and the best eight on each individual apparatus, with a maximum of two per country, will qualify for the finals.",
        "Jarman and Hepworth are part of a strong six-man team that will compete across all six apparatus in Jakarta.Three-time European floor champion Luke Whitehouse features, along with Olympian and former parallel bars world champion Joe Fraser, 10-time major championship medallist Courtney Tulloch and Alex Yolshin-Cash, who will compete at his first senior world championships.In the women's team, Olympians Ruby Evans and Abi Martin will be joined by British all-around champion Alia Leat and Shantae-Eve Amankwaah, who are making their senior world debuts.Martin is one to watch for all-around, while Evans prefers floor and vault.Elsewhere, Ireland's Olympic pommel horse champion Rhys McClenaghan will miss the competition after undergoing shoulder surgery.With 11-time Olympic medallist Simone Biles absent from the USA team, veteran gymnasts Leanne Wong, Joscelyn Roberson and Skye Blakely are joined by 17-year-old Dulcy Caylor.Israeli gymnasts, including defending world floor champion Artem Dolgopyat, will not compete after hosts Indonesia denied them entry to the country because of the country's military offensive in Gaza.",
        "Wednesday, 22 October12:00-15:30 - Men's all-around final on iPlayer/BBC Sport website 13:00-15:30 - BBC TwoThursday, 23 October12:00-15:30 - Women's all-around final on iPlayer/BBC Sport website 13:00-15:30 - BBC TwoFriday, 24 October07:30-12:30 - Individual apparatus finals on BBC Two, iPlayer and BBC Sport website Saturday, 25 October07:30-12:30 - Individual apparatus finals on BBC Two, iPlayer and BBC Sport website",
        "Harry Hepworth and Jake Jarman competed for Team GB at the Paris Olympics",
        "2025 World Artistic Gymnastics Championships",
        "Venue: Indonesia Arena, Jakarta, Indonesia Date: 19-25 October",
        "Coverage: All-around finals, 22-23 October (12:00-15:30 BST), and apparatus finals, 24-25 October (07:30-12:30), on BBC Two, iPlayer and BBC Sport website and app.",
        "Great Britain's Harry Hepworth and Jake Jarman hope to use their \"good rivalry\" to push each other to success at the World Artistic Gymnastic Championships in Jakarta, Indonesia.",
        "Hepworth, who won bronze at the 2024 Paris Olympics, and reigning vault world champion Jarman will compete on the world stage for individual medals despite being close Team GB team-mates.",
        "\"It's a good rivalry,\" Hepworth told BBC Sport. \"It's not toxic in any way and I think that's what has helped us get to where we are now.",
        "\"We just push each other. We are both doing insanely difficult vaults and understand how hard it is to perfect them.\"",
        "Jarman will bid to defend his title by building on his performance at May's European championships, which saw him score a near-perfect 15.2 for his first vault.",
        "He hopes to contain his \"excitement\" this time round, which he admits affected the execution of his second vault in that competition and cost him his third European vault title.",
        "\"That competition was a bit of a learning curve for me,\" he said. \"It was the first time I had nailed a vault like that in an event final.",
        "\"Normally, I tell myself to settle down and bring the energy levels down for the next performance, but that time round it was a bit of a shock.",
        "\"I was overwhelmed by excitement, so for my second vault my legs went to jelly and I took a couple more steps than I needed to.",
        "\"I need to iron out the smaller mistakes. I have to be a perfectionist when it comes to training these vaults.\"",
        "No team competition takes place at the world championships following an Olympics year, so individual medals only are stake.",
        "The top 24 gymnasts in the all-around and the best eight on each individual apparatus, with a maximum of two per country, will qualify for the finals.",
        "This video can not be played",
        "Fraser & Tulloch talk career highlights & inspiring the next generation",
        "Jarman and Hepworth are part of a strong six-man team that will compete across all six apparatus in Jakarta.",
        "Three-time European floor champion Luke Whitehouse features, along with Olympian and former parallel bars world champion Joe Fraser, 10-time major championship medallist Courtney Tulloch and Alex Yolshin-Cash, who will compete at his first senior world championships.",
        "In the women's team, Olympians Ruby Evans and Abi Martin will be joined by British all-around champion Alia Leat and Shantae-Eve Amankwaah, who are making their senior world debuts.",
        "Martin is one to watch for all-around, while Evans prefers floor and vault.",
        "Elsewhere, Ireland's Olympic pommel horse champion Rhys McClenaghan will miss the competition after undergoing shoulder surgery.",
        "With 11-time Olympic medallist Simone Biles absent from the USA team, veteran gymnasts Leanne Wong, Joscelyn Roberson and Skye Blakely are joined by 17-year-old Dulcy Caylor.",
        "Israeli gymnasts, including defending world floor champion Artem Dolgopyat, will not compete after hosts Indonesia denied them entry to the country because of the country's military offensive in Gaza.",
        "Wednesday, 22 October",
        "12:00-15:30 - Men's all-around final on iPlayer/BBC Sport website",
        "13:00-15:30 - BBC Two",
        "12:00-15:30 - Women's all-around final on iPlayer/BBC Sport website",
        "13:00-15:30 - BBC Two",
        "07:30-12:30 - Individual apparatus finals on BBC Two, iPlayer and BBC Sport website",
        "07:30-12:30 - Individual apparatus finals on BBC Two, iPlayer and BBC Sport website"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/gymnastics/articles/c364p04p12wo",
      "main_category": "sport",
      "detailed_category": "gymnastics",
      "topic": "Yolshin-Cash has tooth-aching prep for world champs",
      "content": [
        "Cracking two front teeth in training has not disrupted preparations for the World Artistic Gymnastics Championships for Britain's Alexander Yolshin-Cash.In fact, the 20-year-old was back on the pommel horse within 24 hours.Having missed both the English and British championships this year because of a shoulder injury, the Derby athlete who trains at the Notts Gymnastics Academy took the tooth-rattling training setback in his stride.\"I was on the pommel horse doing a dismount that I've done thousands of times and I slipped, missed my hands and chipped my two front teeth,\" he explained to BBC East Midlands Today\"I was quite an interesting experience, but I was able to get back in the gym the next day - it didn't stop my preparations. I got it sorted and was straight back in.\"",
        "While Yolshin-Cash has had an injury-interrupted year, he distinguished himself as one of Britain's finest performers with a strong showing in September's World Challenge Cup in Paris.He was the top ranked Brit in the pommel horse after finishing fifth and ended up 25th on the parallel bars.He will compete on both apparatuses at the World Championships in Jakarta, Indonesia, starting on Sunday.Yolshin-Cash says he is \"ecstatic and buzzing\" to call the likes of Courtney Tulloch and Joe Fraser team-mates in what will be his first senior World Championship appearance.\"This has been my dream from a young age,\" he said.\"To be able to compete with some names like Courtney Tullock and Joe Fraser, these have been idols of mine for several years since I was a 10-year-old, is an honour.\"",
        "Alexander Yolshin-Cash will be part of a team of 10 Brits competing in Jakarta",
        "Cracking two front teeth in training has not disrupted preparations for the World Artistic Gymnastics Championships for Britain's Alexander Yolshin-Cash.",
        "In fact, the 20-year-old was back on the pommel horse within 24 hours.",
        "Having missed both the English and British championships this year because of a shoulder injury, the Derby athlete who trains at the Notts Gymnastics Academy took the tooth-rattling training setback in his stride.",
        "\"I was on the pommel horse doing a dismount that I've done thousands of times and I slipped, missed my hands and chipped my two front teeth,\" he explained to BBC East Midlands Today",
        "\"I was quite an interesting experience, but I was able to get back in the gym the next day - it didn't stop my preparations. I got it sorted and was straight back in.\"",
        "This video can not be played",
        "Yolshin-Cash on excitement of world championship appearance",
        "While Yolshin-Cash has had an injury-interrupted year, he distinguished himself as one of Britain's finest performers with a strong showing in September's World Challenge Cup in Paris.",
        "He was the top ranked Brit in the pommel horse after finishing fifth and ended up 25th on the parallel bars.",
        "He will compete on both apparatuses at the World Championships in Jakarta, Indonesia, starting on Sunday.",
        "Yolshin-Cash says he is \"ecstatic and buzzing\" to call the likes of Courtney Tulloch and Joe Fraser team-mates in what will be his first senior World Championship appearance.",
        "\"This has been my dream from a young age,\" he said.",
        "\"To be able to compete with some names like Courtney Tullock and Joe Fraser, these have been idols of mine for several years since I was a 10-year-old, is an honour.\""
      ]
    },
    {
      "url": "https://www.bbc.com/sport/gymnastics/articles/clyzllz1v0no",
      "main_category": "sport",
      "detailed_category": "gymnastics",
      "topic": "Boycott of Israel gymnasts sets 'dangerous precedent'",
      "content": [
        "The Israeli Gymnastics Federation (IGF) says a \"dangerous precedent\" has been set after its athletes were denied entry into Indonesia for the World Artistic Gymnastics Championships.Indonesia said it would not grant visas to the Israel team for the event in Jakarta from 19-25 October because of the country's military offensive in Gaza.A request from the IGF for urgent provisional measures to guarantee Israeli participation, or to move or cancel the event, was rejected by the Court of Arbitration for Sport (Cas).Cas said the International Gymnastics Federation (FIG) argued it had \"no prerogatives\" in the issuing of entry visas, and the Indonesian government's decision not to grant the visas falls \"outside the competence\" of the organisation.Indonesia, the world's most populous Muslim nation, has no formal diplomatic ties with Israel but the IGF says it had been given assurances its delegation would be welcome.IGF secretary general Sarit Shenar said that its athletes \"just want to participate\" but the decision to deny them visas represented \"a very slippery slope\" for sport in general.\"Our biggest fear is that this type of event can go on and can just be a setup example,\" Shenar said.\"That if it happened in World Championship and gymnastics, what's next? It can be in any discipline, in any sport, in any competition. This precedent is very dangerous.\"Among the athletes unable to compete are defending world floor champion Artem Dolgopyat.The 28-year-old won Olympic floor gold at the Tokyo 2020 Olympics and silver in Paris last year. He is also a two-time European champion.",
        "Indonesia has cited their longstanding political and diplomatic principles for their decision. \"We are aware of the Israeli Gymnastics Federation's plan to appeal to Cas. We are anticipating the lawsuit and will face it respectfully, following the rules and regulations of Cas and Indonesia,\" said Youth and Sports Minister Erick Thohir.The decision came from the first president of Indonesia, Sukarno, who refused to recognise Israel as a country.That stance has shaped Indonesia's diplomatic posture for decades. During the 1962 Asian Games, Indonesia similarly barred Israeli athletes - leading to its exclusion from the 1964 Tokyo Olympics by the International Olympic Committee. Although that ruling was overturned, Indonesia boycotted the Games.In March 2023 Indonesia was stripped of its right to host football's Under-20 World Cup after the governor of Bali, where the draw was due to take place, refused to host the Israel team.Six months later, Israel launched its offensive in response to the Hamas-led attack on southern Israel on 7 October 2023, in which 1,200 people were killed and 251 taken hostage back to Gaza.Since then more than 67,000 people have been killed by Israel's offensive, according to Gaza's Hamas-run health ministry. Its figures are seen as reliable by the United Nations and other international bodies.More than nine in 10 residential buildings have been damaged or destroyed, according to the UN.Last month the UN commission of inquiry formally declared Israel has committed genocide against Palestinians in Gaza - though Israel rejected this.On Monday, 20 living Israeli hostages and hundreds of Palestinian detainees were reunited with their families as part of a ceasefire deal.Shenar said Indonesia's decision to deny visas to Israeli athletes was \"sad timing\" given the events of the previous day.She added that \"sport and politics should never interfere each other\" as she pointed the finger of blame at FIG, given the IGF had raised the issue with them more than a year ago.\"We were hoping for a diplomatic solution, way before a legal one,\" she added.\"They [FIG] sent us a letter telling us everything is taken under control, that the authorities there gave official letter that they will there will be no problem. \"There is no question who's responsible for this mess in our eyes - FIG, a part of the International Olympic Committee.  \"They should be obeying all the rules and not ignoring the Olympic Charter.\"In September, Spain's Prime Minister Pedro Sanchez called for Israel to be excluded from international sports competitions over its actions in Gaza.There have also been widespread calls for the country's teams to be suspended from football competitions by European football's governing body Uefa.This year's Vuelta a Espana cycling race, which featured the Israel-Premier Tech team, was severely disrupted by pro-Palestine protesters.",
        "Israel's Artem Dolgopyat won gold in the floor at the 2023 World Artistic Gymnastics Championships in Antwerp, Belgium",
        "The Israeli Gymnastics Federation (IGF) says a \"dangerous precedent\" has been set after its athletes were denied entry into Indonesia for the World Artistic Gymnastics Championships.",
        "Indonesia said it would not grant visas to the Israel team for the event in Jakarta from 19-25 October because of the country's military offensive in Gaza.",
        "A request from the IGF for urgent provisional measures to guarantee Israeli participation, or to move or cancel the event, was rejected by the Court of Arbitration for Sport (Cas).",
        "Cas said the International Gymnastics Federation (FIG) argued it had \"no prerogatives\" in the issuing of entry visas, and the Indonesian government's decision not to grant the visas falls \"outside the competence\" of the organisation.",
        "Indonesia, the world's most populous Muslim nation, has no formal diplomatic ties with Israel but the IGF says it had been given assurances its delegation would be welcome.",
        "IGF secretary general Sarit Shenar said that its athletes \"just want to participate\" but the decision to deny them visas represented \"a very slippery slope\" for sport in general.",
        "\"Our biggest fear is that this type of event can go on and can just be a setup example,\" Shenar said.",
        "\"That if it happened in World Championship and gymnastics, what's next? It can be in any discipline, in any sport, in any competition. This precedent is very dangerous.\"",
        "Among the athletes unable to compete are defending world floor champion Artem Dolgopyat.",
        "The 28-year-old won Olympic floor gold at the Tokyo 2020 Olympics and silver in Paris last year. He is also a two-time European champion.",
        "Indonesia has cited their longstanding political and diplomatic principles for their decision.",
        "\"We are aware of the Israeli Gymnastics Federation's plan to appeal to Cas. We are anticipating the lawsuit and will face it respectfully, following the rules and regulations of Cas and Indonesia,\" said Youth and Sports Minister Erick Thohir.",
        "The decision came from the first president of Indonesia, Sukarno, who refused to recognise Israel as a country.",
        "That stance has shaped Indonesia's diplomatic posture for decades.",
        "During the 1962 Asian Games, Indonesia similarly barred Israeli athletes - leading to its exclusion from the 1964 Tokyo Olympics by the International Olympic Committee.",
        "Although that ruling was overturned, Indonesia boycotted the Games.",
        "In March 2023 Indonesia was stripped of its right to host football's Under-20 World Cup after the governor of Bali, where the draw was due to take place, refused to host the Israel team.",
        "Six months later, Israel launched its offensive in response to the Hamas-led attack on southern Israel on 7 October 2023, in which 1,200 people were killed and 251 taken hostage back to Gaza.",
        "Since then more than 67,000 people have been killed by Israel's offensive, according to Gaza's Hamas-run health ministry. Its figures are seen as reliable by the United Nations and other international bodies.",
        "More than nine in 10 residential buildings have been damaged or destroyed, according to the UN.",
        "Last month the UN commission of inquiry formally declared Israel has committed genocide against Palestinians in Gaza - though Israel rejected this.",
        "On Monday, 20 living Israeli hostages and hundreds of Palestinian detainees were reunited with their families as part of a ceasefire deal.",
        "Shenar said Indonesia's decision to deny visas to Israeli athletes was \"sad timing\" given the events of the previous day.",
        "She added that \"sport and politics should never interfere each other\" as she pointed the finger of blame at FIG, given the IGF had raised the issue with them more than a year ago.",
        "\"We were hoping for a diplomatic solution, way before a legal one,\" she added.",
        "\"They [FIG] sent us a letter telling us everything is taken under control, that the authorities there gave official letter that they will there will be no problem.",
        "\"There is no question who's responsible for this mess in our eyes - FIG, a part of the International Olympic Committee.",
        "\"They should be obeying all the rules and not ignoring the Olympic Charter.\"",
        "In September, Spain's Prime Minister Pedro Sanchez called for Israel to be excluded from international sports competitions over its actions in Gaza.",
        "There have also been widespread calls for the country's teams to be suspended from football competitions by European football's governing body Uefa.",
        "This year's Vuelta a Espana cycling race, which featured the Israel-Premier Tech team, was severely disrupted by pro-Palestine protesters."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/gymnastics/articles/c1m30mj59yko",
      "main_category": "sport",
      "detailed_category": "gymnastics",
      "topic": "Israelis denied visas for World Championships",
      "content": [
        "Israeli gymnasts, including defending world floor champion Artem Dolgopyat, will not compete at next week's World Artistic Gymnastics Championships after hosts Indonesia denied them entry to the country.Indonesia said it would not grant visas to the Israel team because of the country's military offensive in Gaza.On Tuesday the Court of Arbitration for Sport (Cas) rejected requests from the Israel Gymnastics Federation (IGF) for urgent provisional measures.The IGF said it was \"deeply disappointed\" by the Cas decision.While a first appeal against the ruling was rejected for \"a lack of jurisdiction\", BBC Sport understands that the hearing for a second appeal will not be held before the World Championships start on Sunday.",
        "The IGF wanted Cas to compel the International Gymnastics Federation (FIG) to \"take the necessary measures that guarantee Israeli participation in the championships\" or \"to move or to cancel\" the event, which runs until 25 October.It said the FIG's lack of measures was a \"denial of justice\" and created a \"situation of discrimination against a member association\".A Cas statement said the FIG argued it had \"no prerogatives\" in the issuing of entry visas, and the Indonesian government's decision not to grant the visas falls \"outside the competence\" of the organisation.An IGF statement read: \"The rules are clear, and Indonesia's actions constitute a blatant violation of them.\"It is inconceivable that a country can bar another nation from competing in a World Championship while the governing bodies stand by.\"This decision undermines the very foundations of sport and fair competition, and it delivers a severe blow to the morale of the gymnasts and staff who have worked tirelessly for this moment.\"Dolgopyat said on Instagram: \"We are so disappointed for the gymnasts, male and female, and professional teams, but not only that, we are deeply concerned by the recent decisions that could negatively impact the future of all our delegations and the future of sport in general.\"We continue the fight, hoping to achieve justice, but unfortunately we will no longer be able to compete in these World Championships.\"Dolgopyat was one of six gymnasts - alongside Eyal Indig, Ron Pyatov, Lihie Raz, Yali Shoshani and Roni Shamay - who submitted the requests to Cas in conjunction with the IGF.Dolgopyat, 28, won Olympic floor gold at the Tokyo 2020 Olympics and silver in Paris last year. He is also a two-time European champion.In 2023 Indonesia was stripped of its right to host football's Under-20 World Cup after the governor of Bali, where the draw was due to take place, refused to host the Israel team.Indonesia, the world's most populous Muslim nation and one which has no formal diplomatic ties with Israel, was banned from the 1964 Olympics after it refused entry visas for Israeli athletes for the 1962 Asian Games.Although that ruling was overturned, Indonesia boycotted the Games.",
        "Israel launched its offensive in response to the Hamas-led attack on southern Israel on 7 October 2023, in which 1,200 people were killed and 251 taken hostage back to Gaza.Since then more than 67,000 people have been killed by Israel's offensive, according to Gaza's Hamas-run health ministry. Its figures are seen as reliable by the United Nations and other international bodies.More than nine in 10 residential buildings have been damaged or destroyed, according to the UN.Last month the UN commission of inquiry formally declared Israel has committed genocide against Palestinians in Gaza.On Monday 20 living Israeli hostages and hundreds of Palestinian detainees were reunited with their families as part of a ceasefire deal.In September Spanish Prime Minister Pedro Sanchez called for Israel to be excluded from international sports competitions over its actions in Gaza, and there have been growing calls for the country to be suspended from international football.",
        "Artem Dolgopyat is a two-time Olympic floor medallist",
        "Israeli gymnasts, including defending world floor champion Artem Dolgopyat, will not compete at next week's World Artistic Gymnastics Championships after hosts Indonesia denied them entry to the country.",
        "Indonesia said it would not grant visas to the Israel team because of the country's military offensive in Gaza.",
        "On Tuesday the Court of Arbitration for Sport (Cas) rejected requests from the Israel Gymnastics Federation (IGF) for urgent provisional measures.",
        "The IGF said it was \"deeply disappointed\" by the Cas decision.",
        "While a first appeal against the ruling was rejected for \"a lack of jurisdiction\", BBC Sport understands that the hearing for a second appeal will not be held before the World Championships start on Sunday.",
        "The IGF wanted Cas to compel the International Gymnastics Federation (FIG) to \"take the necessary measures that guarantee Israeli participation in the championships\" or \"to move or to cancel\" the event, which runs until 25 October.",
        "It said the FIG's lack of measures was a \"denial of justice\" and created a \"situation of discrimination against a member association\".",
        "A Cas statement said the FIG argued it had \"no prerogatives\" in the issuing of entry visas, and the Indonesian government's decision not to grant the visas falls \"outside the competence\" of the organisation.",
        "An IGF statement read: \"The rules are clear, and Indonesia's actions constitute a blatant violation of them.",
        "\"It is inconceivable that a country can bar another nation from competing in a World Championship while the governing bodies stand by.",
        "\"This decision undermines the very foundations of sport and fair competition, and it delivers a severe blow to the morale of the gymnasts and staff who have worked tirelessly for this moment.\"",
        "Dolgopyat said on Instagram: \"We are so disappointed for the gymnasts, male and female, and professional teams, but not only that, we are deeply concerned by the recent decisions that could negatively impact the future of all our delegations and the future of sport in general.",
        "\"We continue the fight, hoping to achieve justice, but unfortunately we will no longer be able to compete in these World Championships.\"",
        "Dolgopyat was one of six gymnasts - alongside Eyal Indig, Ron Pyatov, Lihie Raz, Yali Shoshani and Roni Shamay - who submitted the requests to Cas in conjunction with the IGF.",
        "Dolgopyat, 28, won Olympic floor gold at the Tokyo 2020 Olympics and silver in Paris last year. He is also a two-time European champion.",
        "In 2023 Indonesia was stripped of its right to host football's Under-20 World Cup after the governor of Bali, where the draw was due to take place, refused to host the Israel team.",
        "Indonesia, the world's most populous Muslim nation and one which has no formal diplomatic ties with Israel, was banned from the 1964 Olympics after it refused entry visas for Israeli athletes for the 1962 Asian Games.",
        "Although that ruling was overturned, Indonesia boycotted the Games.",
        "Israel launched its offensive in response to the Hamas-led attack on southern Israel on 7 October 2023, in which 1,200 people were killed and 251 taken hostage back to Gaza.",
        "Since then more than 67,000 people have been killed by Israel's offensive, according to Gaza's Hamas-run health ministry. Its figures are seen as reliable by the United Nations and other international bodies.",
        "More than nine in 10 residential buildings have been damaged or destroyed, according to the UN.",
        "Last month the UN commission of inquiry formally declared Israel has committed genocide against Palestinians in Gaza.",
        "On Monday 20 living Israeli hostages and hundreds of Palestinian detainees were reunited with their families as part of a ceasefire deal.",
        "In September Spanish Prime Minister Pedro Sanchez called for Israel to be excluded from international sports competitions over its actions in Gaza, and there have been growing calls for the country to be suspended from international football."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/olympics/articles/cpd1l8np2w1o",
      "main_category": "sport",
      "detailed_category": "gymnastics",
      "topic": "One year on - what's it like being an Olympic champion?",
      "content": [
        "You stand on the Olympic podium and the gold medal is placed around your neck.It's something you have dreamed of your entire life, hours upon hours of hard work and sacrifice having led to the moment. There's the initial euphoria and celebration, but what happens when the world's cameras and attention gradually shift away from that moment?From work experience, ballroom dancing, a new Everest and dressing gowns, BBC Sport speaks to four Olympic champions one year on to see what the reality of achieving their dream is really like.",
        "Hannah Scott tasted gold in Paris when she won the women's quadruple sculls for Team GB with Lauren Henry, Georgina Brayshaw and Lola Anderson in a dramatic final.Scott, who is also a world and European champion, said achieving her Olympic dream was \"a bit of a whirlwind\" but \"the highlight of my life\".\"Since I've been 12 I've always had something in my head about winning an Olympic gold. I wouldn't even talk about it because I was so - not embarrassed - it's more you never know if you are going to get one or not. \"It's not something I was certain about, it was just a dream.\"I've been figuring my stride out a bit since then. It's been so crazy, in the best way.\"",
        "Despite only being 25 at the time, Scott was faced with a big decision about her future that was not as straightforward as one might think.It wasn't as simple as taking a break, then jumping in the boat and going again.\"I spent so long trying to go for that goal of winning an Olympic gold medal that when you no longer have that purpose, a lot of athletes talk about the struggle after. \"You are kind of like, 'what do I do now?' and you do have to ask yourself the question if you want to go again.\"The Northern Ireland rower said it \"wasn't an easy decision\" and she even tried some work experience to get a taste of the office life.\"For your own sanity, you do have to move on from that and find the next thing. I'm happy and content with that and I'm happy being back rowing.\"But I had to give myself a while. I didn't get back into a boat until around Christmas time and that's when I found my stride again. \"At the time, I wasn't sure what I was going to do but I realised I didn't like the office and I missed rowing. \"I didn't think I would miss the early mornings but it turns out I do love routine.\"",
        "After deciding to return, Scott had a virus that ruled her out of the start of the year but she is set to return to competitive action for the World Championships in September, where she should be reunited with her Olympic team-mates in the women's quad. For Scott, it is just one of the many \"ups and downs\" of being an athlete.\"I don't think I'm finished yet. I want to see what else I can do,\" she said.\"It might be great, it might not. But I'm willing to take the risk to try because it's an addictive feeling doing high performance sport.\"Scott added the response from Northern Ireland was \"beyond\" what she thought it would be and she is now motivated to \"do them proud\" after their support. However, Scott jokes about one drawback that has come from the fame of her success.\"In ways, it was beyond what I imagined, and in other ways it is still another rowing race. Those things never will change. \"I didn't realise how many people cared about rowing. I couldn't go to the shop any more in my dressing gown, which I may have done previously. \"Now, it's like 'that's the girl who went to the Olympics and won the medal'. I didn't expect that. \"Rowing my was dream and winning an Olympic medal was my dream, and I didn't realise how many people shared that celebration with me. I feel so lucky to have experienced that.\"",
        "Rhys McClenaghan completed gymnastics' Grand Slam when he won Olympic gold in the pommel horse final after a stunning routine. He is now, Olympic, world, European and Commonwealth champion.McClenaghan has yet to compete since winning his Olympic gold exactly a year ago on 3 August 2024 and has been sidelined after recent shoulder surgery. \"It's quite ironic how one year ago I was winning Olympic gold and recently I was waking up in a hospital bed,\" the 24-year-old said.\"It's been a crazy year. It's been a year of figuring things out, mentally. The reality is I've accomplished a lifelong goal and childhood dream that has fuelled me all these years.\"In that one little moment it was done. There's a still a lot of rejigging in my brain still.\"McClenaghan said winning Olympic gold \"met every ounce of expectation\" and \"all the blood, sweat and tears were worth it for that little moment and that sensation\".\"You think about so many scenarios growing up, and the standout feeling for me was this - if there was no one in the stands spectating or nobody at home watching, and it was me in an empty room getting that medal around my neck it would have still meant just as much,\" he continued.\"For me, that shows I had done the whole journey for the right reason.\"But then I opened my eyes and looked around and saw the young gymnasts in the stands and thought about those back home, and I realised it was much bigger than just me.\"That was an interesting realisation for me. Having those two feelings hand-in-hand was a moment I'll never forget.\"",
        "Despite winning everything there is to offer in the sport, McClenaghan says he is motivated by \"wanting to be the best\".\"I want to win a gold medal at every competition I enter,\" he said.\"But the main motivation for heading into training every day is that I get to do gymnastics. That's a realisation I've had over the past 12 months or so. \"Even though my goal was Olympic gold, the main thing that brought me to the gym every day was enjoying my sport.\"In a twist from gymnastics, McClenaghan competed on and won Dancing with the Stars - the Irish version of Strictly Come Dancing. It was a different experience from the pommel horse, but one he says was \"pretty cool\".\"It was the perfect blend of doing something different and challenging myself, but also having those similarities with sport, but I'm not a retired dancer,\" he said.Since winning gold, he has travelled around Ireland and visited various gymnastics clubs to speak to the stars of the future.\"I knew how big winning an Olympic gold medal was to me growing up,\" McClenaghan said.\"I'm now in a privileged position to inspire and I don't that responsibility lightly.\"",
        "Daniel Wiffen made history in Paris when he became the first athlete from Northern Ireland to win a gold medal in 36 years when he won 800m freestyle gold in the pool. It kickstarted a historic run of four gold medals at the Games as Jack McMillan, Scott and McClenaghan all triumphed too. Athletes from Northern Ireland can represent either Team GB or Team Ireland, and the Paris Games brought two gold medals for each.Wiffen, who also claimed 800m and 1500m gold at the World Championships before the Games, said being Olympic champion \"was actually better than I thought it was going to be\".\"I didn't really think anyone would care that much when I won Olympic gold. Looking at Tokyo, I know it was the Covid Olympics, but I feel it wasn't covered as much. \"But Paris was insane. I remember walking down the Champs-Elysees after the race and I couldn't take a step without people stopping me. \"Even people recognising the Olympics 12 months on, it's great to see the sport moving forward and it will stay prominent every year going towards LA, and people will be looking out for athletes at the World Championships or other competitions.\"Wiffen said people who had taken up swimming because of him, even on a casual basis, had \"changed his mindset\" and people getting behind the sport is \"amazing\".",
        "The 24-year-old took time out of the pool after the Games to travel around Asia, but attentions soon turned to defending his two world titles.\"I'm quite a confident person, so as soon as I came back from Paris I had already written down my goals for the next season,\" he said before the Championships in Singapore.\"It was what I needed to do to win gold at the next World Championships, and what I needed to change.\" However, his path to Singapore wasn't smooth and he was diagnosed with appendicitis just five weeks out from the Worlds, and the condition forced him to withdraw after the 800m final.",
        "After helping Team GB win 4x200m gold in Paris, Jack McMillan took two months off to travel around Asia and got back in the pool around January after a \"reset\".The 25-year-old said Olympic glory \"definitely lives up to the expectation\" but \"it's still something I'm trying to figure out\".\"When you get to that Everest, when you've achieved something you've been training for for so long, it's a weird feeling,\" he added.\"Part of you is really satisfied but there's always something that you could still do more or you start to think about other things afterwards. \"I think that's the competitive side and why we get to these certain levels. We are always striving for other goals and bettering ourselves. \"Once I retire from swimming and look back on it, I can say I've won Olympic gold and achieved the fullest moment I could in the sport.\"",
        "Despite being Olympic champion, McMillan said the \"most pressurised situation\" is at the national trials, where you only get \"one chance\" to swim at international events later that year. \"It's not like you get a smoother ride because of what you done last year. You start back to where you were and you almost have to prove yourself again. \"That gives you more confidence because there's almost a fear of not knowing what you'll perform like because you've had time off.\"McMillan won World Championships gold for Great Britain in Singapore on Friday and, speaking before the competition, had said he had been \"thinking of other ways to get better\" after his Olympic gold.\"You've reached the best thing you can get in the sport, there's nothing better really. \"It makes you reassess and think about what other areas I can get better, rather than thinking 'that's it done'. \"I want to go for certain times for myself, and then medals at Worlds and Commonwealths will add to it. \"It's not necessarily the end of the world if it doesn't happen, because I've already got the best thing you could get in the sport, but it's trying to find things deeper within yourself rather than just having the accolades.\"",
        "Hannah Scott, Daniel Wiffen, Rhys McClenaghan and Jack McMillan all won Olympic gold in Paris",
        "You stand on the Olympic podium and the gold medal is placed around your neck.",
        "It's something you have dreamed of your entire life, hours upon hours of hard work and sacrifice having led to the moment.",
        "There's the initial euphoria and celebration, but what happens when the world's cameras and attention gradually shift away from that moment?",
        "From work experience, ballroom dancing, a new Everest and dressing gowns, BBC Sport speaks to four Olympic champions one year on to see what the reality of achieving their dream is really like.",
        "Injured Olympic champion McClenaghan to miss Worlds",
        "Olympic champion Wiffen withdraws from the Worlds",
        "GB win freestyle relay for first 2025 Worlds gold",
        "Hannah Scott tasted gold in Paris when she won the women's quadruple sculls for Team GB with Lauren Henry, Georgina Brayshaw and Lola Anderson in a dramatic final.",
        "Scott, who is also a world and European champion, said achieving her Olympic dream was \"a bit of a whirlwind\" but \"the highlight of my life\".",
        "\"Since I've been 12 I've always had something in my head about winning an Olympic gold. I wouldn't even talk about it because I was so - not embarrassed - it's more you never know if you are going to get one or not.",
        "\"It's not something I was certain about, it was just a dream.",
        "\"I've been figuring my stride out a bit since then. It's been so crazy, in the best way.\"",
        "Hannah Scott (second from left) is now an Olympic, world and European champion",
        "Despite only being 25 at the time, Scott was faced with a big decision about her future that was not as straightforward as one might think.",
        "It wasn't as simple as taking a break, then jumping in the boat and going again.",
        "\"I spent so long trying to go for that goal of winning an Olympic gold medal that when you no longer have that purpose, a lot of athletes talk about the struggle after.",
        "\"You are kind of like, 'what do I do now?' and you do have to ask yourself the question if you want to go again.\"",
        "The Northern Ireland rower said it \"wasn't an easy decision\" and she even tried some work experience to get a taste of the office life.",
        "\"For your own sanity, you do have to move on from that and find the next thing. I'm happy and content with that and I'm happy being back rowing.",
        "\"But I had to give myself a while. I didn't get back into a boat until around Christmas time and that's when I found my stride again.",
        "\"At the time, I wasn't sure what I was going to do but I realised I didn't like the office and I missed rowing.",
        "\"I didn't think I would miss the early mornings but it turns out I do love routine.\"",
        "After deciding to return, Scott had a virus that ruled her out of the start of the year but she is set to return to competitive action for the World Championships in September, where she should be reunited with her Olympic team-mates in the women's quad.",
        "For Scott, it is just one of the many \"ups and downs\" of being an athlete.",
        "\"I don't think I'm finished yet. I want to see what else I can do,\" she said.",
        "\"It might be great, it might not. But I'm willing to take the risk to try because it's an addictive feeling doing high performance sport.\"",
        "Scott added the response from Northern Ireland was \"beyond\" what she thought it would be and she is now motivated to \"do them proud\" after their support.",
        "However, Scott jokes about one drawback that has come from the fame of her success.",
        "\"In ways, it was beyond what I imagined, and in other ways it is still another rowing race. Those things never will change.",
        "\"I didn't realise how many people cared about rowing. I couldn't go to the shop any more in my dressing gown, which I may have done previously.",
        "\"Now, it's like 'that's the girl who went to the Olympics and won the medal'. I didn't expect that.",
        "\"Rowing my was dream and winning an Olympic medal was my dream, and I didn't realise how many people shared that celebration with me. I feel so lucky to have experienced that.\"",
        "Rhys McClenaghan completed gymnastics' Grand Slam when he won Olympic gold in the pommel horse final after a stunning routine.",
        "He is now, Olympic, world, European and Commonwealth champion.",
        "McClenaghan has yet to compete since winning his Olympic gold exactly a year ago on 3 August 2024 and has been sidelined after recent shoulder surgery.",
        "\"It's quite ironic how one year ago I was winning Olympic gold and recently I was waking up in a hospital bed,\" the 24-year-old said.",
        "\"It's been a crazy year. It's been a year of figuring things out, mentally. The reality is I've accomplished a lifelong goal and childhood dream that has fuelled me all these years.",
        "\"In that one little moment it was done. There's a still a lot of rejigging in my brain still.\"",
        "McClenaghan said winning Olympic gold \"met every ounce of expectation\" and \"all the blood, sweat and tears were worth it for that little moment and that sensation\".",
        "\"You think about so many scenarios growing up, and the standout feeling for me was this - if there was no one in the stands spectating or nobody at home watching, and it was me in an empty room getting that medal around my neck it would have still meant just as much,\" he continued.",
        "\"For me, that shows I had done the whole journey for the right reason.",
        "\"But then I opened my eyes and looked around and saw the young gymnasts in the stands and thought about those back home, and I realised it was much bigger than just me.",
        "\"That was an interesting realisation for me. Having those two feelings hand-in-hand was a moment I'll never forget.\"",
        "Rhys McClenaghan completed gymnastics' Grand Slam when he won Olympic gold in Paris",
        "Despite winning everything there is to offer in the sport, McClenaghan says he is motivated by \"wanting to be the best\".",
        "\"I want to win a gold medal at every competition I enter,\" he said.",
        "\"But the main motivation for heading into training every day is that I get to do gymnastics. That's a realisation I've had over the past 12 months or so.",
        "\"Even though my goal was Olympic gold, the main thing that brought me to the gym every day was enjoying my sport.\"",
        "In a twist from gymnastics, McClenaghan competed on and won Dancing with the Stars - the Irish version of Strictly Come Dancing.",
        "It was a different experience from the pommel horse, but one he says was \"pretty cool\".",
        "\"It was the perfect blend of doing something different and challenging myself, but also having those similarities with sport, but I'm not a retired dancer,\" he said.",
        "Since winning gold, he has travelled around Ireland and visited various gymnastics clubs to speak to the stars of the future.",
        "\"I knew how big winning an Olympic gold medal was to me growing up,\" McClenaghan said.",
        "\"I'm now in a privileged position to inspire and I don't that responsibility lightly.\"",
        "Daniel Wiffen made history in Paris when he became the first athlete from Northern Ireland to win a gold medal in 36 years when he won 800m freestyle gold in the pool.",
        "It kickstarted a historic run of four gold medals at the Games as Jack McMillan, Scott and McClenaghan all triumphed too.",
        "Athletes from Northern Ireland can represent either Team GB or Team Ireland, and the Paris Games brought two gold medals for each.",
        "Wiffen, who also claimed 800m and 1500m gold at the World Championships before the Games, said being Olympic champion \"was actually better than I thought it was going to be\".",
        "\"I didn't really think anyone would care that much when I won Olympic gold. Looking at Tokyo, I know it was the Covid Olympics, but I feel it wasn't covered as much.",
        "\"But Paris was insane. I remember walking down the Champs-Elysees after the race and I couldn't take a step without people stopping me.",
        "\"Even people recognising the Olympics 12 months on, it's great to see the sport moving forward and it will stay prominent every year going towards LA, and people will be looking out for athletes at the World Championships or other competitions.\"",
        "Wiffen said people who had taken up swimming because of him, even on a casual basis, had \"changed his mindset\" and people getting behind the sport is \"amazing\".",
        "Daniel Wiffen won 800m freestyle gold and 1500m bronze for Team Ireland in Paris",
        "The 24-year-old took time out of the pool after the Games to travel around Asia, but attentions soon turned to defending his two world titles.",
        "\"I'm quite a confident person, so as soon as I came back from Paris I had already written down my goals for the next season,\" he said before the Championships in Singapore.",
        "\"It was what I needed to do to win gold at the next World Championships, and what I needed to change.\"",
        "However, his path to Singapore wasn't smooth and he was diagnosed with appendicitis just five weeks out from the Worlds, and the condition forced him to withdraw after the 800m final.",
        "After helping Team GB win 4x200m gold in Paris, Jack McMillan took two months off to travel around Asia and got back in the pool around January after a \"reset\".",
        "The 25-year-old said Olympic glory \"definitely lives up to the expectation\" but \"it's still something I'm trying to figure out\".",
        "\"When you get to that Everest, when you've achieved something you've been training for for so long, it's a weird feeling,\" he added.",
        "\"Part of you is really satisfied but there's always something that you could still do more or you start to think about other things afterwards.",
        "\"I think that's the competitive side and why we get to these certain levels. We are always striving for other goals and bettering ourselves.",
        "\"Once I retire from swimming and look back on it, I can say I've won Olympic gold and achieved the fullest moment I could in the sport.\"",
        "Jack McMillan says he has had to look for new goals after winning Olympic gold in Paris",
        "Despite being Olympic champion, McMillan said the \"most pressurised situation\" is at the national trials, where you only get \"one chance\" to swim at international events later that year.",
        "\"It's not like you get a smoother ride because of what you done last year. You start back to where you were and you almost have to prove yourself again.",
        "\"That gives you more confidence because there's almost a fear of not knowing what you'll perform like because you've had time off.\"",
        "McMillan won World Championships gold for Great Britain in Singapore on Friday and, speaking before the competition, had said he had been \"thinking of other ways to get better\" after his Olympic gold.",
        "\"You've reached the best thing you can get in the sport, there's nothing better really.",
        "\"It makes you reassess and think about what other areas I can get better, rather than thinking 'that's it done'.",
        "\"I want to go for certain times for myself, and then medals at Worlds and Commonwealths will add to it.",
        "\"It's not necessarily the end of the world if it doesn't happen, because I've already got the best thing you could get in the sport, but it's trying to find things deeper within yourself rather than just having the accolades.\""
      ]
    },
    {
      "url": "https://www.bbc.com/sport/olympics/articles/cy7n7l4m542o",
      "main_category": "sport",
      "detailed_category": "gymnastics",
      "topic": "Injured Olympic champion McClenaghan to miss Worlds",
      "content": [
        "Olympic pommel horse champion Rhys McClenaghan has confirmed he will miss the World Artistic Gymnastics Championships after undergoing shoulder surgery. Two-time world champion McClenaghan, who has not competed since winning Olympic gold for Ireland in Paris last summer, said he had been \"struggling with this injury for a while now\". This year's Worlds take place in Jakarta from 19-25 October.The Commonwealth Games in Glasgow and the World Championships are two events for McClenaghan to target in 2026. \"I'm disappointed to miss this year's World Championships, but my priority is to maintain my place as the best in the world on pommel horse,\" said the 26-year-old.\"My goal is not only to retain my Olympic title in LA 2028 but to continue striving for gold in every major competition. This surgery was necessary to ensure I can perform at the highest level for years to come. \"Setbacks are part of elite sport, but my mindset is about turning challenges - as I have done before - into opportunities to raise my performance.\"McClenaghan was one of four athletes from Northern Ireland to win a gold medal in Paris in a historic games after rower Hannah Scott and swimmers Daniel Wiffen and Jack McMillan all had success at the Games.By winning gold in France, McClenaghan completed gymnastics' Grand Slam by becoming Olympic, World, European and Commonwealth champion.After his Olympic triumph, he competed on and won Dancing With the Stars, which is the Irish version of Strictly Come Dancing. He had been due to compete in the European Championships in May but withdrew through injury. McClenaghan previously had shoulder surgery in 2018.",
        "Rhys McClenaghan won an Olympic gold medal at the 2024 Paris Olympics",
        "Olympic pommel horse champion Rhys McClenaghan has confirmed he will miss the World Artistic Gymnastics Championships after undergoing shoulder surgery.",
        "Two-time world champion McClenaghan, who has not competed since winning Olympic gold for Ireland in Paris last summer, said he had been \"struggling with this injury for a while now\".",
        "This year's Worlds take place in Jakarta from 19-25 October.",
        "The Commonwealth Games in Glasgow and the World Championships are two events for McClenaghan to target in 2026.",
        "\"I'm disappointed to miss this year's World Championships, but my priority is to maintain my place as the best in the world on pommel horse,\" said the 26-year-old.",
        "\"My goal is not only to retain my Olympic title in LA 2028 but to continue striving for gold in every major competition. This surgery was necessary to ensure I can perform at the highest level for years to come.",
        "\"Setbacks are part of elite sport, but my mindset is about turning challenges - as I have done before - into opportunities to raise my performance.\"",
        "McClenaghan was one of four athletes from Northern Ireland to win a gold medal in Paris in a historic games after rower Hannah Scott and swimmers Daniel Wiffen and Jack McMillan all had success at the Games.",
        "By winning gold in France, McClenaghan completed gymnastics' Grand Slam by becoming Olympic, World, European and Commonwealth champion.",
        "After his Olympic triumph, he competed on and won Dancing With the Stars, which is the Irish version of Strictly Come Dancing.",
        "He had been due to compete in the European Championships in May but withdrew through injury. McClenaghan previously had shoulder surgery in 2018."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/olympics/articles/c5yk23x0nj3o",
      "main_category": "sport",
      "detailed_category": "gymnastics",
      "topic": "Why summer can be 'era-defining' for women's sport",
      "content": [
        "A summer of major sporting events can be \"era-defining\" and help drive change that would see more women and girls enjoying sport, senior figures say.England hosts the Rugby World Cup in August, with the Red Roses aiming to have a similar impact as their footballing counterparts in 2022.The Lionesses won the European Championship on home soil and boosted participation in girls football.\"The World Cup is going to raise bar for women's rugby,\" said Sally Horrox, director of women's rugby at World Rugby, on a special Radio 5 Live programme Names Will Be Made, hosted by Loughborough University, to mark the BBC's Women's Summer of Sport.\"I think it will be a really era-defining moment. \"It will shift from being a niche sport to mainstream, that will make a tremendous difference for girls the world over.\"Sarina Wiegman's footballers, meanwhile, are preparing to defend their European crown in Switzerland.\"It's incredible to think where the sport is now [after the success of 2022], and of course the Euros this summer gives us another chance to continue the growth of women's football in this country,\" said Kelly Simmons, former director of women's football at the Football Association.\"When I first started at the FA, our first count was 80 girls and women's teams across the whole country, now over three million girls and women play the sport.\"Star athletes such as Olympic 800m champion Keely Hodgkinson will also be in action at the World Athletics Championships in September.British Olympic Association chair Baroness Katherine Grainger told the programme that the summer of sport is a \"unique opportunity to really make change\" and to work on ways to remove some of the barriers facing women in sport.\"In a year's time, if we were to meet, I would want us all to sit and go 'this is now different', said Grainger. \"All these moments are a unique opportunities to really make change. Whether it's in law, or people's lives, or in attitudes, the doing something next is important. Not just hearing and agreeing but taking action.\"",
        "Olympic swimmer Cassie Patten is 38 now, a mother of three, yet can still recall the anger she felt at a male coach's reaction to her being unable to train while on her period.The 2008 bronze medallist spoke of how one male coach \"looked me in the eye and said 'I'm so disappointed in you'\" when she was unable to train through period cramps. \"I said 'you have no idea'.\"And it was a theme shared by many of her fellow guests, made up of famous names - and those just starting out on their elite sport journeys.Boxer Tiah-Mai Ayton, 18, who recently won her first professional fight, said: \"I can put on three kilos on my period and if I don't make my weight I can't fight.\"Having predominantly male coaches, with less understanding of a woman's body, was cited as one barrier not just to participation, but elite performance.However many felt, while more female coaches were needed, there had been improvements.British track cycling Olympic champion Sophie Capewell explained how an improvement in understanding had helped the women's squad to develop. \"We aren't as consistent, periods have an impact, being able to talk has been huge,\" she said. \"To have an open conversation, a few years ago it wouldn't have been the case.\" Dr Pippa Bennett, the UK Sports Institute's director of clinical governance and chief medical officer at the British Paralympic Association, said research on women's sport was \"woefully lacking\".Physiology expert Dr Emma O'Donnell called for better quality research into menstrual cycles and their effect on performance.\"Despite 40 years of research, we are not any closer to the answer,\" she said.And other body issues faced by female athletes were discussed. Professor Joanna Wakefield-Scurr, professor of biomechanics and head of a research group in breast health at the University of Portsmouth, explained how the right sports bra and support could impact on performance. She said it can shorten a stride by 4cms - over marathon distance that equates to a mile.She said there was a \"disappointing lack of research in this area\" and referred to one study in which 46% of women questioned said they left sport because of issues related to their breasts.However she did say big brands were now investing in research in this area.Sports kit designed for men remains an issue too - though there have been similar improvements as sport grows more inclusive, guests said.Body image was also seen as a barrier to taking part in sport, with athletic figures going against societal beauty standards - something guests agreed could change with more prominent role models.\"We have moved on, we are in a better place but there is still a lot of work to do,\" said Jenny Henderson, performance manager at England Golf.",
        "Another issue facing female athletes in particular is online abuse, with women 30% more likely to be subject to it, according to research cited by World Rugby's Horrox.Last week, some of England's Lionesses said they would be avoiding social media during this summer's tournament, while tennis player Katie Boulter has shared some of the horrific abuse she has suffered with BBC Sport to highlight the problem. \"Since my fight I've got quite a lot of haters, I just think about all the bad comments,\" Miah-Ayton said.Horrox said World Rugby was among the sports monitoring abuse against female players, which it would be doing at the World Cup - and seeking to prosecute those behind it.\"You have to be free to compete without that threat,\" she said.",
        "A summer of major sporting events can be \"era-defining\" and help drive change that would see more women and girls enjoying sport, senior figures say.",
        "England hosts the Rugby World Cup in August, with the Red Roses aiming to have a similar impact as their footballing counterparts in 2022.",
        "The Lionesses won the European Championship on home soil and boosted participation in girls football.",
        "\"The World Cup is going to raise bar for women's rugby,\" said Sally Horrox, director of women's rugby at World Rugby, on a special Radio 5 Live programme Names Will Be Made, hosted by Loughborough University, to mark the BBC's Women's Summer of Sport.",
        "\"I think it will be a really era-defining moment.",
        "\"It will shift from being a niche sport to mainstream, that will make a tremendous difference for girls the world over.\"",
        "Sarina Wiegman's footballers, meanwhile, are preparing to defend their European crown in Switzerland.",
        "\"It's incredible to think where the sport is now [after the success of 2022], and of course the Euros this summer gives us another chance to continue the growth of women's football in this country,\" said Kelly Simmons, former director of women's football at the Football Association.",
        "\"When I first started at the FA, our first count was 80 girls and women's teams across the whole country, now over three million girls and women play the sport.\"",
        "Star athletes such as Olympic 800m champion Keely Hodgkinson will also be in action at the World Athletics Championships in September.",
        "British Olympic Association chair Baroness Katherine Grainger told the programme that the summer of sport is a \"unique opportunity to really make change\" and to work on ways to remove some of the barriers facing women in sport.",
        "\"In a year's time, if we were to meet, I would want us all to sit and go 'this is now different', said Grainger.",
        "\"All these moments are a unique opportunities to really make change. Whether it's in law, or people's lives, or in attitudes, the doing something next is important. Not just hearing and agreeing but taking action.\"",
        "This video can not be played",
        "Cassie Patten won Olympic bronze in the 10km open water swim at the 2008 Games in Beijing",
        "Olympic swimmer Cassie Patten is 38 now, a mother of three, yet can still recall the anger she felt at a male coach's reaction to her being unable to train while on her period.",
        "The 2008 bronze medallist spoke of how one male coach \"looked me in the eye and said 'I'm so disappointed in you'\" when she was unable to train through period cramps. \"I said 'you have no idea'.\"",
        "And it was a theme shared by many of her fellow guests, made up of famous names - and those just starting out on their elite sport journeys.",
        "Boxer Tiah-Mai Ayton, 18, who recently won her first professional fight, said: \"I can put on three kilos on my period and if I don't make my weight I can't fight.\"",
        "Having predominantly male coaches, with less understanding of a woman's body, was cited as one barrier not just to participation, but elite performance.",
        "However many felt, while more female coaches were needed, there had been improvements.",
        "British track cycling Olympic champion Sophie Capewell explained how an improvement in understanding had helped the women's squad to develop.",
        "\"We aren't as consistent, periods have an impact, being able to talk has been huge,\" she said. \"To have an open conversation, a few years ago it wouldn't have been the case.\"",
        "Dr Pippa Bennett, the UK Sports Institute's director of clinical governance and chief medical officer at the British Paralympic Association, said research on women's sport was \"woefully lacking\".",
        "Physiology expert Dr Emma O'Donnell called for better quality research into menstrual cycles and their effect on performance.",
        "\"Despite 40 years of research, we are not any closer to the answer,\" she said.",
        "And other body issues faced by female athletes were discussed.",
        "Professor Joanna Wakefield-Scurr, professor of biomechanics and head of a research group in breast health at the University of Portsmouth, explained how the right sports bra and support could impact on performance. She said it can shorten a stride by 4cms - over marathon distance that equates to a mile.",
        "She said there was a \"disappointing lack of research in this area\" and referred to one study in which 46% of women questioned said they left sport because of issues related to their breasts.",
        "However she did say big brands were now investing in research in this area.",
        "Sports kit designed for men remains an issue too - though there have been similar improvements as sport grows more inclusive, guests said.",
        "Body image was also seen as a barrier to taking part in sport, with athletic figures going against societal beauty standards - something guests agreed could change with more prominent role models.",
        "\"We have moved on, we are in a better place but there is still a lot of work to do,\" said Jenny Henderson, performance manager at England Golf.",
        "Study suggests injury risk varies in menstrual cycle",
        "Football boot issues reported by 82% of female players",
        "Another issue facing female athletes in particular is online abuse, with women 30% more likely to be subject to it, according to research cited by World Rugby's Horrox.",
        "Last week, some of England's Lionesses said they would be avoiding social media during this summer's tournament, while tennis player Katie Boulter has shared some of the horrific abuse she has suffered with BBC Sport to highlight the problem.",
        "\"Since my fight I've got quite a lot of haters, I just think about all the bad comments,\" Miah-Ayton said.",
        "Horrox said World Rugby was among the sports monitoring abuse against female players, which it would be doing at the World Cup - and seeking to prosecute those behind it.",
        "\"You have to be free to compete without that threat,\" she said."
      ]
    }
  ]
}