{
  "scraped_at": "2025-10-27T18:56:59.817546",
  "total_articles": 10,
  "category": "taekwondo",
  "articles_per_category": 100,
  "articles": [
    {
      "url": "https://www.bbc.com/sport/taekwondo/articles/c05160qv7mro",
      "main_category": "sport",
      "detailed_category": "taekwondo",
      "topic": "Williams earns World Taekwondo bronze in China",
      "content": [
        "Wales' Lauren Williams has won bronze for Great Britain at the World Taekwondo Championships in Wuxi, China.Williams won her first three bouts 2-0 before being defeated in two straight rounds by Turkey's Nafia Kuş, who went on to win gold in the final.Williams, 26,  won consecutive gold medals in the Junior World Championships in 2014 and 2016, but this was the first time she had won a medal at a senior World Championships. She swapped from welterweight to heavyweight after the Paris 2024 cycle, a change she said made her happier.It is the second medal won by Great Britain at the championships, with Caden Cunningham securing bronze in the men's heavyweight event on Friday.",
        "Lauren Williams took silver in the women's -67kg taekwondo competition at Tokyo 2020, losing the final bout to Croatia's Matea Jelic",
        "Wales' Lauren Williams has won bronze for Great Britain at the World Taekwondo Championships in Wuxi, China.",
        "Williams won her first three bouts 2-0 before being defeated in two straight rounds by Turkey's Nafia Kuş, who went on to win gold in the final.",
        "Williams, 26,  won consecutive gold medals in the Junior World Championships in 2014 and 2016, but this was the first time she had won a medal at a senior World Championships.",
        "She swapped from welterweight to heavyweight after the Paris 2024 cycle, a change she said made her happier.",
        "It is the second medal won by Great Britain at the championships, with Caden Cunningham securing bronze in the men's heavyweight event on Friday."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/taekwondo/articles/cdrzyelz2lvo",
      "main_category": "sport",
      "detailed_category": "taekwondo",
      "topic": "'Happier' Williams targets Worlds glory at new weight",
      "content": [
        "Former Olympic silver medalist Lauren Williams says she is \"a much happier athlete\" as she prepares for her first Taekwondo World Championships since swapping to heavyweight.Williams, 26, won silver at the delayed Olympics in Tokyo in 2021 in the under 67kg category but missed out on selection for Paris 2024 after injury disruption. Williams ruptured her hamstring at the 2023 Rome Grand Prix and did not participate in the 2023 European Games in Kraków after undergoing surgery in June 2023.\"I was on track to qualify for Paris 2024 but the 2023 period was crucial for qualification,\" said Williams.",
        "\"With our weight category being so competitive, every competition mattered.\"We did everything we could to try to get me there but it didn't happen.\"Williams' injury coincided with a challenging time for the Welsh fighter, who admits she was struggling to make weight for the welterweight division.\"I was in a weight category that really didn't suit me,\" Williams told BBC Sport Wales.\"I struggled more to make the weight than to fight which was annoying me but my body eventually gave up. \"It was injury after injury and illness after illness so that was my time to sit back, reflect on the journey I'd had.\"Two years on from her last World Championships in Baku, Azerbaijan, Williams says she is unrecognisable.\"I'm a completely different person now. I'm a better person to be around and a happier athlete so I can go out and focus on performing rather than making the weight.\"",
        "Williams says the heavier weight has required some adaptation to her training.\"It's harder training now because I spent so long being lighter and more dynamic,\" said Williams.\"Trying to do the same thing at this weight is a lot more challenging.\"I am adapting, I am learning, I just had to change my game a little bit but taekwondo has moved a long way since Tokyo as well.\"It's a lot more tactical and decision making which I'm learning to do more and I'm more disciplined.\"Williams returned to the podium in August, with her first Grand Prix medal at heavyweight in South Korea.\"That was the first major I'd medalled at and my first experience of a repechage,\" said Williams.\"Going out there [after a defeat] to fight again for a medal was difficult but I ended on a win, and I feel like I've won. \"That medal means so much to me because of what I went through to get it.\"In 2014 and 2016, Williams won two consecutive gold medals in the Junior World Championships, she is yet to medal at a senior worlds, something she is hoping to rectify in Wuxi, China.\"We're into a new Olympic cycle and I'm fighting new people all the time,\" said Williams.\"I'm excited about this journey, not just these championships.\"I'm genuinely excited for this opportunity to get a medal, even if I make it past the quarter finals I'll be so happy. \"I know I can take a gold if everything aligns on the day.\"",
        "British team for the 2025 World Taekwondo Championships:F-46 Etta ChoiF-49 Phoenix GoodmanF-53 Jodie MckewF-57 Teigan SmithF-67 Aaliyah PowellF-73 Ruby MackayF+73 Lauren WilliamsM-58 Zack SarsozaM-63 Jamie McIntoshM-68 Matthew HowellM-80 Farzad Mansouri (TRT)M+87 Caden Cunningham",
        "Lauren Williams took silver in the women's -67kg taekwondo competition at Tokyo 2020 after losing the final bout to Croatia's Matea Jelic.",
        "Former Olympic silver medalist Lauren Williams says she is \"a much happier athlete\" as she prepares for her first Taekwondo World Championships since swapping to heavyweight.",
        "Williams, 26, won silver at the delayed Olympics in Tokyo in 2021 in the under 67kg category but missed out on selection for Paris 2024 after injury disruption.",
        "Williams ruptured her hamstring at the 2023 Rome Grand Prix and did not participate in the 2023 European Games in Kraków after undergoing surgery in June 2023.",
        "\"I was on track to qualify for Paris 2024 but the 2023 period was crucial for qualification,\" said Williams.",
        "\"With our weight category being so competitive, every competition mattered.",
        "\"We did everything we could to try to get me there but it didn't happen.\"",
        "Williams' injury coincided with a challenging time for the Welsh fighter, who admits she was struggling to make weight for the welterweight division.",
        "\"I was in a weight category that really didn't suit me,\" Williams told BBC Sport Wales.",
        "\"I struggled more to make the weight than to fight which was annoying me but my body eventually gave up.",
        "\"It was injury after injury and illness after illness so that was my time to sit back, reflect on the journey I'd had.\"",
        "Two years on from her last World Championships in Baku, Azerbaijan, Williams says she is unrecognisable.",
        "\"I'm a completely different person now. I'm a better person to be around and a happier athlete so I can go out and focus on performing rather than making the weight.\"",
        "GB's Williams takes taekwondo silver",
        "'It's a new challenge' - Jones on boxing switch",
        "Williams says the heavier weight has required some adaptation to her training.",
        "\"It's harder training now because I spent so long being lighter and more dynamic,\" said Williams.",
        "\"Trying to do the same thing at this weight is a lot more challenging.",
        "\"I am adapting, I am learning, I just had to change my game a little bit but taekwondo has moved a long way since Tokyo as well.",
        "\"It's a lot more tactical and decision making which I'm learning to do more and I'm more disciplined.\"",
        "Williams returned to the podium in August, with her first Grand Prix medal at heavyweight in South Korea.",
        "\"That was the first major I'd medalled at and my first experience of a repechage,\" said Williams.",
        "\"Going out there [after a defeat] to fight again for a medal was difficult but I ended on a win, and I feel like I've won.",
        "\"That medal means so much to me because of what I went through to get it.\"",
        "In 2014 and 2016, Williams won two consecutive gold medals in the Junior World Championships, she is yet to medal at a senior worlds, something she is hoping to rectify in Wuxi, China.",
        "\"We're into a new Olympic cycle and I'm fighting new people all the time,\" said Williams.",
        "\"I'm excited about this journey, not just these championships.",
        "\"I'm genuinely excited for this opportunity to get a medal, even if I make it past the quarter finals I'll be so happy.",
        "\"I know I can take a gold if everything aligns on the day.\"",
        "British team for the 2025 World Taekwondo Championships:",
        "M-80 Farzad Mansouri (TRT)",
        "M+87 Caden Cunningham"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/olympics/articles/c07zpmmz931o",
      "main_category": "sport",
      "detailed_category": "taekwondo",
      "topic": "Bolt to Rees-Zammit - a dozen career switching stars",
      "content": [
        "Two-time Olympic champion Jade Jones has confirmed she is switching sports from taekwondo to boxing.The 31-year-old won taekwondo gold at London 2012 and Rio 2016 and was World Champion in 2019 as well as being a three-time European champion.Jones has been boxing for two months and is training with former professional boxer Stephen Smith.She is \"dreaming big\" as she aims to become a two sport world champion.Jones is not the first, and unlikely to be the last, to switch sports in the pursuit of further success.BBC Sport looks at those who have made sporting switches – with varying levels of success.",
        "Eight-time Olympic champion Usain Bolt is regarded as the greatest sprinter of all time and still holds the world record for the 100m and 200m.The Jamaican ended his glittering track and field career in 2017 and turned his attention to forging a new sporting career – as a footballer.Bolt trained with Borussia Dortmund, South African club Mamelodi Sundowns and Norway's Stromsgodset before joining Australian club Central Coast Mariners for an \"indefinite training period\" in August 2018 but left after eight weeks.A professional career never materialised and Bolt has had to settle for appearances at charity fixture Soccer Aid.",
        "Rees-Zammit shocked rugby union in January 2024, when he announced before the Six Nations he was quitting the sport in a bid to make a breakthrough in American football.The ex-Wales and Gloucester wing entered the National Football League (NFL) international player pathway, a 10-week crash course designed to teach and assess aspiring players.Initially Rees-Zammit signed to the Kansas City Chiefs for pre-season training before moving to Jacksonville Jaguars last August.Last month he re-signed as a wide receiver with Jacksonville and continues to strive for his ambition of appearing in the NFL.",
        "Considered by many as the best player in the history of basketball, Jordan spent most of his career with the Chicago Bulls and became a global icon, helping raise the National Basketball Association's (NBA) profile around the world.Jordan is a six-time NBA champion with his sixth and final NBA title chronicled in Netflix documentary The Last Dance.During the peak of his career, Jordan abruptly retired from basketball in 1993 and switched briefly to baseball, a sport in which he excelled at as a youngster.He had a successful trial with the Chicago White Sox and played for one of their affiliate teams, the Birmingham Barons in Minor League Baseball before returning to basketball and the Bulls in 1995.",
        "Wales' first female world champion boxer Price also won Olympic gold at Tokyo 2020 as well as World Championship and Commonwealth gold.Price, the WBA champion, is preparing for the biggest fight of her professional career on Friday night when she faces WBC & IBF welterweight champion Natasha Jonas.But the 30-year-old could easily have been preparing for this summer's European Football Championships with Wales.Price played for Cardiff City Ladies and won the first of two senior Wales caps in 2012 – playing alongside the likes of Jess Fishlock – before opting to concentrate on boxing two years later.As if that was not enough, Price won a kickboxing silver medal at a World Championships event in 2007 at the age of 13.",
        "When Gerwyn Price won the PDC World Darts Championship in 2021, he became the first player from qualifying school to be crowned world champion and world number one.Price had only earned his tour card in 2014 having started playing in a pub league at Markham Rugby Club.He had combined his hobby with a rugby union career that saw him play hooker for Cross Keys and Neath in the Welsh Premiership as well as a spell with Glasgow Warriors.The Iceman, who has won a total of seven PDC major titles, still retains a big interest in rugby and signed for local side Bedwellty RFC in January 2023.",
        "Great Britain's most decorated Paralympian, Storey won a record-extending 19th Paralympic gold medal at Paris 2024.Then Sarah Bailey, she was just 14 upon beginning her Paralympic career as a swimmer at Barcelona 1992 and won two golds, three silvers and a bronze.Further success came in the pool at the next three Paralympic Games before Storey switched to cycling for the 2008 Beijing Games.She has claimed 13 Paralympic gold medals in cycling – five Games in a row - to add to the five she won in the pool.",
        "Double Olympic cycling champion Victoria Pendleton retired from cycling after the 2012 Olympics and made a surprising sporting switch three years later.Pendleton, who won Olympic gold in the sprint at the 2008 Olympics in Beijing and the keirin at the 2012 Games in London, started to train as a jockey in March 2015.She came eighth on her amateur jockey debut in a flat race at Newbury in July that year and made her competitive debut the following month, finishing second.Pendleton achieved her ambition of participating in the 2016 Foxhunter Chase, at Cheltenham, finishing fifth.",
        "Current Wales flanker James Botham is from a prominent sporting family - grandfather Ian is an England cricket legend, seen by many as the finest all-rounder of his generation.Ian Botham's international career lasted from 1974 until 1993 and saw him scoring 19,399 runs and taking 1,172 wickets in 402 matches.He also made 11 appearances in the Football League for Scunthorpe United and also played for Yeovil Town.Son Liam – James' father – played a season of County Cricket for Hampshire before a switch to rugby union which included spells with Cardiff and Newcastle Falcons.He also switched codes to play rugby league for Leeds Rhinos, London Broncos and Wigan Warriors.",
        "Arguably Wales' greatest all round sportsman, Wooller won 18 caps for Wales between 1933 and 1939 and played for Cardiff RFC.Wooller was part of the Wales team which beat the All Blacks in 1935, the same year in which he made his first class cricket debut for Cambridge University.He first played for Glamorgan in 1939 and after the Second World War was captain of the county for 14 years which included a County Championship title in 1947.In addition Wooller, who died aged 84 in 1997, briefly played football for Cardiff City and Barry Town.",
        "Non Evans enjoyed a remarkable sporting career which was recognised with an MBE in 2011 and a place in the Welsh Sports Hall of Fame.She won 87 caps for the Wales women's rugby team, scoring 64 tries and kicked the winning penalty that beat England for the first time.Evans also won two silver Commonwealth Games judo medals and was an international in weightlifting and wrestling too.She was the first person to represent Wales in three different sports at the Commonwealth Games and also competed in the original Gladiators series.",
        "Jade Jones was named BBC Cymru Wales Sports Personality of the Year in 2012 and 2016",
        "Two-time Olympic champion Jade Jones has confirmed she is switching sports from taekwondo to boxing.",
        "The 31-year-old won taekwondo gold at London 2012 and Rio 2016 and was World Champion in 2019 as well as being a three-time European champion.",
        "Jones has been boxing for two months and is training with former professional boxer Stephen Smith.",
        "She is \"dreaming big\" as she aims to become a two sport world champion.",
        "Jones is not the first, and unlikely to be the last, to switch sports in the pursuit of further success.",
        "BBC Sport looks at those who have made sporting switches – with varying levels of success.",
        "Usain Bolt's 100m time of 9.58 seconds set in 2009 remains a world record",
        "Eight-time Olympic champion Usain Bolt is regarded as the greatest sprinter of all time and still holds the world record for the 100m and 200m.",
        "The Jamaican ended his glittering track and field career in 2017 and turned his attention to forging a new sporting career – as a footballer.",
        "Bolt trained with Borussia Dortmund, South African club Mamelodi Sundowns and Norway's Stromsgodset before joining Australian club Central Coast Mariners for an \"indefinite training period\" in August 2018 but left after eight weeks.",
        "A professional career never materialised and Bolt has had to settle for appearances at charity fixture Soccer Aid.",
        "Louis Rees-Zammit has won 32 caps for the Wales national rugby team",
        "Rees-Zammit shocked rugby union in January 2024, when he announced before the Six Nations he was quitting the sport in a bid to make a breakthrough in American football.",
        "The ex-Wales and Gloucester wing entered the National Football League (NFL) international player pathway, a 10-week crash course designed to teach and assess aspiring players.",
        "Initially Rees-Zammit signed to the Kansas City Chiefs for pre-season training before moving to Jacksonville Jaguars last August.",
        "Last month he re-signed as a wide receiver with Jacksonville and continues to strive for his ambition of appearing in the NFL.",
        "Michael Jordan twice won Olympic gold with the United States of America basketball team",
        "Considered by many as the best player in the history of basketball, Jordan spent most of his career with the Chicago Bulls and became a global icon, helping raise the National Basketball Association's (NBA) profile around the world.",
        "Jordan is a six-time NBA champion with his sixth and final NBA title chronicled in Netflix documentary The Last Dance.",
        "During the peak of his career, Jordan abruptly retired from basketball in 1993 and switched briefly to baseball, a sport in which he excelled at as a youngster.",
        "He had a successful trial with the Chicago White Sox and played for one of their affiliate teams, the Birmingham Barons in Minor League Baseball before returning to basketball and the Bulls in 1995.",
        "Lauren Price has won all eight of her professional boxing bouts",
        "Wales' first female world champion boxer Price also won Olympic gold at Tokyo 2020 as well as World Championship and Commonwealth gold.",
        "Price, the WBA champion, is preparing for the biggest fight of her professional career on Friday night when she faces WBC & IBF welterweight champion Natasha Jonas.",
        "But the 30-year-old could easily have been preparing for this summer's European Football Championships with Wales.",
        "Price played for Cardiff City Ladies and won the first of two senior Wales caps in 2012 – playing alongside the likes of Jess Fishlock – before opting to concentrate on boxing two years later.",
        "As if that was not enough, Price won a kickboxing silver medal at a World Championships event in 2007 at the age of 13.",
        "Representing Wales, Gerwyn Price has twice won the World Cup of Darts with Jonny Clayton",
        "When Gerwyn Price won the PDC World Darts Championship in 2021, he became the first player from qualifying school to be crowned world champion and world number one.",
        "Price had only earned his tour card in 2014 having started playing in a pub league at Markham Rugby Club.",
        "He had combined his hobby with a rugby union career that saw him play hooker for Cross Keys and Neath in the Welsh Premiership as well as a spell with Glasgow Warriors.",
        "The Iceman, who has won a total of seven PDC major titles, still retains a big interest in rugby and signed for local side Bedwellty RFC in January 2023.",
        "Sarah Storey was appointed an MBE in the 1998 New Year Honours list",
        "Great Britain's most decorated Paralympian, Storey won a record-extending 19th Paralympic gold medal at Paris 2024.",
        "Then Sarah Bailey, she was just 14 upon beginning her Paralympic career as a swimmer at Barcelona 1992 and won two golds, three silvers and a bronze.",
        "Further success came in the pool at the next three Paralympic Games before Storey switched to cycling for the 2008 Beijing Games.",
        "She has claimed 13 Paralympic gold medals in cycling – five Games in a row - to add to the five she won in the pool.",
        "Victoria Pendleton was appointed an MBE in the 2009 New Year Honours list",
        "Double Olympic cycling champion Victoria Pendleton retired from cycling after the 2012 Olympics and made a surprising sporting switch three years later.",
        "Pendleton, who won Olympic gold in the sprint at the 2008 Olympics in Beijing and the keirin at the 2012 Games in London, started to train as a jockey in March 2015.",
        "She came eighth on her amateur jockey debut in a flat race at Newbury in July that year and made her competitive debut the following month, finishing second.",
        "Pendleton achieved her ambition of participating in the 2016 Foxhunter Chase, at Cheltenham, finishing fifth.",
        "Ian Botham now works as a cricket pundit and commentator",
        "Current Wales flanker James Botham is from a prominent sporting family - grandfather Ian is an England cricket legend, seen by many as the finest all-rounder of his generation.",
        "Ian Botham's international career lasted from 1974 until 1993 and saw him scoring 19,399 runs and taking 1,172 wickets in 402 matches.",
        "He also made 11 appearances in the Football League for Scunthorpe United and also played for Yeovil Town.",
        "Son Liam – James' father – played a season of County Cricket for Hampshire before a switch to rugby union which included spells with Cardiff and Newcastle Falcons.",
        "He also switched codes to play rugby league for Leeds Rhinos, London Broncos and Wigan Warriors.",
        "Wilf Wooller went on to become secretary and president of Glamorgan",
        "Arguably Wales' greatest all round sportsman, Wooller won 18 caps for Wales between 1933 and 1939 and played for Cardiff RFC.",
        "Wooller was part of the Wales team which beat the All Blacks in 1935, the same year in which he made his first class cricket debut for Cambridge University.",
        "He first played for Glamorgan in 1939 and after the Second World War was captain of the county for 14 years which included a County Championship title in 1947.",
        "In addition Wooller, who died aged 84 in 1997, briefly played football for Cardiff City and Barry Town.",
        "Non Evans' total of 64 tries for Wales is a record in women's international rugby union",
        "Non Evans enjoyed a remarkable sporting career which was recognised with an MBE in 2011 and a place in the Welsh Sports Hall of Fame.",
        "She won 87 caps for the Wales women's rugby team, scoring 64 tries and kicked the winning penalty that beat England for the first time.",
        "Evans also won two silver Commonwealth Games judo medals and was an international in weightlifting and wrestling too.",
        "She was the first person to represent Wales in three different sports at the Commonwealth Games and also competed in the original Gladiators series."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/olympics/articles/cdjyxxx03g3o",
      "main_category": "sport",
      "detailed_category": "taekwondo",
      "topic": "Ex-Olympic champion Jones quits taekwondo for boxing",
      "content": [
        "Wales' double Olympic taekwondo champion Jade Jones is switching sports and has taken up boxing.The 31-year-old says she is \"dreaming big\" as she intends to become a two-sport world champion.Jones has been boxing for two months and is training with former professional boxer Stephen Smith in a move she believes is unprecedented as she eyes a career in the paid ranks.\"It is nerve-wracking. Some days I wake up and think 'am I absolutely crazy?'\" Jones told BBC Breakfast.\"I am loving it. I love taekwondo, it will always be my first love. But this is an exciting challenge.\"",
        "Jones' switch is sure to raise eyebrows, having competed for two decades in a sport where kicking your opponent is the name of the game and she admits her decision did come out of the blue.\"I don't know what gave me the idea, I was sat in my kitchen and thought 'I'll try boxing', my family all think I'm crazy, but people who know me know it is inside me, I love to have a fight and a scrap,\" she said.\"People can follow my journey, the good, the bad and the ugly. Can I get to the top? Will I fail?\"The dream is to be a world champion. To be a world champion in two sports would be pretty cool.\"",
        "Jones admits she has faced a huge culture shock as she has learned about the \"sweet science\" of boxing.\"Boxing is arguably the hardest sport in the world, but I am up for the challenge, I want to give it a go,\" she said.\"Technique is the hardest thing to learn. There are so many little factors to it. I started wading in, but it's all about timing and being patient.\"I've learned straight away it's not like being Rocky, you can't just get in there and blast away.\"I've come in thinking I'm hardcore and can have a scrap, but it's the total opposite to be honest, it's kind of like taekwondo in that it's a game of chess, but with your hands.\"",
        "One of Wales' most successful Olympians, Jones admits there is a degree of sadness at giving up taekwondo, having represented Team GB at four Olympics and having won two gold medals, as well as winning a World Championship.Jones became the youngest Team GB Olympic gold medallist when she sensationally won gold at her first attempt, as a 19-year-old at the 2012 London Games and held on to her crown four years later in Rio de Janeiro.Disappointment followed at the 2020 Tokyo Games which she later described as the \"biggest low\" of her career.At Paris 2024, Jones' bid for Olympic history ended in early defeat in the taekwondo -57kg first round.She was bidding to become the first three-time Olympic champion in the sport's history and defeat left Jones \"devastated\".Jones lost to Macedonia's Miljana Reljikj on the number of registered hits, used as a tie-breaker after three even rounds.Jones - whose Paris build-up had been overshadowed by the controversy of a missed drugs test, but was later cleared by the UK Anti-Doping Agency - has now chosen to step away from the sport she loves.\"My family have been a little bit sad about me giving up taekwondo,\" she added.\"I've never used my hands. After 20 years of using my feet I am switching it up.\"Boxing is good for me. It started as a distraction but now I am going to go for it, because I am just loving it.\"",
        "Jones' trainer Smith, who twice boxed for a world title, admits he was initially sceptical about Jones' boxing ambitions. \"My first instinct was why? Why would someone who kicks with both feet get into a sport where you use your hands,\" he said. \"I wasn't doubting her, but I was confused. I don't think it's ever happened before, I don't know anyone who has come over from taekwondo.\"It's a massive challenge but it is made easier by her attitude... she's improving all the time.\"",
        "Jade Jones and Stephen 'Swifty' Smith is a terrific boxing partnership.Jones is an aggressive, competitive fighter in taekwondo and she will need an old-school boxing coach to help with her transition.Smith, a former British champion and one of the four fighting Smith brothers from the Rotunda club In Liverpool, is a calm head in the gym and corner; Jones will need that as she forgets her kicks and perfects her hooks.The initial transition will not be difficult, but turning Jones into a genuine contender will take time. Jones has good feet, fast hands and, as a world-class fighter, she has great awareness.The fairy tale will mostly be conducted behind closed doors at the gym in long days of sparring and boring repetition; Jones will need to slow down, pick her punches and react to getting hit and hit and hit.Swifty will insist that she \"shapes up\" well before letting her apply for a British licence to fight; the British Boxing Board will not just grant her a licence based on her glory in another sport. She will need to display the basics, learn boxing balance and simple punches - that might be frustrating for her; all crossover athletes want to run before they can walk.There are only 13 active featherweights in Britain and Jones will be an excellent addition. She will also do some damage if she learns the basics - too many female fighters never bother to get an education and that is why the gulf at the top is so wide. Jones can bridge that gap.",
        "Jade Jones was appointed an MBE in 2013 and an OBE in 2020",
        "Wales' double Olympic taekwondo champion Jade Jones is switching sports and has taken up boxing.",
        "The 31-year-old says she is \"dreaming big\" as she intends to become a two-sport world champion.",
        "Jones has been boxing for two months and is training with former professional boxer Stephen Smith in a move she believes is unprecedented as she eyes a career in the paid ranks.",
        "\"It is nerve-wracking. Some days I wake up and think 'am I absolutely crazy?'\" Jones told BBC Breakfast.",
        "\"I am loving it. I love taekwondo, it will always be my first love. But this is an exciting challenge.\"",
        "Jones was born in Bodelwyddan in Denbighshire",
        "Jones' switch is sure to raise eyebrows, having competed for two decades in a sport where kicking your opponent is the name of the game and she admits her decision did come out of the blue.",
        "\"I don't know what gave me the idea, I was sat in my kitchen and thought 'I'll try boxing', my family all think I'm crazy, but people who know me know it is inside me, I love to have a fight and a scrap,\" she said.",
        "\"People can follow my journey, the good, the bad and the ugly. Can I get to the top? Will I fail?",
        "\"The dream is to be a world champion. To be a world champion in two sports would be pretty cool.\"",
        "Bolt to Rees-Zammit - a dozen career switching stars",
        "Jones admits she has faced a huge culture shock as she has learned about the \"sweet science\" of boxing.",
        "\"Boxing is arguably the hardest sport in the world, but I am up for the challenge, I want to give it a go,\" she said.",
        "\"Technique is the hardest thing to learn. There are so many little factors to it. I started wading in, but it's all about timing and being patient.",
        "\"I've learned straight away it's not like being Rocky, you can't just get in there and blast away.",
        "\"I've come in thinking I'm hardcore and can have a scrap, but it's the total opposite to be honest, it's kind of like taekwondo in that it's a game of chess, but with your hands.\"",
        "As well as two Olympic gold medals, Jade Jones won a World Championship, three-European Championships and won 10 Grand Prix titles in taekwondo",
        "One of Wales' most successful Olympians, Jones admits there is a degree of sadness at giving up taekwondo, having represented Team GB at four Olympics and having won two gold medals, as well as winning a World Championship.",
        "Jones became the youngest Team GB Olympic gold medallist when she sensationally won gold at her first attempt, as a 19-year-old at the 2012 London Games and held on to her crown four years later in Rio de Janeiro.",
        "Disappointment followed at the 2020 Tokyo Games which she later described as the \"biggest low\" of her career.",
        "At Paris 2024, Jones' bid for Olympic history ended in early defeat in the taekwondo -57kg first round.",
        "She was bidding to become the first three-time Olympic champion in the sport's history and defeat left Jones \"devastated\".",
        "Jones lost to Macedonia's Miljana Reljikj on the number of registered hits, used as a tie-breaker after three even rounds.",
        "Jones - whose Paris build-up had been overshadowed by the controversy of a missed drugs test, but was later cleared by the UK Anti-Doping Agency - has now chosen to step away from the sport she loves.",
        "\"My family have been a little bit sad about me giving up taekwondo,\" she added.",
        "\"I've never used my hands. After 20 years of using my feet I am switching it up.",
        "\"Boxing is good for me. It started as a distraction but now I am going to go for it, because I am just loving it.\"",
        "This video can not be played",
        "Jade Jones switch to boxing",
        "Jones' trainer Smith, who twice boxed for a world title, admits he was initially sceptical about Jones' boxing ambitions.",
        "\"My first instinct was why? Why would someone who kicks with both feet get into a sport where you use your hands,\" he said.",
        "\"I wasn't doubting her, but I was confused. I don't think it's ever happened before, I don't know anyone who has come over from taekwondo.",
        "\"It's a massive challenge but it is made easier by her attitude... she's improving all the time.\"",
        "This video can not be played",
        "Jade Jones: 'Taekwondo has been my whole life'",
        "Jade Jones and Stephen 'Swifty' Smith is a terrific boxing partnership.",
        "Jones is an aggressive, competitive fighter in taekwondo and she will need an old-school boxing coach to help with her transition.",
        "Smith, a former British champion and one of the four fighting Smith brothers from the Rotunda club In Liverpool, is a calm head in the gym and corner; Jones will need that as she forgets her kicks and perfects her hooks.",
        "The initial transition will not be difficult, but turning Jones into a genuine contender will take time. Jones has good feet, fast hands and, as a world-class fighter, she has great awareness.",
        "The fairy tale will mostly be conducted behind closed doors at the gym in long days of sparring and boring repetition; Jones will need to slow down, pick her punches and react to getting hit and hit and hit.",
        "Swifty will insist that she \"shapes up\" well before letting her apply for a British licence to fight; the British Boxing Board will not just grant her a licence based on her glory in another sport. She will need to display the basics, learn boxing balance and simple punches - that might be frustrating for her; all crossover athletes want to run before they can walk.",
        "There are only 13 active featherweights in Britain and Jones will be an excellent addition. She will also do some damage if she learns the basics - too many female fighters never bother to get an education and that is why the gulf at the top is so wide. Jones can bridge that gap.",
        "Boxing schedule and results 2025",
        "Watch every Born to Brawl episode"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/articles/cd75rn804dwo",
      "main_category": "sport",
      "detailed_category": "taekwondo",
      "topic": "In Pictures: Welsh sporting photos of 2024",
      "content": [
        "In a year dominated by the Olympics, it has been another gripping 12 months of sporting drama in Wales.There has been agony and ecstasy for our national footballers while Wrexham's staggering rise showed no signs of faltering.It has been a tumultuous period for our rugby stars but there was golden glory for our cricketers, boxers, cyclists and Olympians.Here BBC Sport Wales looks at a selection of some of the most striking sports photographs taken during 2024.",
        "The year kicked off in a Bridgend mud-bath on New Year's Day. Ospreys beat Cardiff on their way to reaching the knockout stages of the United Rugby Championship (URC) and Europe.But by the end of 2024, they would part company with head coach Toby Booth and Cardiff would be flying the flag for Wales in the URC.",
        "For 20 wonderful, dizzying minutes, Newport were eyeing a genuine FA Cup giant-killing when Bryn Morris kick-started a comeback against Manchester United.County levelled at 2-2 before United edged clear to win 4-2 on a wonderfully raucous night at Rodney Parade.",
        "Dafydd Jenkins, the 21-year-old lock from Exeter Chiefs, became the second youngest Wales captain in history when he led his country against Scotland in the opening match of a winless Six Nations.He was the youngest Wales captain in more than half a century, since a 20-year-old Sir Gareth Edwards in 1968.",
        "On a night of crushing disappointment, Wales agonisingly missed out on qualification for Euro 2024 after a penalty shootout defeat in their play-off final against Poland.It would signal the end for manager Robert Page who departed after disappointing summer friendlies against Gibraltar and Slovakia - with his former team-mate Craig Bellamy taking over to steer Wales back to the top tier of the Nations League in November.",
        "Louis Rees-Zammit stunned everyone, including Wales head coach Warren Gatland, by switching to American football to pursue a childhood dream of playing in the National Football League.",
        "The Wrexham roller-coaster showed no signs of coming off the tracks by securing back-to-back promotions to League One in April.",
        "In just her seventh professional fight, Olympic gold medallist Lauren Price became the first ever female boxing world champion from Wales with a unanimous points victory over Jessica McCaskill.The WBA, IBO and Ring Magazine welterweight champ later beat Bexcy Mateus to set up mouthwatering unification bout with Natasha Jonas next year.",
        "A record 33 Welsh Olympians represented Team GB at Paris 2024 - the largest Welsh contingent at an Olympics.And those Welsh Olympians bagged a record 13-medal haul, including three golds, three silvers and seven bronze.Sprint cyclist Emma Finucane became the first Welsh athlete to win three medals at a single games, which saw her crowned BBC Wales Sports Personality of the Year.",
        "Welsh Paralympians celebrated their best medal haul in 20 years after winning 16 medals in Paris, including seven golds.Among the golds were...",
        "Cardiff City and Swansea City resumed hostilities in the new Championship season, though Erol Bulut was soon sacked as Bluebirds manager, replaced by Omer Riza.",
        "Welsh cricket enjoyed a successful year in the limited overs format with Glamorgan winning the One Day Cup for the second time in four years after Welsh Fire reached the final of The Hundred at Lord's.That venue had already proved successful for Glamorgan captain Sam Northeast, who hit the highest first-class score recorded at Lord's with an unbeaten 335 against Middlesex.",
        "Wales failed to win a single Test match throughout 2024 with a run of 12 defeats in a row - the worst run in the team's 143-year history - but head coach Warren Gatland was backed by the Welsh Rugby Union to lead the team to next year's Six Nations.His Wales Women counterpart Ioan Cunningham was not of the same mind, resigning in November.",
        "But the year finished on a glorious high as Wales qualified for their first major tournament - Euro 2025 - as they stunned the Republic of Ireland in Dublin in their play-off final.There, they face a tough group alongside holders England, former winners Netherlands and France.",
        "In a year dominated by the Olympics, it has been another gripping 12 months of sporting drama in Wales.",
        "There has been agony and ecstasy for our national footballers while Wrexham's staggering rise showed no signs of faltering.",
        "It has been a tumultuous period for our rugby stars but there was golden glory for our cricketers, boxers, cyclists and Olympians.",
        "Here BBC Sport Wales looks at a selection of some of the most striking sports photographs taken during 2024.",
        "The year kicked off in a Bridgend mud-bath on New Year's Day.",
        "Ospreys beat Cardiff on their way to reaching the knockout stages of the United Rugby Championship (URC) and Europe.",
        "But by the end of 2024, they would part company with head coach Toby Booth and Cardiff would be flying the flag for Wales in the URC.",
        "For 20 wonderful, dizzying minutes, Newport were eyeing a genuine FA Cup giant-killing when Bryn Morris kick-started a comeback against Manchester United.",
        "County levelled at 2-2 before United edged clear to win 4-2 on a wonderfully raucous night at Rodney Parade.",
        "If you're good enough, you're old enough",
        "Dafydd Jenkins, the 21-year-old lock from Exeter Chiefs, became the second youngest Wales captain in history when he led his country against Scotland in the opening match of a winless Six Nations.",
        "He was the youngest Wales captain in more than half a century, since a 20-year-old Sir Gareth Edwards in 1968.",
        "So near but yet... Dan James is consoled after his penalty miss",
        "On a night of crushing disappointment, Wales agonisingly missed out on qualification for Euro 2024 after a penalty shootout defeat in their play-off final against Poland.",
        "It would signal the end for manager Robert Page who departed after disappointing summer friendlies against Gibraltar and Slovakia - with his former team-mate Craig Bellamy taking over to steer Wales back to the top tier of the Nations League in November.",
        "Louis Rees-Zammit stunned everyone, including Wales head coach Warren Gatland, by switching to American football to pursue a childhood dream of playing in the National Football League.",
        "We're going up... again",
        "The Wrexham roller-coaster showed no signs of coming off the tracks by securing back-to-back promotions to League One in April.",
        "In just her seventh professional fight, Olympic gold medallist Lauren Price became the first ever female boxing world champion from Wales with a unanimous points victory over Jessica McCaskill.",
        "The WBA, IBO and Ring Magazine welterweight champ later beat Bexcy Mateus to set up mouthwatering unification bout with Natasha Jonas next year.",
        "Wales' sparkling Olympic moments from Paris 2024",
        "The records and landmarks behind 70 years of BBC Wales SPOTY",
        "How 2024 became the year Wales' women made history",
        "Count them, one, two... three!",
        "A record 33 Welsh Olympians represented Team GB at Paris 2024 - the largest Welsh contingent at an Olympics.",
        "And those Welsh Olympians bagged a record 13-medal haul, including three golds, three silvers and seven bronze.",
        "Sprint cyclist Emma Finucane became the first Welsh athlete to win three medals at a single games, which saw her crowned BBC Wales Sports Personality of the Year.",
        "Matt Richards won gold and silver in the pool",
        "Elinor Barker, Jess Roberts and Anna Morris won Women's Team Pursuit bronze",
        "Welsh sailor Chris Grube shows remarkable balance... and bravery",
        "Ruby Evans became the first Welsh gymnast to compete at the Olympics since 1996",
        "But there was heartache for former champion Jade Jones",
        "Welsh Paralympians celebrated their best medal haul in 20 years after winning 16 medals in Paris, including seven golds.",
        "Among the golds were...",
        "Sabrina Fortune in the F20 shot put gold with a world record",
        "Matt Bush in the Men's K44 +80kg taekwondo",
        "And Jodie Grinham won archery gold and bronze while pregnant",
        "New season, old rivalries",
        "Cardiff City and Swansea City resumed hostilities in the new Championship season, though Erol Bulut was soon sacked as Bluebirds manager, replaced by Omer Riza.",
        "Welsh cricket enjoyed a successful year in the limited overs format with Glamorgan winning the One Day Cup for the second time in four years after Welsh Fire reached the final of The Hundred at Lord's.",
        "That venue had already proved successful for Glamorgan captain Sam Northeast, who hit the highest first-class score recorded at Lord's with an unbeaten 335 against Middlesex.",
        "Wales failed to win a single Test match throughout 2024 with a run of 12 defeats in a row - the worst run in the team's 143-year history - but head coach Warren Gatland was backed by the Welsh Rugby Union to lead the team to next year's Six Nations.",
        "His Wales Women counterpart Ioan Cunningham was not of the same mind, resigning in November.",
        "But the year finished on a glorious high as Wales qualified for their first major tournament - Euro 2025 - as they stunned the Republic of Ireland in Dublin in their play-off final.",
        "There, they face a tough group alongside holders England, former winners Netherlands and France."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/articles/ce9zeerlr9do",
      "main_category": "sport",
      "detailed_category": "taekwondo",
      "topic": "Maskill and Bush to be GB's flagbearers",
      "content": [
        "Poppy Maskill and Matt Bush have been named as Great Britain's flagbearers for the Paralympics closing ceremony on Sunday.Maskill won three golds among a total of five medals, which is the joint most by a British athlete in Paris alongside swimming team-mate Alice Tai.The 19-year-old was victorious in the S14 100m butterfly - GB's first gold of the Games - before also winning the 100m backstroke and mixed 4x100m freestyle relay.She took silver in both the 200m freestyle and the 200m individual medley.Para-taekwondo's Bush, 35, was a gold medallist in the men's K44 +80kg final. Both he and Maskill were making their Paralympic debuts in Paris.Maskill said: \"Next time I really want to win five golds. I’ve had a really amazing time and I can't wait to carry the flag.\"Bush, who was ruled out of the previous two Games with injury, said: \"ParalympicsGB is such a close-knit team, it is extra special that I can carry the flag on behalf of everyone. It's an unbelievable way to finish my first experience of a Paralympic Games.\"The closing ceremony, at Stade de France and featuring 24 artists from the French electronic music scene, is due to start at 19:30 BST.",
        "Matt Bush and Poppy Maskill were both making their Paralympic debuts in Paris",
        "Poppy Maskill and Matt Bush have been named as Great Britain's flagbearers for the Paralympics closing ceremony on Sunday.",
        "Maskill won three golds among a total of five medals, which is the joint most by a British athlete in Paris alongside swimming team-mate Alice Tai.",
        "The 19-year-old was victorious in the S14 100m butterfly - GB's first gold of the Games - before also winning the 100m backstroke and mixed 4x100m freestyle relay.",
        "She took silver in both the 200m freestyle and the 200m individual medley.",
        "Para-taekwondo's Bush, 35, was a gold medallist in the men's K44 +80kg final.",
        "Both he and Maskill were making their Paralympic debuts in Paris.",
        "Maskill said: \"Next time I really want to win five golds. I’ve had a really amazing time and I can't wait to carry the flag.\"",
        "Bush, who was ruled out of the previous two Games with injury, said: \"ParalympicsGB is such a close-knit team, it is extra special that I can carry the flag on behalf of everyone. It's an unbelievable way to finish my first experience of a Paralympic Games.\"",
        "The closing ceremony, at Stade de France and featuring 24 artists from the French electronic music scene, is due to start at 19:30 BST.",
        "What's happening and when at the Paris Paralympics?",
        "Paris 2024 Paralympics medal table",
        "All you need to know about the Paris Paralympics",
        "Sport-by-sport guide to Paris 2024 Paralympics",
        "Paralympics 2024: What you need to know about classification",
        "Paralympics 2024: Who has been selected for the GB team?",
        "Paris 2024 Paralympics"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/taekwondo/articles/c5y3jd4j37yo",
      "main_category": "sport",
      "detailed_category": "taekwondo",
      "topic": "Truesdale and Bush win back-to-back taekwondo golds",
      "content": [
        "Amy Truesdale won Para-Taekwondo gold in dramatic fashion before Matt Bush claimed gold of his own at the Paralympics in Paris.Truesdale, 35, was an 8-2 winner over Uzbekistan's Guljonoy Naimova in the final of the women's K44 +65kg category, but almost got disqualified with 65 seconds remaining after inadvertently landing a kick in the face of Naimova.Despite being medically cleared to carry on, Naimova withdrew, awarding Truesdale the victory at the Grand Palais.\"I don't think it's sunk in,\" said Truesdale, who celebrated by performing a cartwheel on the mat before doing the splits.\"I was like 'I don't know what to do as a celebration' but for me it's the last medal I need to complete my Para-taekwondo career. \"I'm Paralympic champion, I've made history, I'm the first person to do it and I'm so grateful for the support and I think I just need to cry on my own for 20 minutes after the medal ceremony.\"Shortly after, two-time world champion Bush, 35, beat Neutral Paralympic athlete Aliaskhab Ramazanov 5-0 in the men's K44 +80kg final.\"I had fought him before, quite a bit,\" he said. \"He is a very good fighter and I had to be on it and that comes back to building a game plan. It was tough, it was hard but I had to fight.\"",
        "Amy Truesdale (left) and Matt Bush (right) both won Para-Taekwondo golds in back-to-back finals on Saturday night",
        "Amy Truesdale won Para-Taekwondo gold in dramatic fashion before Matt Bush claimed gold of his own at the Paralympics in Paris.",
        "Truesdale, 35, was an 8-2 winner over Uzbekistan's Guljonoy Naimova in the final of the women's K44 +65kg category, but almost got disqualified with 65 seconds remaining after inadvertently landing a kick in the face of Naimova.",
        "Despite being medically cleared to carry on, Naimova withdrew, awarding Truesdale the victory at the Grand Palais.",
        "\"I don't think it's sunk in,\" said Truesdale, who celebrated by performing a cartwheel on the mat before doing the splits.",
        "\"I was like 'I don't know what to do as a celebration' but for me it's the last medal I need to complete my Para-taekwondo career.",
        "\"I'm Paralympic champion, I've made history, I'm the first person to do it and I'm so grateful for the support and I think I just need to cry on my own for 20 minutes after the medal ceremony.\"",
        "Shortly after, two-time world champion Bush, 35, beat Neutral Paralympic athlete Aliaskhab Ramazanov 5-0 in the men's K44 +80kg final.",
        "\"I had fought him before, quite a bit,\" he said. \"He is a very good fighter and I had to be on it and that comes back to building a game plan. It was tough, it was hard but I had to fight.\"",
        "This video can not be played",
        "Chester's Amy Truesdale makes history in Paris."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/taekwondo/articles/cmmmrnq8gy6o",
      "main_category": "sport",
      "detailed_category": "taekwondo",
      "topic": "Paralympics 2024: A guide to Para-taekwondo at the Paris Games",
      "content": [
        "Dates: 29-31 AugustVenue: Grand PalaisGold medals on offer: Ten",
        "After making its debut at Tokyo 2020, there is an expanded Para-taekwondo programme for Paris.While the sport has similarities to the Olympic version, the one key difference is that kicks to the head are not allowed and punches are not allowed because not all athletes can block in the same way.All of the scoring is based on kicks to the trunk with competitors wearing body protectors with in-built electronics. Two points are awarded for a valid kick to the trunk protector, three points for a valid turn kick and four for a valid spinning kick. In addition, one point is awarded for every penalty given to the opponent.At the Paris Games there will be one division (K44) for athletes who compete in the K43 or K44 category.The K43 category includes athletes who have impairments in both arms above the elbow while the K44 category includes athletes who have impairments in one arm above the elbow.There will be five weight categories per gender - two more than Tokyo - men's up to 58kg, -63kg, -70kg, -80kg and more than 80kg and women's up to 47kg, -52kg, -57kg, -65kg and over 65kg.Each division will have 12 athletes meaning that there will be a repechage system in place and two bronze medals will be awarded.Bouts are made up of three rounds of two minutes with a one-minute break between rounds. If athletes are tied after three rounds, a golden-point round takes place with the winner the first fighter to two points.",
        "GB will have a three-strong team in Paris with the trio all in with good medal chances.Beth Munro won Britain’s first medal in the sport, taking silver in Tokyo just two years after taking up the sport. Since then she has become European champion and leads the world rankings in the -65kg event.Current world champion Amy Truesdale has been a pioneer of the sport and won bronze in Tokyo and wants to improve on that in France where she will compete in the over 65kg event.And after missing Tokyo 2020 through injury, Matt Bush will be making his debut in the men’s over 80kg division. Bush created history in 2019 when he became Britain’s first male Para world champion in the sport and followed that with another gold at last year’s Worlds in Mexico.",
        "Five of the six Tokyo gold medallists are back to defend their title and with the sport continuing to grow and develop, standards are rising.Nations represented in Paris include Nepal, Fiji and Papua New Guinea as well as more traditional powerhouses like Turkey, Mexico and Iran plus Brazil, who topped the Tokyo standings with three medals.Among the defending champions are Denmark’s Lisa Gjessing who goes in the same -65kg category as Munro and beat the Briton to gold in Tokyo. Gjessing has won every honour in the sport and was one of her nation’s flagbearers at the opening ceremony in Japan.Mexico’s Claudia Romero and Italy’s Antonino Bossolo, who were voted 2023 Best Para Athletes by World Taekwondo, will be hoping to add to their honours.Romero, who competes in the -47kg event, triumphed in last year’s Paris Grand Prix while Bossolo won a surprise gold in the -63kg event at the Worlds while Romero’s compatriot Jessica Garcia Quijano is one to watch in the -52kg division.",
        "Afghanistan athlete Zakia Khudadadi will be competing in her second Games in Paris and hoping that she can continue to make an impact on and off the mat.A week before the 2021 Tokyo Games, she was evacuated from the Afghanistan capital Kabul along with sprinter Hossain Rasouli. The pair spent a week in France before travelling to Japan to compete at the Games.It saw Khudadadi become Afghanistan's first female Paralympian since 2004.The 25-year-old is now based in Paris and won gold in the -47kg event at last year's European Para Championships",
        "Two - one silver (Beth Munro) and one bronze (Amy Truesdale)",
        "Iran’s Mahdi Pourrahnama goes up against Mexico’s Juan Garcia in the gold-medal bout at the Tokyo Paralympics",
        "Gold medals on offer: Ten",
        "After making its debut at Tokyo 2020, there is an expanded Para-taekwondo programme for Paris.",
        "While the sport has similarities to the Olympic version, the one key difference is that kicks to the head are not allowed and punches are not allowed because not all athletes can block in the same way.",
        "All of the scoring is based on kicks to the trunk with competitors wearing body protectors with in-built electronics. Two points are awarded for a valid kick to the trunk protector, three points for a valid turn kick and four for a valid spinning kick. In addition, one point is awarded for every penalty given to the opponent.",
        "At the Paris Games there will be one division (K44) for athletes who compete in the K43 or K44 category.",
        "The K43 category includes athletes who have impairments in both arms above the elbow while the K44 category includes athletes who have impairments in one arm above the elbow.",
        "There will be five weight categories per gender - two more than Tokyo - men's up to 58kg, -63kg, -70kg, -80kg and more than 80kg and women's up to 47kg, -52kg, -57kg, -65kg and over 65kg.",
        "Each division will have 12 athletes meaning that there will be a repechage system in place and two bronze medals will be awarded.",
        "Bouts are made up of three rounds of two minutes with a one-minute break between rounds. If athletes are tied after three rounds, a golden-point round takes place with the winner the first fighter to two points.",
        "GB will have a three-strong team in Paris with the trio all in with good medal chances.",
        "Beth Munro won Britain’s first medal in the sport, taking silver in Tokyo just two years after taking up the sport. Since then she has become European champion and leads the world rankings in the -65kg event.",
        "Current world champion Amy Truesdale has been a pioneer of the sport and won bronze in Tokyo and wants to improve on that in France where she will compete in the over 65kg event.",
        "And after missing Tokyo 2020 through injury, Matt Bush will be making his debut in the men’s over 80kg division. Bush created history in 2019 when he became Britain’s first male Para world champion in the sport and followed that with another gold at last year’s Worlds in Mexico.",
        "Five of the six Tokyo gold medallists are back to defend their title and with the sport continuing to grow and develop, standards are rising.",
        "Nations represented in Paris include Nepal, Fiji and Papua New Guinea as well as more traditional powerhouses like Turkey, Mexico and Iran plus Brazil, who topped the Tokyo standings with three medals.",
        "Among the defending champions are Denmark’s Lisa Gjessing who goes in the same -65kg category as Munro and beat the Briton to gold in Tokyo. Gjessing has won every honour in the sport and was one of her nation’s flagbearers at the opening ceremony in Japan.",
        "Mexico’s Claudia Romero and Italy’s Antonino Bossolo, who were voted 2023 Best Para Athletes by World Taekwondo, will be hoping to add to their honours.",
        "Romero, who competes in the -47kg event, triumphed in last year’s Paris Grand Prix while Bossolo won a surprise gold in the -63kg event at the Worlds while Romero’s compatriot Jessica Garcia Quijano is one to watch in the -52kg division.",
        "Afghanistan athlete Zakia Khudadadi will be competing in her second Games in Paris and hoping that she can continue to make an impact on and off the mat.",
        "A week before the 2021 Tokyo Games, she was evacuated from the Afghanistan capital Kabul along with sprinter Hossain Rasouli. The pair spent a week in France before travelling to Japan to compete at the Games.",
        "It saw Khudadadi become Afghanistan's first female Paralympian since 2004.",
        "The 25-year-old is now based in Paris and won gold in the -47kg event at last year's European Para Championships",
        "Two - one silver (Beth Munro) and one bronze (Amy Truesdale)"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/olympics/articles/cvgxnngzeylo",
      "main_category": "sport",
      "detailed_category": "taekwondo",
      "topic": "GB's Cunningham narrowly beaten in taekwondo final",
      "content": [
        "Caden Cunningham narrowly missed out on becoming the first British man to win Olympic taekwondo gold as he had to settle for +80kg silver in Paris.The 21-year-old, appearing in his first Games, was beaten 2-1 in a tight contest by Iran's Arian Salimi.The Briton dropped to his knees and then sat on the mat as the time ran down, before he and Salimi raised one another's hands above their heads and thanked the crowd.It was an even fight - Cunningham won the first of the three rounds but Salimi dominated the second, before finding a crucial head kick late in the third to secure victory.Cunningham's silver ensures Britain continue their record of winning an Olympic taekwondo medal at every Games since Athens 2004.\"If I stay in this, I will be the king of taekwondo in the next four years,\" Cunningham told BBC Sport.\"One fight does not define me as a fighter.\"It is the start of whatever I want it to be.\"The silver came shortly after GB's Rebecca McGowan lost to Turkey's Nafia Kus Aydin in the +67kg bronze-medal match.",
        "Cunningham will be able to take comfort from the way he came through a difficult draw in Paris. He beat Tokyo bronze medallist Rafael Alba in the quarter-finals, followed by world champion and 2016 Rio gold medallist Cheick Sallah Cisse in the last four.While he may be disappointed with silver, there are high hopes for Cunningham, with two-time Olympic bronze medallist Bianca Walkden describing him as the \"future of the sport\".Aged 10, Cunningham decided to find a sport he would excel at and win an Olympic medal in, opting for taekwondo, external after a conversation with his dad, a former champion kickboxer.He won his first senior medal aged just 17, claiming -87kg silver at the Spanish Open in April 2021.Since then, he has added European +87kg gold - which he won on his debut at the event in May this year - to his tally, along with gold in last year's Rome Grand Prix and silver in Paris.Cunningham suffered a six-month lay-off in 2022 after tearing his anterior cruciate ligament in the first round of the World Championships.Remarkably, he continued the fight - and won.Cunningham cuts a relaxed figure off the mat and was quick to praise his opponent after the fight.\"He is a very nice guy. I've no problem losing to a guy who was better than me on the day, and he was,\" he told BBC Sport.\"I didn't get the gold for myself, my coach and my family but I am very proud to be here today.\"I just want to see my parents, maybe go home and have a KFC or something.\"",
        "Scot McGowan had been left devastated after her quarter-final loss to Svetlana Osipova of Uzbekistan earlier on Saturday.However, Osipova progressed to the final, meaning McGowan was able to go into the repechage and fight for a chance at bronze.She easily beat Astan Bathily of the Ivory Coast 2-0 to set up a bronze-medal match.Tied at 1-1 going into the final round, McGowan thought she had delivered a winning head kick but it had only caught the arm of Aydin, who held out to secure the medal.\"My heart is broken twice tonight but I'm really proud of myself being able to pick myself up and fight how I did,\" McGowan told BBC Sport.\"It is gutting and it feels like a bit of a heartbreak right now but it is the sport and life I chose.\"Cunningham leaves Paris as Britain's only taekwondo medallist out of the four medal hopes.Favourite Bradly Sinden had to withdraw injured before his men's -68kg bronze-medal match, while two-time gold medallist Jade Jones suffered an early exit in the women's -57kg.",
        "This video can not be played",
        "GB's Caden Cunningham wins silver after losing men's +80kg category final",
        "Caden Cunningham narrowly missed out on becoming the first British man to win Olympic taekwondo gold as he had to settle for +80kg silver in Paris.",
        "The 21-year-old, appearing in his first Games, was beaten 2-1 in a tight contest by Iran's Arian Salimi.",
        "The Briton dropped to his knees and then sat on the mat as the time ran down, before he and Salimi raised one another's hands above their heads and thanked the crowd.",
        "It was an even fight - Cunningham won the first of the three rounds but Salimi dominated the second, before finding a crucial head kick late in the third to secure victory.",
        "Cunningham's silver ensures Britain continue their record of winning an Olympic taekwondo medal at every Games since Athens 2004.",
        "\"If I stay in this, I will be the king of taekwondo in the next four years,\" Cunningham told BBC Sport.",
        "\"One fight does not define me as a fighter.",
        "\"It is the start of whatever I want it to be.\"",
        "The silver came shortly after GB's Rebecca McGowan lost to Turkey's Nafia Kus Aydin in the +67kg bronze-medal match.",
        "Shortman and Thorpe win historic artistic swimming medal",
        "Bell's brilliant bronze and relay stars boost GB medals haul",
        "Top five stories from day 15 at the Paris Olympics",
        "Cunningham will be able to take comfort from the way he came through a difficult draw in Paris. He beat Tokyo bronze medallist Rafael Alba in the quarter-finals, followed by world champion and 2016 Rio gold medallist Cheick Sallah Cisse in the last four.",
        "While he may be disappointed with silver, there are high hopes for Cunningham, with two-time Olympic bronze medallist Bianca Walkden describing him as the \"future of the sport\".",
        "Aged 10, Cunningham decided to find a sport he would excel at and win an Olympic medal in, opting for taekwondo, external after a conversation with his dad, a former champion kickboxer.",
        "He won his first senior medal aged just 17, claiming -87kg silver at the Spanish Open in April 2021.",
        "Since then, he has added European +87kg gold - which he won on his debut at the event in May this year - to his tally, along with gold in last year's Rome Grand Prix and silver in Paris.",
        "Cunningham suffered a six-month lay-off in 2022 after tearing his anterior cruciate ligament in the first round of the World Championships.",
        "Remarkably, he continued the fight - and won.",
        "Cunningham cuts a relaxed figure off the mat and was quick to praise his opponent after the fight.",
        "\"He is a very nice guy. I've no problem losing to a guy who was better than me on the day, and he was,\" he told BBC Sport.",
        "\"I didn't get the gold for myself, my coach and my family but I am very proud to be here today.",
        "\"I just want to see my parents, maybe go home and have a KFC or something.\"",
        "Caden Cunningham and Arian Salimi celebrated together at the end of their men's +80kg gold medal match",
        "Scot McGowan had been left devastated after her quarter-final loss to Svetlana Osipova of Uzbekistan earlier on Saturday.",
        "However, Osipova progressed to the final, meaning McGowan was able to go into the repechage and fight for a chance at bronze.",
        "She easily beat Astan Bathily of the Ivory Coast 2-0 to set up a bronze-medal match.",
        "Tied at 1-1 going into the final round, McGowan thought she had delivered a winning head kick but it had only caught the arm of Aydin, who held out to secure the medal.",
        "\"My heart is broken twice tonight but I'm really proud of myself being able to pick myself up and fight how I did,\" McGowan told BBC Sport.",
        "\"It is gutting and it feels like a bit of a heartbreak right now but it is the sport and life I chose.\"",
        "Cunningham leaves Paris as Britain's only taekwondo medallist out of the four medal hopes.",
        "Favourite Bradly Sinden had to withdraw injured before his men's -68kg bronze-medal match, while two-time gold medallist Jade Jones suffered an early exit in the women's -57kg.",
        "Today's Olympics guide",
        "Full Paris Olympics schedule",
        "BBC's Paris Olympics TV schedule"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/olympics/articles/cged9j9plv0o",
      "main_category": "sport",
      "detailed_category": "taekwondo",
      "topic": "GB's Cunningham to fight for taekwondo gold",
      "content": [
        "Britain's Caden Cunningham will bid for Olympic taekwondo gold later on Saturday - and Rebecca McGowan will fight again for a chance at bronze.Cunningham, competing at his first Olympics, stunned Rio 2016 champion Cheick Sallah Cisse in the men's +80kg semi-finals.The pair were tied at 1-1 going into the final round of the best-of-three match - and, as the clock ticked down, the score in the decider was level at 5-5.But Cunningham, 21, was judged to have had more shots and was declared the winner.Cunningham will face Iran's Arian Salimi in the final at 20:18 BST, knowing he is guaranteed at least a silver medal in Paris.Asked how he would prepare for the final, Cunningham said: \"Chill, eat a banana, drink, smile and warm up.\"I plan to come out victorious, so happy days.\"Bianca Cook, a two-time Olympic bronze medallist for GB, praised Cunningham's maturity during the fight.\"That match was going to be so tight, down the wire, but Caden kept his cool,\" she said on BBC TV.\"They're both such strong characters. They knew what they needed to do to get the edge over each other and Caden was fantastic.\"",
        "McGowan was outclassed 2-0 in the quarter-finals of the women's +67kg event by Svetlana Osipova of Uzbekistan.However, Osipova went on to reach the final, meaning McGowan will contest the repechage - a fight which decides who will advance to the bronze medal matches.McGowan, from Dumbarton, will now need to recompose herself and beat Astan Bathily of Ivory Coast to be in with a shot at a medal.Britain have won a taekwondo medal at every Games since Athens in 2004, but they initially struggled in Paris.Gold medal favourite Bradly Sinden had to withdraw injured before his men's -68kg bronze medal match, having taken silver in Tokyo three years ago.That came after two-time gold medallist Jade Jones suffered an early defeat - just as she did in Tokyo - in the women's -57kg.",
        "This video can not be played",
        "Team GB's Caden Cunningham qualifies for the men's +80kg taekwondo final",
        "Britain's Caden Cunningham will bid for Olympic taekwondo gold later on Saturday - and Rebecca McGowan will fight again for a chance at bronze.",
        "Cunningham, competing at his first Olympics, stunned Rio 2016 champion Cheick Sallah Cisse in the men's +80kg semi-finals.",
        "The pair were tied at 1-1 going into the final round of the best-of-three match - and, as the clock ticked down, the score in the decider was level at 5-5.",
        "But Cunningham, 21, was judged to have had more shots and was declared the winner.",
        "Cunningham will face Iran's Arian Salimi in the final at 20:18 BST, knowing he is guaranteed at least a silver medal in Paris.",
        "Asked how he would prepare for the final, Cunningham said: \"Chill, eat a banana, drink, smile and warm up.",
        "\"I plan to come out victorious, so happy days.\"",
        "Bianca Cook, a two-time Olympic bronze medallist for GB, praised Cunningham's maturity during the fight.",
        "\"That match was going to be so tight, down the wire, but Caden kept his cool,\" she said on BBC TV.",
        "\"They're both such strong characters. They knew what they needed to do to get the edge over each other and Caden was fantastic.\"",
        "Olympics: GB's Williams wins bronze in 10m diving final, USA v Brazil in women's football final",
        "Top five stories from day 15 at the Paris Olympics",
        "Caden Cunningham won men's +87kg gold on his European Games debut in 2023",
        "McGowan was outclassed 2-0 in the quarter-finals of the women's +67kg event by Svetlana Osipova of Uzbekistan.",
        "However, Osipova went on to reach the final, meaning McGowan will contest the repechage - a fight which decides who will advance to the bronze medal matches.",
        "McGowan, from Dumbarton, will now need to recompose herself and beat Astan Bathily of Ivory Coast to be in with a shot at a medal.",
        "Britain have won a taekwondo medal at every Games since Athens in 2004, but they initially struggled in Paris.",
        "Gold medal favourite Bradly Sinden had to withdraw injured before his men's -68kg bronze medal match, having taken silver in Tokyo three years ago.",
        "That came after two-time gold medallist Jade Jones suffered an early defeat - just as she did in Tokyo - in the women's -57kg.",
        "Today's Olympics guide",
        "Full Paris Olympics schedule",
        "BBC's Paris Olympics TV schedule"
      ]
    }
  ]
}