{
  "scraped_at": "2025-10-27T18:56:59.822545",
  "total_articles": 1,
  "category": "water-polo",
  "articles_per_category": 100,
  "articles": [
    {
      "url": "https://www.bbc.com/sport/water-polo/articles/c8xj8lpl4yeo",
      "main_category": "sport",
      "detailed_category": "water-polo",
      "topic": "Meet Amelie Perkins - the rising star of water polo",
      "content": [
        "Amelie Perkins is not your average Coventry teenager.At 17, at a time when half the nation will be thinking about their Christmas turkey,  the schoolgirl from Earlsdon will actually be in Turkey next week as one of Great Britain's most exciting prospects competing in the Water Polo World Cup.She is not long back from the Under-18s European Union nations tournament in the Czech Republic, where she scored 30 goals in five games, including seven in the final, to help England win gold and claim the prize of tournament top scorer.Now she steps back up to senior level again in Istanbul with a fast-growing reputation.\"I'm back in the seniors and playing again with a lot of older people,\" she told BBC CWR. \"I'm always the baby in the team but they look after me.\"There are a couple of teams there who competed in the Paris 2024 Olympics in the summer, so there's a lot of experience out there.\"",
        "Amelie had just turned 16 in January when she was selected for the GB team at the Ladies European Championships, becoming the youngest British female player to play at an official world aquatics tournament. She scored two goals against the Netherlands, the world champions, as GB finished seventh, their highest finish at a European tournament. But she knows all too well that water polo is taken a lot more seriously on the European mainland than it is in Great Britain.\"In some countries it's their national sport. Here it's a bit of a minority sport,\" she added.Amelie, who used to play rugby in her early childhood, is currently signed for Maltese club Sirens, where she has spent time training in the past six weeks and playing for them in the European Challenger Cup - water polo's equivalent of the Europa League in football.But she already has her sights set beyond next week's World Cup.\"My dad was a rugby player and I got into rugby and I played until two years ago when I stopped. But there are similarities,\" said Amelie, one of two 17-year-olds in the GB squad, who still attends Westwood Academy in Canley.",
        "\"My ultimate goal is to play Champions League in Europe or at the Olympics.\"I've kind of known what I wanted to do since I was younger but I'm still studying.\"Unfortunately, in women's water polo, you can't make a footballer's wage off it, when you can just sit back and let the money come in.\"Eventually, when you stop playing, you do have to go into a career.\"But there is a really good league over in America at a high level and you get your education paid for - and there is an option over in Europe too. And they both sound exciting.\"The women's tournament begins in Istanbul on Saturday and runs until Tuesday, 17 December. It then runs straight into the men's, which runs from 18 -21 December.",
        "GB senior women's squad:Kathy Rogers (capt), Annie Clapperton (vice-capt), Lucy Blenkinship, Sophie Jackson (gk), Jade Smith (gk), Katie Brown, Katy Cutler, Harriet Dickens, Toula Falvey, Izzy Howe, Isobelle Robb, Amelie Perkins, Amelia Peters, Brooke TafazolliHead coach: Theo NousiosAssistant coach: Joanne MountfieldTeam manager: Paula WestPhysio: Diane ElliotGB senior men's squad:Kameron Powell (capt), Elliot McHugh (vice-capt, gk), Thomas Manley (gk), Ben Alderson, Alastair Cook, George Davies, Murray Dickson, Jordan Elliot, Lewis Gilmour, Louie McKie, Lloyd Pittick, Reuben Powell, Alex Sharp, Richard WallerHead coach: Nick HumeAssistant coach: James Spencer-BoyceTeam manager: Terri HalstedPhysio: Leanne Pridding",
        "Amelie Perkins was the youngest British female player to play at an official world aquatics tournament when she was selected for the ladies team at the age of 16 in January",
        "Amelie Perkins is not your average Coventry teenager.",
        "At 17, at a time when half the nation will be thinking about their Christmas turkey,  the schoolgirl from Earlsdon will actually be in Turkey next week as one of Great Britain's most exciting prospects competing in the Water Polo World Cup.",
        "She is not long back from the Under-18s European Union nations tournament in the Czech Republic, where she scored 30 goals in five games, including seven in the final, to help England win gold and claim the prize of tournament top scorer.",
        "Now she steps back up to senior level again in Istanbul with a fast-growing reputation.",
        "\"I'm back in the seniors and playing again with a lot of older people,\" she told BBC CWR. \"I'm always the baby in the team but they look after me.",
        "\"There are a couple of teams there who competed in the Paris 2024 Olympics in the summer, so there's a lot of experience out there.\"",
        "Coventry teenager heads for World Cup",
        "Amelie had just turned 16 in January when she was selected for the GB team at the Ladies European Championships, becoming the youngest British female player to play at an official world aquatics tournament.",
        "She scored two goals against the Netherlands, the world champions, as GB finished seventh, their highest finish at a European tournament. But she knows all too well that water polo is taken a lot more seriously on the European mainland than it is in Great Britain.",
        "\"In some countries it's their national sport. Here it's a bit of a minority sport,\" she added.",
        "Amelie, who used to play rugby in her early childhood, is currently signed for Maltese club Sirens, where she has spent time training in the past six weeks and playing for them in the European Challenger Cup - water polo's equivalent of the Europa League in football.",
        "But she already has her sights set beyond next week's World Cup.",
        "\"My dad was a rugby player and I got into rugby and I played until two years ago when I stopped. But there are similarities,\" said Amelie, one of two 17-year-olds in the GB squad, who still attends Westwood Academy in Canley.",
        "Amelie Perkins' latest medal was won in November in the Czech Republic",
        "\"My ultimate goal is to play Champions League in Europe or at the Olympics.",
        "\"I've kind of known what I wanted to do since I was younger but I'm still studying.",
        "\"Unfortunately, in women's water polo, you can't make a footballer's wage off it, when you can just sit back and let the money come in.",
        "\"Eventually, when you stop playing, you do have to go into a career.",
        "\"But there is a really good league over in America at a high level and you get your education paid for - and there is an option over in Europe too. And they both sound exciting.\"",
        "The women's tournament begins in Istanbul on Saturday and runs until Tuesday, 17 December. It then runs straight into the men's, which runs from 18 -21 December.",
        "GB senior women's squad:",
        "Kathy Rogers (capt), Annie Clapperton (vice-capt), Lucy Blenkinship, Sophie Jackson (gk), Jade Smith (gk), Katie Brown, Katy Cutler, Harriet Dickens, Toula Falvey, Izzy Howe, Isobelle Robb, Amelie Perkins, Amelia Peters, Brooke Tafazolli",
        "Head coach: Theo Nousios",
        "Assistant coach: Joanne Mountfield",
        "Team manager: Paula West",
        "GB senior men's squad:",
        "Kameron Powell (capt), Elliot McHugh (vice-capt, gk), Thomas Manley (gk), Ben Alderson, Alastair Cook, George Davies, Murray Dickson, Jordan Elliot, Lewis Gilmour, Louie McKie, Lloyd Pittick, Reuben Powell, Alex Sharp, Richard Waller",
        "Head coach: Nick Hume",
        "Assistant coach: James Spencer-Boyce",
        "Team manager: Terri Halsted",
        "Physio: Leanne Pridding"
      ]
    }
  ]
}