{
  "scraped_at": "2025-10-27T18:56:59.765547",
  "total_articles": 11,
  "category": "bowls",
  "articles_per_category": 100,
  "articles": [
    {
      "url": "https://www.bbc.com/sport/articles/cglew521l4do",
      "main_category": "sport",
      "detailed_category": "bowls",
      "topic": "Dunlop and Booth receive MBEs in King's Birthday Honours",
      "content": [
        "Michael Dunlop and Neil Booth have spoken of their immense pride after being awarded MBEs in the King's Birthday Honours.Dunlop, 36, is regarded as a road racing great as the record holder for the most number of wins and podiums at the Isle of Man TT, making it 33 victories just last week.The Ballymoney man comes from a family synonymous with motorcycling and tragedy, with his father Robert, brother William and uncle Joey all tragically passing away while pursuing the sport they loved.Michael has remained committed to racing as, in addition to his exploits on the Isle of Man, he has enjoyed success at the North West 200, claiming his first victory just days after his father's death in 2008 when topping the podium in the 250cc race.His most recent outing at the North West saw him secure a hat-trick of wins to bring his tally to eight overall and further cement his legacy in the sport.He now follows in the footsteps of his uncle Joey, who was also made an MBE in 1986 before being presented with an OBE 10 years later.\"This is a wonderful honour for me and for my family,\" he said.\"I am proud to represent Northern Ireland sport, and motorcycling in this country.\"Our team has had another brilliant year, with a hat trick at the NW200, and smashing into the record books again at the Isle of Man TT.\"To be the not just the most successful rider in the history of the TT, but also to have the record number of podiums and to have won on the biggest number of manufacturers is extremely special.\"I am humbled to be awarded this honour from the Palace.\"",
        "County Antrim bowler Booth has spoken of his \"delight\", having been awarded an MBE.The highly-decorated 57-year-old enjoyed a remarkable career on the green and has since brought that expertise into his role as coach of the Irish men's team which opens its 2025 Mainstream International Programme with a test match away to Bowls Jersey over the weekend.Booth will go there with an added spring in his step after news of his recognition was made public on Friday and he admits he was a little shocked when first contacted.\"I saw the letter outside the door with 'Cabinet Office' on the front and started to think I was going to be extradited, but I was delighted when I opened it up,\" he said.\"I can't imagine what the whole occasion will be like, but I'm really looking forward to it. We'll make a weekend out of it but I imagine I'll be pretty nervous.\"Booth recently collected the High Performance Coaching Award at the Sport NI Sportmaker ceremony at Titanic Belfast and this will sit alongside a host of medals and honours collected down through the years.The Portglenone man is a three-time medallist at the World Championships which includes gold in the fours back in 2004 when the Championships were held in Ayr.Booth is also in possession of four Commonwealth Games medals, including gold from the 1998 edition in Kuala Lumpur and bronze in Manchester 2002 - both in the fours - while taking silver medals in the triples in the Melbourne Games of 2006 and again in Glasgow 2014.As a coach, he helped guide Northern Ireland's men to the men's fours title at the 2022 Commonwealth Games, with Gary Kelly taking silver in the men's singles.In 2020, he completed a charity challenge when playing bowls in 52 clubs throughout Ireland to raise awareness of mental health issues, which underlined his commitment to help others.The awarding of an MBE is the crowning glory and Booth reflected on a superb career, but insists he will accept the award on behalf of the entire sport.\"I've probably played at that high level from he late 80s, early 90s, all the way through to 2014,\" he added.\"Since then, the coaching role has gone really well and the men's team is second in the world at the minute, which is exceptional. I'm just delighted as this says a lot about the sport in general. It's come on leaps and bounds over here, so this is an award for the entire sport, as much as it is for myself.\"",
        "Michael Dunlop celebrates with a trophy following victory at last week's Isle of Man TT",
        "Michael Dunlop and Neil Booth have spoken of their immense pride after being awarded MBEs in the King's Birthday Honours.",
        "Dunlop, 36, is regarded as a road racing great as the record holder for the most number of wins and podiums at the Isle of Man TT, making it 33 victories just last week.",
        "The Ballymoney man comes from a family synonymous with motorcycling and tragedy, with his father Robert, brother William and uncle Joey all tragically passing away while pursuing the sport they loved.",
        "Michael has remained committed to racing as, in addition to his exploits on the Isle of Man, he has enjoyed success at the North West 200, claiming his first victory just days after his father's death in 2008 when topping the podium in the 250cc race.",
        "His most recent outing at the North West saw him secure a hat-trick of wins to bring his tally to eight overall and further cement his legacy in the sport.",
        "He now follows in the footsteps of his uncle Joey, who was also made an MBE in 1986 before being presented with an OBE 10 years later.",
        "\"This is a wonderful honour for me and for my family,\" he said.",
        "\"I am proud to represent Northern Ireland sport, and motorcycling in this country.",
        "\"Our team has had another brilliant year, with a hat trick at the NW200, and smashing into the record books again at the Isle of Man TT.",
        "\"To be the not just the most successful rider in the history of the TT, but also to have the record number of podiums and to have won on the biggest number of manufacturers is extremely special.",
        "\"I am humbled to be awarded this honour from the Palace.\"",
        "Neil Booth (right) with Paul Daly and Neil Mulholland following their silver medal finish in the triples at the 2014 Commonwealth Games",
        "County Antrim bowler Booth has spoken of his \"delight\", having been awarded an MBE.",
        "The highly-decorated 57-year-old enjoyed a remarkable career on the green and has since brought that expertise into his role as coach of the Irish men's team which opens its 2025 Mainstream International Programme with a test match away to Bowls Jersey over the weekend.",
        "Booth will go there with an added spring in his step after news of his recognition was made public on Friday and he admits he was a little shocked when first contacted.",
        "\"I saw the letter outside the door with 'Cabinet Office' on the front and started to think I was going to be extradited, but I was delighted when I opened it up,\" he said.",
        "\"I can't imagine what the whole occasion will be like, but I'm really looking forward to it. We'll make a weekend out of it but I imagine I'll be pretty nervous.\"",
        "Booth recently collected the High Performance Coaching Award at the Sport NI Sportmaker ceremony at Titanic Belfast and this will sit alongside a host of medals and honours collected down through the years.",
        "The Portglenone man is a three-time medallist at the World Championships which includes gold in the fours back in 2004 when the Championships were held in Ayr.",
        "Booth is also in possession of four Commonwealth Games medals, including gold from the 1998 edition in Kuala Lumpur and bronze in Manchester 2002 - both in the fours - while taking silver medals in the triples in the Melbourne Games of 2006 and again in Glasgow 2014.",
        "As a coach, he helped guide Northern Ireland's men to the men's fours title at the 2022 Commonwealth Games, with Gary Kelly taking silver in the men's singles.",
        "In 2020, he completed a charity challenge when playing bowls in 52 clubs throughout Ireland to raise awareness of mental health issues, which underlined his commitment to help others.",
        "The awarding of an MBE is the crowning glory and Booth reflected on a superb career, but insists he will accept the award on behalf of the entire sport.",
        "\"I've probably played at that high level from he late 80s, early 90s, all the way through to 2014,\" he added.",
        "\"Since then, the coaching role has gone really well and the men's team is second in the world at the minute, which is exceptional. I'm just delighted as this says a lot about the sport in general. It's come on leaps and bounds over here, so this is an award for the entire sport, as much as it is for myself.\""
      ]
    },
    {
      "url": "https://www.bbc.com/sport/bowls/articles/cp82j3n7m5no",
      "main_category": "sport",
      "detailed_category": "bowls",
      "topic": "Banks plays down 'natural talent' despite historic world treble",
      "content": [
        "Jason Banks thinks his history making triple World Indoor Bowls title success has come despite not having \"as much natural talent as a lot of the other players\".But the modest Scot has revealed that games of \"roon the stick\" while growing up in his native Aberdeenshire helped hone his game after taking up the sport at the age of 10.Eighteen years on, Banks defeated Englishman Robert Paxton, the 2020 champion, at Potters Resorts in Hopton-on-Sea on Sunday to add the singles title to the men's pairs and mixed pairs trophies he lifted a few days earlier.He admits it has still not \"sunk it at all\" that he has become the first to win all three at the same championships.",
        "\"The reason I started it was because my family play bowls as well,\" Banks told BBC Scotland. \"My parents and my grandparents, they were quite helpful when I was beginning my journey in bowls.\"I started off playing what in our area is called 'roon the stick'. It is like a short mat version of bowls, which was good for learning the basics of the game, learning the draw shot.\"In halls or something you can roll out a carpet. They put a stick in the middle so you can't actually play with speed at the bowls. You have to play with deadweight to draw round the stick.\"Banks has since risen to seventh in the world, but the closest he has come to major singles success was in 2023, when he lost to England's Jamie Walker in the final.This time, the design engineer plotted his way past five-time champion and current world number two Paul Foster then two-time champion Paul Dawes before a dominant performance against fifth seed Paxton in the final.\"It feels like it is just a dream,\" Banks said. \"It doesn't feel like I am in reality to be honest.\"I don't think I really understand what I have done. When you think of all the great bowling players that have played in the past and I have done something that they haven't, it is just quite unbelievable.\"Along with compatriot Michael Stepney, Banks had started the week by beating Paxton and Northern Irishman Jason Greenslade to take the men's doubles crown.Then he and 21-year-old debutant Beth Riva edged out Foster and six-time women's champion Katherine Rednall to win the mixed during a week when Scotland's Julie Forrest secured the women's singles title for a third time.\"I just can't really believe it, because I don't think I have got as much natural talent as a lot of the other players have, but somehow I have managed to achieve this,\" a delighted Banks said of his unprecedented hat-trick. \"If I don't win anything else in bowls, at least I can always say I have done this.\"Banks, a member of Garioch Indoor Bowling club in Inverurie, suggests \"determination and just the mindset\" have been key to his success but admits to difficulty at getting his head around his newfound celebrity status.\"Since I have got to a higher level, one of the harder things I have found to deal with is the amount of messages you get from people,\" he added. \"I haven't replied to so many text messages and things - I will get round to them eventually.\"",
        "Jason Banks completed a Scottish clean sweep of the major titles in Norfolk",
        "Jason Banks thinks his history making triple World Indoor Bowls title success has come despite not having \"as much natural talent as a lot of the other players\".",
        "But the modest Scot has revealed that games of \"roon the stick\" while growing up in his native Aberdeenshire helped hone his game after taking up the sport at the age of 10.",
        "Eighteen years on, Banks defeated Englishman Robert Paxton, the 2020 champion, at Potters Resorts in Hopton-on-Sea on Sunday to add the singles title to the men's pairs and mixed pairs trophies he lifted a few days earlier.",
        "He admits it has still not \"sunk it at all\" that he has become the first to win all three at the same championships.",
        "'Closing bowling greens would come at a cost to our health'",
        "Forrest clinches World Indoor Bowls singles title",
        "\"The reason I started it was because my family play bowls as well,\" Banks told BBC Scotland. \"My parents and my grandparents, they were quite helpful when I was beginning my journey in bowls.",
        "\"I started off playing what in our area is called 'roon the stick'. It is like a short mat version of bowls, which was good for learning the basics of the game, learning the draw shot.",
        "\"In halls or something you can roll out a carpet. They put a stick in the middle so you can't actually play with speed at the bowls. You have to play with deadweight to draw round the stick.\"",
        "Banks has since risen to seventh in the world, but the closest he has come to major singles success was in 2023, when he lost to England's Jamie Walker in the final.",
        "This time, the design engineer plotted his way past five-time champion and current world number two Paul Foster then two-time champion Paul Dawes before a dominant performance against fifth seed Paxton in the final.",
        "\"It feels like it is just a dream,\" Banks said. \"It doesn't feel like I am in reality to be honest.",
        "\"I don't think I really understand what I have done. When you think of all the great bowling players that have played in the past and I have done something that they haven't, it is just quite unbelievable.\"",
        "Along with compatriot Michael Stepney, Banks had started the week by beating Paxton and Northern Irishman Jason Greenslade to take the men's doubles crown.",
        "Then he and 21-year-old debutant Beth Riva edged out Foster and six-time women's champion Katherine Rednall to win the mixed during a week when Scotland's Julie Forrest secured the women's singles title for a third time.",
        "\"I just can't really believe it, because I don't think I have got as much natural talent as a lot of the other players have, but somehow I have managed to achieve this,\" a delighted Banks said of his unprecedented hat-trick.",
        "\"If I don't win anything else in bowls, at least I can always say I have done this.\"",
        "Banks, a member of Garioch Indoor Bowling club in Inverurie, suggests \"determination and just the mindset\" have been key to his success but admits to difficulty at getting his head around his newfound celebrity status.",
        "\"Since I have got to a higher level, one of the harder things I have found to deal with is the amount of messages you get from people,\" he added. \"I haven't replied to so many text messages and things - I will get round to them eventually.\""
      ]
    },
    {
      "url": "https://www.bbc.com/sport/bowls/articles/cn4m3r97wxeo",
      "main_category": "sport",
      "detailed_category": "bowls",
      "topic": "Banks seals hat-trick of World Indoor Bowls titles",
      "content": [
        "Scotland's Jason Banks completed a historic hat-trick of titles by beating England's Robert Paxton in Sunday's open singles final of the World Indoor Bowls Championships.Banks, 28, defeated Paxton 10-4 11-9 at Potters Resorts, Hopton-on-Sea.With Michael Stepney, Banks had already won the open pairs title and also took the mixed pairs title with Beth Riva.\"I don't think it's going to change me, I'll just be the same person,\" Banks told BBC Sport after becoming the first person to complete such a world indoor treble.\"I'm just happy that I've managed to do something that nobody else has done. I was just really determined to get over the line - just kept pushing and pushing all the way, every end.\"Paxton was hoping to end a five-year wait for a world singles title and said: \"I've had a great two weeks here but today's not about me, it's about Jason. Superb, buddy, superb.\"It's always the weekend you want to get to, especially the Sunday. I didn't really perform today but Jason didn't give me a chance out there.\"",
        "Scotland's Jason Banks completed a historic hat-trick of titles by beating England's Robert Paxton in Sunday's open singles final of the World Indoor Bowls Championships.",
        "Banks, 28, defeated Paxton 10-4 11-9 at Potters Resorts, Hopton-on-Sea.",
        "With Michael Stepney, Banks had already won the open pairs title and also took the mixed pairs title with Beth Riva.",
        "\"I don't think it's going to change me, I'll just be the same person,\" Banks told BBC Sport after becoming the first person to complete such a world indoor treble.",
        "\"I'm just happy that I've managed to do something that nobody else has done. I was just really determined to get over the line - just kept pushing and pushing all the way, every end.\"",
        "Paxton was hoping to end a five-year wait for a world singles title and said: \"I've had a great two weeks here but today's not about me, it's about Jason. Superb, buddy, superb.",
        "\"It's always the weekend you want to get to, especially the Sunday. I didn't really perform today but Jason didn't give me a chance out there.\"",
        "Banks to meet Paxton in World Indoor Bowls final",
        "Holder Anderson beaten by Gourlay in world quarters"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/bowls/articles/cvgen981jjeo",
      "main_category": "sport",
      "detailed_category": "bowls",
      "topic": "Banks to meet Paxton in World Indoor Bowls final",
      "content": [
        "Scotland's Jason Banks could complete a hat-trick of victories when he meets England's Robert Paxton in Sunday's open singles final of the World Indoor Bowls Championships.Banks beat Englishman Mark Dawes 8-4 8-4 and Paxton overcame Scotsman David Gourlay 11-2 5-10 2-1 in Saturday's semi-finals at Potters Resorts, Hopton-on-Sea.With Michael Stepney, Banks has already won the open pairs title and also took the mixed pairs title with Beth Riva.Paxton is hoping to end a five-year wait for a world singles title.Sunday's final will be shown live on BBC Two and iPlayer from 14:40 GMT",
        "Scotland's Jason Banks could complete a hat-trick of victories when he meets England's Robert Paxton in Sunday's open singles final of the World Indoor Bowls Championships.",
        "Banks beat Englishman Mark Dawes 8-4 8-4 and Paxton overcame Scotsman David Gourlay 11-2 5-10 2-1 in Saturday's semi-finals at Potters Resorts, Hopton-on-Sea.",
        "With Michael Stepney, Banks has already won the open pairs title and also took the mixed pairs title with Beth Riva.",
        "Paxton is hoping to end a five-year wait for a world singles title.",
        "Sunday's final will be shown live on BBC Two and iPlayer from 14:40 GMT",
        "Holder Anderson beaten by Gourlay in world quarters"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/bowls/articles/cy9lx50q4nzo",
      "main_category": "sport",
      "detailed_category": "bowls",
      "topic": "Holder Anderson beaten by Gourlay in world quarters",
      "content": [
        "Reigning champion Stewart Anderson has been knocked out of the World Indoor Bowls by fellow Scot David Gourlay in the quarter-finals. Gourlay, who lifted the trophy in 1996, beat the top seed and three-time champion 8-6 9-7 at Potters in Great Yarmouth.The eighth seed will face Robert Paxton in Saturday's semi-finals after the fifth-seeded 2020 champion beat fellow Englishman Les Gillett, seeded four and who won it in 2022, 10-4 7-5.In the other all-England quarter-final, two-time champion Mark Dawes, the sixth seed, edged out qualifier Paul Hartley 5-7 7-6 2-0.Dawes will play seventh seed Jason Banks, who beat five-time champion and fellow Scot Paul Foster 10-4 3-10 2-1.All matches are broadcast live on BBC Sport.",
        "David Gourlay has beaten tournament favourite Stewart Anderson",
        "Reigning champion Stewart Anderson has been knocked out of the World Indoor Bowls by fellow Scot David Gourlay in the quarter-finals.",
        "Gourlay, who lifted the trophy in 1996, beat the top seed and three-time champion 8-6 9-7 at Potters in Great Yarmouth.",
        "The eighth seed will face Robert Paxton in Saturday's semi-finals after the fifth-seeded 2020 champion beat fellow Englishman Les Gillett, seeded four and who won it in 2022, 10-4 7-5.",
        "In the other all-England quarter-final, two-time champion Mark Dawes, the sixth seed, edged out qualifier Paul Hartley 5-7 7-6 2-0.",
        "Dawes will play seventh seed Jason Banks, who beat five-time champion and fellow Scot Paul Foster 10-4 3-10 2-1.",
        "All matches are broadcast live on BBC Sport."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/bowls/articles/c79dqn44ezwo",
      "main_category": "sport",
      "detailed_category": "bowls",
      "topic": "Forrest clinches World Indoor Bowls singles title",
      "content": [
        "Julie Forrest edged out Scottish compatriot Beth Riva to win the women's singles title at the World Indoor Bowls Championships in Norfolk.Forrest, 56, triumphed 11-8 8-9 2-0 to win the title for the third time after singles successes at Yarmouth in 2019 and 2020.\"I dug deep again. It was a matter of keeping my head and keep going,\" Forrest told BBC Sport.\"My brother-in-law died six months ago and I felt he was here with me. I feel he was there getting me through the games.\"Riva won the mixed doubles title on Tuesday alongside Jason Banks in what was the 21-year-old law student's first time competing in the tournament.\"I am delighted to compete in a final like that and it's been a great week. I've enjoyed every moment,\" Riva said.\"I was beaten today by the better player - Julie was unbelievably good. No matter how close I was getting my balls she was determined. She is a worthy winner and a legend who deserves the trophy.\"",
        "Scotland's Julie Forrest is ranked seventh in the world",
        "Julie Forrest edged out Scottish compatriot Beth Riva to win the women's singles title at the World Indoor Bowls Championships in Norfolk.",
        "Forrest, 56, triumphed 11-8 8-9 2-0 to win the title for the third time after singles successes at Yarmouth in 2019 and 2020.",
        "\"I dug deep again. It was a matter of keeping my head and keep going,\" Forrest told BBC Sport.",
        "\"My brother-in-law died six months ago and I felt he was here with me. I feel he was there getting me through the games.\"",
        "Riva won the mixed doubles title on Tuesday alongside Jason Banks in what was the 21-year-old law student's first time competing in the tournament.",
        "\"I am delighted to compete in a final like that and it's been a great week. I've enjoyed every moment,\" Riva said.",
        "\"I was beaten today by the better player - Julie was unbelievably good. No matter how close I was getting my balls she was determined. She is a worthy winner and a legend who deserves the trophy.\"",
        "Watch World Indoor Bowls Championships on the BBC",
        "Nurse swaps wards for world championship bowls",
        "Why World Bowls Tour reversed ban on Israeli competitors"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/bowls/articles/cm2153m527no",
      "main_category": "sport",
      "detailed_category": "bowls",
      "topic": "Riva and Banks hailed as 'future of bowls' after world mixed title",
      "content": [
        "Jason Banks and 21-year-old debutant Beth Riva were labelled \"the future of bowls\" after the Scottish pair lifted the mixed doubles title at the World Indoor Bowls in Norfolk.The 28-year-old Banks, who had won the men's doubles title 24 hours earlier with compatriot Michael Stepney, and Riva defeated former five-time men's champion Paul Foster and six-time women's champion Katherine Rednall 12-5 10-10 live on the BBC Sport website.Riva, who was watched from the stand by her uncle, six-time men's champion Alex Marshall, said: \"I hope I didn't put him through the ringer too much there.",
        "\"I've sat there supporting Paul so many times when he has been playing with Alex and Katherine is one of the best players on the planet, especially here on this rink. I am just trying to wrap my head around it.\"Banks, who had teamed up with Stepney to beat England's Robert Paxton and Northern Irishman Jason Greenslade 10-9 6-8 2-0, was particularly delighted to win the mixed \"with it being Beth's first time here\".Maxwell stands between Banks and a place in the singles quarter-finals when they meet on Thursday, while Riva takes on England's Chelsea Spencer in the women's semi-finals on Wednesday.Scotland's Foster said: \"I am very proud of her. She and Jason are the future of bowls. \"Katherine and I did struggle, but that was down to how Jason and Beth played. Jason was unbelievable in the first set.\"England's Rednall added that: \"For a first performance as a pair together, that was outstanding.\"",
        "Beth Riva and Jason Banks are also chasing singles titles",
        "Jason Banks and 21-year-old debutant Beth Riva were labelled \"the future of bowls\" after the Scottish pair lifted the mixed doubles title at the World Indoor Bowls in Norfolk.",
        "The 28-year-old Banks, who had won the men's doubles title 24 hours earlier with compatriot Michael Stepney, and Riva defeated former five-time men's champion Paul Foster and six-time women's champion Katherine Rednall 12-5 10-10 live on the BBC Sport website.",
        "Riva, who was watched from the stand by her uncle, six-time men's champion Alex Marshall, said: \"I hope I didn't put him through the ringer too much there.",
        "Watch World Indoor Bowls Championships on the BBC",
        "\"I've sat there supporting Paul so many times when he has been playing with Alex and Katherine is one of the best players on the planet, especially here on this rink. I am just trying to wrap my head around it.\"",
        "Banks, who had teamed up with Stepney to beat England's Robert Paxton and Northern Irishman Jason Greenslade 10-9 6-8 2-0, was particularly delighted to win the mixed \"with it being Beth's first time here\".",
        "Maxwell stands between Banks and a place in the singles quarter-finals when they meet on Thursday, while Riva takes on England's Chelsea Spencer in the women's semi-finals on Wednesday.",
        "Scotland's Foster said: \"I am very proud of her. She and Jason are the future of bowls.",
        "\"Katherine and I did struggle, but that was down to how Jason and Beth played. Jason was unbelievable in the first set.\"",
        "England's Rednall added that: \"For a first performance as a pair together, that was outstanding.\""
      ]
    },
    {
      "url": "https://www.bbc.com/sport/bowls/articles/ce3llnv1l21o",
      "main_category": "sport",
      "detailed_category": "bowls",
      "topic": "Why World Bowls Tour reversed ban on Israeli competitors",
      "content": [
        "Daniel Alonim will become the third Israeli to play at this year's World Indoor Bowls Championships when he faces Stewart Anderson on Monday.Alonim will meet the defending champion in the opening round of the singles competition as BBC TV coverage of the event begins.His compatriots Amnon Amar and Itai Rigbi played in the pairs event at Hopton-on-Sea, Norfolk earlier this month.But that was only after a ban imposed on the three players was revoked.What's the background?",
        "Tournament organiser the World Bowls Tour (WBT) announced on 31 December that invitations issued to the three Israeli players had been withdrawn.It said there had been a \"significant escalation in related political concerns\" following the involvement of Israeli bowlers at the Scottish International Open in August.\"This decision was not taken lightly and has been made in the best interests of the event's success and integrity,\" a statement said.Pro-Palestinian groups including the Norfolk Palestine Solidarity Campaign had urged supporters to sign a petition calling for the invitations to the World Indoor Bowls Championships to be rescinded.In its campaign, the group accused Israel of committing apartheid against Palestinians and called for its athletes to be banned under the 1977 Gleneagles Agreement - originally signed to exclude South Africa.Israel strongly denies accusations of apartheid.",
        "MP Rupert Lowe, whose Great Yarmouth constituency includes Hopton-on-Sea, said  he was \"genuinely disgusted\" and would \"fight\" the ban.\"Sport should be a unifier, and it should be above politics,\" he added on X.The Board of Deputies of British Jews described the ban as \"an overt act of discrimination against Israeli participants\".A government spokesperson told BBC Sport the decision was a matter for international sport federations and the national representatives to these federations but added it was \"deeply disappointing\".The sport's governing body, World Bowls - which is separate to the WBT - stressed Israeli players were still welcome to play in its events.",
        "Within hours of the initial decision being announced, the WBT released a second statement.That said Alonim, Amar and Rigbi could compete after \"significant additional security measures\" had been put in place.The WBT acknowledged it had been \"a difficult time for all involved\" and was pleased to reach an outcome that \"includes players for all supporting countries\".Lowe said: \"The World Bowls Tour have made the right decision.\"WBT board member Jason Parkinson told BBC Sport the period had been \"challenging\" but added: \"At the end of the day, it's a sporting event and everybody here is here to play sport.\"",
        "Rigbi and Amar were beaten 2-0 by Scots Mark Renwick and Kieran Ward on the opening day of the competition.\"Even though we lost, I think it is a victory for all of us,\" said Rigbi.\"It is a victory for sport, the values of the sport, the spirit of the sport.\"The World Bowls Tour gave us a warm welcome. We had a nice conversation with other players. It's a very sporting atmosphere and a very sporting event. What happened outside is beyond my understanding.\"",
        "The conflict between Israel and the Palestinian people is one of the longest-running and most violent disputes in the world. Its origins go back more than a century.The consequences of the historic dispute are still being felt, and include the latest war between Israel and Hamas in Gaza.On 7 October 2023, Hamas fighters launched an assault from Gaza, killing about                 1,200 people in Israel and taking more than 250 hostages.This triggered a massive Israeli military offensive in Gaza. More than 46,700 people have been killed, the majority of them women and children, according to the Hamas-run health ministry.After 15 months of fighting between Israel and Hamas, on Sunday a ceasefire came into effect in Gaza, and thousands of Gazans began to return home.",
        "Israel was initially banned from last year's Ice Hockey World Championships, but the decision was later reversed.Across other sports, there has been no ban on Israeli athletes - or the country's national teams.The Palestine Football Association had called for its Israeli counterpart to be suspended by Fifa, submitting an official proposal which the governing body is considering.",
        "Daniel Alonim will become the third Israeli to play at this year's World Indoor Bowls Championships when he faces Stewart Anderson on Monday.",
        "Alonim will meet the defending champion in the opening round of the singles competition as BBC TV coverage of the event begins.",
        "His compatriots Amnon Amar and Itai Rigbi played in the pairs event at Hopton-on-Sea, Norfolk earlier this month.",
        "But that was only after a ban imposed on the three players was revoked.",
        "What's the background?",
        "Tournament organiser the World Bowls Tour (WBT) announced on 31 December that invitations issued to the three Israeli players had been withdrawn.",
        "It said there had been a \"significant escalation in related political concerns\" following the involvement of Israeli bowlers at the Scottish International Open in August.",
        "\"This decision was not taken lightly and has been made in the best interests of the event's success and integrity,\" a statement said.",
        "Pro-Palestinian groups including the Norfolk Palestine Solidarity Campaign had urged supporters to sign a petition calling for the invitations to the World Indoor Bowls Championships to be rescinded.",
        "In its campaign, the group accused Israel of committing apartheid against Palestinians and called for its athletes to be banned under the 1977 Gleneagles Agreement - originally signed to exclude South Africa.",
        "Israel strongly denies accusations of apartheid.",
        "MP Rupert Lowe, whose Great Yarmouth constituency includes Hopton-on-Sea, said  he was \"genuinely disgusted\" and would \"fight\" the ban.",
        "\"Sport should be a unifier, and it should be above politics,\" he added on X.",
        "The Board of Deputies of British Jews described the ban as \"an overt act of discrimination against Israeli participants\".",
        "A government spokesperson told BBC Sport the decision was a matter for international sport federations and the national representatives to these federations but added it was \"deeply disappointing\".",
        "The sport's governing body, World Bowls - which is separate to the WBT - stressed Israeli players were still welcome to play in its events.",
        "Within hours of the initial decision being announced, the WBT released a second statement.",
        "That said Alonim, Amar and Rigbi could compete after \"significant additional security measures\" had been put in place.",
        "The WBT acknowledged it had been \"a difficult time for all involved\" and was pleased to reach an outcome that \"includes players for all supporting countries\".",
        "Lowe said: \"The World Bowls Tour have made the right decision.\"",
        "WBT board member Jason Parkinson told BBC Sport the period had been \"challenging\" but added: \"At the end of the day, it's a sporting event and everybody here is here to play sport.\"",
        "Rigbi and Amar were beaten 2-0 by Scots Mark Renwick and Kieran Ward on the opening day of the competition.",
        "\"Even though we lost, I think it is a victory for all of us,\" said Rigbi.",
        "\"It is a victory for sport, the values of the sport, the spirit of the sport.",
        "\"The World Bowls Tour gave us a warm welcome. We had a nice conversation with other players. It's a very sporting atmosphere and a very sporting event. What happened outside is beyond my understanding.\"",
        "The conflict between Israel and the Palestinian people is one of the longest-running and most violent disputes in the world. Its origins go back more than a century.",
        "The consequences of the historic dispute are still being felt, and include the latest war between Israel and Hamas in Gaza.",
        "On 7 October 2023, Hamas fighters launched an assault from Gaza, killing about                 1,200 people in Israel and taking more than 250 hostages.",
        "This triggered a massive Israeli military offensive in Gaza. More than 46,700 people have been killed, the majority of them women and children, according to the Hamas-run health ministry.",
        "After 15 months of fighting between Israel and Hamas, on Sunday a ceasefire came into effect in Gaza, and thousands of Gazans began to return home.",
        "Israel was initially banned from last year's Ice Hockey World Championships, but the decision was later reversed.",
        "Across other sports, there has been no ban on Israeli athletes - or the country's national teams.",
        "The Palestine Football Association had called for its Israeli counterpart to be suspended by Fifa, submitting an official proposal which the governing body is considering."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/bowls/articles/cgrnnxxd2v4o",
      "main_category": "sport",
      "detailed_category": "bowls",
      "topic": "Watch World Indoor Bowls Championships on the BBC",
      "content": [
        "For the 27th year, the prestigious World Indoor Bowls Championships is being held at Potters Resorts in Hopton-on-Sea, just outside Great Yarmouth, with BBC Sport coverage beginning on 20 January.Potters is to bowls what the Crucible Theatre is to snooker, where the best of the best come to compete.Favourite to win the open singles title this year is defending champion Stewart Anderson, who beat fellow Scot Alex Marshall in the final last January.Other titles up for grabs are the open pairs, mixed pairs and the ladies' singles, where Suffolk's defending champion Katherine Rednall will be hoping to add to her tally of six world titles.",
        "There is live action on BBC TV, Red Button, BBC iPlayer, the BBC Sport website and the BBC Sport mobile app.You can also follow updates through the live pages on the BBC Sport website and mobile app.",
        "All times are GMT. Coverage times are subject to late changes. The BBC is not responsible for any changes that may be made. Seedings in brackets.Monday, 20 JanuarySingles round one - Paul Foster MBE v Jamie Chestney: 10:00 - 11:30 - BBC Red Button, BBC iPlayer, BBC Sport website & appPairs final - Jason Banks & Michael Stepney v Robert Paxton & Jason Greenslade: 13:00 - 17:15 - BBC Two, BBC iPlayer, BBC Sport website & appSingles round one - Stewart Anderson v Daniel Alonim: 17:10 - 18:00 - BBC Red Button, BBC iPlayer, BBC Sport website & appSingles round one - Jason Greenslade v Sam Tolchard: 19:30 - 21:30 - BBC Red Button, BBC iPlayer, BBC Sport website & appTuesday, 21 JanuarySingles round two - Wayne Willgress v David Gourlay MBE: 10:00 - 11:30 - BBC Red Button, BBC iPlayer, BBC Sport website & appMixed pairs final: 13:00 - 17:15 - BBC Two, BBC iPlayer, BBC Sport website & appSingles round two - Robert Paxton v Darren Burnett: 17:10 - 18:00 - BBC Red Button, BBC iPlayer, BBC Sport website & appSingles round two - Michael Stepney v Les Gillett: 19:30 - 21:30 - BBC iPlayer, BBC Sport website & appWednesday, 22 JanuarySingles round two - Paul Hartley v Coleen Piketh: 10:00 - 11:30 - BBC Red Button, BBC iPlayer, BBC Sport website & appSingles round two: 13:00 - 17:15 - BBC Two, BBC iPlayer, Website & AppSemi-final one, women's singles: 17:10 - 18:00 - BBC Red Button, BBC iPlayer, BBC Sport website & appSemi-final two, women's singles: 19:30 - 21:30 - BBC iPlayer, BBC Sport website & appThursday, 23 JanuaryRound two, open singles - Martin Heitzman v Mark Dawes: 10:00 - 11:30 - BBC Red Button, BBC iPlayer, BBC Sport website & appWomen's singles final: 13:00 - 17:15 - BBC Two, BBC iPlayer, BBC Sport website & appRound two, open singles: 17:10 - 18:00 - BBC Red Button, BBC iPlayer, BBC Sport website & appRound two, open singles - Jason Banks v Alex Marshall MBE: 19:30 - 21:30 - BBC Red Button, BBC iPlayer, BBC Sport website & appFriday, 24 JanuaryQuarter-final one, open singles: 10:00 - 11:30 - BBC Red Button, BBC iPlayer, BBC Sport website & appQuarter-final two, open singles: 13:00 - 17:15 - BBC Two, BBC iPlayer, BBC Sport website & appQuarter-final three, open singles: 17:10 - 18:00 - BBC Red Button, BBC iPlayer, BBC Sport website & appQuarter-final four, open singles: 19:30 - 21:30 - BBC Red Button, BBC iPlayer, BBC Sport website & appSaturday, 25 JanuarySemi-final one, open singles: 13:00 - 17:05 - BBC Two, BBC iPlayer, BBC Sport website & appSemi-final two, open singles: 17:30 - 18:00 - BBC Red Button, BBC iPlayer, BBC Sport website & appSunday, 26 JanuaryOpen singles final14:40 - 17:15 - BBC Two, BBC iPlayer, BBC Sport website & app17:10 - 18:00 - BBC Red Button, BBC iPlayer, BBC Sport website & app",
        "The open singles winner receives the top prize of £50,000.",
        "Katherine Rednall and Stewart Anderson are the reigning singles champions",
        "For the 27th year, the prestigious World Indoor Bowls Championships is being held at Potters Resorts in Hopton-on-Sea, just outside Great Yarmouth, with BBC Sport coverage beginning on 20 January.",
        "Potters is to bowls what the Crucible Theatre is to snooker, where the best of the best come to compete.",
        "Favourite to win the open singles title this year is defending champion Stewart Anderson, who beat fellow Scot Alex Marshall in the final last January.",
        "Other titles up for grabs are the open pairs, mixed pairs and the ladies' singles, where Suffolk's defending champion Katherine Rednall will be hoping to add to her tally of six world titles.",
        "Bowl up, bowl up, for the greatest show in Hopton",
        "The decorator aiming to become world bowls champion",
        "There is live action on BBC TV, Red Button, BBC iPlayer, the BBC Sport website and the BBC Sport mobile app.",
        "You can also follow updates through the live pages on the BBC Sport website and mobile app.",
        "All times are GMT. Coverage times are subject to late changes. The BBC is not responsible for any changes that may be made. Seedings in brackets.",
        "Singles round one - Paul Foster MBE v Jamie Chestney: 10:00 - 11:30 - BBC Red Button, BBC iPlayer, BBC Sport website & app",
        "Pairs final - Jason Banks & Michael Stepney v Robert Paxton & Jason Greenslade: 13:00 - 17:15 - BBC Two, BBC iPlayer, BBC Sport website & app",
        "Singles round one - Stewart Anderson v Daniel Alonim: 17:10 - 18:00 - BBC Red Button, BBC iPlayer, BBC Sport website & app",
        "Singles round one - Jason Greenslade v Sam Tolchard: 19:30 - 21:30 - BBC Red Button, BBC iPlayer, BBC Sport website & app",
        "Singles round two - Wayne Willgress v David Gourlay MBE: 10:00 - 11:30 - BBC Red Button, BBC iPlayer, BBC Sport website & app",
        "Mixed pairs final: 13:00 - 17:15 - BBC Two, BBC iPlayer, BBC Sport website & app",
        "Singles round two - Robert Paxton v Darren Burnett: 17:10 - 18:00 - BBC Red Button, BBC iPlayer, BBC Sport website & app",
        "Singles round two - Michael Stepney v Les Gillett: 19:30 - 21:30 - BBC iPlayer, BBC Sport website & app",
        "Wednesday, 22 January",
        "Singles round two - Paul Hartley v Coleen Piketh: 10:00 - 11:30 - BBC Red Button, BBC iPlayer, BBC Sport website & app",
        "Singles round two: 13:00 - 17:15 - BBC Two, BBC iPlayer, Website & App",
        "Semi-final one, women's singles: 17:10 - 18:00 - BBC Red Button, BBC iPlayer, BBC Sport website & app",
        "Semi-final two, women's singles: 19:30 - 21:30 - BBC iPlayer, BBC Sport website & app",
        "Round two, open singles - Martin Heitzman v Mark Dawes: 10:00 - 11:30 - BBC Red Button, BBC iPlayer, BBC Sport website & app",
        "Women's singles final: 13:00 - 17:15 - BBC Two, BBC iPlayer, BBC Sport website & app",
        "Round two, open singles: 17:10 - 18:00 - BBC Red Button, BBC iPlayer, BBC Sport website & app",
        "Round two, open singles - Jason Banks v Alex Marshall MBE: 19:30 - 21:30 - BBC Red Button, BBC iPlayer, BBC Sport website & app",
        "Quarter-final one, open singles: 10:00 - 11:30 - BBC Red Button, BBC iPlayer, BBC Sport website & app",
        "Quarter-final two, open singles: 13:00 - 17:15 - BBC Two, BBC iPlayer, BBC Sport website & app",
        "Quarter-final three, open singles: 17:10 - 18:00 - BBC Red Button, BBC iPlayer, BBC Sport website & app",
        "Quarter-final four, open singles: 19:30 - 21:30 - BBC Red Button, BBC iPlayer, BBC Sport website & app",
        "Semi-final one, open singles: 13:00 - 17:05 - BBC Two, BBC iPlayer, BBC Sport website & app",
        "Semi-final two, open singles: 17:30 - 18:00 - BBC Red Button, BBC iPlayer, BBC Sport website & app",
        "14:40 - 17:15 - BBC Two, BBC iPlayer, BBC Sport website & app",
        "17:10 - 18:00 - BBC Red Button, BBC iPlayer, BBC Sport website & app",
        "The open singles winner receives the top prize of £50,000."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/bowls/articles/cvgm30ekrk9o",
      "main_category": "sport",
      "detailed_category": "bowls",
      "topic": "Israeli bowls players compete after ban revoked",
      "content": [
        "Israeli bowler Itai Rigbi says his appearance at the World Indoor Bowls Championships alongside playing partner Amnon Amar was \"a victory for the sport\" after their participation had looked in doubt.Tournament organisers last month revoked a ban on Israeli players which had been imposed amid a campaign by pro-Palestinian groups.Rigbi and Amar were beaten 2-0 in the pairs event by Scotland's Mark Renwick and Kieran Ward on the opening day of the competition in Norfolk on Friday.There were protests outside the venue before play.\"Even though we lost today, I think it is a victory for all of us,\" Rigbi said.\"It is a victory for sport, the values of the sport, the spirit of the sport. So even though we lost, to much better players than us, I feel like the sport won.\"Of course the initial decision I wasn't very happy with it, but then it was a 48-hour rollercoaster and the decision was corrected. I'm happy that the final decision is the correct decision and now I'm over it, it's fine.\"The pair intend to stay on to support compatriot Daniel Alonim in the singles event.\"The World Bowls Tour (WBT) gave us a warm welcome. We had a nice conversation with other players. It's a very sporting atmosphere and a very sporting event. What happened outside is beyond my understanding,\" Rigbi added.\"That's how it should be. We compete, because we are players. We are here to promote the values of the sport and that's what we are doing.\"The WBT said the trio could compete after \"significant additional security measures\" had been put in place.Pro-Palestinian groups have accused Israel of committing apartheid against Palestinians and called for its athletes to be banned under the 1977 Gleneagles Agreement - originally signed to exclude South Africa.Israel strongly denies accusations of apartheid.Since war broke out between Israel and Hamas 15 months ago, there have been instances of it impacting sport.The Palestinian Football Association has put pressure on world governing body Fifa to ban Israel from international football, although Israeli athletes have competed on the biggest stages, including the Olympics and Wimbledon.World Bowls Tour board member Jason Parkinson told BBC Sport that the period had been \"challenging\" but added: \"At the end of the day it's a sporting event and everybody here is here to play sport.\"People are always welcome to have their own opinion. And in my opinion what we've done is the correct thing.\"The championships run until 26 January.",
        "Itai Rigbi is one of three Israeli competitors at the World Indoor Bowls Championships",
        "Israeli bowler Itai Rigbi says his appearance at the World Indoor Bowls Championships alongside playing partner Amnon Amar was \"a victory for the sport\" after their participation had looked in doubt.",
        "Tournament organisers last month revoked a ban on Israeli players which had been imposed amid a campaign by pro-Palestinian groups.",
        "Rigbi and Amar were beaten 2-0 in the pairs event by Scotland's Mark Renwick and Kieran Ward on the opening day of the competition in Norfolk on Friday.",
        "There were protests outside the venue before play.",
        "\"Even though we lost today, I think it is a victory for all of us,\" Rigbi said.",
        "\"It is a victory for sport, the values of the sport, the spirit of the sport. So even though we lost, to much better players than us, I feel like the sport won.",
        "\"Of course the initial decision I wasn't very happy with it, but then it was a 48-hour rollercoaster and the decision was corrected. I'm happy that the final decision is the correct decision and now I'm over it, it's fine.\"",
        "The pair intend to stay on to support compatriot Daniel Alonim in the singles event.",
        "\"The World Bowls Tour (WBT) gave us a warm welcome. We had a nice conversation with other players. It's a very sporting atmosphere and a very sporting event. What happened outside is beyond my understanding,\" Rigbi added.",
        "\"That's how it should be. We compete, because we are players. We are here to promote the values of the sport and that's what we are doing.\"",
        "The WBT said the trio could compete after \"significant additional security measures\" had been put in place.",
        "Pro-Palestinian groups have accused Israel of committing apartheid against Palestinians and called for its athletes to be banned under the 1977 Gleneagles Agreement - originally signed to exclude South Africa.",
        "Israel strongly denies accusations of apartheid.",
        "Since war broke out between Israel and Hamas 15 months ago, there have been instances of it impacting sport.",
        "The Palestinian Football Association has put pressure on world governing body Fifa to ban Israel from international football, although Israeli athletes have competed on the biggest stages, including the Olympics and Wimbledon.",
        "World Bowls Tour board member Jason Parkinson told BBC Sport that the period had been \"challenging\" but added: \"At the end of the day it's a sporting event and everybody here is here to play sport.",
        "\"People are always welcome to have their own opinion. And in my opinion what we've done is the correct thing.\"",
        "The championships run until 26 January."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/bowls/articles/c5ydzk04zl1o",
      "main_category": "sport",
      "detailed_category": "bowls",
      "topic": "World Bowls Tour revokes ban on Israeli bowlers",
      "content": [
        "Israeli players will be allowed to compete in January's World Indoor Bowls Championships after tournament organisers revoked a ban imposed amid a campaign by pro-Palestinian groups.The World Bowls Tour (WBT) had said in a statement that invitations issued to three Israeli players for the event in Hopton-on-Sea, Norfolk had been withdrawn.That came after a \"significant escalation in related political concerns\" following the involvement of Israeli bowlers at the Scottish International Open in August.The WBT said the decision \"was not taken lightly\" and had been made \"in the best interests of the event's success and integrity\".But in a new statement on Tuesday, it said Daniel Alonim, Amnon Amar and Itai Rigbi could now compete after \"significant additional security measures\" had been put in place.Alonim will play in the World Open Singles, while Amar and Rigbi will feature in the World Open Pairs.The WBT acknowledged it had been \"a difficult time for all involved\" and was pleased to reach an outcome that \"includes players for all supporting countries\".MP Rupert Lowe, whose Great Yarmouth constituency includes Hopton-on-Sea, welcomed the decision.Lowe, who said he was \"genuinely disgusted\" the players had been banned, wrote on X: \"The Israeli team will be welcomed in Great Yarmouth, and I wish them well for the event.\"The World Bowls Tour have made the right decision.\"",
        "The tournament organisers had faced pressure from several pro-Palestinian groups, including Palestine Action and the Palestine Solidarity Campaign, to introduce the ban.The Norfolk Palestine Solidarity Campaign had urged its supporters to sign a petition calling for the players' invitations to be rescinded.In its campaign, the group accused Israel of committing apartheid against Palestinians and called for its athletes to be banned under the 1977 Gleneagles Agreement - originally signed to exclude South Africa.Israel strongly denies accusations of apartheid.The Board of Deputies of British Jews described the initial ban as \"an overt act of discrimination against Israeli participants\".A government spokesperson told BBC Sport the decision was a matter for international sport federations and the national representatives to these federations but added it was \"deeply disappointing\".The sport's governing body, World Bowls - which is separate to the World Bowls Tour - had stressed Israeli players were still welcome to play in its events.The 14-month war between Israel and Hamas began when Hamas-led gunmen carried out an unprecedented attack on southern Israel on 7 October 2023, during which about 1,200 people were killed and 251 others were taken hostage.More than 45,000 Palestinians have been killed during the war, according to figures from Gaza's Hamas-run health ministry.The figures are often disputed by the Israeli government, which says almost 20,000 \"terrorists\" have been killed, but they are broadly accepted by United Nations agencies.Israel was initially banned from last year's Ice Hockey World Championships, but the decision was later reversed.Across other sports, there has been no ban on Israeli athletes - or the country's national teams.The Palestine Football Association has called for its Israeli counterpart to be suspended by world governing body Fifa, but no decision has yet been taken.",
        "The World Indoor Bowls Championships start on 10 January",
        "Israeli players will be allowed to compete in January's World Indoor Bowls Championships after tournament organisers revoked a ban imposed amid a campaign by pro-Palestinian groups.",
        "The World Bowls Tour (WBT) had said in a statement that invitations issued to three Israeli players for the event in Hopton-on-Sea, Norfolk had been withdrawn.",
        "That came after a \"significant escalation in related political concerns\" following the involvement of Israeli bowlers at the Scottish International Open in August.",
        "The WBT said the decision \"was not taken lightly\" and had been made \"in the best interests of the event's success and integrity\".",
        "But in a new statement on Tuesday, it said Daniel Alonim, Amnon Amar and Itai Rigbi could now compete after \"significant additional security measures\" had been put in place.",
        "Alonim will play in the World Open Singles, while Amar and Rigbi will feature in the World Open Pairs.",
        "The WBT acknowledged it had been \"a difficult time for all involved\" and was pleased to reach an outcome that \"includes players for all supporting countries\".",
        "MP Rupert Lowe, whose Great Yarmouth constituency includes Hopton-on-Sea, welcomed the decision.",
        "Lowe, who said he was \"genuinely disgusted\" the players had been banned, wrote on X: \"The Israeli team will be welcomed in Great Yarmouth, and I wish them well for the event.",
        "\"The World Bowls Tour have made the right decision.\"",
        "The tournament organisers had faced pressure from several pro-Palestinian groups, including Palestine Action and the Palestine Solidarity Campaign, to introduce the ban.",
        "The Norfolk Palestine Solidarity Campaign had urged its supporters to sign a petition calling for the players' invitations to be rescinded.",
        "In its campaign, the group accused Israel of committing apartheid against Palestinians and called for its athletes to be banned under the 1977 Gleneagles Agreement - originally signed to exclude South Africa.",
        "Israel strongly denies accusations of apartheid.",
        "The Board of Deputies of British Jews described the initial ban as \"an overt act of discrimination against Israeli participants\".",
        "A government spokesperson told BBC Sport the decision was a matter for international sport federations and the national representatives to these federations but added it was \"deeply disappointing\".",
        "The sport's governing body, World Bowls - which is separate to the World Bowls Tour - had stressed Israeli players were still welcome to play in its events.",
        "The 14-month war between Israel and Hamas began when Hamas-led gunmen carried out an unprecedented attack on southern Israel on 7 October 2023, during which about 1,200 people were killed and 251 others were taken hostage.",
        "More than 45,000 Palestinians have been killed during the war, according to figures from Gaza's Hamas-run health ministry.",
        "The figures are often disputed by the Israeli government, which says almost 20,000 \"terrorists\" have been killed, but they are broadly accepted by United Nations agencies.",
        "Israel was initially banned from last year's Ice Hockey World Championships, but the decision was later reversed.",
        "Across other sports, there has been no ban on Israeli athletes - or the country's national teams.",
        "The Palestine Football Association has called for its Israeli counterpart to be suspended by world governing body Fifa, but no decision has yet been taken."
      ]
    }
  ]
}