{
  "scraped_at": "2025-10-27T18:56:59.800545",
  "total_articles": 18,
  "category": "motorsport",
  "articles_per_category": 100,
  "articles": [
    {
      "url": "https://www.bbc.com/sport/motorsport/articles/cn8x40qvvw9o",
      "main_category": "sport",
      "detailed_category": "motorsport",
      "topic": "Marquez wins in Malaysia but crash mars Moto3 race",
      "content": [
        "Spain's Alex Marquez cruised to his third win of the season with victory at the Malaysian Grand Prix.The 29-year-old Gresini rider finished second in the sprint race on Saturday to clinch second place overall in the MotoGP World Championship behind the champion, his brother Marc Marquez.And he went one better on Sunday, finishing 2.676 seconds clear of fellow Spaniard Pedro Acosta.It is the first time Alex Marquez has won outside of Spain this year, following success at the Spanish and Catalan Grands Prix.Marquez opened up a healthy lead early on in the 20-lap race, overtaking Acosta before reeling in Italy's Francesco Bagnaia.Pole-sitter Bagnaia, who won Saturday's sprint race, looked on course for third place before a bike issue forced him to retire on lap 18.Honda's Joan Mir took advantage and clinched the final podium spot at a hot and humid Sepang circuit.World champion Marc Marquez, who won his seventh MotoGP title in Japan last month, missed the race because of a season-ending collarbone injury.",
        "Following his win, Marquez said his \"prayers and thoughts are with the Moto3 guys\" after a serious crash in the earlier Moto3 race.Noah Dettwiler will need to undergo \"multiple surgeries\" after a collision with newly crowned world champion Jose Antonio Rueda, his CIP Green Power team has confirmed.The race was delayed and shortened after the incident, with the race medical director confirming both riders were airlifted to hospital but were conscious.\"Noah Dettwiler was involved in a serious accident,\" his team said. \"He will need to undergo multiple surgeries.\"Noah is a true fighter, and the entire CIP Green Power team is right behind him. We will keep you updated as soon as possible.\"MotoGP provided an update on Rueda, stating: \"Moto3 rider #99 Rueda is awake and alert, with a suspected hand fracture and a number of contusions.\"",
        "Alex Marquez secured second place in the MotoGP standings yesterday",
        "Spain's Alex Marquez cruised to his third win of the season with victory at the Malaysian Grand Prix.",
        "The 29-year-old Gresini rider finished second in the sprint race on Saturday to clinch second place overall in the MotoGP World Championship behind the champion, his brother Marc Marquez.",
        "And he went one better on Sunday, finishing 2.676 seconds clear of fellow Spaniard Pedro Acosta.",
        "It is the first time Alex Marquez has won outside of Spain this year, following success at the Spanish and Catalan Grands Prix.",
        "Marquez opened up a healthy lead early on in the 20-lap race, overtaking Acosta before reeling in Italy's Francesco Bagnaia.",
        "Pole-sitter Bagnaia, who won Saturday's sprint race, looked on course for third place before a bike issue forced him to retire on lap 18.",
        "Honda's Joan Mir took advantage and clinched the final podium spot at a hot and humid Sepang circuit.",
        "World champion Marc Marquez, who won his seventh MotoGP title in Japan last month, missed the race because of a season-ending collarbone injury.",
        "Following his win, Marquez said his \"prayers and thoughts are with the Moto3 guys\" after a serious crash in the earlier Moto3 race.",
        "Noah Dettwiler will need to undergo \"multiple surgeries\" after a collision with newly crowned world champion Jose Antonio Rueda, his CIP Green Power team has confirmed.",
        "The race was delayed and shortened after the incident, with the race medical director confirming both riders were airlifted to hospital but were conscious.",
        "\"Noah Dettwiler was involved in a serious accident,\" his team said. \"He will need to undergo multiple surgeries.",
        "\"Noah is a true fighter, and the entire CIP Green Power team is right behind him. We will keep you updated as soon as possible.\"",
        "MotoGP provided an update on Rueda, stating: \"Moto3 rider #99 Rueda is awake and alert, with a suspected hand fracture and a number of contusions.\""
      ]
    },
    {
      "url": "https://www.bbc.com/sport/formula1/articles/c364wr0rl98o",
      "main_category": "sport",
      "detailed_category": "motorsport",
      "topic": "From horses to horsepower - Lloyd dreaming of F1",
      "content": [
        "She is a former showjumper who swapped horses for horsepower.Since starting motorsport four years ago, Ella Lloyd is already making her mark - and ruffling some feathers.\"The males don't like to get overtaken by females - you can tell that from their driving,\" the 20-year-old said. \"They're a bit more aggressive, but I give it back to them and they stop.\"I want to beat the boys. I want to beat the girls. I want to be first.\"Pontypridd-born Lloyd wants to take on everyone when it comes to the mixed-field F4 British Championship but she also has her eyes on success in the F1 Academy.The Formula 4-level women's-only competition is designed to give young women in motorsport a direct pathway into the higher levels of single-seater racing.Lloyd currently sits third in the F1 Academy standings - the best of any British driver - with only one race to go. She has achieved five podium finishes, including a race victory in Jeddah and is hoping to finish her first full season in the Academy in style, at Las Vegas in November.\"I'm feeling pretty confident. It's a new track for myself, the team and the whole grid, so it's going to be a massive learning curve going into the race weekend,\" Lloyd said.",
        "Quick changes of direction are familiar to the Welsh driver.A former showjumper and skier, Lloyd only started motorsport at 16 and not via the typical karting route a lot of her peers used.\"There's always going to be disadvantages to not doing karting when you first start off - I had a lack of racecraft and knowledge about the driving side,\" she said.\"But I'm in my fourth year now and I've learned as much as possible so I think I'm quite even to most drivers.\"[In showjumping] you've got to have a feel for your animal, in skiing you've got to have a feel of what's underneath and that transfers well because you've got to have a good feel of what's happening with the car and what the car is doing.\"",
        "Lloyd is one of only two female drivers having to juggle the F1 Academy with the mixed-field F4 British Championship this season.Sharing the track with male drivers at this level is not something that worries Lloyd at all, despite the \"mixed views\" some peers have.\"I think you've just got to put your stamp down and get your elbows out a little bit and be like, yeah, I'm here to do the same thing as you are, and I'm not going to get pushed about. \"I'm just as tough as you are, so you've kind of got to put them back in their place and put them in their box, and they're all right then.\"At the end of the day we're all in equal machinery, we're all in cars that do the same thing. So it doesn't really make a difference to me whether I'm racing against females or a mixed grid.\"Lloyd hopes she and the other racers in the F1 Academy can pave the way for a new generation of girls to see motorsport as a career - and not just on the track.\"There's a lot more females participating in the karting races and coming up through the ranks, which is nice to see,\" she said.\"Since I've started there's been quite a lot of females coming into the sport and not just drivers - mechanics and engineers. It's great to see.\"",
        "Lloyd has been announced as an Envision Racing test driver for Formula E's Women's Test day in Valencia on Friday, 31 October, where she will be at the wheel of the current GEN3 Evo race car, which accelerates at a rate 30% faster than those used in Formula 1.But the goal is clear for the 20-year-old.She became the only female driver in the McLaren driver development programme last year, and is hoping to follow in the footsteps of seven-time Formula 1 world champion Lewis Hamilton and current McLaren driver Lando Norris, who both graduated through the programme.\"My end goal is to keep progressing up the ladder, and obviously to get to F1 one day.\"If Lloyd was to race in Formula 1 she could become the first female driver to enter a grand prix since Italian racer Giovanna Amati in 1992. To get there she would most likely have to take the next step to Formula 3 - and judging from her current trajectory that may happen sooner rather than later.",
        "Ella Lloyd is currently third in her rookie season in the F1 Academy",
        "She is a former showjumper who swapped horses for horsepower.",
        "Since starting motorsport four years ago, Ella Lloyd is already making her mark - and ruffling some feathers.",
        "\"The males don't like to get overtaken by females - you can tell that from their driving,\" the 20-year-old said. \"They're a bit more aggressive, but I give it back to them and they stop.",
        "\"I want to beat the boys. I want to beat the girls. I want to be first.\"",
        "Pontypridd-born Lloyd wants to take on everyone when it comes to the mixed-field F4 British Championship but she also has her eyes on success in the F1 Academy.",
        "The Formula 4-level women's-only competition is designed to give young women in motorsport a direct pathway into the higher levels of single-seater racing.",
        "Lloyd currently sits third in the F1 Academy standings - the best of any British driver - with only one race to go.",
        "She has achieved five podium finishes, including a race victory in Jeddah and is hoping to finish her first full season in the Academy in style, at Las Vegas in November.",
        "\"I'm feeling pretty confident. It's a new track for myself, the team and the whole grid, so it's going to be a massive learning curve going into the race weekend,\" Lloyd said.",
        "This video can not be played",
        "\"I want to be first.\" Ella Lloyd has been racing against men and women this season.",
        "Quick changes of direction are familiar to the Welsh driver.",
        "A former showjumper and skier, Lloyd only started motorsport at 16 and not via the typical karting route a lot of her peers used.",
        "\"There's always going to be disadvantages to not doing karting when you first start off - I had a lack of racecraft and knowledge about the driving side,\" she said.",
        "\"But I'm in my fourth year now and I've learned as much as possible so I think I'm quite even to most drivers.",
        "\"[In showjumping] you've got to have a feel for your animal, in skiing you've got to have a feel of what's underneath and that transfers well because you've got to have a good feel of what's happening with the car and what the car is doing.\"",
        "Lloyd is one of only two female drivers having to juggle the F1 Academy with the mixed-field F4 British Championship this season.",
        "Sharing the track with male drivers at this level is not something that worries Lloyd at all, despite the \"mixed views\" some peers have.",
        "\"I think you've just got to put your stamp down and get your elbows out a little bit and be like, yeah, I'm here to do the same thing as you are, and I'm not going to get pushed about.",
        "\"I'm just as tough as you are, so you've kind of got to put them back in their place and put them in their box, and they're all right then.",
        "\"At the end of the day we're all in equal machinery, we're all in cars that do the same thing. So it doesn't really make a difference to me whether I'm racing against females or a mixed grid.\"",
        "Lloyd hopes she and the other racers in the F1 Academy can pave the way for a new generation of girls to see motorsport as a career - and not just on the track.",
        "\"There's a lot more females participating in the karting races and coming up through the ranks, which is nice to see,\" she said.",
        "\"Since I've started there's been quite a lot of females coming into the sport and not just drivers - mechanics and engineers. It's great to see.\"",
        "Lloyd has been announced as an Envision Racing test driver for Formula E's Women's Test day in Valencia on Friday, 31 October, where she will be at the wheel of the current GEN3 Evo race car, which accelerates at a rate 30% faster than those used in Formula 1.",
        "But the goal is clear for the 20-year-old.",
        "She became the only female driver in the McLaren driver development programme last year, and is hoping to follow in the footsteps of seven-time Formula 1 world champion Lewis Hamilton and current McLaren driver Lando Norris, who both graduated through the programme.",
        "\"My end goal is to keep progressing up the ladder, and obviously to get to F1 one day.\"",
        "If Lloyd was to race in Formula 1 she could become the first female driver to enter a grand prix since Italian racer Giovanna Amati in 1992.",
        "To get there she would most likely have to take the next step to Formula 3 - and judging from her current trajectory that may happen sooner rather than later."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/motorsport/articles/cvgkdryp57do",
      "main_category": "sport",
      "detailed_category": "motorsport",
      "topic": "'It hasn't sunk in' - Creighton wins British rally title",
      "content": [
        "Northern Ireland's William Creighton says winning the British Rally Championship title for the first time \"hasn't sunk in\".Creighton and co-driver Liam Regan finished fourth at the Cambrian Rally to comfortably claim top spot.The 27-year-old Motorsport Ireland Rally Academy driver needed to finish no lower than eighth to win the title and he duly obliged with a safe drive in his Toyota GR Yaris.It was a stark contrast in emotions for Creighton compared with 12 months ago, when he narrowly missed out on the BRC title to Chris Ingram at the final round of the season.It is the latest success in Creighton's growing resume, as the BRC title comes after triumphs in the Junior World and British Rally Championships.Saturday's composed drive puts Creighton on a list of BRC champions including rallying legend Colin McRae and current World Rally Championship points leader Elfyn Evans.The Moira driver thanked Motorsport Ireland, his Melvyn Evans team, sponsors and supporters for a \"sensational\" year.\"Today, we join a staggering list of legends,\" Creighton posted on social media.\"[Colin and Jimmy] McRae, [Ari] Vatanen, [Roger] Clark, [Hannu] Mikkola…the list goes on and now me and Liam join that line up.\"The Junior BRC was one of the first places it all started for us, and it's really not sunk in yet.\"Creighton and Regan won the opening round of the season with a dominant victory on the East Riding Stages and, after finishing in second place at the Carlisle Stages, he stormed to victory on the Grampian Forest Rally to take control of the title battle. The crew finished third in the BRC at Rali Ceredigion in September, which also ran as part of the European Rally Championship.The rally was won by Max McRae, nephew of the late McRae. Creighton's title challengers Romet Jurgenson and Meirion Evans, who both needed to win in Wales, were second and third.McRae, 21, is the fourth driver across three generations of his family to win in the BRC after his grandfather and five-time champion Jimmy, his father Alister and 1995 WRC champion Colin.There was also Irish success in the Junior BRC as Donegal's Kyle McBride took the title by winning his class at the Cambrian for the fourth time in six events.",
        "William Creighton finished fourth at the Cambrian Rally to seal the title",
        "Northern Ireland's William Creighton says winning the British Rally Championship title for the first time \"hasn't sunk in\".",
        "Creighton and co-driver Liam Regan finished fourth at the Cambrian Rally to comfortably claim top spot.",
        "The 27-year-old Motorsport Ireland Rally Academy driver needed to finish no lower than eighth to win the title and he duly obliged with a safe drive in his Toyota GR Yaris.",
        "It was a stark contrast in emotions for Creighton compared with 12 months ago, when he narrowly missed out on the BRC title to Chris Ingram at the final round of the season.",
        "It is the latest success in Creighton's growing resume, as the BRC title comes after triumphs in the Junior World and British Rally Championships.",
        "Saturday's composed drive puts Creighton on a list of BRC champions including rallying legend Colin McRae and current World Rally Championship points leader Elfyn Evans.",
        "The Moira driver thanked Motorsport Ireland, his Melvyn Evans team, sponsors and supporters for a \"sensational\" year.",
        "\"Today, we join a staggering list of legends,\" Creighton posted on social media.",
        "\"[Colin and Jimmy] McRae, [Ari] Vatanen, [Roger] Clark, [Hannu] Mikkola…the list goes on and now me and Liam join that line up.",
        "\"The Junior BRC was one of the first places it all started for us, and it's really not sunk in yet.\"",
        "Creighton and Regan won the opening round of the season with a dominant victory on the East Riding Stages and, after finishing in second place at the Carlisle Stages, he stormed to victory on the Grampian Forest Rally to take control of the title battle.",
        "The crew finished third in the BRC at Rali Ceredigion in September, which also ran as part of the European Rally Championship.",
        "The rally was won by Max McRae, nephew of the late McRae. Creighton's title challengers Romet Jurgenson and Meirion Evans, who both needed to win in Wales, were second and third.",
        "McRae, 21, is the fourth driver across three generations of his family to win in the BRC after his grandfather and five-time champion Jimmy, his father Alister and 1995 WRC champion Colin.",
        "There was also Irish success in the Junior BRC as Donegal's Kyle McBride took the title by winning his class at the Cambrian for the fourth time in six events."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/motorsport/articles/c5yp5x2jv98o",
      "main_category": "sport",
      "detailed_category": "motorsport",
      "topic": "Champion Marquez ends season early through injury",
      "content": [
        "MotoGP champion Marc Marquez has ended his season three races early after suffering a collarbone injury at the Indonesian Grand Prix earlier this month.A week after winning his seventh premier class title at the Japanese Grand Prix, Marquez suffered the injury in a collision with Aprilia's Marco Bezzecchi on the opening lap in Indonesia.The 32-year-old Spaniard was expected to return for the last two rounds in Portugal and Valencia.But the Ducati rider has opted not to rush back from the injury and will spend four weeks with his arm immobilised before beginning rehabilitation.",
        "\"Analysing the entire situation, we believe that the most appropriate, clever and consistent course of action is to respect the biological timing of the injury, even if that means I will no longer be able to race this season,\" Marquez said.\"We know that a difficult winter awaits us, with a lot of work, to recover my muscles to 100% and be ready for 2026.\"Ducati's test rider Michele Pirro replaced Marquez at the Australian Grand Prix but the Italian manufacturer has not yet confirmed whether he will also race in the final rounds.Marquez, who will also miss the post-season test in Cheste, tops the standings with 545 points, above his brother Alex (379) and Marco Bezzecchi (282).",
        "Marc Marquez clinched the MotoGP title with five races to spare",
        "MotoGP champion Marc Marquez has ended his season three races early after suffering a collarbone injury at the Indonesian Grand Prix earlier this month.",
        "A week after winning his seventh premier class title at the Japanese Grand Prix, Marquez suffered the injury in a collision with Aprilia's Marco Bezzecchi on the opening lap in Indonesia.",
        "The 32-year-old Spaniard was expected to return for the last two rounds in Portugal and Valencia.",
        "But the Ducati rider has opted not to rush back from the injury and will spend four weeks with his arm immobilised before beginning rehabilitation.",
        "\"Analysing the entire situation, we believe that the most appropriate, clever and consistent course of action is to respect the biological timing of the injury, even if that means I will no longer be able to race this season,\" Marquez said.",
        "\"We know that a difficult winter awaits us, with a lot of work, to recover my muscles to 100% and be ready for 2026.\"",
        "Ducati's test rider Michele Pirro replaced Marquez at the Australian Grand Prix but the Italian manufacturer has not yet confirmed whether he will also race in the final rounds.",
        "Marquez, who will also miss the post-season test in Cheste, tops the standings with 545 points, above his brother Alex (379) and Marco Bezzecchi (282).",
        "This video can not be played",
        "Seventh MotoGP title 'the most difficult challenge of my career'",
        "MotoGP title was 'an impossible dream' for Marquez",
        "Marquez's comeback from 'nightmare' to contender"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/motorsport/articles/cvgve964z25o",
      "main_category": "sport",
      "detailed_category": "motorsport",
      "topic": "'Nothing guaranteed' as Creighton aims for title",
      "content": [
        "Motorsport Ireland driver William Creighton says \"nothing is guaranteed\" as he looks to win the British Rally Championship title for the first time. Creighton and co-driver Liam Regan can secure the title by finishing eighth or above at the Cambrain Rally in Wales on Saturday.The 27-year-old year narrowly missed out on the BRC title to Chris Ingram in 2024 at the Cambrian Rally but is looking to go one better in this year's decider. \"The British Rally Championship is incredibly competitive, and every event this year has pushed us to improve,\" said Creighton, who will pilot a Toyota GR Yaris in Wales.\"To be in this position going into the final round is really satisfying, but nothing is guaranteed in rallying, especially on the Cambrian. \"We'll stick to our plan and aim to deliver another strong performance and hopefully, this time, we can finish the year with the result that our team, supporters, and of course, Liam and I have worked so hard for.\"It has been a strong campaign for Creighton and he will face competition from his Toyota team-mate Meirion Evans and M-Sport driver Romet Jurgenson, who are both in mathematical contention heading into the final rally of the season.While Creighton can secure the title with an eighth-place finish, both Evans and Estonia's Jurgenson need to hope the Northern Ireland driver fails to score or retires from the rally while they pick up maximum points.",
        "Creighton, a former Junior British and World Rally champion, won the opening round of the season with a dominant victory on the East Riding Stages and, after finishing in second place at the Carlisle Stages, he stormed to victory on the Grampian Forest Rally to take control of the title battle. Creighton and Regan finished third in the BRC at Rali Ceredigion in September, which also ran as part of the European Rally Championship.Knowing he needs a solid finish to join the likes of rallying legend Colin McRae and current World Rally Championship points leader Elfyn Evans as BRC champions, Creighton says he will keep the same mindset \"that's worked for us all year\".\"It's been a really strong season so far, and I'm happy with how we've continued our progression on both surfaces,\" added Creighton.\"The feeling in the car has been good all year, especially on gravel, and we've built a lot of confidence with every event.\"The Cambrian is always one of the toughest events of the year, they are proper World Rally Championship Stages which demand full commitment from start to finish. \"The plan for us is probably no different to any other event this season. Our approach has always been to prepare well, stay focused, and aim for a strong result.\"",
        "William Creighton is aiming to win the British Rally Championship for the first time",
        "Motorsport Ireland driver William Creighton says \"nothing is guaranteed\" as he looks to win the British Rally Championship title for the first time.",
        "Creighton and co-driver Liam Regan can secure the title by finishing eighth or above at the Cambrain Rally in Wales on Saturday.",
        "The 27-year-old year narrowly missed out on the BRC title to Chris Ingram in 2024 at the Cambrian Rally but is looking to go one better in this year's decider.",
        "\"The British Rally Championship is incredibly competitive, and every event this year has pushed us to improve,\" said Creighton, who will pilot a Toyota GR Yaris in Wales.",
        "\"To be in this position going into the final round is really satisfying, but nothing is guaranteed in rallying, especially on the Cambrian.",
        "\"We'll stick to our plan and aim to deliver another strong performance and hopefully, this time, we can finish the year with the result that our team, supporters, and of course, Liam and I have worked so hard for.\"",
        "It has been a strong campaign for Creighton and he will face competition from his Toyota team-mate Meirion Evans and M-Sport driver Romet Jurgenson, who are both in mathematical contention heading into the final rally of the season.",
        "While Creighton can secure the title with an eighth-place finish, both Evans and Estonia's Jurgenson need to hope the Northern Ireland driver fails to score or retires from the rally while they pick up maximum points.",
        "Armstrong claims first European Rally victory",
        "Creighton, a former Junior British and World Rally champion, won the opening round of the season with a dominant victory on the East Riding Stages and, after finishing in second place at the Carlisle Stages, he stormed to victory on the Grampian Forest Rally to take control of the title battle.",
        "Creighton and Regan finished third in the BRC at Rali Ceredigion in September, which also ran as part of the European Rally Championship.",
        "Knowing he needs a solid finish to join the likes of rallying legend Colin McRae and current World Rally Championship points leader Elfyn Evans as BRC champions, Creighton says he will keep the same mindset \"that's worked for us all year\".",
        "\"It's been a really strong season so far, and I'm happy with how we've continued our progression on both surfaces,\" added Creighton.",
        "\"The feeling in the car has been good all year, especially on gravel, and we've built a lot of confidence with every event.",
        "\"The Cambrian is always one of the toughest events of the year, they are proper World Rally Championship Stages which demand full commitment from start to finish.",
        "\"The plan for us is probably no different to any other event this season. Our approach has always been to prepare well, stay focused, and aim for a strong result.\""
      ]
    },
    {
      "url": "https://www.bbc.com/sport/motorsport/articles/czxn5lwd3ywo",
      "main_category": "sport",
      "detailed_category": "motorsport",
      "topic": "'Not the end we dreamed of' - crash ruins Rea finale",
      "content": [
        "In a career that brought six World Superbike Championship titles, 119 wins and 264 podiums, to finish it in the gravel trap was not the ending Jonathan Rea wanted. The intention had been for the Northern Ireland rider to call time on his glittering 17-year career at Sunday's final race of the season at Jerez.However, it was brought to a premature end when a knee injury sustained in an opening-lap crash of the earlier Superpole race ruled Rea out of one more start. For the 38-year-old, there were \"mixed emotions\" as he said: \"It's not the end we all dreamed of, but I'm very grateful to have had the career that I've had.\"Being ruled out of the season finale was a cruel way to depart the sport, but also brought an end to a difficult two-year spell with Yamaha, which he had described as \"stressful\" and a \"struggle\" - and a far cry from the six successive titles with Kawasaki from 2015 to 2020.\"I was frustrated to go down, and to be ruled out of my last race isn't how I wanted to write the end of the story,\" Rea told BBC Sport NI's Stephen Watson in Spain.\"I also have to be very content. I'm happy to close the chapter. \"It hasn't been the dream I imaged the last few seasons. It's the end of a story I'm happy to get out of and start a new story.\"",
        "The crash was the second of the weekend for Rea, who also ended Saturday's opening race in the gravel at Jerez. On Sunday morning, he was battling with Australian Remy Gardner on the opening lap and the pair collided, which sent both riders into the gravel trap and Rea was taken away from his stricken bike on a stretcher. Back in the paddock, he was walking gingerly and said early indications showed knee ligament damage. Rea added the moment he found out he would not be able to race one final time was emotional as he was with his team manager and wife, Tatia, who had so often been by his side along with their sons, Jake and Tyler. \"It's tough in one way because it's not how you imagined you finish,\" he added.\"But every story must come to an end and you don't get to decide how that ends. \"There's a mix of emotions but overall there's relief that it is done. The sport has given me so much but taken away a lot as well, so I'm happy to walk slowly out of it.\"",
        "The latter two years of Rea's World Superbike career could not contrast more with the unprecedented success he had in his golden era, where he broke record after record to become the championship's most decorated rider.But he hoped to be remembered for the good times, and compared it to MotoGP legend Valentino Rossi, who won six titles in motorcycle racing's premier class before his career faded out in 2021. \"This is a small chapter in a big book that we've written,\" added Rea, who started out with Honda in 2008.\"The great Valentino Rossi, I can't remember how his last season went, never mind his last race. I hope I will be remembered like that. \"I went down fighting and I hope that still gives inspiration to people. I'm 100% sure that I will be able to have no regrets and I finish my career content with what I have done.\"With strapping on his knee, Rea hobbled into his box in the pits and was greeted by his team with a 'Thank you JR' banner, before he was presented with a special helmet to mark his career.His father Johnny - a successful motorcycle racer himself back in the 1980s - said: \"We're proud of what he has achieved, but we're more proud of the person he is.\"I think he will be remembered for a long time.\"",
        "It was a dramatic Sunday at Jerez as Toprak Razgatlioglu won his third World Superbike title ahead of rival Nicolo Bulega after a tense final race.The BMW rider, who won the championship in 2021 and 2024, came into the weekend with a sizeable 39-point lead over Ducati's Bulega.  That margin dropped as Bulega won the opening race on Saturday in front of Razgatlioglu, but there was drama to come in the Superpole sprint race. Moments after Rea and Gardner had come together on the opening lap, Bulega went for a gap on the inside of leader Razgatlioglu, but the riders made contact and the defending champion slid into the gravel. Bulega was handed a long-lap penalty for the incident, but had enough pace in hand to win the sprint race and reduce Razgatlioglu's lead to 22 points.The Italian rider, 26, then controlled the main race to complete a weekend hat-trick of wins, but all eyes were on Razgatlioglu, who needed to finish 13th or above to claim the title.In the end, the 29-year-old charged from 10th to third place to celebrate in his final World Superbike race before he moves to MotoGP in 2026 with Yamaha. \"We did an incredible season. Thank you very much everyone, my team, everyone worked so hard,\" Razgatlioglu told TNT Sports.\"I love this paddock, I know all the teams, everyone is respectful. I'll really miss this paddock, but maybe in the future I will come back here again.\"",
        "Jonathan Rea suffered a knee injury in his crash with Remy Gardner on the opening lap of Sunday's Superpole race",
        "In a career that brought six World Superbike Championship titles, 119 wins and 264 podiums, to finish it in the gravel trap was not the ending Jonathan Rea wanted.",
        "The intention had been for the Northern Ireland rider to call time on his glittering 17-year career at Sunday's final race of the season at Jerez.",
        "However, it was brought to a premature end when a knee injury sustained in an opening-lap crash of the earlier Superpole race ruled Rea out of one more start.",
        "For the 38-year-old, there were \"mixed emotions\" as he said: \"It's not the end we all dreamed of, but I'm very grateful to have had the career that I've had.\"",
        "Being ruled out of the season finale was a cruel way to depart the sport, but also brought an end to a difficult two-year spell with Yamaha, which he had described as \"stressful\" and a \"struggle\" - and a far cry from the six successive titles with Kawasaki from 2015 to 2020.",
        "\"I was frustrated to go down, and to be ruled out of my last race isn't how I wanted to write the end of the story,\" Rea told BBC Sport NI's Stephen Watson in Spain.",
        "\"I also have to be very content. I'm happy to close the chapter.",
        "\"It hasn't been the dream I imaged the last few seasons. It's the end of a story I'm happy to get out of and start a new story.\"",
        "'Stressful last few years have been a struggle' - Rea",
        "'Retiring Rea's records could stand test of time'",
        "The crash was the second of the weekend for Rea, who also ended Saturday's opening race in the gravel at Jerez.",
        "On Sunday morning, he was battling with Australian Remy Gardner on the opening lap and the pair collided, which sent both riders into the gravel trap and Rea was taken away from his stricken bike on a stretcher.",
        "Back in the paddock, he was walking gingerly and said early indications showed knee ligament damage.",
        "Rea added the moment he found out he would not be able to race one final time was emotional as he was with his team manager and wife, Tatia, who had so often been by his side along with their sons, Jake and Tyler.",
        "\"It's tough in one way because it's not how you imagined you finish,\" he added.",
        "\"But every story must come to an end and you don't get to decide how that ends.",
        "\"There's a mix of emotions but overall there's relief that it is done. The sport has given me so much but taken away a lot as well, so I'm happy to walk slowly out of it.\"",
        "This video can not be played",
        "Rea has 'mixed emotions' as Superbike career ends",
        "The latter two years of Rea's World Superbike career could not contrast more with the unprecedented success he had in his golden era, where he broke record after record to become the championship's most decorated rider.",
        "But he hoped to be remembered for the good times, and compared it to MotoGP legend Valentino Rossi, who won six titles in motorcycle racing's premier class before his career faded out in 2021.",
        "\"This is a small chapter in a big book that we've written,\" added Rea, who started out with Honda in 2008.",
        "\"The great Valentino Rossi, I can't remember how his last season went, never mind his last race. I hope I will be remembered like that.",
        "\"I went down fighting and I hope that still gives inspiration to people. I'm 100% sure that I will be able to have no regrets and I finish my career content with what I have done.\"",
        "With strapping on his knee, Rea hobbled into his box in the pits and was greeted by his team with a 'Thank you JR' banner, before he was presented with a special helmet to mark his career.",
        "His father Johnny - a successful motorcycle racer himself back in the 1980s - said: \"We're proud of what he has achieved, but we're more proud of the person he is.",
        "\"I think he will be remembered for a long time.\"",
        "Toprak Razgatlioglu will head to MotoGP in 2026 as a three-time World Superbike champion",
        "It was a dramatic Sunday at Jerez as Toprak Razgatlioglu won his third World Superbike title ahead of rival Nicolo Bulega after a tense final race.",
        "The BMW rider, who won the championship in 2021 and 2024, came into the weekend with a sizeable 39-point lead over Ducati's Bulega.",
        "That margin dropped as Bulega won the opening race on Saturday in front of Razgatlioglu, but there was drama to come in the Superpole sprint race.",
        "Moments after Rea and Gardner had come together on the opening lap, Bulega went for a gap on the inside of leader Razgatlioglu, but the riders made contact and the defending champion slid into the gravel.",
        "Bulega was handed a long-lap penalty for the incident, but had enough pace in hand to win the sprint race and reduce Razgatlioglu's lead to 22 points.",
        "The Italian rider, 26, then controlled the main race to complete a weekend hat-trick of wins, but all eyes were on Razgatlioglu, who needed to finish 13th or above to claim the title.",
        "In the end, the 29-year-old charged from 10th to third place to celebrate in his final World Superbike race before he moves to MotoGP in 2026 with Yamaha.",
        "\"We did an incredible season. Thank you very much everyone, my team, everyone worked so hard,\" Razgatlioglu told TNT Sports.",
        "\"I love this paddock, I know all the teams, everyone is respectful. I'll really miss this paddock, but maybe in the future I will come back here again.\""
      ]
    },
    {
      "url": "https://www.bbc.com/sport/motorsport/articles/c3vnry7346ro",
      "main_category": "sport",
      "detailed_category": "motorsport",
      "topic": "Fernandez clinches maiden MotoGP victory",
      "content": [
        "Spain's Raul Fernandez secured his first win in MotoGP with victory at the Australian Grand Prix.The 24-year-old Trackhouse rider finished top of the podium after he passed the chequered flag 1.418 seconds clear of VR46 Ducati's Fabio di Giannantonio.Fernandez's Aprilia stablemate Marco Bezzecchi, who won the 13-lap sprint on Saturday, was third.Fernandez had pulled clear by lap 10 and built on the lead as the race progressed with an expected counter-attack from Bezzecchi, who had to serve two long lap penalties, failing to materialise.World champion Marc Marquez, who won his seventh MotoGP title in Japan last month, missed the race through injury.Marquez was involved in a crash with Bezzecchi in Indonesia and has had shoulder surgery, which is likely to keep him out of action for up to 16 weeks.While Fernandez, in his 76th grand prix, stole the glory, Marquez's brother Alex finished fourth to all but seal the runner-up spot in the overall standings.The Spanish Gresini rider is now 97 points clear of Bezzecchi with a maximum 111 at stake in the final three races.",
        "Raul Fernandez is racing in his fourth season in MotoGP",
        "Spain's Raul Fernandez secured his first win in MotoGP with victory at the Australian Grand Prix.",
        "The 24-year-old Trackhouse rider finished top of the podium after he passed the chequered flag 1.418 seconds clear of VR46 Ducati's Fabio di Giannantonio.",
        "Fernandez's Aprilia stablemate Marco Bezzecchi, who won the 13-lap sprint on Saturday, was third.",
        "Fernandez had pulled clear by lap 10 and built on the lead as the race progressed with an expected counter-attack from Bezzecchi, who had to serve two long lap penalties, failing to materialise.",
        "World champion Marc Marquez, who won his seventh MotoGP title in Japan last month, missed the race through injury.",
        "Marquez was involved in a crash with Bezzecchi in Indonesia and has had shoulder surgery, which is likely to keep him out of action for up to 16 weeks.",
        "While Fernandez, in his 76th grand prix, stole the glory, Marquez's brother Alex finished fourth to all but seal the runner-up spot in the overall standings.",
        "The Spanish Gresini rider is now 97 points clear of Bezzecchi with a maximum 111 at stake in the final three races."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/motorsport/articles/c201kp1549eo",
      "main_category": "sport",
      "detailed_category": "motorsport",
      "topic": "Ryde retains British Superbike Championship title",
      "content": [
        "Kyle Ryde has become the first rider since 2017 to win back-to-back British Superbike Championship titles.The 28-year-old beat rival Bradley Ray by 20 points to clinch the title at the final race of the season at Brands Hatch. Ryde has become the first champion to defend the BSB title since Shane Byrne's double in 2016 and 2017.The Yamaha rider headed into the final round with a 30-point margin over Ray, and looked to have put one hand on the title by finishing second in Sunday's sprint race behind Scott Redding, who won the opening two races.",
        "But, in a wet third race, Ray put pressure on Ryde by finishing second behind Danny Kent, but the championship leader kept his cool to cross the line in sixth place to wrap up the title. \"It's amazing, both me and Brad had such a good season,\" Ryde, who won six races and claimed 14 podiums in 33 races, told TNT Sports.\"It's a shame one of us had to lose. It means so much, not just to be but my team.\"Ryde's team-mate Glenn Irwin, who missed three rounds of the season with a pelvic injury, ended his campaign with an eighth and two 10th-placed finishes across the three races.In a day of championships at Brands Hatch, Irish rider Rhys Irwin claimed the British Supersport title by four points ahead of Ben Currie.Ukraine's Ilya Mikhalchik won the British Superstock title, while Barry Burrell triumphed in the BMW F900 R Cup.",
        "Kyle Ryde became the first rider to retain the British Superbike title since Shane Byrne in 2016 and 2017",
        "Kyle Ryde has become the first rider since 2017 to win back-to-back British Superbike Championship titles.",
        "The 28-year-old beat rival Bradley Ray by 20 points to clinch the title at the final race of the season at Brands Hatch.",
        "Ryde has become the first champion to defend the BSB title since Shane Byrne's double in 2016 and 2017.",
        "The Yamaha rider headed into the final round with a 30-point margin over Ray, and looked to have put one hand on the title by finishing second in Sunday's sprint race behind Scott Redding, who won the opening two races.",
        "But, in a wet third race, Ray put pressure on Ryde by finishing second behind Danny Kent, but the championship leader kept his cool to cross the line in sixth place to wrap up the title.",
        "\"It's amazing, both me and Brad had such a good season,\" Ryde, who won six races and claimed 14 podiums in 33 races, told TNT Sports.",
        "\"It's a shame one of us had to lose. It means so much, not just to be but my team.\"",
        "Ryde's team-mate Glenn Irwin, who missed three rounds of the season with a pelvic injury, ended his campaign with an eighth and two 10th-placed finishes across the three races.",
        "In a day of championships at Brands Hatch, Irish rider Rhys Irwin claimed the British Supersport title by four points ahead of Ben Currie.",
        "Ukraine's Ilya Mikhalchik won the British Superstock title, while Barry Burrell triumphed in the BMW F900 R Cup."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/motorsport/articles/c15p91z5ll5o",
      "main_category": "sport",
      "detailed_category": "motorsport",
      "topic": "Evans regains WRC lead with second place in CER",
      "content": [
        "Elfyn Evans has regained the lead in the World Rally Championship (WRC) with rival Sebastien Ogier losing ground after crashing at the Central European Rally (CER) in Passau.The 36-year-old Welsh driver finished second at CER behind winner Kalle Rovanpera, while previous series leader Ogier had to be content with picking up a maximum 10 Sunday bonus points.With two events to come in the 14-rally series - each offering a maximum 35 points - Toyota's Gazoo Racing occupy the top three WRC postions and have secured their fifth consecutive WRC manufacturers' title.Evans, with 247 points, is 13 ahead of both 25-year-old Rovanpera and eight-time World Champion Ogier, who are tied on 234.Twice-champion Rovanpera - who announced before the race he would leave WRC after this year - finished more than 43 seconds ahead of Evans, who grabbed the runners-up spot from Hyundai's Ott Tanak after placing second on the final stage.",
        "Dolgellau's Evans recovered from ninth place after a first-stage penalty having hit a haybale and collected 25 points from the weekend, compared to Rovanpera's 31.\"Huge congratulations to everyone at the team for another title, clearly the best team dominating, so we are super good as a team,\" said the Finn after his third rally win of the year.\"I'm hungry for this drivers' title, we increase our chances with this result. It won't be easy but we will try to continue.\"Ogier had led the event in Austria, Czech Republic and Germany for all of Thursday and Friday's stages, before puncturing and ripping the wheel off his Yaris Rally1 on Saturday's stage 10.However, the 41-year-old Frenchman took the honours on the final day, topping the Super Sunday standings and winning the final bonus-point powerstage.Reigning world champion Thierry Neuville's title defence is over after he crashed out on Sunday's opening run.The Belgian retired from seventh place after hitting the end of a bridge in an incident that led to stage 15 being cancelled.Neuville's misfortune meant Josh McErlean, from Northern Ireland, equalled his best finish in WRC1, placing seventh for the third time this year in his M-Sport Ford Puma.The drivers next head to Japan for round 13 from 6-9 November, before a finale in Saudi Arabia at the end of the month.",
        "1. Kalle Rovanpera (Finland), Toyota, 2 hours 36 minutes 20.1 seconds2. Elfyn Evans (Great Britain), Toyota, +43.7secs3. Ott Tanak (Estonia), Hyundai, +49.3secs4.  Takamoto Katsuta (Japan), Toyota, +1min 6.8secs5. Adrien Formaux (France), Hyundai, +2min 04.6secs6. Sami Pajari (Finland), Toyota. +2min 13.9secs7. Josh McErlean (Ireland), Ford, +5mins 48.8secs",
        "1. Elfyn Evans (Great Britain), Toyota, 247 points2. Sebastien Ogier (France), Toyota, 2343. Kalle Rovanpera (Finland), Toyota, 2344. Ott Tanak (Estonia), Hyundai, 1975. Thierry Neuville (Belgium), Hyundai, 1666. Takamoto Katsuta (Japan), Toyota, 1107. Adrien Formaux (France), Hyundai, 96Selected10. Josh McErlean (Ireland), Ford, 2614. Gus Greensmith (Great Britain), Skoda, 14",
        "Elfyn Evans and co-driver Scott Martin were World Rally Championship runners-up in 2020, 2021, 2023 and 2024",
        "Elfyn Evans has regained the lead in the World Rally Championship (WRC) with rival Sebastien Ogier losing ground after crashing at the Central European Rally (CER) in Passau.",
        "The 36-year-old Welsh driver finished second at CER behind winner Kalle Rovanpera, while previous series leader Ogier had to be content with picking up a maximum 10 Sunday bonus points.",
        "With two events to come in the 14-rally series - each offering a maximum 35 points - Toyota's Gazoo Racing occupy the top three WRC postions and have secured their fifth consecutive WRC manufacturers' title.",
        "Evans, with 247 points, is 13 ahead of both 25-year-old Rovanpera and eight-time World Champion Ogier, who are tied on 234.",
        "Twice-champion Rovanpera - who announced before the race he would leave WRC after this year - finished more than 43 seconds ahead of Evans, who grabbed the runners-up spot from Hyundai's Ott Tanak after placing second on the final stage.",
        "Dolgellau's Evans recovered from ninth place after a first-stage penalty having hit a haybale and collected 25 points from the weekend, compared to Rovanpera's 31.",
        "\"Huge congratulations to everyone at the team for another title, clearly the best team dominating, so we are super good as a team,\" said the Finn after his third rally win of the year.",
        "\"I'm hungry for this drivers' title, we increase our chances with this result. It won't be easy but we will try to continue.\"",
        "Ogier had led the event in Austria, Czech Republic and Germany for all of Thursday and Friday's stages, before puncturing and ripping the wheel off his Yaris Rally1 on Saturday's stage 10.",
        "However, the 41-year-old Frenchman took the honours on the final day, topping the Super Sunday standings and winning the final bonus-point powerstage.",
        "Reigning world champion Thierry Neuville's title defence is over after he crashed out on Sunday's opening run.",
        "The Belgian retired from seventh place after hitting the end of a bridge in an incident that led to stage 15 being cancelled.",
        "Neuville's misfortune meant Josh McErlean, from Northern Ireland, equalled his best finish in WRC1, placing seventh for the third time this year in his M-Sport Ford Puma.",
        "The drivers next head to Japan for round 13 from 6-9 November, before a finale in Saudi Arabia at the end of the month.",
        "1. Kalle Rovanpera (Finland), Toyota, 2 hours 36 minutes 20.1 seconds",
        "2. Elfyn Evans (Great Britain), Toyota, +43.7secs",
        "3. Ott Tanak (Estonia), Hyundai, +49.3secs",
        "4.  Takamoto Katsuta (Japan), Toyota, +1min 6.8secs",
        "5. Adrien Formaux (France), Hyundai, +2min 04.6secs",
        "6. Sami Pajari (Finland), Toyota. +2min 13.9secs",
        "7. Josh McErlean (Ireland), Ford, +5mins 48.8secs",
        "1. Elfyn Evans (Great Britain), Toyota, 247 points",
        "2. Sebastien Ogier (France), Toyota, 234",
        "3. Kalle Rovanpera (Finland), Toyota, 234",
        "4. Ott Tanak (Estonia), Hyundai, 197",
        "5. Thierry Neuville (Belgium), Hyundai, 166",
        "6. Takamoto Katsuta (Japan), Toyota, 110",
        "7. Adrien Formaux (France), Hyundai, 96",
        "10. Josh McErlean (Ireland), Ford, 26",
        "14. Gus Greensmith (Great Britain), Skoda, 14"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/motorsport/articles/c7492w8gzw4o",
      "main_category": "sport",
      "detailed_category": "motorsport",
      "topic": "Ipswich Witches celebrate first title for 27 years",
      "content": [
        "Ipswich Witches team boss Ritchie Hawkins admitted to feeling \"overwhelmed\" after seeing the team win their first league title since 1998.The Witches beat Leicester Lions 46-43 in the second leg of the Premiership play-off final at their own Foxhall track to win 93-86 on aggregate, as former world champion Jason Doyle top scored for them with 10 points.It was the club's 11th major trophy since they were founded in 1950 and first since their Knockout Cup win against Sheffield Tigers two years ago, but the outcome was only decided in the final heat of the night.\"It's been so many years coming, it was a tough night,\" Hawkins told BBC Radio Suffolk. \"We knew it would be a massive fight. I felt we needed to win [the first leg] at Leicester and that certainly took the pressure off a little bit. \"There's a massive expectation here. Six weeks after I took over as team manager we were bottom of the second division and three years later we were top of the top division - I'm proud of that but it took us another seven or eight years to finish top. \"Every week we have the best crowds in the country and we've got the best supporters, I love the club.\"",
        "Ipswich held a four-point lead from the first leg in Leicester but Adam Ellis was injured in a crash during that meeting so they had Keynan Rew in the line-up for the re-match as a guest rider.He contributed 7+1 points and Emil Sayfutdinov added 9+2 to his 11 points from the first leg on Monday.\"I've waited so long for this. We've been close a few times, we've made finals but always fallen short,\" said captain Danny King, who has been with the Witches since he was 16.\"We left it late but we got the job done. Leicester are a strong team who ride our track very well and they were actually outgating us, but we didn't give up, we just kept fighting all the way and got the result we deserved.\"It's the first time I've won the top league, it ticks a lot of boxes and to be able to do it with Ipswich, my home club as I call it, and to see the fans' faces and the emotion out there was amazing.\"Among the crowd was the town's mayor, Stefan Long, who was also present when they won the title in 1998 - then only nine years old.He said: \"I haven't seen a crowd like this in a long time, I can only hope it's a sign of things to come in the future. There were nerve-jangling moments but we got there bit by bit and the result speaks for itself. \"The memories just came flooding back of 1998 and being here seeing the emotion in the team's eyes and [promoter] Chris Louis' eyes. An absolute honour, it's one of the highlights of my year for sure.\"Promoter Louis rode in the last Ipswich team to become champions\"There's been a lot of blood, sweat and tears in the last 27 years before we got there again,\" he said. \"We made very hard work of it but I always had faith that they would have the grit to do it in the end.\"",
        "This video can not be played",
        "Ipswich Witches win British Speedway Premiership title",
        "Ipswich Witches team boss Ritchie Hawkins admitted to feeling \"overwhelmed\" after seeing the team win their first league title since 1998.",
        "The Witches beat Leicester Lions 46-43 in the second leg of the Premiership play-off final at their own Foxhall track to win 93-86 on aggregate, as former world champion Jason Doyle top scored for them with 10 points.",
        "It was the club's 11th major trophy since they were founded in 1950 and first since their Knockout Cup win against Sheffield Tigers two years ago, but the outcome was only decided in the final heat of the night.",
        "\"It's been so many years coming, it was a tough night,\" Hawkins told BBC Radio Suffolk. \"We knew it would be a massive fight. I felt we needed to win [the first leg] at Leicester and that certainly took the pressure off a little bit.",
        "\"There's a massive expectation here. Six weeks after I took over as team manager we were bottom of the second division and three years later we were top of the top division - I'm proud of that but it took us another seven or eight years to finish top.",
        "\"Every week we have the best crowds in the country and we've got the best supporters, I love the club.\"",
        "'The Ipswich Witches are British speedway Premiership champions' (BBC Radio Suffolk",
        "Ipswich held a four-point lead from the first leg in Leicester but Adam Ellis was injured in a crash during that meeting so they had Keynan Rew in the line-up for the re-match as a guest rider.",
        "He contributed 7+1 points and Emil Sayfutdinov added 9+2 to his 11 points from the first leg on Monday.",
        "\"I've waited so long for this. We've been close a few times, we've made finals but always fallen short,\" said captain Danny King, who has been with the Witches since he was 16.",
        "\"We left it late but we got the job done. Leicester are a strong team who ride our track very well and they were actually outgating us, but we didn't give up, we just kept fighting all the way and got the result we deserved.",
        "\"It's the first time I've won the top league, it ticks a lot of boxes and to be able to do it with Ipswich, my home club as I call it, and to see the fans' faces and the emotion out there was amazing.\"",
        "Among the crowd was the town's mayor, Stefan Long, who was also present when they won the title in 1998 - then only nine years old.",
        "He said: \"I haven't seen a crowd like this in a long time, I can only hope it's a sign of things to come in the future. There were nerve-jangling moments but we got there bit by bit and the result speaks for itself.",
        "\"The memories just came flooding back of 1998 and being here seeing the emotion in the team's eyes and [promoter] Chris Louis' eyes. An absolute honour, it's one of the highlights of my year for sure.\"",
        "Promoter Louis rode in the last Ipswich team to become champions",
        "\"There's been a lot of blood, sweat and tears in the last 27 years before we got there again,\" he said.",
        "\"We made very hard work of it but I always had faith that they would have the grit to do it in the end.\""
      ]
    },
    {
      "url": "https://www.bbc.com/sport/motorsport/articles/cr7m5311jm1o",
      "main_category": "sport",
      "detailed_category": "motorsport",
      "topic": "Veteran road racer Lougher announces retirement",
      "content": [
        "Veteran road racer Ian Lougher has announced his retirement from the sport after a 44-year career.The 62-year-old Welshman said it was a \"long, long time to still be racing\" but no rider could \"go on forever\".After starting his racing career in 1982, Lougher carved out a successful career on the Isle of Man's Mountain Course, coming third in his debut in the Manx Grand Prix (MGP) newcomers' race in 1983 before switching to the TT.Over the next four decades, he took the top spot on the podium 10 times in the June races.",
        "His final victory on the 37.7-mile course came last year in the MGP Lightweight race.",
        "But his tally of victories on the island was not restricted to the Mountain Course. He also secured 40 race wins at the Southern 100 races on the Billown Circuit in the south of the island.The Cardiff-born racer has also been a regular competitor at the North West 200, gathering eight wins at the Northern Ireland meeting.Reflecting on the longevity of his career, he said: \"I never imagined after that first outing in 1982 that I'd still be competing more than four decades later.\"I've always said I'd keep racing as long as I was competitive, and I like to think I've managed that. I'm not one for just riding around at the back.\"He said while he still did not \"get nervous going through the bottom of Bray Hill at 140mph, you can't go on forever, and I don't want to put my old body through any more\".\"I've had the privilege to race against so many great riders and meet some of the best people in the sport, and not many get to do that,\" he added.\"Racing has literally been my life.\"However, he said he would remain involved in the sport with a \"focus on the next generation\" through his team ILR Racing, which nurtures young talent.",
        "Read more stories from the Isle of Man on the BBC, watch BBC North West Tonight on BBC iPlayer and follow BBC Isle of Man on Facebook, external and X, external.",
        "The veteran racer has been a familiar face at motor racing events on the island for four decades",
        "Veteran road racer Ian Lougher has announced his retirement from the sport after a 44-year career.",
        "The 62-year-old Welshman said it was a \"long, long time to still be racing\" but no rider could \"go on forever\".",
        "After starting his racing career in 1982, Lougher carved out a successful career on the Isle of Man's Mountain Course, coming third in his debut in the Manx Grand Prix (MGP) newcomers' race in 1983 before switching to the TT.",
        "Over the next four decades, he took the top spot on the podium 10 times in the June races.",
        "His final victory on the 37.7-mile course came last year in the MGP Lightweight race.",
        "Lougher secured a podium finish in the reintroduced Classic TT earlier this year",
        "But his tally of victories on the island was not restricted to the Mountain Course. He also secured 40 race wins at the Southern 100 races on the Billown Circuit in the south of the island.",
        "The Cardiff-born racer has also been a regular competitor at the North West 200, gathering eight wins at the Northern Ireland meeting.",
        "Reflecting on the longevity of his career, he said: \"I never imagined after that first outing in 1982 that I'd still be competing more than four decades later.",
        "\"I've always said I'd keep racing as long as I was competitive, and I like to think I've managed that. I'm not one for just riding around at the back.\"",
        "He said while he still did not \"get nervous going through the bottom of Bray Hill at 140mph, you can't go on forever, and I don't want to put my old body through any more\".",
        "\"I've had the privilege to race against so many great riders and meet some of the best people in the sport, and not many get to do that,\" he added.",
        "\"Racing has literally been my life.\"",
        "However, he said he would remain involved in the sport with a \"focus on the next generation\" through his team ILR Racing, which nurtures young talent.",
        "Tell us which stories we should cover on the Isle of Man",
        "Read more stories from the Isle of Man on the BBC, watch BBC North West Tonight on BBC iPlayer and follow BBC Isle of Man on Facebook, external and X, external.",
        "‘No other event will compare’ - Manx GP newcomer",
        "Lougher grabs late Lightweight Manx Grand Prix win"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/motorsport/articles/cy4rk991n4go",
      "main_category": "sport",
      "detailed_category": "motorsport",
      "topic": "Armstrong misses out on title despite Croatia win",
      "content": [
        "Northern Ireland's Jon Armstrong dominated Rally Croatia but missed out on the European Rally Championship title.The M-Sport driver, who won his first ERC event in Wales at the previous round, led from the first stage to take a commanding win in Croatia by 45.7 seconds from ex-WRC driver Mads Ostberg.To have an outside chance of claiming the title, Armstrong needed to win the rally and secure maximum points in the power stage - and duly delivered - but leader Mikolaj Marczyk finished third to secure the championship.\"What an event,\" said Armstrong. \"Today we had to be controlled in treacherous conditions and we are fastest on the Power Stage, we couldn't do much more.\"",
        "He and co-driver Shane Byrne won all but one of Saturday's six stages to hold a 27-second lead overnight.Andrea Mabellini was Marczyk's closest challenger heading into the rally, but the Italian's title hopes ended after a crash on stage four. That left a battle between the Polish driver and Armstrong on Sunday's wet final four stages.Armstrong controlled his margin to win, but Marczyk finished higher than the seventh place he needed to win the ERC title for the first time with an overall tally of 154 points, six clear of his rival.",
        "Jon Armstrong and co-driver Shane Byrne won the last two European Rally Championship events of the season",
        "Northern Ireland's Jon Armstrong dominated Rally Croatia but missed out on the European Rally Championship title.",
        "The M-Sport driver, who won his first ERC event in Wales at the previous round, led from the first stage to take a commanding win in Croatia by 45.7 seconds from ex-WRC driver Mads Ostberg.",
        "To have an outside chance of claiming the title, Armstrong needed to win the rally and secure maximum points in the power stage - and duly delivered - but leader Mikolaj Marczyk finished third to secure the championship.",
        "\"What an event,\" said Armstrong. \"Today we had to be controlled in treacherous conditions and we are fastest on the Power Stage, we couldn't do much more.\"",
        "He and co-driver Shane Byrne won all but one of Saturday's six stages to hold a 27-second lead overnight.",
        "Andrea Mabellini was Marczyk's closest challenger heading into the rally, but the Italian's title hopes ended after a crash on stage four.",
        "That left a battle between the Polish driver and Armstrong on Sunday's wet final four stages.",
        "Armstrong controlled his margin to win, but Marczyk finished higher than the seventh place he needed to win the ERC title for the first time with an overall tally of 154 points, six clear of his rival."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/articles/cj6xn553j5no",
      "main_category": "sport",
      "detailed_category": "motorsport",
      "topic": "Drogba, Kohli, LeBron, Nadal - why big names are investing in powerboat racing",
      "content": [
        "Didier Drogba is a member of what might be the world's greatest sporting WhatsApp group.Along with fellow global icons Tom Brady, LeBron James, Virat Kohli and Rafael Nadal - as well as actor Will Smith - the former Chelsea and Ivory Coast striker owns a team in E1 Series, the world's first all-electric international powerboat racing competition.Having taken to the waves last year, E1 is nearing the chequered flag on its second season and is about to pay its first visit to Africa, with Lagos' lagoon set to host the nine teams over the weekend of 4-5 October.\"When we decided to jump on the journey with E1, the main goal was always 'let's bring the race to Africa',\" Drogba told BBC Sport Africa.\"We want people to discover our culture, to discover our history. That's why Lagos is for us a good choice, because it's a vibrant city.\"Drogba's partner Gabrielle Lemaire, who is a co-investor in their team, also believes Nigeria's largest city fits the bill.\"The people are very young and it's an opportunity for us to advocate for sustainability,\" said the entrepreneur and vice president of the Didier Drogba Foundation.Billing itself on its website as \"pioneering a sustainable future in marine sports\", E1 claims to \"regenerate coastal waters through innovative clean technologies\".Venice, Monaco, Dubrovnik, Doha and Lake Como in Italy are among the venues so far visited by E1, with Miami scheduled to round off this season.It also aims to promotes gender equality, with every team consisting of one female and one male pilot.\"As a symbol it is really strong to show that men and women can do sports,\" said Lemaire.\"We would like to advocate for this, for the young people, for the young ladies to understand how important it is today.\"It's not only a sport that we're talking about here.\"",
        "Competitors come from a variety of motorsport backgrounds, exemplified by Team Drogba's line-up.Teenage British powerboat champion Oban Duncan is partnered with Micah Wilkinson, who won sailing bronze for New Zealand at last year's Olympic Games.Duncan is the youngest pilot in E1, but Drogba says he has built a strong relationship with the 19-year-old.\"Oban is full of talent but her confidence was a bit low,\" he revealed.\"I said 'We put our trust in you, we are behind you, and you're a superstar because you race with a lot of energy, a lot of enthusiasm'.\"I'm really happy with her because she applies the same principle that I used to apply during my career: give everything, do your best.\"Despite Duncan's young age, Drogba and Lemaire are already looking to the future, hoping the upcoming race in Lagos might inspire African talent.\"This is the goal, to be able to have African people interested in the sport, interested in sustainability, in racing, in discovering new cultures,\" explained Drogba.\"I think this is the opportunity for young people who want to succeed, who want to become a part of the E1 team.\"We would love to have an African pilot. It would mean a lot to us.\"",
        "Despite a glittering career which saw Drogba win four Premier League titles and the Champions League with Chelsea, the two-time African Footballer of the Year has so far decided against a move into coaching.But the 47-year-old says he is now channelling the leadership qualities of his former coaches and team-mates into his new position.\"I'm lucky to have had a diversity of managers, a diversity of knowledge, and I learned a lot.\"Even players who showed great leadership, like John Terry, Frank Lampard, Michael Ballack, Petr Cech - all these guys.\"I try to be like a sponge and take the best out of them, as a leader trying to reproduce it, but in my own way.\"While competition in E1 is fierce on the water, it is just as intense away from it, according to a smiling Drogba.\"I decided not to bring too much of my competitiveness, otherwise I will destroy them like I destroyed all the strikers I was in competition with,\" he laughed when discussing his rivalry with the other owners.\"These guys are really nasty on this WhatsApp group.\"I thought Rafa [Nadal] was a nice guy, always gentle, polite. But I've read what he said a few times and I'm not happy about it so I will have to change gears.\"With DJ Steve Aoki and Puerto Rican singer Marc Anthony, huge names in North America and beyond, also team owners, the rivalry between the stars is clearly one of E1's biggest draws.It has led organisers to target a valuation of £500m ($675m) for the competition in the next five years.\"It can only grow with the energy that all the owners are putting in,\" said Drogba.\"When we first started, I think it was me, Rafa, Marc and Steve.\"Now the list is becoming bigger with Tom Brady, Will Smith, LeBron James. Hopefully we'll have a female owner too because this is really important.\"Also on Drogba's list is a race in Ivory Coast, with Abidjan a likely venue because of its lagoon which mirrors Lagos' waterways.\"There's some technical specifications that you must require to organise the race, but I think we have everything here [Abidjan] to host,\" he added.\"We proved it with the Africa Cup of Nations. This is something that must happen.\"",
        "Didier Drogba won four Premier League titles and the Champions League with Chelsea but is now involved in electric powerboat racing with the E1 Series",
        "Didier Drogba is a member of what might be the world's greatest sporting WhatsApp group.",
        "Along with fellow global icons Tom Brady, LeBron James, Virat Kohli and Rafael Nadal - as well as actor Will Smith - the former Chelsea and Ivory Coast striker owns a team in E1 Series, the world's first all-electric international powerboat racing competition.",
        "Having taken to the waves last year, E1 is nearing the chequered flag on its second season and is about to pay its first visit to Africa, with Lagos' lagoon set to host the nine teams over the weekend of 4-5 October.",
        "\"When we decided to jump on the journey with E1, the main goal was always 'let's bring the race to Africa',\" Drogba told BBC Sport Africa.",
        "\"We want people to discover our culture, to discover our history. That's why Lagos is for us a good choice, because it's a vibrant city.\"",
        "Drogba's partner Gabrielle Lemaire, who is a co-investor in their team, also believes Nigeria's largest city fits the bill.",
        "\"The people are very young and it's an opportunity for us to advocate for sustainability,\" said the entrepreneur and vice president of the Didier Drogba Foundation.",
        "Billing itself on its website as \"pioneering a sustainable future in marine sports\", E1 claims to \"regenerate coastal waters through innovative clean technologies\".",
        "Venice, Monaco, Dubrovnik, Doha and Lake Como in Italy are among the venues so far visited by E1, with Miami scheduled to round off this season.",
        "It also aims to promotes gender equality, with every team consisting of one female and one male pilot.",
        "\"As a symbol it is really strong to show that men and women can do sports,\" said Lemaire.",
        "\"We would like to advocate for this, for the young people, for the young ladies to understand how important it is today.",
        "\"It's not only a sport that we're talking about here.\"",
        "The E1 Series has lofty aspirations of competing with motorsport powerhouses Formula 1 and Formula E",
        "Competitors come from a variety of motorsport backgrounds, exemplified by Team Drogba's line-up.",
        "Teenage British powerboat champion Oban Duncan is partnered with Micah Wilkinson, who won sailing bronze for New Zealand at last year's Olympic Games.",
        "Duncan is the youngest pilot in E1, but Drogba says he has built a strong relationship with the 19-year-old.",
        "\"Oban is full of talent but her confidence was a bit low,\" he revealed.",
        "\"I said 'We put our trust in you, we are behind you, and you're a superstar because you race with a lot of energy, a lot of enthusiasm'.",
        "\"I'm really happy with her because she applies the same principle that I used to apply during my career: give everything, do your best.\"",
        "Despite Duncan's young age, Drogba and Lemaire are already looking to the future, hoping the upcoming race in Lagos might inspire African talent.",
        "\"This is the goal, to be able to have African people interested in the sport, interested in sustainability, in racing, in discovering new cultures,\" explained Drogba.",
        "\"I think this is the opportunity for young people who want to succeed, who want to become a part of the E1 team.",
        "\"We would love to have an African pilot. It would mean a lot to us.\"",
        "Drogba met Prince Albert II of Monaco (centre) alongside fellow E1 Series investors Rafael Nadal (third left), Tom Brady (fourth right), Marc Anthony (third right) and LeBron James (right) in July",
        "Despite a glittering career which saw Drogba win four Premier League titles and the Champions League with Chelsea, the two-time African Footballer of the Year has so far decided against a move into coaching.",
        "But the 47-year-old says he is now channelling the leadership qualities of his former coaches and team-mates into his new position.",
        "\"I'm lucky to have had a diversity of managers, a diversity of knowledge, and I learned a lot.",
        "\"Even players who showed great leadership, like John Terry, Frank Lampard, Michael Ballack, Petr Cech - all these guys.",
        "\"I try to be like a sponge and take the best out of them, as a leader trying to reproduce it, but in my own way.\"",
        "While competition in E1 is fierce on the water, it is just as intense away from it, according to a smiling Drogba.",
        "\"I decided not to bring too much of my competitiveness, otherwise I will destroy them like I destroyed all the strikers I was in competition with,\" he laughed when discussing his rivalry with the other owners.",
        "\"These guys are really nasty on this WhatsApp group.",
        "\"I thought Rafa [Nadal] was a nice guy, always gentle, polite. But I've read what he said a few times and I'm not happy about it so I will have to change gears.\"",
        "With DJ Steve Aoki and Puerto Rican singer Marc Anthony, huge names in North America and beyond, also team owners, the rivalry between the stars is clearly one of E1's biggest draws.",
        "It has led organisers to target a valuation of £500m ($675m) for the competition in the next five years.",
        "\"It can only grow with the energy that all the owners are putting in,\" said Drogba.",
        "\"When we first started, I think it was me, Rafa, Marc and Steve.",
        "\"Now the list is becoming bigger with Tom Brady, Will Smith, LeBron James. Hopefully we'll have a female owner too because this is really important.\"",
        "Also on Drogba's list is a race in Ivory Coast, with Abidjan a likely venue because of its lagoon which mirrors Lagos' waterways.",
        "\"There's some technical specifications that you must require to organise the race, but I think we have everything here [Abidjan] to host,\" he added.",
        "\"We proved it with the Africa Cup of Nations. This is something that must happen.\""
      ]
    },
    {
      "url": "https://www.bbc.com/sport/motorsport/articles/c33rlx2z4xeo",
      "main_category": "sport",
      "detailed_category": "motorsport",
      "topic": "MotoGP title was 'an impossible dream' for Marquez",
      "content": [
        "Marc Marquez says winning his seventh MotoGP world championship at the weekend was \"impossible\" to foresee after a horrendous run of injuries which made him consider quitting the sport.Marquez, 32, finished second in Japan to win the title for Ducati and move level with all-time great Valentino Rossi on seven premier-class titles.It is a position many expected him to reach when he dominated the sport in his 20s, winning six titles in seven years between 2013 and 2019 for the Repsol Honda team.But then the Spaniard suffered the cruelty of motorcycle racing.He only managed to compete in one race in 2020, and won a total of six races in five seasons before this year as recovering from multiple injuries took its toll.He told BBC Sport: \"I am super happy and I feel at peace with myself.\"It was a long journey from 2020 a lot of up and downs, a lot of injuries, I was fighting against myself.\"There was one Marc saying stop and another Marc saying continue and fight for your dream, for your goal.\"",
        "Marquez broke his arm at the start of the 2020 season, which over the course of two years required four operations.In 2021, a motocross crash resulted in severe concussion.The following year, double vision meant he had to miss many races, and in 2023 he broke his ankle, ribs and fingers.He admits he was close to leaving the sport and - like most observers - did not see a seventh title coming.But Marquez has been reborn since joining Ducati for the 2024 season. Last year he won three races on the way to finishing third overall, and this year he has been dominant, winning 11 times to take the title, with his brother Alex in second place.\"This title was the most difficult challenge of my career. It was impossible to believe that I could win again,\" he said.\"In 2023 and 2022, I was considering stopping my career. Now the next target will be 2026, trying to fight for another championship.\"But for me, the biggest challenge is already done.\"That was to come back from that very bad period of injuries from 2020 to 2024 and now in 2025 close that circle with our world championship.\"",
        "This video can not be played",
        "Seventh MotoGP title 'the most difficult challenge of my career'",
        "Marc Marquez says winning his seventh MotoGP world championship at the weekend was \"impossible\" to foresee after a horrendous run of injuries which made him consider quitting the sport.",
        "Marquez, 32, finished second in Japan to win the title for Ducati and move level with all-time great Valentino Rossi on seven premier-class titles.",
        "It is a position many expected him to reach when he dominated the sport in his 20s, winning six titles in seven years between 2013 and 2019 for the Repsol Honda team.",
        "But then the Spaniard suffered the cruelty of motorcycle racing.",
        "He only managed to compete in one race in 2020, and won a total of six races in five seasons before this year as recovering from multiple injuries took its toll.",
        "He told BBC Sport: \"I am super happy and I feel at peace with myself.",
        "\"It was a long journey from 2020 a lot of up and downs, a lot of injuries, I was fighting against myself.",
        "\"There was one Marc saying stop and another Marc saying continue and fight for your dream, for your goal.\"",
        "Only Giacomo Agostini (eight) has won more top-class world titles than Marc Marquez, who has seven alongside Valentino Rossi",
        "Marquez broke his arm at the start of the 2020 season, which over the course of two years required four operations.",
        "In 2021, a motocross crash resulted in severe concussion.",
        "The following year, double vision meant he had to miss many races, and in 2023 he broke his ankle, ribs and fingers.",
        "He admits he was close to leaving the sport and - like most observers - did not see a seventh title coming.",
        "But Marquez has been reborn since joining Ducati for the 2024 season. Last year he won three races on the way to finishing third overall, and this year he has been dominant, winning 11 times to take the title, with his brother Alex in second place.",
        "\"This title was the most difficult challenge of my career. It was impossible to believe that I could win again,\" he said.",
        "\"In 2023 and 2022, I was considering stopping my career. Now the next target will be 2026, trying to fight for another championship.",
        "\"But for me, the biggest challenge is already done.",
        "\"That was to come back from that very bad period of injuries from 2020 to 2024 and now in 2025 close that circle with our world championship.\"",
        "Marquez came 14th in the standings in 2023 - 371 points behind champion Francesco Bagnaia"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/formula1/articles/cn833d44n5zo",
      "main_category": "sport",
      "detailed_category": "motorsport",
      "topic": "McLaughlin stretches British F4 lead at Silverstone",
      "content": [
        "Red Bull Junior driver Fionn McLaughlin moved closer to securing the British F4 championship after extending his lead in the standings in the penultimate weekend of racing at Silverstone.The 17-year-old, who secured the rookie championship in August, secured his fifth win of the championship in race one on Saturday as he held off the challenge of Tommy Harfield.Starting in third on the grid, McLaughlin had moved up to first by the end of the opening lap, where he stayed for the remainder of the race despite pressure from Harfield.He retired from the second race early on Sunday and in the third race, Harfield pipped the Northern Irish driver midway through with a move down the inside to earn a second victory of the season.Hitech Racing driver McLaughlin now holds a margin of 61.5 points over nearest challengers Jimmy Piszcyk and Martin Molar, who are both on 257 points in the overall standings.The final round of racing will take place at Brands Hatch on 4-5 October with 80 points still on offer.",
        "McLaughlin won the rookie championship in August",
        "Red Bull Junior driver Fionn McLaughlin moved closer to securing the British F4 championship after extending his lead in the standings in the penultimate weekend of racing at Silverstone.",
        "The 17-year-old, who secured the rookie championship in August, secured his fifth win of the championship in race one on Saturday as he held off the challenge of Tommy Harfield.",
        "Starting in third on the grid, McLaughlin had moved up to first by the end of the opening lap, where he stayed for the remainder of the race despite pressure from Harfield.",
        "He retired from the second race early on Sunday and in the third race, Harfield pipped the Northern Irish driver midway through with a move down the inside to earn a second victory of the season.",
        "Hitech Racing driver McLaughlin now holds a margin of 61.5 points over nearest challengers Jimmy Piszcyk and Martin Molar, who are both on 257 points in the overall standings.",
        "The final round of racing will take place at Brands Hatch on 4-5 October with 80 points still on offer."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/motorsport/articles/cq8egd08jzzo",
      "main_category": "sport",
      "detailed_category": "motorsport",
      "topic": "Marquez wins seventh MotoGP title to equal Rossi",
      "content": [
        "Spain's Marc Marquez completed his incredible comeback story as he won his seventh MotoGP World Championship to move level with Italian great Valentino Rossi.Marquez, 32, finished second at the Japan Grand Prix behind Italian team-mate Francesco Bagnaia to give himself an unassailable lead in the championship standings with five races to go as he secured his first title since 2019. He held his head in his hands and sobbed on his bike as he crossed the line, before being congratulated by his brother Alex, who was his nearest challenger in the title race this season but finished sixth in Motegi.\"It's impossible even to speak, I just want to enjoy the moment, but it's true that it was difficult, it was super difficult, but now I'm at peace with myself,\" a tearful Marquez said.Marquez's achievement comes after a \"nightmare\" that started in 2020.After winning four consecutive championships from 2016 to 2019 he suffered a string of injuries, including breaking his arm in 2020, which needed four operations over two years.The years that followed were filled with serious injuries and major crashes, and in 2023 he left Honda after 11 years to join Ducati.\"I did a big mistake in my career, to come back too early [from surgery]. And then I fight, fight, fight - and I won again! So I'm at peace,\" he added.Marquez has 11 wins this season and stretched his championship lead to 201 points over his brother in second place.",
        "This video can not be played",
        "Seventh MotoGP title 'the most difficult challenge of my career'",
        "Spain's Marc Marquez completed his incredible comeback story as he won his seventh MotoGP World Championship to move level with Italian great Valentino Rossi.",
        "Marquez, 32, finished second at the Japan Grand Prix behind Italian team-mate Francesco Bagnaia to give himself an unassailable lead in the championship standings with five races to go as he secured his first title since 2019.",
        "He held his head in his hands and sobbed on his bike as he crossed the line, before being congratulated by his brother Alex, who was his nearest challenger in the title race this season but finished sixth in Motegi.",
        "\"It's impossible even to speak, I just want to enjoy the moment, but it's true that it was difficult, it was super difficult, but now I'm at peace with myself,\" a tearful Marquez said.",
        "Marquez's achievement comes after a \"nightmare\" that started in 2020.",
        "After winning four consecutive championships from 2016 to 2019 he suffered a string of injuries, including breaking his arm in 2020, which needed four operations over two years.",
        "The years that followed were filled with serious injuries and major crashes, and in 2023 he left Honda after 11 years to join Ducati.",
        "\"I did a big mistake in my career, to come back too early [from surgery]. And then I fight, fight, fight - and I won again! So I'm at peace,\" he added.",
        "Marquez has 11 wins this season and stretched his championship lead to 201 points over his brother in second place.",
        "Marquez's comeback from 'nightmare' to contender"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/motorsport/articles/cz0dxv207vlo",
      "main_category": "sport",
      "detailed_category": "motorsport",
      "topic": "The next Vettel or Verstappen? Meet Fionn McLaughlin",
      "content": [
        "Max Verstappen. Sebastian Vettel. Carlos Sainz. Daniel Ricciardo. The list of drivers to come through Red Bull Racing's junior programme is extensive, with race winners and world champions making up eight of the 21 drivers on this year's Formula 1 grid. Now, a teenager from Northern Ireland is hoping to join the ranks of some of Formula 1's biggest names. Red Bull junior driver Fionn McLaughlin is in title contention in British F4 in his first season of car racing.\"If I'm in the Red Bull academy and I'm doing a good job, then I think it's realistic. I'm going to work as hard as I can to make it to F1,\" the 17-year-old told BBC Sport NI.\"Red Bull are giving me the opportunity and I think I have the ability to make it. \"If you don't believe in yourself, you won't be able to get anywhere. \"When I was six years of age driving around, the thought of being in F4 or F3 was something I never would have thought of. I'm proud to be here and I'll always be grateful for the steps I'm making.\"",
        "Racing is in McLaughlin's DNA. His father Martin used to race go-karts and he was always at circuits with his dad. While Verstappen is one of the sport's biggest names, it was another four-time F1 world champion who McLaughlin grew up idolising. \"My whole life I looked up to Sebastian Vettel, from when I was six. \"I thought he was amazing so I always had that dream of making it to Formula 1 - and with Red Bull. \"It's great to be in the academy and looking forward F1 is my goal. I'm happy I have this opportunity.\"McLaughlin had a solid karting career, which had taken him across the UK, Europe and the world.",
        "But he had the chance to take his career to the next level when he was invited to a shootout by Red Bull at Jerez last summer and he beat a number of drivers to be enrolled into the team's junior driving programme.McLaughlin discovered he had been selected when Helmut Marko, Red Bull's team adviser and head of the company's driver academy, approached him at the end of the test.\"I was doing well at go-karting and had an opportunity from Red Bull. I just tried to do a good job to see where it took me,\" continued McLaughlin.\"I was up against six other drivers, it was good competition and there was a bit of pressure. I was able to deliver and they obviously thought I was decent enough to take me on board for the junior team. \"Helmut Marko came over to me and said, 'I think you're a good driver and I want you on our team'. He said I had potential and would take me on as far as he could in the future. \"He's a nice man and he's given me the opportunity to race in F4.\"",
        "With the support of Red Bull, McLaughlin has taken his first steps into car racing. He started with the Formula Winter Series, where he secured three wins and seven podiums.The teenager, from the town of Magherafelt, then moved into British F4, which has seen the likes of McLaren duo Lando Norris and Oscar Piastri, IndyCar star Colton Herta and Formula 2 championship contender Alex Dunne.He has adapted well to the championship, leads the rookie standings and is second in the overall standings after four rounds. \"I've found it's not too bad stepping up from go-karting. It's different in how you brake and it's different as it's a tighter space inside the car,\" McLaughlin added. \"It's been a change but I think I've got used to it quite well and I'm delivering as best as I can. \"I'm taking it step by step and it's about the main goal at the end of the year, which is the championship trophy.\"You have to deliver as quickly as possible in this sport. Being classed as a rookie is good but I always try to focus on the main championship.\"",
        "McLaughlin is delivering in British F4 and will have the chance to race on the British Grand Prix weekend as the series supports Formula 1 at Silverstone in July. It's a huge opportunity with some of the sport's biggest names watching on and looking for the next stars. \"Being a support race on the F1 Silverstone package was unexpected — opportunities like this usually don't come until F3,\" McLaughlin said.\"I'm still in F4 so I'm not putting any extra pressure on the event. But the goal remains the same - to win every time I get in the car and winning on the world stage would be something special.\"After being given the chance to progress his career by Red Bull, McLaughlin admits there is pressure to deliver if he is to achieve his dream to making it to F1. \"I always have high expectations of winning but I just try to believe in my ability,\" McLaughlin added. \"I try not to look too much into the future, I take it step by step. For me, it's important to do a good job at where I'm at now, and believe in what I can do. \"You have to keep getting results because if you're not doing a good job, you're not going to be able to take the next step.\"McLaughlin says \"pressure has always been a thing\" but that it is something he thrives under. \"Obviously it can be tough as you need the results but that's my job and that's what I want. \"I want to be a winner. Red Bull are a winning team, I'm a winning driver so we work well with each other.\"",
        "Fionn McLaughlin is one of the newest recruits to Red Bull's junior academy",
        "Max Verstappen. Sebastian Vettel. Carlos Sainz. Daniel Ricciardo.",
        "The list of drivers to come through Red Bull Racing's junior programme is extensive, with race winners and world champions making up eight of the 21 drivers on this year's Formula 1 grid.",
        "Now, a teenager from Northern Ireland is hoping to join the ranks of some of Formula 1's biggest names.",
        "Red Bull junior driver Fionn McLaughlin is in title contention in British F4 in his first season of car racing.",
        "\"If I'm in the Red Bull academy and I'm doing a good job, then I think it's realistic. I'm going to work as hard as I can to make it to F1,\" the 17-year-old told BBC Sport NI.",
        "\"Red Bull are giving me the opportunity and I think I have the ability to make it.",
        "\"If you don't believe in yourself, you won't be able to get anywhere.",
        "\"When I was six years of age driving around, the thought of being in F4 or F3 was something I never would have thought of. I'm proud to be here and I'll always be grateful for the steps I'm making.\"",
        "McLaughlin takes F4 lead with Snetterton win",
        "NI driver, 16, to be part of Red Bull Academy",
        "Racing is in McLaughlin's DNA. His father Martin used to race go-karts and he was always at circuits with his dad.",
        "While Verstappen is one of the sport's biggest names, it was another four-time F1 world champion who McLaughlin grew up idolising.",
        "\"My whole life I looked up to Sebastian Vettel, from when I was six.",
        "\"I thought he was amazing so I always had that dream of making it to Formula 1 - and with Red Bull.",
        "\"It's great to be in the academy and looking forward F1 is my goal. I'm happy I have this opportunity.\"",
        "McLaughlin had a solid karting career, which had taken him across the UK, Europe and the world.",
        "McLaughlin currently leads the British F4 standings after three rounds as a rookie",
        "But he had the chance to take his career to the next level when he was invited to a shootout by Red Bull at Jerez last summer and he beat a number of drivers to be enrolled into the team's junior driving programme.",
        "McLaughlin discovered he had been selected when Helmut Marko, Red Bull's team adviser and head of the company's driver academy, approached him at the end of the test.",
        "\"I was doing well at go-karting and had an opportunity from Red Bull. I just tried to do a good job to see where it took me,\" continued McLaughlin.",
        "\"I was up against six other drivers, it was good competition and there was a bit of pressure. I was able to deliver and they obviously thought I was decent enough to take me on board for the junior team.",
        "\"Helmut Marko came over to me and said, 'I think you're a good driver and I want you on our team'. He said I had potential and would take me on as far as he could in the future.",
        "\"He's a nice man and he's given me the opportunity to race in F4.\"",
        "With the support of Red Bull, McLaughlin has taken his first steps into car racing.",
        "He started with the Formula Winter Series, where he secured three wins and seven podiums.",
        "The teenager, from the town of Magherafelt, then moved into British F4, which has seen the likes of McLaren duo Lando Norris and Oscar Piastri, IndyCar star Colton Herta and Formula 2 championship contender Alex Dunne.",
        "He has adapted well to the championship, leads the rookie standings and is second in the overall standings after four rounds.",
        "\"I've found it's not too bad stepping up from go-karting. It's different in how you brake and it's different as it's a tighter space inside the car,\" McLaughlin added.",
        "\"It's been a change but I think I've got used to it quite well and I'm delivering as best as I can.",
        "\"I'm taking it step by step and it's about the main goal at the end of the year, which is the championship trophy.",
        "\"You have to deliver as quickly as possible in this sport. Being classed as a rookie is good but I always try to focus on the main championship.\"",
        "McLaughlin is racing for Hitech in his first season of car racing",
        "McLaughlin is delivering in British F4 and will have the chance to race on the British Grand Prix weekend as the series supports Formula 1 at Silverstone in July.",
        "It's a huge opportunity with some of the sport's biggest names watching on and looking for the next stars.",
        "\"Being a support race on the F1 Silverstone package was unexpected — opportunities like this usually don't come until F3,\" McLaughlin said.",
        "\"I'm still in F4 so I'm not putting any extra pressure on the event. But the goal remains the same - to win every time I get in the car and winning on the world stage would be something special.\"",
        "After being given the chance to progress his career by Red Bull, McLaughlin admits there is pressure to deliver if he is to achieve his dream to making it to F1.",
        "\"I always have high expectations of winning but I just try to believe in my ability,\" McLaughlin added.",
        "\"I try not to look too much into the future, I take it step by step. For me, it's important to do a good job at where I'm at now, and believe in what I can do.",
        "\"You have to keep getting results because if you're not doing a good job, you're not going to be able to take the next step.\"",
        "McLaughlin says \"pressure has always been a thing\" but that it is something he thrives under.",
        "\"Obviously it can be tough as you need the results but that's my job and that's what I want.",
        "\"I want to be a winner. Red Bull are a winning team, I'm a winning driver so we work well with each other.\""
      ]
    },
    {
      "url": "https://www.bbc.com/sport/articles/czxwekw040do",
      "main_category": "sport",
      "detailed_category": "motorsport",
      "topic": "Five stories from Britain's best sporting underdogs",
      "content": [
        "British sports fans have always loved an underdog, to root for a David when they're faced with a Goliath.Underdogs are athletes who have pushed down barriers, who achieved things they typically were not meant to achieve.As part of a new BBC Sounds podcast series, Sport's Greatest Underdogs, the BBC tells the story of five of Britain's best and how they managed to achieve sporting success against all the odds.Read their stories and vote for who you think is the best sporting underdog in our poll below.",
        "In 2015, Nicolas Hamilton became the first disabled racing driver in the British Touring Cars series.But a year later he was out of the sport and had became a gambling addict.\"I didn't feel valuable,\" Hamilton, the brother of seven-time Formula 1 champion Lewis, said.\"I wasn't racing and I wasn't getting sponsorship. My Dad is a multi-millionaire, my brother is a multi-millionaire, and they are going on this upward trajectory.\"I felt very lost and lonely and I just stumbled across gambling.\"However, Hamilton, who has cerebral palsy, made his British Touring Cars comeback in 2019 and is currently competing in the 2025 championship.Read more about his story here.",
        "BMX rider Beth Shriever became the first British athlete to win a gold medal in the sport at the Tokyo Olympics in 2021.The Essex cyclist had to contend with having her funding cut on the road to Tokyo.In 2017, UK Sport announced they would only fund male riders, based on results, and Shriever left the national set-up to go solo.She crowdfunded £50,000 to help her earn the chance to qualify for the Olympics.\"I'm so grateful that people did donate and I was able to get to these places to qualify and get myself on that start line,\" she said.",
        "Eddie 'the Eagle' Edwards had only been ski jumping for 20 months when he qualified for the Calgary Winter Olympics of 1988, becoming Britain's first-ever competitor in the event.  He took it up because Alpine skiing was too expensive, and his journey was one of pure determination as he borrowed kit, ate out of bins, and slept in his car to achieve his dream.While Edwards went on to finish last in the both the 70m and 90m events, he became a global and sporting icon. \"I had so much fun getting to Calgary, that Calgary was my gold medal,\" Edwards said. \"I'm very proud of what I've achieved. I broke boundaries, I pushed envelopes, and I did everything that people said couldn't be done.\"Episode released on BBC Sounds on 30 July.",
        "Double Olympic gold medallist Nicola Adams grew up in a male-dominated boxing world but never gave up on her teenage dream of one day competing at the Olympics. But when the sport debuted at the 2012 Olympics, she took her chance and went on to win gold, followed by another gold four years later at the Rio Games.\"The funding wasn't there, a lot of us were still working and trying to fund being athletes as well, which was really difficult,\" Adams said.\"When we'd go away and we wouldn't even have our own competition gear, we'd have to wash it for the other person to wear for competing the next day. \"It was just such a different comparison to when you looked at when the guys went away. They'd have everything. \"They'd have somebody go out a week before, get the hotel set up. They'd have all the rooms on the same floor. They'd make sure all the fridges were stacked, but then we couldn't even get our own separate competition gear.\"Episode released on BBC Sounds on 6 August.",
        "Leicester City were the 5,000-1 outsiders who shocked the footballing world to win the Premier League title in 2016 for the first time in their 132-year history. A year earlier they were bottom of the table, having been promoted from the Championship and struggling to adapt to life in the top flight. But they turned things around under manager Nigel Pearson to avoid the drop, and when Claudio Ranieri was appointed in the summer of 2015 the club's winning run continued into the new season, and did not stop. They won 23 of their 38 matches, despite one of the smallest playing budgets in the league, to pull off what remains as one of the greatest unexpected sporting stories of all time.Two-part episode released on BBC Sounds on 13 August.",
        "A new BBC Sounds series examines the stories of five of Britain's best sporting underdogs",
        "British sports fans have always loved an underdog, to root for a David when they're faced with a Goliath.",
        "Underdogs are athletes who have pushed down barriers, who achieved things they typically were not meant to achieve.",
        "As part of a new BBC Sounds podcast series, Sport's Greatest Underdogs, the BBC tells the story of five of Britain's best and how they managed to achieve sporting success against all the odds.",
        "Read their stories and vote for who you think is the best sporting underdog in our poll below.",
        "Listen: Sport's Greatest Underdogs",
        "This video can not be played",
        "Racing driver Nic Hamilton says he is recovering from a gambling addiction",
        "In 2015, Nicolas Hamilton became the first disabled racing driver in the British Touring Cars series.",
        "But a year later he was out of the sport and had became a gambling addict.",
        "\"I didn't feel valuable,\" Hamilton, the brother of seven-time Formula 1 champion Lewis, said.",
        "\"I wasn't racing and I wasn't getting sponsorship. My Dad is a multi-millionaire, my brother is a multi-millionaire, and they are going on this upward trajectory.",
        "\"I felt very lost and lonely and I just stumbled across gambling.\"",
        "However, Hamilton, who has cerebral palsy, made his British Touring Cars comeback in 2019 and is currently competing in the 2025 championship.",
        "Read more about his story here.",
        "Listen: Sport's Greatest Underdogs - Nicolas Hamilton",
        "Beth Shriever won BMX gold at the Tokyo Olympic Games",
        "BMX rider Beth Shriever became the first British athlete to win a gold medal in the sport at the Tokyo Olympics in 2021.",
        "The Essex cyclist had to contend with having her funding cut on the road to Tokyo.",
        "In 2017, UK Sport announced they would only fund male riders, based on results, and Shriever left the national set-up to go solo.",
        "She crowdfunded £50,000 to help her earn the chance to qualify for the Olympics.",
        "\"I'm so grateful that people did donate and I was able to get to these places to qualify and get myself on that start line,\" she said.",
        "Listen: Sport's Greatest Underdogs - Beth Shriever",
        "Eddie 'the Eagle' Edwards might have fin",
        "Eddie 'the Eagle' Edwards had only been ski jumping for 20 months when he qualified for the Calgary Winter Olympics of 1988, becoming Britain's first-ever competitor in the event.",
        "He took it up because Alpine skiing was too expensive, and his journey was one of pure determination as he borrowed kit, ate out of bins, and slept in his car to achieve his dream.",
        "While Edwards went on to finish last in the both the 70m and 90m events, he became a global and sporting icon.",
        "\"I had so much fun getting to Calgary, that Calgary was my gold medal,\" Edwards said.",
        "\"I'm very proud of what I've achieved. I broke boundaries, I pushed envelopes, and I did everything that people said couldn't be done.\"",
        "Episode released on BBC Sounds on 30 July.",
        "Nicola Adams won the first-ever women's Olympic boxing gold medal in 2012",
        "Double Olympic gold medallist Nicola Adams grew up in a male-dominated boxing world but never gave up on her teenage dream of one day competing at the Olympics.",
        "But when the sport debuted at the 2012 Olympics, she took her chance and went on to win gold, followed by another gold four years later at the Rio Games.",
        "\"The funding wasn't there, a lot of us were still working and trying to fund being athletes as well, which was really difficult,\" Adams said.",
        "\"When we'd go away and we wouldn't even have our own competition gear, we'd have to wash it for the other person to wear for competing the next day.",
        "\"It was just such a different comparison to when you looked at when the guys went away. They'd have everything.",
        "\"They'd have somebody go out a week before, get the hotel set up. They'd have all the rooms on the same floor. They'd make sure all the fridges were stacked, but then we couldn't even get our own separate competition gear.\"",
        "Episode released on BBC Sounds on 6 August.",
        "Leicester City defied 5,000-1 odds to win the Premier League title in 2016",
        "Leicester City were the 5,000-1 outsiders who shocked the footballing world to win the Premier League title in 2016 for the first time in their 132-year history.",
        "A year earlier they were bottom of the table, having been promoted from the Championship and struggling to adapt to life in the top flight.",
        "But they turned things around under manager Nigel Pearson to avoid the drop, and when Claudio Ranieri was appointed in the summer of 2015 the club's winning run continued into the new season, and did not stop.",
        "They won 23 of their 38 matches, despite one of the smallest playing budgets in the league, to pull off what remains as one of the greatest unexpected sporting stories of all time.",
        "Two-part episode released on BBC Sounds on 13 August."
      ]
    }
  ]
}