{
  "scraped_at": "2025-10-27T18:56:59.796546",
  "total_articles": 16,
  "category": "ice-hockey",
  "articles_per_category": 100,
  "articles": [
    {
      "url": "https://www.bbc.com/sport/ice-hockey/articles/c5ypk2pdd03o",
      "main_category": "sport",
      "detailed_category": "ice-hockey",
      "topic": "Cardiff Devils go top of Elite League with win at Blaze",
      "content": [
        "Cardiff Devils moved to the top of the Elite League with a 3-0 win at Coventry Blaze, their second victory of the weekend.Following a goalless opening period, Brett Perlini broke the deadlock at the Skydome Arena to put Devils in front.Cole Sanford and Ryan Barrow wrapped up the victory in the final period.Devils' next game is away to Belfast Giants on Wednesday before they host Manchester Storm next Saturday.",
        "Netminder Ben Bowns was Cardiff Devils' man of the match against Coventry Blaze",
        "Cardiff Devils moved to the top of the Elite League with a 3-0 win at Coventry Blaze, their second victory of the weekend.",
        "Following a goalless opening period, Brett Perlini broke the deadlock at the Skydome Arena to put Devils in front.",
        "Cole Sanford and Ryan Barrow wrapped up the victory in the final period.",
        "Devils' next game is away to Belfast Giants on Wednesday before they host Manchester Storm next Saturday."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/ice-hockey/articles/ce862091rqyo",
      "main_category": "sport",
      "detailed_category": "ice-hockey",
      "topic": "Cardiff Devils beat Elite League leaders Nottingham Panthers",
      "content": [
        "Cardiff Devils bounced back after two defeats to beat Elite League leaders Nottingham Panthers 4-1 at the Vindico Arena.Brendan Harris put Panthers ahead but Devils levelled through Riley Brandt before Joey Martin put Devils ahead in the second period.Brandon Estes and Martin's second secured a second league win of the season over Panthers.Devils are away to Coventry in the Elite League on Sunday evening.",
        "This video can not be played",
        "Highlights: Cardiff Devils 4-1 Nottingham Panthers",
        "Cardiff Devils bounced back after two defeats to beat Elite League leaders Nottingham Panthers 4-1 at the Vindico Arena.",
        "Brendan Harris put Panthers ahead but Devils levelled through Riley Brandt before Joey Martin put Devils ahead in the second period.",
        "Brandon Estes and Martin's second secured a second league win of the season over Panthers.",
        "Devils are away to Coventry in the Elite League on Sunday evening."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/ice-hockey/articles/cvgw8eee38ro",
      "main_category": "sport",
      "detailed_category": "ice-hockey",
      "topic": "Devils beaten by Steelers to make it back-to-back losses",
      "content": [
        "Cardiff Devils were punished by Sheffield Steelers in their 4-1 Challenge Cup loss.It started off as a cagey affair with the first period ending scoreless and not much to separate the two teams.The Steelers came out with intent in the second period and made it 3-0 within ten minutes. Goals from Mitchell Heard, Jack Dougherty and Robert Dowd took the game away from Cardiff.A fourth goal from Mitchell Balmas at the beginning of the third period put the game well beyond reach for the away side, which meant the Devils would be travelling back to Cardiff empty-handed.A consolation goal from Joey Martin gave the away fans something to cheer for, but the damage was done as the Devils finished a disappointing weekend with a 4-1 loss in front of more than 8,000 at the Utilita Arena in Sheffield.This loss means Cardiff have to beat the Guildford Flames in their final Challenge Cup qualifying game on 2 November to have a chance to advance to the next round.",
        "The Devils were comfortably beaten by the Steelers in Sheffield",
        "Cardiff Devils were punished by Sheffield Steelers in their 4-1 Challenge Cup loss.",
        "It started off as a cagey affair with the first period ending scoreless and not much to separate the two teams.",
        "The Steelers came out with intent in the second period and made it 3-0 within ten minutes. Goals from Mitchell Heard, Jack Dougherty and Robert Dowd took the game away from Cardiff.",
        "A fourth goal from Mitchell Balmas at the beginning of the third period put the game well beyond reach for the away side, which meant the Devils would be travelling back to Cardiff empty-handed.",
        "A consolation goal from Joey Martin gave the away fans something to cheer for, but the damage was done as the Devils finished a disappointing weekend with a 4-1 loss in front of more than 8,000 at the Utilita Arena in Sheffield.",
        "This loss means Cardiff have to beat the Guildford Flames in their final Challenge Cup qualifying game on 2 November to have a chance to advance to the next round."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/ice-hockey/articles/cy7ekm6318zo",
      "main_category": "sport",
      "detailed_category": "ice-hockey",
      "topic": "Devils suffer shootout loss to table-topping Clan",
      "content": [
        "Cardiff Devils suffered a nail-biting shootout loss to Glasgow Clan as they were beaten 3-2 at home.Devils took the lead in the first period as Ben Davies was assisted by Connor Caponi to make it 1-0. Deven Sideroff equalised for Clan before Josh MacDonald regained the lead for the home side.Glasgow made it 2-2 in the second period after Canadian forward Tristin Langan scored. There was not a lot to separate the two teams throughout the contest, as seen in the third period when neither team managed to break the deadlock.The scores remained level after overtime and Glasgow Clan took the match-winning point, emerging victorious from the shootout.The home side failed to make it three wins out of three and sit fourth in the Elite League table whilst Glasgow Clan are top.Cardiff Devils travel to Sheffield on Sunday for their Challenge Cup game against the Steelers.",
        "Cardiff Devils had won their opening two EIHL games, including shootout victory at Nottingham",
        "Cardiff Devils suffered a nail-biting shootout loss to Glasgow Clan as they were beaten 3-2 at home.",
        "Devils took the lead in the first period as Ben Davies was assisted by Connor Caponi to make it 1-0.",
        "Deven Sideroff equalised for Clan before Josh MacDonald regained the lead for the home side.",
        "Glasgow made it 2-2 in the second period after Canadian forward Tristin Langan scored. There was not a lot to separate the two teams throughout the contest, as seen in the third period when neither team managed to break the deadlock.",
        "The scores remained level after overtime and Glasgow Clan took the match-winning point, emerging victorious from the shootout.",
        "The home side failed to make it three wins out of three and sit fourth in the Elite League table whilst Glasgow Clan are top.",
        "Cardiff Devils travel to Sheffield on Sunday for their Challenge Cup game against the Steelers."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/ice-hockey/articles/cqjwlyd49gdo",
      "main_category": "sport",
      "detailed_category": "ice-hockey",
      "topic": "Devils add imposing defenceman MacLean to roster",
      "content": [
        "Cardiff Devils have signed Canadian defenceman Steven MacLean to bolster their squad following injury to forward Cedric Lacroix.MacLean, 27, has spent the last two seasons playing with Cincinnati Cyclones in North America's ECHL, scoring three goals and 17 assists in 109 games.The Ontario native cuts an imposing figure at 6'7\" (2m) and 15st 6lbs (98kg).Lacroix is expected to be out for between six to eight weeks with an upper body injury sustained last week.Cardiff head coach Paul Thompson was already one player short on his defensive roster after teenage British defenceman Brodie Kay requested to be released from his contract in September.\"We have been looking for a defenceman for a few weeks now, and Steven is a good fit,\" said Thompson.\"He is a big strong defensive defenceman who skates well. Our defensive core has been great this season, but with Lacroix out short-term we always have the option to move [defenceman] Evan Mosey up front.\"Signing Steven gives us some options and also provides additional cover on the blueline for the season.\"",
        "Cardiff won their opening two Elite Ice Hockey League (EIHL) games at the weekend with victories over Coventry Blaze and Nottingham Panthers, with captain Joey Martin scoring on his return after four weeks out injured.The successful start to the Devils EIHL campaign came a week after Challenge Cup defeats at home by the same two sides which left Thompson fuming.",
        "Steven MacLean played four years at Wilfrid Laurier University before turning professional",
        "Cardiff Devils have signed Canadian defenceman Steven MacLean to bolster their squad following injury to forward Cedric Lacroix.",
        "MacLean, 27, has spent the last two seasons playing with Cincinnati Cyclones in North America's ECHL, scoring three goals and 17 assists in 109 games.",
        "The Ontario native cuts an imposing figure at 6'7\" (2m) and 15st 6lbs (98kg).",
        "Lacroix is expected to be out for between six to eight weeks with an upper body injury sustained last week.",
        "Cardiff head coach Paul Thompson was already one player short on his defensive roster after teenage British defenceman Brodie Kay requested to be released from his contract in September.",
        "\"We have been looking for a defenceman for a few weeks now, and Steven is a good fit,\" said Thompson.",
        "\"He is a big strong defensive defenceman who skates well. Our defensive core has been great this season, but with Lacroix out short-term we always have the option to move [defenceman] Evan Mosey up front.",
        "\"Signing Steven gives us some options and also provides additional cover on the blueline for the season.\"",
        "Cardiff won their opening two Elite Ice Hockey League (EIHL) games at the weekend with victories over Coventry Blaze and Nottingham Panthers, with captain Joey Martin scoring on his return after four weeks out injured.",
        "The successful start to the Devils EIHL campaign came a week after Challenge Cup defeats at home by the same two sides which left Thompson fuming.",
        "Cardiff Devils refresh roster for 2025-26 season"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/ice-hockey/articles/cgj1j3en6n3o",
      "main_category": "sport",
      "detailed_category": "ice-hockey",
      "topic": "Devils snatch overtime win at Panthers",
      "content": [
        "Cardiff Devils completed a rousing comeback win by snatching a 3-2 victory in overtime at Nottingham Panthers in the Elite League.Panthers led 2-0 after Brendan Harris put the hosts ahead in the first period and Mitchell Fossier doubled the lead from a penalty.But Devils' Riley Brandt hit back in final period and Ryan Barrow levelled before scoring the overtime winner.It was a second successive revenge for Devils who had lost 5-0 to Panthers last weekend in the Challenge Cup a day after succumbing to Coventry Blaze, setbacks that left Paul Thompson furious.Devils beat Blaze on Saturday in their Elite League opener and left Nottingham with another win.Devils host Glasgow Clan in their next Elite League encounter in the Welsh capital on Saturday, 18 October (19:00 BST) while Panthers go to Fife Flyers in the same competition on Wednesday, 15 October (19:30 BST).",
        "This video can not be played",
        "Elite League highlights: Cardiff Devils 3-0 Coventry Blaze",
        "Cardiff Devils completed a rousing comeback win by snatching a 3-2 victory in overtime at Nottingham Panthers in the Elite League.",
        "Panthers led 2-0 after Brendan Harris put the hosts ahead in the first period and Mitchell Fossier doubled the lead from a penalty.",
        "But Devils' Riley Brandt hit back in final period and Ryan Barrow levelled before scoring the overtime winner.",
        "It was a second successive revenge for Devils who had lost 5-0 to Panthers last weekend in the Challenge Cup a day after succumbing to Coventry Blaze, setbacks that left Paul Thompson furious.",
        "Devils beat Blaze on Saturday in their Elite League opener and left Nottingham with another win.",
        "Devils host Glasgow Clan in their next Elite League encounter in the Welsh capital on Saturday, 18 October (19:00 BST) while Panthers go to Fife Flyers in the same competition on Wednesday, 15 October (19:30 BST)."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/ice-hockey/articles/cq8e87gded4o",
      "main_category": "sport",
      "detailed_category": "ice-hockey",
      "topic": "Cardiff Devils edge past Coventry Blaze",
      "content": [
        "Cardiff Devils edged past visitors Coventry Blaze as their Elite League (EIHL) campaign kicked off with a 3-0 win in the Welsh capital.Joey Martin made a perfect return after four weeks out with a broken foot, putting the Devils ahead inside the first four minutes.The game however remained intensely tight with no further goals until the dying minutes when the visitors pulled their netminder for an extra skater in chase of an equaliser.Instead Cardiff took advantage of the empty net as Brett Perlini fed Riley Brandt to double the hosts advantage before Perlini himself scored a third.Devils coach Paul Thompson was furious after last weekend's double Challenge Cup defeat, the first against Blaze a 6-5 setback at the Vindico Arena, the second a 5-0 loss at the same venue the following day against Nottingham Panthers.Devils' have a second opportunity for revenge on Sunday, with an EIHL trip to Panthers (16:00 BST).",
        "This video can not be played",
        "Elite League highlights: Cardiff Devils 3-0 Coventry Blaze",
        "Cardiff Devils edged past visitors Coventry Blaze as their Elite League (EIHL) campaign kicked off with a 3-0 win in the Welsh capital.",
        "Joey Martin made a perfect return after four weeks out with a broken foot, putting the Devils ahead inside the first four minutes.",
        "The game however remained intensely tight with no further goals until the dying minutes when the visitors pulled their netminder for an extra skater in chase of an equaliser.",
        "Instead Cardiff took advantage of the empty net as Brett Perlini fed Riley Brandt to double the hosts advantage before Perlini himself scored a third.",
        "Devils coach Paul Thompson was furious after last weekend's double Challenge Cup defeat, the first against Blaze a 6-5 setback at the Vindico Arena, the second a 5-0 loss at the same venue the following day against Nottingham Panthers.",
        "Devils' have a second opportunity for revenge on Sunday, with an EIHL trip to Panthers (16:00 BST).",
        "Thompson fuming before Devils Elite League start"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/ice-hockey/articles/cddm8dy0q35o",
      "main_category": "sport",
      "detailed_category": "ice-hockey",
      "topic": "Thompson fuming before Devils Elite League start",
      "content": [
        "With eight days to go until Cardiff Devils' opening Elite League (EIHL) fixture against Coventry Blaze this Saturday, prospects for the new-look Welsh side seemed promising.Before last weekend Paul Thompson's team had won five of their six games in the Challenge Cup - and with two home games ahead of them looked well set to take control of their 10-game group.Instead, having dropped a 3-0 lead to lose a helter-skelter Saturday encounter with Coventry 6-5, on Sunday the side collapsed to a 5-0 defeat by Nottingham Panthers.It left their head coach fuming.\"I was embarrassed for ourselves,\" said Thompson who took charge of the Devils in the summer.\"I use the word 'we' because our fans pay good money to come and watch us and for the first time this season, we didn't give them anything to get excited about.\"",
        "In the wake of Sunday's 5-0 loss at the Vindico Arena, Thompson and his coaching staff spent all day Monday working out their response.\"In the past I've brought the players in on a Monday as a punishment, but they had the day off because we needed 24 hours to digest where we've been and where we are now,\" added the 57-year-old with over 30 years experience of coaching.\"I waited two days to get in front of them and tell them how I feel. We had a hard workout, and then we had a hard meeting.\"I tell you, there were some tough things said, but I feel that we've got a group that will respond to that. Every player at one point was singled out for something that we don't believe they're doing right.\"",
        "Having conceded just nine goals in their first six games, last weekend Cardiff conceded 10 in less than 100 minutes of hockey.\"When your game is flat, when you are chasing, when you're thinking that you are doing the right thing and the five or the six of you aren't on the same page, this happens,\" said Thompson.\"The level of the league is, if you're not on it, that's going to happen to you.\"Thompson also points to playing too many minutes outnumbered with players sitting out \"soft, selfish\" two-minute penalties \"that just don't need to be taken\".\"It's only so long that you can keep defending seven or eight, nine penalties a game that it's going to come back and kick you,\" he said.\"We were running around and looking for the hits rather than looking to win the puck. \"As much as we want to play this heavy, fast-forechecking game, we also have to play with our brains.\"",
        "With a somewhat ironic twist, the Devils' opening EIHL opponents are the same two sides that beat them last weekend – Coventry and Nottingham. What might have been a routine start to a league season has now become a hugely important pair of fixtures.\"We want to get off to a good start in the league and get to playing Devils hockey,\" said Thompson.\"The last time we won the Elite League here was 2017-18 and that's not good enough for a club like this.\"This is the hardest league to play in because the league championship is the number one thing to win and in the rest of the world it's not - it's about the play-offs.\"Cardiff were beaten in overtime by Nottingham in last season's Play-Off final but - despite also winning a first European trophy - previous head coach Pete Russell left the club having finished fourth in EIHL\"I was brought in to change the culture and bring the every day effect,\" added former Coventry and Sheffield coach Thompson.\"You're not going to win every night, it's impossible, there's too many good teams.\"So that focus of being an every-dayer, that focus on us being the team that is going to be right up there, staying within the top three, four teams and having a real opportunity to win a league means that we have to push these guys on a daily basis and they have to push us and they have to push each other.\"And Thompson, who last season won the Danish League with Odense Bulldogs, is reassured by this week's training sessions that everything will be alright on Elite League opening night.\"We didn't fulfil our potential last weekend, but the key to it all is recognising that we didn't and try and put it right next time,\" he said.\"They went on the ice today and proved to me the good bunch that they are.\"The players have reacted in exactly the way I'd hoped, and to be honest with you, in the way I knew they would.\"",
        "Saturday, 11 OctoberCardiff Devils v Coventry Blaze (19:00 BST)Sunday, 12 OctoberNottingham Panthers v Cardiff Devils (16:00 BST)",
        "Paul Thompson has brought in nine fresh faces to Cardiff Devils' squad since his appointment in May",
        "With eight days to go until Cardiff Devils' opening Elite League (EIHL) fixture against Coventry Blaze this Saturday, prospects for the new-look Welsh side seemed promising.",
        "Before last weekend Paul Thompson's team had won five of their six games in the Challenge Cup - and with two home games ahead of them looked well set to take control of their 10-game group.",
        "Instead, having dropped a 3-0 lead to lose a helter-skelter Saturday encounter with Coventry 6-5, on Sunday the side collapsed to a 5-0 defeat by Nottingham Panthers.",
        "It left their head coach fuming.",
        "\"I was embarrassed for ourselves,\" said Thompson who took charge of the Devils in the summer.",
        "\"I use the word 'we' because our fans pay good money to come and watch us and for the first time this season, we didn't give them anything to get excited about.\"",
        "In the wake of Sunday's 5-0 loss at the Vindico Arena, Thompson and his coaching staff spent all day Monday working out their response.",
        "\"In the past I've brought the players in on a Monday as a punishment, but they had the day off because we needed 24 hours to digest where we've been and where we are now,\" added the 57-year-old with over 30 years experience of coaching.",
        "\"I waited two days to get in front of them and tell them how I feel. We had a hard workout, and then we had a hard meeting.",
        "\"I tell you, there were some tough things said, but I feel that we've got a group that will respond to that. Every player at one point was singled out for something that we don't believe they're doing right.\"",
        "Cardiff Devils have the highest penalty minutes per game this season, 20.13, a whole 12 minutes more than Coventry Blaze",
        "Having conceded just nine goals in their first six games, last weekend Cardiff conceded 10 in less than 100 minutes of hockey.",
        "\"When your game is flat, when you are chasing, when you're thinking that you are doing the right thing and the five or the six of you aren't on the same page, this happens,\" said Thompson.",
        "\"The level of the league is, if you're not on it, that's going to happen to you.\"",
        "Thompson also points to playing too many minutes outnumbered with players sitting out \"soft, selfish\" two-minute penalties \"that just don't need to be taken\".",
        "\"It's only so long that you can keep defending seven or eight, nine penalties a game that it's going to come back and kick you,\" he said.",
        "\"We were running around and looking for the hits rather than looking to win the puck.",
        "\"As much as we want to play this heavy, fast-forechecking game, we also have to play with our brains.\"",
        "Cardiff Devils and Coventry Blaze will both be playing their first EIHL game of the season on Saturday",
        "With a somewhat ironic twist, the Devils' opening EIHL opponents are the same two sides that beat them last weekend – Coventry and Nottingham.",
        "What might have been a routine start to a league season has now become a hugely important pair of fixtures.",
        "\"We want to get off to a good start in the league and get to playing Devils hockey,\" said Thompson.",
        "\"The last time we won the Elite League here was 2017-18 and that's not good enough for a club like this.",
        "\"This is the hardest league to play in because the league championship is the number one thing to win and in the rest of the world it's not - it's about the play-offs.\"",
        "Cardiff were beaten in overtime by Nottingham in last season's Play-Off final but - despite also winning a first European trophy - previous head coach Pete Russell left the club having finished fourth in EIHL",
        "\"I was brought in to change the culture and bring the every day effect,\" added former Coventry and Sheffield coach Thompson.",
        "\"You're not going to win every night, it's impossible, there's too many good teams.",
        "\"So that focus of being an every-dayer, that focus on us being the team that is going to be right up there, staying within the top three, four teams and having a real opportunity to win a league means that we have to push these guys on a daily basis and they have to push us and they have to push each other.\"",
        "And Thompson, who last season won the Danish League with Odense Bulldogs, is reassured by this week's training sessions that everything will be alright on Elite League opening night.",
        "\"We didn't fulfil our potential last weekend, but the key to it all is recognising that we didn't and try and put it right next time,\" he said.",
        "\"They went on the ice today and proved to me the good bunch that they are.",
        "\"The players have reacted in exactly the way I'd hoped, and to be honest with you, in the way I knew they would.\"",
        "Cardiff Devils v Coventry Blaze (19:00 BST)",
        "Nottingham Panthers v Cardiff Devils (16:00 BST)",
        "Master builder Thompson aims to bring league title back to Cardiff"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/ice-hockey/articles/cjedjq305kgo",
      "main_category": "sport",
      "detailed_category": "ice-hockey",
      "topic": "Ruthless Panthers hammer Devils in Challenge Cup",
      "content": [
        "Cardiff Devils suffered a home Challenge Cup whitewash as Nottingham Panthers struck five times without reply in the Welsh capital.The hosts had hoped to bounce back from Saturday's 6-5 home loss to Coventry Blaze.But ruthless Panthers put paid to that ambition as Didrik Henbrant, Tim Doherty, Matthew Marcinew, Mitchell Fossier and Zsombor Garat found the net.Devils can target revenge against Blaze in the Elite League in Cardiff on Saturday, 11 October (19:00 BST) while Panthers lie in wait for another rematch the following day (16:00 BST).",
        "Ryan Barrow is playing in his third season for Cardiff Devils",
        "Cardiff Devils suffered a home Challenge Cup whitewash as Nottingham Panthers struck five times without reply in the Welsh capital.",
        "The hosts had hoped to bounce back from Saturday's 6-5 home loss to Coventry Blaze.",
        "But ruthless Panthers put paid to that ambition as Didrik Henbrant, Tim Doherty, Matthew Marcinew, Mitchell Fossier and Zsombor Garat found the net.",
        "Devils can target revenge against Blaze in the Elite League in Cardiff on Saturday, 11 October (19:00 BST) while Panthers lie in wait for another rematch the following day (16:00 BST)."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/ice-hockey/articles/c99g84l0k3zo",
      "main_category": "sport",
      "detailed_category": "ice-hockey",
      "topic": "Blaze edge Devils in 11 goal Challenge Cup thriller",
      "content": [
        "Coventry Blaze beat Cardiff Devils in an 11 goal Challenge Cup thriller at the Vindico Arena.Ryan Barrow, Brett Perlini and Brandon Estes gave the sell-out home crowd plenty to cheer as they cruised to a 3-0 lead, with Alessio Luciani pulling one back before the break.Matthew Gleason and Sam Ruffin levelled the scores in the second period before Barrow and Jack Hopkins exchanged goals to make it 4-4 going into the third.Colton Saucerman put Blaze ahead for the first time in the game only for Sam Duggan to equalise.Grant Mismash got the winner four minutes from time to seal a Blaze victory.Devils return to Challenge Cup action on Sunday when they host Nottingham Panthers, before meeting Blaze again on Saturday.",
        "Ryan Barrow is playing in his third season for Cardiff Devils",
        "Coventry Blaze beat Cardiff Devils in an 11 goal Challenge Cup thriller at the Vindico Arena.",
        "Ryan Barrow, Brett Perlini and Brandon Estes gave the sell-out home crowd plenty to cheer as they cruised to a 3-0 lead, with Alessio Luciani pulling one back before the break.",
        "Matthew Gleason and Sam Ruffin levelled the scores in the second period before Barrow and Jack Hopkins exchanged goals to make it 4-4 going into the third.",
        "Colton Saucerman put Blaze ahead for the first time in the game only for Sam Duggan to equalise.",
        "Grant Mismash got the winner four minutes from time to seal a Blaze victory.",
        "Devils return to Challenge Cup action on Sunday when they host Nottingham Panthers, before meeting Blaze again on Saturday."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/ice-hockey/articles/c237z05dyy8o",
      "main_category": "sport",
      "detailed_category": "ice-hockey",
      "topic": "Devils claim second successive Challenge Cup win over Storm",
      "content": [
        "Cardiff Devils completed a second win in 24 hours over Manchester Storm in the Challenge Cup with a 2-1 away victory.Devils had won 3-0 at the Vindico Arena on Friday night, their fourth win in this season's competition.Connor Caponi put Devils ahead inside the opening three minutes at Planet Ice, Altrincham but Kaleb Ergan levelled for the hosts soon after.Kohen Olischefski's goal in the second period saw Devils seal the win to remain top of their pool.Second placed Coventry Blaze - who have have two points fewer than Cardiff with a game in hand - visit south Wales for Devils next game in the competition on Saturday, 4 October (19:00 BST).",
        "Cardiff Devils have won five of six games in the Challenge Cup this season, with four further pool games to come",
        "Cardiff Devils completed a second win in 24 hours over Manchester Storm in the Challenge Cup with a 2-1 away victory.",
        "Devils had won 3-0 at the Vindico Arena on Friday night, their fourth win in this season's competition.",
        "Connor Caponi put Devils ahead inside the opening three minutes at Planet Ice, Altrincham but Kaleb Ergan levelled for the hosts soon after.",
        "Kohen Olischefski's goal in the second period saw Devils seal the win to remain top of their pool.",
        "Second placed Coventry Blaze - who have have two points fewer than Cardiff with a game in hand - visit south Wales for Devils next game in the competition on Saturday, 4 October (19:00 BST)."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/ice-hockey/articles/cvg0nj1w7v9o",
      "main_category": "sport",
      "detailed_category": "ice-hockey",
      "topic": "Devils bounce back to beat Storm",
      "content": [
        "Cardiff Devils returned to winning ways in the Challenge Cup with a 3-0 home victory over Manchester StormDevils suffered their first defeat of the campaign at Coventry Blaze in the previous match having opened the season with three successive wins.Cedric Lacroix's power-play goal in the opening period put the Devils ahead and a power-play goal from Kristoff Kontos doubled their lead in the third period.Storm had a goal ruled out before Josh MacDonald put the puck into the empty net for Devils' third.The teams meet again in the Challenge Cup on Saturday at Ice Planet Altrincham.",
        "Cedric Lacroix (left) scored Cardiff Devils' opening goal against Manchester Storm",
        "Cardiff Devils returned to winning ways in the Challenge Cup with a 3-0 home victory over Manchester Storm",
        "Devils suffered their first defeat of the campaign at Coventry Blaze in the previous match having opened the season with three successive wins.",
        "Cedric Lacroix's power-play goal in the opening period put the Devils ahead and a power-play goal from Kristoff Kontos doubled their lead in the third period.",
        "Storm had a goal ruled out before Josh MacDonald put the puck into the empty net for Devils' third.",
        "The teams meet again in the Challenge Cup on Saturday at Ice Planet Altrincham."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/ice-hockey/articles/cqjee1r79q7o",
      "main_category": "sport",
      "detailed_category": "ice-hockey",
      "topic": "Cardiff Devils' winning run ends at Coventry Blaze",
      "content": [
        "Cardiff Devils' unbeaten start to the season was ended as Coventry Blaze edged out the visitors 2-1 in the Challenge Cup.Ryan Barrow put Devils ahead within a minute as they looked set to build on their opening three wins of the competition that included a 7-1 hammering of Guildford Flames on Friday.But Michael Pelech equalised on a power-play early in the second period for Blaze before Colton Saucerman netted what proved to be the winner at the Skydome Arena.Devils continue their Challenge Cup campaign in the Welsh capital against Manchester Storm on Friday, 26 September (19:00 BST).",
        "Cardiff Devils had won their opening three games of 2025-26",
        "Cardiff Devils' unbeaten start to the season was ended as Coventry Blaze edged out the visitors 2-1 in the Challenge Cup.",
        "Ryan Barrow put Devils ahead within a minute as they looked set to build on their opening three wins of the competition that included a 7-1 hammering of Guildford Flames on Friday.",
        "But Michael Pelech equalised on a power-play early in the second period for Blaze before Colton Saucerman netted what proved to be the winner at the Skydome Arena.",
        "Devils continue their Challenge Cup campaign in the Welsh capital against Manchester Storm on Friday, 26 September (19:00 BST)."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/ice-hockey/articles/c8jmp3yx3nko",
      "main_category": "sport",
      "detailed_category": "ice-hockey",
      "topic": "Cardiff Devils hammer Guildford Flames 7-1",
      "content": [
        "Cardiff Devils overcame an early Guildford Flames goal in the Challenge Cup to comfortably continue their winning start to the season.Charlie Curti struck first for the visitors, but after Nolan Yaremko levelled, the hosts seized the initiative.Cole Sanford put Devils ahead with Ben Davies, Josh MacDonald, Brandon Estes, Yaremko and Kristoff Kontos completing a dominant display.Devils continue their Challenge Cup campaign at Coventry Blaze on Sunday, 21 September (17:30 BST) while Flames also go there a day earlier for an 18:00 BST start.",
        "Cardiff Devils are unbeaten in their opening three games of 2025-26",
        "Cardiff Devils overcame an early Guildford Flames goal in the Challenge Cup to comfortably continue their winning start to the season.",
        "Charlie Curti struck first for the visitors, but after Nolan Yaremko levelled, the hosts seized the initiative.",
        "Cole Sanford put Devils ahead with Ben Davies, Josh MacDonald, Brandon Estes, Yaremko and Kristoff Kontos completing a dominant display.",
        "Devils continue their Challenge Cup campaign at Coventry Blaze on Sunday, 21 September (17:30 BST) while Flames also go there a day earlier for an 18:00 BST start."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/ice-hockey/articles/cj9zerd20zro",
      "main_category": "sport",
      "detailed_category": "ice-hockey",
      "topic": "Devils beat Steelers in overtime to maintain winning start",
      "content": [
        "Cardiff Devils maintained their winning start to the season with a 3-2 overtime victory over Sheffield Steelers in the Challenge Cup.Cole Sanford fired the hosts ahead in the 10th minute, with Ben Davies extending Cardiff's lead early on in the second period.Dominic Cormier responded for the Steelers, and Mitchell Balmas levelled up the contest in the opening seconds of the third period.But Brandon Estes struck the winner for the Welsh side in overtime as they made it two wins from two at the start of the new campaign.Devils return to Challenge Cup action against Guildford Flames at the Vindico Arena on Friday (19:00 BST).Steelers make the trip to the Motorpoint Arena to take on Nottingham Panthers on Saturday (19:00 BST).",
        "Cole Sanford was among the scorers as Cardiff Devils started their 2025-26 season with a 6-3 win against Nottingham Panthers prior to beating Sheffield Steelers the following day",
        "Cardiff Devils maintained their winning start to the season with a 3-2 overtime victory over Sheffield Steelers in the Challenge Cup.",
        "Cole Sanford fired the hosts ahead in the 10th minute, with Ben Davies extending Cardiff's lead early on in the second period.",
        "Dominic Cormier responded for the Steelers, and Mitchell Balmas levelled up the contest in the opening seconds of the third period.",
        "But Brandon Estes struck the winner for the Welsh side in overtime as they made it two wins from two at the start of the new campaign.",
        "Devils return to Challenge Cup action against Guildford Flames at the Vindico Arena on Friday (19:00 BST).",
        "Steelers make the trip to the Motorpoint Arena to take on Nottingham Panthers on Saturday (19:00 BST)."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/ice-hockey/articles/cn4lw02982eo",
      "main_category": "sport",
      "detailed_category": "ice-hockey",
      "topic": "Highlights: Giants lose to Stars in Challenge Cup",
      "content": [
        "Watch highlights as Belfast Giants begin their defence of the Challenge Cup with a 7-4 defeat against Dundee Stars at the SSE Arena on Saturday.The Giants are back in action on Sunday as they take on Fife Flyers at 17:00 BST.",
        "This video can not be played",
        "Highlights: Giants fall to defeat against Stars in Challenge Cup",
        "Watch highlights as Belfast Giants begin their defence of the Challenge Cup with a 7-4 defeat against Dundee Stars at the SSE Arena on Saturday.",
        "The Giants are back in action on Sunday as they take on Fife Flyers at 17:00 BST."
      ]
    }
  ]
}