{
  "scraped_at": "2025-10-27T18:56:59.799546",
  "total_articles": 8,
  "category": "modern-pentathlon",
  "articles_per_category": 100,
  "articles": [
    {
      "url": "https://www.bbc.com/sport/olympics/articles/cdxng025xw8o",
      "main_category": "sport",
      "detailed_category": "modern-pentathlon",
      "topic": "Pentathletes must 'crack on' with obstacle event",
      "content": [
        "Joe Choong might be a former Olympic gold medallist in modern pentathlon but like all other athletes in the sport, he is a complete novice when it comes to the new 'Ninja Warrior' style obstacle racing recently introduced as a new discipline.For the past six weeks Choong, who won gold at the Tokyo 2020 Games, has been getting to grips with the obstacle assault course that has replaced showjumping as one of the five events. It features an 80m course which athletes have to get through as quickly as possible, packed with eight obstacles such as monkey bars, high rings and a wall run. \"I was against the change; if I could choose I still wouldn't choose this but there's nothing we can do,\" Choong told BBC Radio Somerset.\"I fought as hard as I could to stop it - so did a lot of other athletes - and now we have to accept it or move on.\"Fencing, swimming, and a combined running and shooting event make up the four other disciplines that remain in modern pentathlon.Choong was one of the most vocal athletes against the overhaul to the sport's traditional format, brought in after the equestrian element came under spotlight when a German coach was thrown out of the Tokyo Olympics for appearing to punch a horse.However, after taking a break following the Paris Olympics - where he finished ninth - the 29-year-old is back in Bath at the Team GB modern pentathlon base, giving the obstacle course a go.\"It just depends what part of your career you're in, whether you feel it's a good time to move on or you give the new event a try,\" Choong said.\"It's definitely something I'm going to get stuck in with and crack on with but I'm not sure relishing is quite the right word.\"",
        "Choong stresses the new discipline is \"fun\". Six of the eight obstacles will remain the same every competition, while the other two will be a variant of six more, meaning athletes have to train with all 12.\"I find it a little bit strange compared to the other more historic sports because you can come into this and be relatively competent quickly, so that learning curve seems like a bit of a different trajectory compared to the other sports,\" he said.Modern pentathletes tend to be well-rounded, versatile athletes but the new discipline is very \"upper body focused\" Choong says, and requires a different strength and conditioning to the horse riding it has replaced.Much of Choong's six weeks of training so far has been spent in the gym, or with the physios, rather than on the course itself.\"The hard part is training to improve because you've got to be swinging on your arms, doing pull-ups for essentially an hour,\" Choong said.\"The hardest part for me is doing that conditioning, getting my body ready so that I can actually work on improving.\"",
        "Olivia Green, who is also on the Great Britain senior performance squad, was similarly against the event change, but has come to accept it is here to stay.\"If I've wanted to do pentathlon, this is the reality I've needed to accept and actually embrace and enjoy,\" she said. \"I'm feeling a lot better about it now than I was.\" The event, though, is still very much in its infancy and Green believes the only way athletes will improve at it is when competitions start in earnest this season. The World Cup series begins in April, with the European Championships in June and World Championships in August.\"We've had some national rankings [competitions] and that's really helped,\" Green said. \"Those will really help just get used to competing in the sport. We've still got a long way to go and a lot to learn.\"Hopefully by August time I'm going to be a lot more prepared than I am now.\"",
        "The format of modern pentathlon has changed in the sport's recent history as the authorities try to push it more into the public mainstream, beyond just the Olympic Games.It first appeared at the 1912 with the five events - swimming, fencing, show jumping, shooting and running - modelled on the skills required by a soldier.While the obstacle course section might bring in a new audience, Choong is unsure whether this is the golden change the sport needs.\"Every Olympic cycle has had some sort of change in one way or another with the promise of it bringing pentathlon to the masses,\" Choong said. \"Is this the change that's going to do it? I don't know, I'd love for pentathlon to be a mainstream sport but I'm not sure.\"As for whether he will be sticking with it through to the 2028 Olympics in Los Angeles, Choong is also keeping his options open.\"It's definitely in my mind that's the next thing, that's on the horizon,\" he said. \"But for me my focus is on a couple of other personal bits right now that I want to have done and have sorted in my life.\"",
        "This video can not be played",
        "How the modern pentathlon obstacle course event works",
        "Joe Choong might be a former Olympic gold medallist in modern pentathlon but like all other athletes in the sport, he is a complete novice when it comes to the new 'Ninja Warrior' style obstacle racing recently introduced as a new discipline.",
        "For the past six weeks Choong, who won gold at the Tokyo 2020 Games, has been getting to grips with the obstacle assault course that has replaced showjumping as one of the five events.",
        "It features an 80m course which athletes have to get through as quickly as possible, packed with eight obstacles such as monkey bars, high rings and a wall run.",
        "\"I was against the change; if I could choose I still wouldn't choose this but there's nothing we can do,\" Choong told BBC Radio Somerset.",
        "\"I fought as hard as I could to stop it - so did a lot of other athletes - and now we have to accept it or move on.\"",
        "Fencing, swimming, and a combined running and shooting event make up the four other disciplines that remain in modern pentathlon.",
        "Choong was one of the most vocal athletes against the overhaul to the sport's traditional format, brought in after the equestrian element came under spotlight when a German coach was thrown out of the Tokyo Olympics for appearing to punch a horse.",
        "However, after taking a break following the Paris Olympics - where he finished ninth - the 29-year-old is back in Bath at the Team GB modern pentathlon base, giving the obstacle course a go.",
        "\"It just depends what part of your career you're in, whether you feel it's a good time to move on or you give the new event a try,\" Choong said.",
        "\"It's definitely something I'm going to get stuck in with and crack on with but I'm not sure relishing is quite the right word.\"",
        "Athletes practise the new 'obstacle course' at Team GB's base in Bath",
        "Choong stresses the new discipline is \"fun\".",
        "Six of the eight obstacles will remain the same every competition, while the other two will be a variant of six more, meaning athletes have to train with all 12.",
        "\"I find it a little bit strange compared to the other more historic sports because you can come into this and be relatively competent quickly, so that learning curve seems like a bit of a different trajectory compared to the other sports,\" he said.",
        "Modern pentathletes tend to be well-rounded, versatile athletes but the new discipline is very \"upper body focused\" Choong says, and requires a different strength and conditioning to the horse riding it has replaced.",
        "Much of Choong's six weeks of training so far has been spent in the gym, or with the physios, rather than on the course itself.",
        "\"The hard part is training to improve because you've got to be swinging on your arms, doing pull-ups for essentially an hour,\" Choong said.",
        "\"The hardest part for me is doing that conditioning, getting my body ready so that I can actually work on improving.\"",
        "Obstacle racing gets modern pentathlon approval",
        "Olivia Green, who is also on the Great Britain senior performance squad, was similarly against the event change, but has come to accept it is here to stay.",
        "\"If I've wanted to do pentathlon, this is the reality I've needed to accept and actually embrace and enjoy,\" she said.",
        "\"I'm feeling a lot better about it now than I was.\"",
        "The event, though, is still very much in its infancy and Green believes the only way athletes will improve at it is when competitions start in earnest this season.",
        "The World Cup series begins in April, with the European Championships in June and World Championships in August.",
        "\"We've had some national rankings [competitions] and that's really helped,\" Green said.",
        "\"Those will really help just get used to competing in the sport. We've still got a long way to go and a lot to learn.",
        "\"Hopefully by August time I'm going to be a lot more prepared than I am now.\"",
        "Joe Choong became the first British man to win individual Olympic gold in modern pentathlon in Tokyo",
        "The format of modern pentathlon has changed in the sport's recent history as the authorities try to push it more into the public mainstream, beyond just the Olympic Games.",
        "It first appeared at the 1912 with the five events - swimming, fencing, show jumping, shooting and running - modelled on the skills required by a soldier.",
        "While the obstacle course section might bring in a new audience, Choong is unsure whether this is the golden change the sport needs.",
        "\"Every Olympic cycle has had some sort of change in one way or another with the promise of it bringing pentathlon to the masses,\" Choong said.",
        "\"Is this the change that's going to do it? I don't know, I'd love for pentathlon to be a mainstream sport but I'm not sure.\"",
        "As for whether he will be sticking with it through to the 2028 Olympics in Los Angeles, Choong is also keeping his options open.",
        "\"It's definitely in my mind that's the next thing, that's on the horizon,\" he said.",
        "\"But for me my focus is on a couple of other personal bits right now that I want to have done and have sorted in my life.\""
      ]
    },
    {
      "url": "https://www.bbc.com/sport/modern-pentathlon/articles/cn4mwn1x39do",
      "main_category": "sport",
      "detailed_category": "modern-pentathlon",
      "topic": "Former Olympic champion French retires",
      "content": [
        "Modern pentathlete Kate French, who won Olympic gold at the Tokyo Games, has announced her retirement from the sport. French also won five world championship medals and six European gold medals in her career, and claimed the World Cup title during a dominant 2021 in which she was ranked number one in the world.The 33-year-old returned to the sport after 18 months away last summer to compete in Paris, but sickness hampered her chances of winning another medal and she withdrew from competition on the final day.In a post on Instagram, external, French said she leaves the sport \"with a heart full of happiness and a head full of wonderful memories\".She added: \"There were many highs and lows, but it's been an amazing adventure and truth be told, I wouldn't change a thing.\"",
        "French, from Kent but now based in Wiltshire, has been involved in the sport since joining the British Pathway Programme in 2007. In 2010, she was part of the team that won the junior world title before winning a first senior world gold medal in the team event in Taiwan in 2013. French finished fifth in Rio in 2016 at her first Olympic Games before storming to the title in Tokyo five years later.She swam a personal best in the 200m freestyle and finished more than 15 seconds ahead in the laser run to set a new Olympic record for the highest points total in the event.French took a break from the sport after winning gold in 2021, only competing twice the following year, before stepping back again in 2023 as she did \"not want to regret\" not trying out for the Paris Games last summer.\"From a performance side Kate dominated the sport, and from a personal side she continues to inspire in the way she did it,\" said Jamie Cooke, head of performance at Pentathlon GB.Modern pentathlon is undergoing a significant overhaul before the next Games in Los Angeles in 2028, with showjumping removed from the five-event sport to be replaced by a Ninja Warrior-style obstacle course.",
        "Kate French won modern pentathlon gold at the Tokyo Olympics in 2021",
        "Modern pentathlete Kate French, who won Olympic gold at the Tokyo Games, has announced her retirement from the sport.",
        "French also won five world championship medals and six European gold medals in her career, and claimed the World Cup title during a dominant 2021 in which she was ranked number one in the world.",
        "The 33-year-old returned to the sport after 18 months away last summer to compete in Paris, but sickness hampered her chances of winning another medal and she withdrew from competition on the final day.",
        "In a post on Instagram, external, French said she leaves the sport \"with a heart full of happiness and a head full of wonderful memories\".",
        "She added: \"There were many highs and lows, but it's been an amazing adventure and truth be told, I wouldn't change a thing.\"",
        "French, from Kent but now based in Wiltshire, has been involved in the sport since joining the British Pathway Programme in 2007.",
        "In 2010, she was part of the team that won the junior world title before winning a first senior world gold medal in the team event in Taiwan in 2013.",
        "French finished fifth in Rio in 2016 at her first Olympic Games before storming to the title in Tokyo five years later.",
        "She swam a personal best in the 200m freestyle and finished more than 15 seconds ahead in the laser run to set a new Olympic record for the highest points total in the event.",
        "French took a break from the sport after winning gold in 2021, only competing twice the following year, before stepping back again in 2023 as she did \"not want to regret\" not trying out for the Paris Games last summer.",
        "\"From a performance side Kate dominated the sport, and from a personal side she continues to inspire in the way she did it,\" said Jamie Cooke, head of performance at Pentathlon GB.",
        "Modern pentathlon is undergoing a significant overhaul before the next Games in Los Angeles in 2028, with showjumping removed from the five-event sport to be replaced by a Ninja Warrior-style obstacle course."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/olympics/articles/cwy543gzle0o",
      "main_category": "sport",
      "detailed_category": "modern-pentathlon",
      "topic": "Bryson 'gutted' to miss out on Olympic medal",
      "content": [
        "Kerenza Bryson says she is \"gutted\" not to have won a modern-pentathlon medal at the Olympic Games.The 25-year-old from Plymouth had been the top qualifier for Sunday's final but could only finish in ninth place. Bryson, who has balanced training for Paris 2024 with her work as a doctor and with the armed forces, was 57 points off Hungary's gold-medal winner Michelle Gulyas, having started more than a minute behind her in the final event.\"I'm gutted, really disappointed,\" she told BBC Sport after the final at Versailles.\"This is my first Games, so I am really happy to be here and I'm really trying to make myself feel happy and grateful because there's a lot of people home that have worked really hard and haven't managed to get here.\"I can call myself an Olympian now and I have to remember that I have juggled a lot of other things, including medicine and the military, so I've got a few more things to focus on as well.\"But not getting a medal has made me hungry to come back and get more.\"",
        "Kerenza Bryson went into the Olympic Games as the reigning European champion",
        "Kerenza Bryson says she is \"gutted\" not to have won a modern-pentathlon medal at the Olympic Games.",
        "The 25-year-old from Plymouth had been the top qualifier for Sunday's final but could only finish in ninth place.",
        "Bryson, who has balanced training for Paris 2024 with her work as a doctor and with the armed forces, was 57 points off Hungary's gold-medal winner Michelle Gulyas, having started more than a minute behind her in the final event.",
        "\"I'm gutted, really disappointed,\" she told BBC Sport after the final at Versailles.",
        "\"This is my first Games, so I am really happy to be here and I'm really trying to make myself feel happy and grateful because there's a lot of people home that have worked really hard and haven't managed to get here.",
        "\"I can call myself an Olympian now and I have to remember that I have juggled a lot of other things, including medicine and the military, so I've got a few more things to focus on as well.",
        "\"But not getting a medal has made me hungry to come back and get more.\""
      ]
    },
    {
      "url": "https://www.bbc.com/sport/olympics/articles/cj62z9ylw0po",
      "main_category": "sport",
      "detailed_category": "modern-pentathlon",
      "topic": "GB's Bryson misses medal after ill French withdraws",
      "content": [
        "Kerenza Bryson could not add to Great Britain's medal haul at Paris 2024 as she fell out of contention in the Olympic women's modern pentathlon.The 25-year-old junior doctor - who was Team GB's sole representative in the final because defending champion Kate French withdrew before Sunday's climax - led after Saturday’s semi-finals but finished ninth in the final.\"I've got mixed emotions,\" Bryson said.\"Not getting a medal here makes me hungry for another Olympic Games.\"Bryson slipped to fifth after the opening showjumping event - which will be dropped for Los Angeles 2028 as a result of the horse-punching controversy in Tokyo - and fell to sixth by losing quickly to Italy's Elena Micheli in the fencing.Swimming is considered the Briton's weakest event and, needing a fast 200m freestyle to make up ground, she trailed the rest of the field in her heat.That left Bryson sitting seventh going into the final event of laser run - which is a 3,000m run, split into five 600m laps and four visits to the shooting range.She needed to make up a gap of 30 seconds in the time trial to finish on the podium, but that never looked likely.Hungary's Michelle Gulyas won gold with a new world record of 1,461 points, just ahead of French veteran Elodie Clouvel, who finished on 1,452.South Korea's Seung-min Seong claimed bronze with 1,441 as Bryson ended on 1,404.Bryson, who is also an army reservist, received a huge ovation from British fans as she jogged around the track with a Union Jack minutes later.\"I'm really disappointed with my performance, I came here to get a medal and I thought I was capable of one,\" said Bryson, who took a year off medicine and starts a NHS job in Bath next month.\"But I'm also trying to be really positive and remember I'm Olympian. \"I'm also a doctor and an army officer and sometimes you have to remember there is more to life than sport and medals.\"",
        "Earlier, French's chances of matching her medal at Tokyo 2020 were dashed because of sickness.The 33-year-old was ranked fifth after Saturday's semi-finals, just four points behind leader Bryson.\"This has been an extremely difficult decision for Kate as she had hoped to defend her Olympic title and ride in the jumping for a final time in Olympic competition,\" a Team GB statement said.After winning gold in Tokyo in 2021, French took a break from the sport in 2023 and only returned to training last August.Her withdrawal and Bryson's struggles meant Britain missed out on an Olympic medal in the women's pentathlon for only the second time - after Rio 2016 - since the event was introduced in 2000.",
        "Kerenza Bryson won gold at the 2024 European Championships last month but could not add an Olympic medal",
        "Kerenza Bryson could not add to Great Britain's medal haul at Paris 2024 as she fell out of contention in the Olympic women's modern pentathlon.",
        "The 25-year-old junior doctor - who was Team GB's sole representative in the final because defending champion Kate French withdrew before Sunday's climax - led after Saturday’s semi-finals but finished ninth in the final.",
        "\"I've got mixed emotions,\" Bryson said.",
        "\"Not getting a medal here makes me hungry for another Olympic Games.\"",
        "Bryson slipped to fifth after the opening showjumping event - which will be dropped for Los Angeles 2028 as a result of the horse-punching controversy in Tokyo - and fell to sixth by losing quickly to Italy's Elena Micheli in the fencing.",
        "Swimming is considered the Briton's weakest event and, needing a fast 200m freestyle to make up ground, she trailed the rest of the field in her heat.",
        "That left Bryson sitting seventh going into the final event of laser run - which is a 3,000m run, split into five 600m laps and four visits to the shooting range.",
        "She needed to make up a gap of 30 seconds in the time trial to finish on the podium, but that never looked likely.",
        "Hungary's Michelle Gulyas won gold with a new world record of 1,461 points, just ahead of French veteran Elodie Clouvel, who finished on 1,452.",
        "South Korea's Seung-min Seong claimed bronze with 1,441 as Bryson ended on 1,404.",
        "Bryson, who is also an army reservist, received a huge ovation from British fans as she jogged around the track with a Union Jack minutes later.",
        "\"I'm really disappointed with my performance, I came here to get a medal and I thought I was capable of one,\" said Bryson, who took a year off medicine and starts a NHS job in Bath next month.",
        "\"But I'm also trying to be really positive and remember I'm Olympian.",
        "\"I'm also a doctor and an army officer and sometimes you have to remember there is more to life than sport and medals.\"",
        "French won gold in Tokyo with an Olympic record of 1,385 points",
        "Earlier, French's chances of matching her medal at Tokyo 2020 were dashed because of sickness.",
        "The 33-year-old was ranked fifth after Saturday's semi-finals, just four points behind leader Bryson.",
        "\"This has been an extremely difficult decision for Kate as she had hoped to defend her Olympic title and ride in the jumping for a final time in Olympic competition,\" a Team GB statement said.",
        "After winning gold in Tokyo in 2021, French took a break from the sport in 2023 and only returned to training last August.",
        "Her withdrawal and Bryson's struggles meant Britain missed out on an Olympic medal in the women's pentathlon for only the second time - after Rio 2016 - since the event was introduced in 2000.",
        "Today's Olympics guide",
        "Full Paris Olympics schedule",
        "BBC's Paris Olympics TV schedule"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/olympics/articles/cdrl0xk6ry7o",
      "main_category": "sport",
      "detailed_category": "modern-pentathlon",
      "topic": "Third Olympic title an 'amazing honour' for Kipyegon",
      "content": [
        "Faith Kipyegon said it was an \"amazing honour\" to set an Olympic record as she won a third successive women’s 1500m title at the Games.The Kenyan’s remarkable feat came after team-mate Emmanuel Wanyonyi triumphed in the men’s 800m final on a medal-heavy day for Africa.Ahmed Elgendy registered a world record score in the men's modern pentathlon to secure Egypt's first gold at Paris 2024, while Ethiopia's Tamirat Tola put in a dominant display in the men's marathon.Kipyegon added 1500m gold to her dramatic silver medal in the 5000m on Monday – a race which had seen the 30-year-old disqualified for obstruction but later reinstated after an appeal.\"It's a big, big achievement,\" she said.\"I was really looking forward to defending my title. I had a dream, I completed it.\"I managed to make history, to win the gold medal in the 1500. It was my key target. I'm so, so grateful.\"Wanyonyi, meanwhile, clocked the third-fastest 800m of all time to cross the line in one minute 41.19 seconds – but he only beat Canada's Marco Arop by 0.01 seconds.Algeria's Djamel Sedjati took bronze, while Kenya's Ronald Kwemoi secured silver in the men's 5,000m behind Jakob Ingebrigtsen.Newly crowned 200m champion Letsile Tebogo helped Botswana to silver and a new African record in the men’s 4x400m relay and South Africa's Jo-Ane van Dyk finished second in the women’s javelin.",
        "Away from the Stade de France, modern pentathlete Elgendy managed to upgrade his silver medal from Tokyo 2020.The 24-year-old, whose performances in the final earned him a 17-second head start in the last event, the laser run, said he was happy to top the podium following a testing three years since competing in Japan.\"It means a lot because the last three years that I've been competing, I've had a lot of struggles and many physical and mental problems with injuries and pain,\" he said.\"It's the only gold medal [for Egypt] in this Olympic Games. I'm so proud to get this medal.\"Earlier on Saturday, Egyptian weightlifter Sara Ahmed claimed silver in the women’s 81kg category.Ahmed, the former world champion in the 76kg weight class who was a flag bearer at the opening ceremony, lifted an impressive 151kg in her second attempt of the clean and jerk to finish with a total of 268kg.\"I wanted to get the gold, but I'm very happy and satisfied that I got the silver,\" the 26-year-old said.\"In the future, this experience will make me better and take me to the top.\"Elsewhere, Ivorian taekwondo athlete Cheick Sallah Cisse picked up bronze in the men's +80kg division.",
        "Faith Kipyegon set an Olympic record of 3:51.29 as she won the women's 1500m at Paris 2024",
        "Faith Kipyegon said it was an \"amazing honour\" to set an Olympic record as she won a third successive women’s 1500m title at the Games.",
        "The Kenyan’s remarkable feat came after team-mate Emmanuel Wanyonyi triumphed in the men’s 800m final on a medal-heavy day for Africa.",
        "Ahmed Elgendy registered a world record score in the men's modern pentathlon to secure Egypt's first gold at Paris 2024, while Ethiopia's Tamirat Tola put in a dominant display in the men's marathon.",
        "Kipyegon added 1500m gold to her dramatic silver medal in the 5000m on Monday – a race which had seen the 30-year-old disqualified for obstruction but later reinstated after an appeal.",
        "\"It's a big, big achievement,\" she said.",
        "\"I was really looking forward to defending my title. I had a dream, I completed it.",
        "\"I managed to make history, to win the gold medal in the 1500. It was my key target. I'm so, so grateful.\"",
        "Wanyonyi, meanwhile, clocked the third-fastest 800m of all time to cross the line in one minute 41.19 seconds – but he only beat Canada's Marco Arop by 0.01 seconds.",
        "Algeria's Djamel Sedjati took bronze, while Kenya's Ronald Kwemoi secured silver in the men's 5,000m behind Jakob Ingebrigtsen.",
        "Newly crowned 200m champion Letsile Tebogo helped Botswana to silver and a new African record in the men’s 4x400m relay and South Africa's Jo-Ane van Dyk finished second in the women’s javelin.",
        "Ahmed Elgendy scored a world record 1,555 points to become the first Egyptian to win the men's modern pentathlon",
        "Away from the Stade de France, modern pentathlete Elgendy managed to upgrade his silver medal from Tokyo 2020.",
        "The 24-year-old, whose performances in the final earned him a 17-second head start in the last event, the laser run, said he was happy to top the podium following a testing three years since competing in Japan.",
        "\"It means a lot because the last three years that I've been competing, I've had a lot of struggles and many physical and mental problems with injuries and pain,\" he said.",
        "\"It's the only gold medal [for Egypt] in this Olympic Games. I'm so proud to get this medal.\"",
        "Earlier on Saturday, Egyptian weightlifter Sara Ahmed claimed silver in the women’s 81kg category.",
        "Ahmed, the former world champion in the 76kg weight class who was a flag bearer at the opening ceremony, lifted an impressive 151kg in her second attempt of the clean and jerk to finish with a total of 268kg.",
        "\"I wanted to get the gold, but I'm very happy and satisfied that I got the silver,\" the 26-year-old said.",
        "\"In the future, this experience will make me better and take me to the top.\"",
        "Elsewhere, Ivorian taekwondo athlete Cheick Sallah Cisse picked up bronze in the men's +80kg division."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/modern-pentathlon/articles/cyj3jyl0v3no",
      "main_category": "sport",
      "detailed_category": "modern-pentathlon",
      "topic": "Modern pentathlon at the Paris 2024 Olympics",
      "content": [
        "Modern pentathlon was introduced to the Olympic programme in 1912 and has featured ever since, despite its future coming under scrutiny regularly.Here's all you need to know about modern pentathlon at Paris 2024.",
        "The modern pentathlon events run from 8-11 August. They are taking place at the Palace of Versailles and the North Paris Arena.There are two medal events - women's individual and men's individual.",
        "Modern pentathlon is made up of four events combining five sports: Riding, fencing, swimming, running and shooting.In Paris, it will be a new two-hour condensed format and semi-finals have also been introduced which will reduce the fields from 36 to 18 competitors.Athletes will compete in fencing, show jumping and swimming before points are converted into a time handicap for the concluding laser run of five 600m laps and four stops at a shooting range.In riding, the athlete is allocated an unfamiliar horse in a draw just 20 minutes before they take part in a show jumping task.This will be the last Olympics in which riding is featured following the furore at Tokyo 2020 when German trainer Kim Raisner was sent home in disgrace after being filmed hitting the horse Saint Boy.Fencing is split into two rounds: a ranking round where athletes compete in a round-robin basis, and a bonus round where the winner stays on.Swimming is a 200m freestyle event.",
        "In short, yes. A total of 72 athletes will compete in Paris, with 36 in the women’s and 36 in the men’s. It is the same number of athletes as Tokyo 2020.Each nation can have four athletes - two men and two women.Great Britain's Joe Choong, who won gold in Tokyo 2020, will be defending his title.He secured his place in Paris after winning the World Championships in Bath and claiming silver at the European Championships in Poland last year.Kate French won the women's event in Tokyo as part of a golden double for Britain.Earlier this year, she stated she wanted to defend her title in Paris and returned to competition after 18 months out.",
        "Hungary is the leading nation at the Olympic Games, having won a combined 23 medals.Great Britain is fourth in the all-time table and has won nine medals.Britain won gold in both men's and women's events at Tokyo 2020 after victories for Choong and French.",
        "While the previous format for the modern pentathlon could take days to complete, the event for 2024 has been condensed into two-hour competitions, with individual disciplines taking place in a new order, at the same venue:35 minutes of equestrian (jumping)5 minutes break20 minutes of fencing (épee) - bonus round10 minutes break15 minutes of swimming (200m freestyle)15 minutes break20 minutes combined event (laser run)",
        "Kate French won gold for Great Britain in the women's event at Tokyo 2020",
        "Modern pentathlon was introduced to the Olympic programme in 1912 and has featured ever since, despite its future coming under scrutiny regularly.",
        "Here's all you need to know about modern pentathlon at Paris 2024.",
        "The modern pentathlon events run from 8-11 August. They are taking place at the Palace of Versailles and the North Paris Arena.",
        "There are two medal events - women's individual and men's individual.",
        "Modern pentathlon is made up of four events combining five sports: Riding, fencing, swimming, running and shooting.",
        "In Paris, it will be a new two-hour condensed format and semi-finals have also been introduced which will reduce the fields from 36 to 18 competitors.",
        "Athletes will compete in fencing, show jumping and swimming before points are converted into a time handicap for the concluding laser run of five 600m laps and four stops at a shooting range.",
        "In riding, the athlete is allocated an unfamiliar horse in a draw just 20 minutes before they take part in a show jumping task.",
        "This will be the last Olympics in which riding is featured following the furore at Tokyo 2020 when German trainer Kim Raisner was sent home in disgrace after being filmed hitting the horse Saint Boy.",
        "Fencing is split into two rounds: a ranking round where athletes compete in a round-robin basis, and a bonus round where the winner stays on.",
        "Swimming is a 200m freestyle event.",
        "In short, yes. A total of 72 athletes will compete in Paris, with 36 in the women’s and 36 in the men’s. It is the same number of athletes as Tokyo 2020.",
        "Each nation can have four athletes - two men and two women.",
        "Great Britain's Joe Choong, who won gold in Tokyo 2020, will be defending his title.",
        "He secured his place in Paris after winning the World Championships in Bath and claiming silver at the European Championships in Poland last year.",
        "Kate French won the women's event in Tokyo as part of a golden double for Britain.",
        "Earlier this year, she stated she wanted to defend her title in Paris and returned to competition after 18 months out.",
        "Hungary is the leading nation at the Olympic Games, having won a combined 23 medals.",
        "Great Britain is fourth in the all-time table and has won nine medals.",
        "Britain won gold in both men's and women's events at Tokyo 2020 after victories for Choong and French.",
        "While the previous format for the modern pentathlon could take days to complete, the event for 2024 has been condensed into two-hour competitions, with individual disciplines taking place in a new order, at the same venue:",
        "35 minutes of equestrian (jumping)",
        "20 minutes of fencing (épee) - bonus round",
        "15 minutes of swimming (200m freestyle)",
        "20 minutes combined event (laser run)",
        "When do the Olympics start?",
        "Great Britain's team for 2024 Paris Olympics"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/modern-pentathlon/articles/c4nnr44jr4ro",
      "main_category": "sport",
      "detailed_category": "modern-pentathlon",
      "topic": "Choong to chase gold before change 'no-one wanted'",
      "content": [
        "Olympic champion Joe Choong has one chance remaining to win another modern pentathlon medal before the event changes in a way he says \"no-one wanted\".Paris 2024 will be the last Games to feature the current format, with showjumping being replaced with a ninja warrior-style obstacle course at Los Angeles 2028.The equestrian element of the five-sport event came under the spotlight at the Tokyo Games in 2021 when a German coach was thrown out for appearing to punch a horse who was refusing to jump or trot.Choong, who was on Wednesday named in Team GB's Olympic team, says the sport should have considered changes to the showjumping element before bringing in a completely different sport that athletes like him have never done before.\"I think the way it was announced follows on from the poor management of the sport; we as athletes were completely ignored. No-one wanted it to happen,\" the 29-year-old told BBC Sport.He added that measures to improve horse welfare in hot conditions were among the changes that could have been explored.“The board are arguing that ninja warrior is a big sport and can make our sport a mass participation one. It doesn't ring true because horse riding is already a huge sport on its own.\"If we can’t get the numbers with horse riding I don’t see how we will with obstacle racing.\"Choong has never trained in obstacle course racing but will start after Paris and, while he is open to the change, believes it gives an advantage to younger pentathletes.\"We will only have four years to train for this completely new sport and then compete at it at an Olympic Games, where we're expected to be elite,\" he said. \"It's not going to be the same standard as what we can produce in the other sports.\" Choong will head to Paris alongside fellow Olympic champion Kate French, Kerenza Bryson - who took an individual bronze and team silver at last year's world championships - and Myles Pillage, a world silver medallist in the team event.\"I want to be as good as I can be and the first British man to defend an Olympic pentathlon title,\" Choong said.",
        "Modern pentathlon has been on the Olympic programme since 1912, with the women’s event introduced in 2000.It currently consists of fencing, horse riding, swimming, running and laser shooting.In the equestrian element, horses are allocated at random to each athlete, who is then given 20 minutes to bond with the animal before embarking on a showjumping course.During the 2020 Tokyo Olympics, German pentathlete Annika Schleu was given a horse that was not co-operating. The animal refused to jump around the course and as a result Schleu, who had been a gold medal contender, significantly fell down the rankings.Schleu and her coach Kim Raisner were accused of animal mistreatment after the event, as accusations arose of the pentathlete whipping the horse and her coach punching the animal.An investigation was launched into the incident but has since been dropped. However, the accusations resulted in horse riding being removed by the modern pentathlon board after Paris 2024.Modern pentathlon has also had a long struggle with viewership, ranking as one of the weakest sports in terms of social media metrics and hours watched according to the International Olympic Committee (IOC).The introduction of obstacle racing played a big part in keeping modern pentathlon in the Olympic programme, with the sport’s president Klaus Schormann saying the event would be \"more dynamic and exciting for spectators and fans\" after being confirmed for Los Angeles 2028.Obstacle racing was selected from 61 suggestions – including climbing, javelin and orienteering - to replace the equestrian element.But questions have arisen from the pentathletes on whether the replacement event has the same transferable skills.Choong’s partner Olivia Green, who is also a GB pentathlete, said: \"You can't just get on a horse and go around and start jumping. It's a technical skill and I just don't think obstacle course racing is.\"It’s like they've just sort of given up, I'm still quite a young athlete and I was looking forward to the years to come of riding, which has been taken away.\"",
        "Joe Choong will seek to become the first British man to defend an Olympic modern pentathlon title",
        "Olympic champion Joe Choong has one chance remaining to win another modern pentathlon medal before the event changes in a way he says \"no-one wanted\".",
        "Paris 2024 will be the last Games to feature the current format, with showjumping being replaced with a ninja warrior-style obstacle course at Los Angeles 2028.",
        "The equestrian element of the five-sport event came under the spotlight at the Tokyo Games in 2021 when a German coach was thrown out for appearing to punch a horse who was refusing to jump or trot.",
        "Choong, who was on Wednesday named in Team GB's Olympic team, says the sport should have considered changes to the showjumping element before bringing in a completely different sport that athletes like him have never done before.",
        "\"I think the way it was announced follows on from the poor management of the sport; we as athletes were completely ignored. No-one wanted it to happen,\" the 29-year-old told BBC Sport.",
        "He added that measures to improve horse welfare in hot conditions were among the changes that could have been explored.",
        "“The board are arguing that ninja warrior is a big sport and can make our sport a mass participation one. It doesn't ring true because horse riding is already a huge sport on its own.",
        "\"If we can’t get the numbers with horse riding I don’t see how we will with obstacle racing.\"",
        "Choong has never trained in obstacle course racing but will start after Paris and, while he is open to the change, believes it gives an advantage to younger pentathletes.",
        "\"We will only have four years to train for this completely new sport and then compete at it at an Olympic Games, where we're expected to be elite,\" he said.",
        "\"It's not going to be the same standard as what we can produce in the other sports.\"",
        "Choong will head to Paris alongside fellow Olympic champion Kate French, Kerenza Bryson - who took an individual bronze and team silver at last year's world championships - and Myles Pillage, a world silver medallist in the team event.",
        "\"I want to be as good as I can be and the first British man to defend an Olympic pentathlon title,\" Choong said.",
        "Modern pentathlon has been on the Olympic programme since 1912, with the women’s event introduced in 2000.",
        "It currently consists of fencing, horse riding, swimming, running and laser shooting.",
        "In the equestrian element, horses are allocated at random to each athlete, who is then given 20 minutes to bond with the animal before embarking on a showjumping course.",
        "During the 2020 Tokyo Olympics, German pentathlete Annika Schleu was given a horse that was not co-operating.",
        "The animal refused to jump around the course and as a result Schleu, who had been a gold medal contender, significantly fell down the rankings.",
        "Schleu and her coach Kim Raisner were accused of animal mistreatment after the event, as accusations arose of the pentathlete whipping the horse and her coach punching the animal.",
        "An investigation was launched into the incident but has since been dropped.",
        "However, the accusations resulted in horse riding being removed by the modern pentathlon board after Paris 2024.",
        "Modern pentathlon has also had a long struggle with viewership, ranking as one of the weakest sports in terms of social media metrics and hours watched according to the International Olympic Committee (IOC).",
        "The introduction of obstacle racing played a big part in keeping modern pentathlon in the Olympic programme, with the sport’s president Klaus Schormann saying the event would be \"more dynamic and exciting for spectators and fans\" after being confirmed for Los Angeles 2028.",
        "Obstacle racing was selected from 61 suggestions – including climbing, javelin and orienteering - to replace the equestrian element.",
        "But questions have arisen from the pentathletes on whether the replacement event has the same transferable skills.",
        "Choong’s partner Olivia Green, who is also a GB pentathlete, said: \"You can't just get on a horse and go around and start jumping. It's a technical skill and I just don't think obstacle course racing is.",
        "\"It’s like they've just sort of given up, I'm still quite a young athlete and I was looking forward to the years to come of riding, which has been taken away.\"",
        "Modern pentathlon at the Paris 2024 Olympics"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/modern-pentathlon/articles/c4n1d0pl7j7o",
      "main_category": "sport",
      "detailed_category": "modern-pentathlon",
      "topic": "GB's Varley celebrates World Cup silver after 'rocky years'",
      "content": [
        "Great Britain's Jess Varley claimed a silver medal in the Pentathlon World Cup in Sofia, Bulgaria.It is Varley's first World Cup podium finish in more than a year after being hampered by injury and illness.\"I’ve had a rocky couple of years,\" she said.“I fell off a horse in training just before the World Cup final last year, and had a fracture in my spine, which meant I wasn’t at full fitness for the World Championships and the second half of last year.“At the first World Cup I did this year, I had a migraine in the laser run of the qualifications and didn’t qualify, had an absolute disaster, and so this was my last shot. I had to come here and get a medal and I can’t believe I’ve done it.\"Laser run specialist Blanka Guzi of Hungary rose from seventh place at the start of the final day to top the leaderboard to claim a second World Cup gold, with Malak Ismail of Egypt winning bronze.Varley says she hopes to have done enough to qualify for the Pentathlon World Cup Final in Turkey at the end of the month.\"I’m just keeping everything crossed, and hopefully I’ve done enough to qualify,\" she added.\"I couldn’t have done any more today and I'm very happy.”",
        "Jess Varley won bronze on her Team GB debut at the European Games in Poland last year",
        "Great Britain's Jess Varley claimed a silver medal in the Pentathlon World Cup in Sofia, Bulgaria.",
        "It is Varley's first World Cup podium finish in more than a year after being hampered by injury and illness.",
        "\"I’ve had a rocky couple of years,\" she said.",
        "“I fell off a horse in training just before the World Cup final last year, and had a fracture in my spine, which meant I wasn’t at full fitness for the World Championships and the second half of last year.",
        "“At the first World Cup I did this year, I had a migraine in the laser run of the qualifications and didn’t qualify, had an absolute disaster, and so this was my last shot. I had to come here and get a medal and I can’t believe I’ve done it.\"",
        "Laser run specialist Blanka Guzi of Hungary rose from seventh place at the start of the final day to top the leaderboard to claim a second World Cup gold, with Malak Ismail of Egypt winning bronze.",
        "Varley says she hopes to have done enough to qualify for the Pentathlon World Cup Final in Turkey at the end of the month.",
        "\"I’m just keeping everything crossed, and hopefully I’ve done enough to qualify,\" she added.",
        "\"I couldn’t have done any more today and I'm very happy.”"
      ]
    }
  ]
}