{
  "scraped_at": "2025-10-27T18:56:59.776545",
  "total_articles": 16,
  "category": "disability-sport",
  "articles_per_category": 100,
  "articles": [
    {
      "url": "https://www.bbc.com/sport/articles/cg39dq59xzqo",
      "main_category": "sport",
      "detailed_category": "disability-sport",
      "topic": "Disability sport calendar",
      "content": [
        "BBC Sport picks out the key sporting events of 2025.The list will be updated with further fixtures and events as they are confirmed; dates and venues are subject to change.OCTOBER30: Wheelchair Rugby League international - Australia v England, Gold CoastNOVEMBER2: Wheelchair Rugby League international - Australia v England, Gold Coast15-26: Summer Deaflympics, Tokyo, Japan20-25: European Para Table Tennis Championships, Helsingborg, SwedenJANUARY 202627-31: Australian Open wheelchair tennis tournament, MelbourneFEBRUARY7-14: Para-badminton World Championships, Manama, BahrainMARCH6-15: Winter Paralympics, Italy",
        "Britain's Aaron McKibbin is the current men's class eight world number one in para-table tennis",
        "BBC Sport picks out the key sporting events of 2025.",
        "The list will be updated with further fixtures and events as they are confirmed; dates and venues are subject to change.",
        "30: Wheelchair Rugby League international - Australia v England, Gold Coast",
        "2: Wheelchair Rugby League international - Australia v England, Gold Coast",
        "15-26: Summer Deaflympics, Tokyo, Japan",
        "20-25: European Para Table Tennis Championships, Helsingborg, Sweden",
        "27-31: Australian Open wheelchair tennis tournament, Melbourne",
        "7-14: Para-badminton World Championships, Manama, Bahrain",
        "6-15: Winter Paralympics, Italy"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/rugby-league/articles/ckgkly1vy9qo",
      "main_category": "sport",
      "detailed_category": "disability-sport",
      "topic": "Collins stars as England edge past Queensland",
      "content": [
        "Nathan Collins scored 22 points as England came through a testing final warm-up for the Wheelchair Rugby League Ashes to beat Queensland 72-60 on the Sunshine Coast.Leeds Rhinos pivot Collins scored two tries and landed seven goals as Tom Coyd's side had to come back from an early 12-6 deficit against competitive hosts.Wheels of Steel winner Joe Coyd scored three of England's 13 tries, and added a goal, as they followed up their 86-10 win over New South Wales in last Friday's tour opener.Mason Billington and Luis Domingos both scored twice, with one try each for Rob Hawkins, tour captain Lewis King, Seb Bechara and Finlay O'Neill. Wayne Boardman added a goal to the tally.For Halifax Panthers youngster O'Neill it was a first international try, and he was watched by his father and grandmother, who have travelled from Yorkshire for the tour's early stages.Queensland included several players who are set to feature for Australia against England later this week, including Zac Schumacher, who scored five of their tries, and Bayley McKenna, who converted all nine of his goal attempts.Dan Anstey and Adam Tannock scored twice for the hosts and Pete Arbuckle once, with their other goal coming from Jack Kruger.England face a two-Test series against Australia on the Gold Coast, with the first match on Thursday and the second on Sunday.",
        "Nathan Collins received the man-of-the-match award named after his England team-mate Jack Brown, who coached Queensland to four successive Wheelchair State of Origin victories during his time in Australia",
        "Nathan Collins scored 22 points as England came through a testing final warm-up for the Wheelchair Rugby League Ashes to beat Queensland 72-60 on the Sunshine Coast.",
        "Leeds Rhinos pivot Collins scored two tries and landed seven goals as Tom Coyd's side had to come back from an early 12-6 deficit against competitive hosts.",
        "Wheels of Steel winner Joe Coyd scored three of England's 13 tries, and added a goal, as they followed up their 86-10 win over New South Wales in last Friday's tour opener.",
        "Mason Billington and Luis Domingos both scored twice, with one try each for Rob Hawkins, tour captain Lewis King, Seb Bechara and Finlay O'Neill. Wayne Boardman added a goal to the tally.",
        "For Halifax Panthers youngster O'Neill it was a first international try, and he was watched by his father and grandmother, who have travelled from Yorkshire for the tour's early stages.",
        "Queensland included several players who are set to feature for Australia against England later this week, including Zac Schumacher, who scored five of their tries, and Bayley McKenna, who converted all nine of his goal attempts.",
        "Dan Anstey and Adam Tannock scored twice for the hosts and Pete Arbuckle once, with their other goal coming from Jack Kruger.",
        "England face a two-Test series against Australia on the Gold Coast, with the first match on Thursday and the second on Sunday.",
        "Why Brown has taken financial hit to help England",
        "The Portugal basketballer turned England rugby player"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/rugby-league/articles/cy40vzngglgo",
      "main_category": "sport",
      "detailed_category": "disability-sport",
      "topic": "Hawkins scores five as England beat New South Wales",
      "content": [
        "Rob Hawkins scored five second-half tries as England's wheelchair rugby league side began their tour of Australia with an 86-10 victory over New South Wales in Sydney.Hawkins, the reigning international wheelchair player of the year, is seeking to complete a memorable 2025 with an Ashes series victory after helping his club Halifax Panthers win the treble of Challenge Cup, League Leaders' Shield and Grand Final.England scored 15 tries as head coach Tom Coyd gave all 10 of his squad half a game each - with five playing the first half, and the other five the second.Hawkins' Halifax club-mate Jack Brown scored three of England's first four tries, with debutant Luis Domingos, captain Lewis King and veteran Wayne Boardman also crossing before the break. Boardman added five goals.Finlay O'Neill, another Halifax treble winner, came on for his debut in the second half, when Leeds pivot Nathan Collins scored 20 points from a try and eight goals, while Wheels of Steel winner Joe Coyd touched down once and Seb Bechara twice.\"Obviously we've been battling jetlag and fatigue a little bit this week after the flight, but that was why the game against New South Wales was so important,\" Tom Coyd said.\"It's been almost a year since we last played as an England team, with the Test against France last November, so we needed to get out on the pitch together.\"It was great to see Finlay O'Neill and Luis Domingos in action in England jerseys for the first time, and I think we'll wake up on Saturday morning really knowing that we've arrived in Australia.\"England face Queensland on the Sunshine Coast next Monday before two Tests against Australia on 30 October and 2 November on the Gold Coast.",
        "Rob Hawkins helped Halifax Panthers win the Wheelchair Challenge Cup, League Leaders' Shield and Super League Grand Final this season",
        "Rob Hawkins scored five second-half tries as England's wheelchair rugby league side began their tour of Australia with an 86-10 victory over New South Wales in Sydney.",
        "Hawkins, the reigning international wheelchair player of the year, is seeking to complete a memorable 2025 with an Ashes series victory after helping his club Halifax Panthers win the treble of Challenge Cup, League Leaders' Shield and Grand Final.",
        "England scored 15 tries as head coach Tom Coyd gave all 10 of his squad half a game each - with five playing the first half, and the other five the second.",
        "Hawkins' Halifax club-mate Jack Brown scored three of England's first four tries, with debutant Luis Domingos, captain Lewis King and veteran Wayne Boardman also crossing before the break. Boardman added five goals.",
        "Finlay O'Neill, another Halifax treble winner, came on for his debut in the second half, when Leeds pivot Nathan Collins scored 20 points from a try and eight goals, while Wheels of Steel winner Joe Coyd touched down once and Seb Bechara twice.",
        "\"Obviously we've been battling jetlag and fatigue a little bit this week after the flight, but that was why the game against New South Wales was so important,\" Tom Coyd said.",
        "\"It's been almost a year since we last played as an England team, with the Test against France last November, so we needed to get out on the pitch together.",
        "\"It was great to see Finlay O'Neill and Luis Domingos in action in England jerseys for the first time, and I think we'll wake up on Saturday morning really knowing that we've arrived in Australia.\"",
        "England face Queensland on the Sunshine Coast next Monday before two Tests against Australia on 30 October and 2 November on the Gold Coast.",
        "The Portugal basketballer turned England rugby player",
        "Why Brown has taken financial hit to help England",
        "Halifax beat London in Grand Final to seal treble"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/articles/c5ypgkd6klpo",
      "main_category": "sport",
      "detailed_category": "disability-sport",
      "topic": "No Russians or Belarusians at Winter Paralympics",
      "content": [
        "Russian and Belarusian para-athletes will not be at the 2026 Winter Paralympics, despite the International Paralympic Committee lifting its ban on them.Although the IPC oversees the Games, there are four separate governing bodies in charge of the six sports taking place in Milan and Cortina d'Ampezzo.Three of the governing bodies have decided to keep their bans on athletes from the two countries, and although Russia and Belarus are now allowed to compete in ice hockey, the decision came too late for them to take part in qualifying.Both countries were suspended from Paralympic competition after Russia's invasion of Ukraine in 2022, with Belarus a close ally of Russia.A partial ban - allowing athletes to compete as neutrals - was introduced in 2023.IPC members then voted to lift the suspensions on the two countries at a meeting last month, allowing para-athletes from Russia and Belarus to compete under their own flags.However, the four international federations have now told the IPC \"that, in practice, no athletes from the two nations are likely to qualify for March's Games\".The International Ski and Snowboard Federation (FIS), International Biathlon Union (IBU) and World Curling have not lifted their bans, while World Para Ice Hockey has already decided which countries will enter the qualifying tournament for the two remaining places at the Games.\"In the same way that the IPC fully respects the decision of the IPC General Assembly not to maintain the partial suspensions of NPC Belarus and NPC Russia, we also fully respect the decisions of each international federation regarding the sports they govern,\" said IPC president Andrew Parsons.\"The positions of FIS, IBU and World Curling currently mean that athletes and teams from Belarus and Russia cannot compete in their events, making it impossible for them to qualify for the Milano Cortina 2026 Paralympic Winter Games.\"While Belarus and Russia can now compete in Para ice hockey competitions, at this late stage of the qualification cycle, the six teams for November's Paralympic Games qualification tournament have already been determined.\"I hope the focus will now be very much on the outstanding athletes and NPCs that will compete at Milano Cortina 2026 next March, as well as the tremendous transformational legacies the Paralympic Winter Games will create.\"",
        "The Winter Paralympics take place from 6-15 March with about 600 athletes competing in 79 medal events across six sports",
        "Russian and Belarusian para-athletes will not be at the 2026 Winter Paralympics, despite the International Paralympic Committee lifting its ban on them.",
        "Although the IPC oversees the Games, there are four separate governing bodies in charge of the six sports taking place in Milan and Cortina d'Ampezzo.",
        "Three of the governing bodies have decided to keep their bans on athletes from the two countries, and although Russia and Belarus are now allowed to compete in ice hockey, the decision came too late for them to take part in qualifying.",
        "Both countries were suspended from Paralympic competition after Russia's invasion of Ukraine in 2022, with Belarus a close ally of Russia.",
        "A partial ban - allowing athletes to compete as neutrals - was introduced in 2023.",
        "IPC members then voted to lift the suspensions on the two countries at a meeting last month, allowing para-athletes from Russia and Belarus to compete under their own flags.",
        "However, the four international federations have now told the IPC \"that, in practice, no athletes from the two nations are likely to qualify for March's Games\".",
        "The International Ski and Snowboard Federation (FIS), International Biathlon Union (IBU) and World Curling have not lifted their bans, while World Para Ice Hockey has already decided which countries will enter the qualifying tournament for the two remaining places at the Games.",
        "\"In the same way that the IPC fully respects the decision of the IPC General Assembly not to maintain the partial suspensions of NPC Belarus and NPC Russia, we also fully respect the decisions of each international federation regarding the sports they govern,\" said IPC president Andrew Parsons.",
        "\"The positions of FIS, IBU and World Curling currently mean that athletes and teams from Belarus and Russia cannot compete in their events, making it impossible for them to qualify for the Milano Cortina 2026 Paralympic Winter Games.",
        "\"While Belarus and Russia can now compete in Para ice hockey competitions, at this late stage of the qualification cycle, the six teams for November's Paralympic Games qualification tournament have already been determined.",
        "\"I hope the focus will now be very much on the outstanding athletes and NPCs that will compete at Milano Cortina 2026 next March, as well as the tremendous transformational legacies the Paralympic Winter Games will create.\"",
        "Russia & Belarus could use own flags as ban lifted",
        "Paralympic chief expects 'reaction' to Russia ban lift"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/articles/c62q14r1npno",
      "main_category": "sport",
      "detailed_category": "disability-sport",
      "topic": "Why Brown has taken financial hit to help England",
      "content": [
        "Jack Brown has made a big financial sacrifice to help England's bid to retain the Wheelchair Rugby League World Cup next year - but you will not hear him complaining about it.Nor will he grumble about having made England's job more difficult as they prepare for the forthcoming wheelchair Ashes series down under, because that is just how he wants it.\"We want to be playing the best, we want to be challenged and we want the sport to keep growing,\" he says.The Halifax Panthers player spent five and a half years living in Australia, coaching wheelchair rugby league while picking up lucrative work as a welder in the Queensland mines.The 35-year-old gave up the mining work and came home to West Yorkshire in April, rejoining the Panthers, because he wanted to play more regularly in the build-up to the World Cup.It has already paid off, with the Panthers winning the Wheelchair Super League Grand Final last month to add to the Challenge Cup and League Leaders' Shield, completing a treble.\"I knew I would take a hit coming back,\" he says. \"But back over here, there are other, more positive aspects of the lifestyle, with its connection with family and friends. You're a lot more around people.\"Brown - who scored two tries to help England beat France in a dramatic World Cup final in Manchester three years ago - is vice-captain for the four-match tour of Australia.England face New South Wales on Friday and Queensland next Monday before two Tests against Australia on 30 October and 2 November.During his time down under, Brown coached Queensland to four successive victories over New South Wales in the Wheelchair State of Origin match - now known as the Wheelchair State Challenge.He believes the standards of Australian wheelchair rugby league have risen over the past half-decade, and acknowledges that if England have a tough time of it down under, it will be partly down to his coaching.\"We like to be open, share everything with everyone,\" he says. \"We do it at club level, we do it at international level. If we can help someone, you help them whether it makes your job harder or not.\"",
        "Brown is one of two non-disabled players in England's squad for the Ashes tour; he first took up wheelchair basketball and then rugby league to share a sport on an equal level with his younger brother Harry, who lost both legs to meningitis as a baby.They were both part of the England team who won the Wheelchair Rugby League World Cup in 2008, and were runners-up in 2013 and 2017, before Harry concentrated on basketball, helping Great Britain to Paralympic silver in Paris last year.Wheelchair rugby league's international laws allow two of a team's five players on the court to be non-disabled, and Jack has become an England stalwart.But he was not playing regularly in Australia because of strict eligibility rules.\"I was training with a lot of the top players over in Australia, but in terms of representation, the eligibility rules are quite strict over there, so it kind of filters down,\" he said. \"If you're not eligible for Australia, you're not eligible for State of Origin, and it continues on down.\"It meant that throughout his time in Australia, Brown was only playing during trips home to England. And although he helped his country lift the World Cup in 2022, he did not feel it was going to work for 2026. Which meant a move home and giving up the lucrative welding.\"I was just doing a bit of workshop welding to start off with, but the aim was to try and get into the mines over there,\" he said.\"It had that team mentality around it, where you're going through really nasty periods of work and you're in some really bad places and some dirty places, and you've got to get through it together.\"It was a big decision to come back to England, because we had a lot of things over there and I've still got a lot of good, close friends over there.\"But I had to be realistic with myself. I was really lucky to be still alongside these players in the England side while I was over there and I think it was selfish of me to think that I could maintain that level with only playing one game a year.\"And for Brown, international success means more than money.\"I've set up a couple of businesses with close friends doing driving and maintenance, so I've got my finger in a couple of jars but that's not the important thing at the moment,\" he says.\"My only focus at the moment is just making sure I can get to every training on time, get to every game on time and the work will just take care of itself. I can always make more money.\"",
        "24 October: New South Wales v England (Sydney)27 October: Queensland v England (Sunshine Coast)30 October: Australia v England (Gold Coast)2 November: Australia v England (Gold Coast)",
        "Jack Brown was a Wheelchair Rugby League World Cup winner in 2008 and 2022",
        "Jack Brown has made a big financial sacrifice to help England's bid to retain the Wheelchair Rugby League World Cup next year - but you will not hear him complaining about it.",
        "Nor will he grumble about having made England's job more difficult as they prepare for the forthcoming wheelchair Ashes series down under, because that is just how he wants it.",
        "\"We want to be playing the best, we want to be challenged and we want the sport to keep growing,\" he says.",
        "The Halifax Panthers player spent five and a half years living in Australia, coaching wheelchair rugby league while picking up lucrative work as a welder in the Queensland mines.",
        "The 35-year-old gave up the mining work and came home to West Yorkshire in April, rejoining the Panthers, because he wanted to play more regularly in the build-up to the World Cup.",
        "It has already paid off, with the Panthers winning the Wheelchair Super League Grand Final last month to add to the Challenge Cup and League Leaders' Shield, completing a treble.",
        "\"I knew I would take a hit coming back,\" he says. \"But back over here, there are other, more positive aspects of the lifestyle, with its connection with family and friends. You're a lot more around people.\"",
        "Brown - who scored two tries to help England beat France in a dramatic World Cup final in Manchester three years ago - is vice-captain for the four-match tour of Australia.",
        "England face New South Wales on Friday and Queensland next Monday before two Tests against Australia on 30 October and 2 November.",
        "During his time down under, Brown coached Queensland to four successive victories over New South Wales in the Wheelchair State of Origin match - now known as the Wheelchair State Challenge.",
        "He believes the standards of Australian wheelchair rugby league have risen over the past half-decade, and acknowledges that if England have a tough time of it down under, it will be partly down to his coaching.",
        "\"We like to be open, share everything with everyone,\" he says. \"We do it at club level, we do it at international level. If we can help someone, you help them whether it makes your job harder or not.\"",
        "Jack Brown helped Halifax Panthers win the Wheelchair Super League Grand Final in September",
        "Brown proud of brother's World Cup impact",
        "King to captain England for wheelchair Ashes",
        "Halifax beat London in Grand Final to seal treble",
        "Brown is one of two non-disabled players in England's squad for the Ashes tour; he first took up wheelchair basketball and then rugby league to share a sport on an equal level with his younger brother Harry, who lost both legs to meningitis as a baby.",
        "They were both part of the England team who won the Wheelchair Rugby League World Cup in 2008, and were runners-up in 2013 and 2017, before Harry concentrated on basketball, helping Great Britain to Paralympic silver in Paris last year.",
        "Wheelchair rugby league's international laws allow two of a team's five players on the court to be non-disabled, and Jack has become an England stalwart.",
        "But he was not playing regularly in Australia because of strict eligibility rules.",
        "\"I was training with a lot of the top players over in Australia, but in terms of representation, the eligibility rules are quite strict over there, so it kind of filters down,\" he said.",
        "\"If you're not eligible for Australia, you're not eligible for State of Origin, and it continues on down.\"",
        "It meant that throughout his time in Australia, Brown was only playing during trips home to England. And although he helped his country lift the World Cup in 2022, he did not feel it was going to work for 2026. Which meant a move home and giving up the lucrative welding.",
        "\"I was just doing a bit of workshop welding to start off with, but the aim was to try and get into the mines over there,\" he said.",
        "\"It had that team mentality around it, where you're going through really nasty periods of work and you're in some really bad places and some dirty places, and you've got to get through it together.",
        "\"It was a big decision to come back to England, because we had a lot of things over there and I've still got a lot of good, close friends over there.",
        "\"But I had to be realistic with myself. I was really lucky to be still alongside these players in the England side while I was over there and I think it was selfish of me to think that I could maintain that level with only playing one game a year.\"",
        "And for Brown, international success means more than money.",
        "\"I've set up a couple of businesses with close friends doing driving and maintenance, so I've got my finger in a couple of jars but that's not the important thing at the moment,\" he says.",
        "\"My only focus at the moment is just making sure I can get to every training on time, get to every game on time and the work will just take care of itself. I can always make more money.\"",
        "This video can not be played",
        "Tom Halliwell stars in England win - highlights",
        "24 October: New South Wales v England (Sydney)",
        "27 October: Queensland v England (Sunshine Coast)",
        "30 October: Australia v England (Gold Coast)",
        "2 November: Australia v England (Gold Coast)"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/articles/cx20vnnldygo",
      "main_category": "sport",
      "detailed_category": "disability-sport",
      "topic": "GB claim double Euro wheelchair basketball silver",
      "content": [
        "Great Britain finished runners-up in both the men's and women's events at the European Wheelchair Basketball Championships in Sarajevo. The men were aiming for a record-extending ninth European title, but were pipped 72-69 by Spain in Saturday's final.That came a day after the GB women's team fell to a 66-59 defeat to the Netherlands, who won their fifth title in a row.Gregg Warburton top scored for the men with 18 points, but trailed for the majority of the game against a young Spanish side hungry to claim their first European crown.GB were 12 points down after the first quarter, but slowly whittled that deficit down to eventually take the lead for the first time in the game with just over seven minutes to play. But they were unable to shake off the Spanish, who again pulled clear with a minute remaining and this time held on to their advantage, although GB's Kyle Marsh missed an attempted three pointer on the buzzer that would have tied the game. It was heartache again for the GB women on Friday as they fell to a fourth successive defeat to the Dutch - who retained their Paralympic title in Paris last year - in the European final.Lucy Robinson top-scored for the British team with 22 points, while Robyn Love also reached double figures with 10 points and led the team for rebounds with nine.In reaching the final, both British teams ensured their qualification for next year's World Championships in Ottawa, Canada.",
        "Great Britain beat Spain in the 2023 European final in Rotterdam",
        "Great Britain finished runners-up in both the men's and women's events at the European Wheelchair Basketball Championships in Sarajevo.",
        "The men were aiming for a record-extending ninth European title, but were pipped 72-69 by Spain in Saturday's final.",
        "That came a day after the GB women's team fell to a 66-59 defeat to the Netherlands, who won their fifth title in a row.",
        "Gregg Warburton top scored for the men with 18 points, but trailed for the majority of the game against a young Spanish side hungry to claim their first European crown.",
        "GB were 12 points down after the first quarter, but slowly whittled that deficit down to eventually take the lead for the first time in the game with just over seven minutes to play.",
        "But they were unable to shake off the Spanish, who again pulled clear with a minute remaining and this time held on to their advantage, although GB's Kyle Marsh missed an attempted three pointer on the buzzer that would have tied the game.",
        "It was heartache again for the GB women on Friday as they fell to a fourth successive defeat to the Dutch - who retained their Paralympic title in Paris last year - in the European final.",
        "Lucy Robinson top-scored for the British team with 22 points, while Robyn Love also reached double figures with 10 points and led the team for rebounds with nine.",
        "In reaching the final, both British teams ensured their qualification for next year's World Championships in Ottawa, Canada."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/triathlon/articles/c2drx0jk913o",
      "main_category": "sport",
      "detailed_category": "disability-sport",
      "topic": "GB's Ellis wins eighth world Para-triathlon title",
      "content": [
        "Paralympic champion Dave Ellis claimed an eighth world Para-triathlon title, defending his crown in the PTVI category for visually impaired athletes, in Australia. After a decent swim, the 39-year-old Englishman, guided by Luke Pollard, made his way through the field with the fastest bike leg then took the lead on the closing run. He finished 20 seconds ahead of second-placed Frenchman Antoine Perel, finishing the course in Wollongong, New South Wales, in 59 minutes 19 seconds. Fellow British triathlete Henry Urand defended his world title in the men's PTS3 category, beating team-mate Ryan Taylor into second place. And GB's Lauren Steadman won bronze in the women's PTS5 race.The World Triathlon Championships continue in Australia on Sunday with the men's and women's elite events. GB's Olympic bronze medallist Beth Potter is attempting to clinch her second world title in the women's race.",
        "Dave Ellis won his first world Para-triathlon title in London in 2013",
        "Paralympic champion Dave Ellis claimed an eighth world Para-triathlon title, defending his crown in the PTVI category for visually impaired athletes, in Australia.",
        "After a decent swim, the 39-year-old Englishman, guided by Luke Pollard, made his way through the field with the fastest bike leg then took the lead on the closing run.",
        "He finished 20 seconds ahead of second-placed Frenchman Antoine Perel, finishing the course in Wollongong, New South Wales, in 59 minutes 19 seconds.",
        "Fellow British triathlete Henry Urand defended his world title in the men's PTS3 category, beating team-mate Ryan Taylor into second place.",
        "And GB's Lauren Steadman won bronze in the women's PTS5 race.",
        "The World Triathlon Championships continue in Australia on Sunday with the men's and women's elite events.",
        "GB's Olympic bronze medallist Beth Potter is attempting to clinch her second world title in the women's race."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/cycling/articles/c993x011d3vo",
      "main_category": "sport",
      "detailed_category": "disability-sport",
      "topic": "Unwin & Holl win GB's third gold on day two in Rio",
      "content": [
        "Sophie Unwin and Jenny Holl triumphed in the women's B individual pursuit to claim a third gold for Britain on day two of the Para-Cycling World Championships.The duo, who set a new world record in qualifying, paced their effort superbly to overcome a two-second deficit and beat New Zealand's Emma Foy and Jessie Hodges, rounding off a fine day for the British team in Rio de Janeiro.Earlier in the evening Jody Cundy claimed his second gold in as many days by winning the inaugural men's C4 sprint title, while James Ball and Steffan Lloyd claimed gold in the men's B 1km time trial.Cundy, 47, led from start to finish as he held off Belgium's Jarno Thierens and Australia's Michael Shipley to win his 23rd world track gold medal.Ball and his pilot Lloyd were equally as impressive as they finished over a second clear of Australia's Kane Perris and Luke Zaccaria, with Italy's Stefano Meroni and Francesco Ceci in third. Kadeena Cox collected a silver in the women's C4 kilo behind Australia's Tara Neyland after being unable to maintain her blistering start. Fin Graham secured his second medal of the week with a bronze in the men's C3 1km time trial and Lizzi Jordan and pilot Dannielle Khan caught Poland's Karolina Karasiewicz and Dominika Putrya to earn a bronze in the women's B individual pursuit.However, there was disappointment for Blaine Hunt, who crashed out in the men's C5 elimination race.The British team now has four golds, three silver medals and five bronze medals overall.",
        "Sophie Unwin (left) and Jenny Holl set a new world record on their way to gold on Friday",
        "Sophie Unwin and Jenny Holl triumphed in the women's B individual pursuit to claim a third gold for Britain on day two of the Para-Cycling World Championships.",
        "The duo, who set a new world record in qualifying, paced their effort superbly to overcome a two-second deficit and beat New Zealand's Emma Foy and Jessie Hodges, rounding off a fine day for the British team in Rio de Janeiro.",
        "Earlier in the evening Jody Cundy claimed his second gold in as many days by winning the inaugural men's C4 sprint title, while James Ball and Steffan Lloyd claimed gold in the men's B 1km time trial.",
        "Cundy, 47, led from start to finish as he held off Belgium's Jarno Thierens and Australia's Michael Shipley to win his 23rd world track gold medal.",
        "Ball and his pilot Lloyd were equally as impressive as they finished over a second clear of Australia's Kane Perris and Luke Zaccaria, with Italy's Stefano Meroni and Francesco Ceci in third.",
        "Kadeena Cox collected a silver in the women's C4 kilo behind Australia's Tara Neyland after being unable to maintain her blistering start.",
        "Fin Graham secured his second medal of the week with a bronze in the men's C3 1km time trial and Lizzi Jordan and pilot Dannielle Khan caught Poland's Karolina Karasiewicz and Dominika Putrya to earn a bronze in the women's B individual pursuit.",
        "However, there was disappointment for Blaine Hunt, who crashed out in the men's C5 elimination race.",
        "The British team now has four golds, three silver medals and five bronze medals overall."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/rugby-league/articles/c2dn2dd21exo",
      "main_category": "sport",
      "detailed_category": "disability-sport",
      "topic": "The Portugal basketballer turned England rugby player",
      "content": [
        "The story of how Luis Domingos switched from playing wheelchair basketball for Portugal to wheelchair rugby league for England is a complicated one. But it involves a business management degree in Huddersfield.Castleford Tigers' Domingos is one of two uncapped players in England's 10-man squad for the wheelchair rugby league Ashes. Tom Coyd's side will play four matches in late October and early November, including two Tests against Australia.It wasn't part of the 27-year-old's plan to make the Ashes squad when he returned to England after several years playing basketball professionally in Italy, Spain and Portugal. It just turned out that way.\"It was mainly because of family and wanting to achieve a goal of mine, which was to get a degree,\" he said.\"When you're doing a professional sport for so long, you get used to it and that becomes your normal. But I want to experience different things in life and getting a degree is one of the things I want to achieve. And I want to do it young, not after I finished my career.\"",
        "Born in Setubal, near Lisbon, of Angolan descent, Domingos is a wheelchair user as a result of a childhood bout of polio. He moved to Leeds with his family when he was 14 - \"I'm a Leeds United fan\" - and took up first wheelchair basketball with Leeds Spiders, for fun, and then rugby league with Leeds Rhinos, to improve his fitness.He was good enough at basketball to attract the attention of Portugal's co-captain Pedro Bartolo, who at the time was playing professionally in Italy's Serie A wheelchair basketball league with Varese. Domingos was invited to the northern Italian city, about 35 miles from Milan, for a trial.\"It was around 2019,\" he said. \"They invited me for two weeks' trial, but after three or four days, they said OK, just pack your stuff and come here. We like you.\"The offer of a professional contract came with a problem, though. Varese wanted Domingos straight away, but he was partway through studying for a healthcare qualification at Leeds City College. The solution? A chat with his friendly course leaders.\"I spoke to my college and they allowed me to do the course online,\" he said.\"It was too good an opportunity to turn down. For me it wasn't about the money - it was just about the opportunity to train every day.\"I went on my own. At the time, I didn't mind because I was going to live my dream. But as soon as I got there, I had a reality check. It was an expensive country. It was difficult to adapt from having my mum's food every day to having to cook every day, it was challenging. But it was an amazing experience.\"",
        "Domingos passed his healthcare course too - and over the next few years, spent time in Spain with second-tier Basketmi Ferrol and top-flight Servigest Burgos, then followed his friend and mentor Bartolo to Portugal to join BC Gaia, all the while racking up international appearances for the country of his birth.\"Spain's the biggest league in the world,\" Domingos said. \"It's the NBA of wheelchair basketball.\"I played alongside two of the best players: Mateusz Filipski - he's known as wheelchair basketball's Steph Curry. He can shoot from everywhere. He's a good leader, an amazing human. And I played alongside Lee Fryer, one of England's most exciting emerging players.\"But Domingos wanted to come back to England to study, starting a business management degree at the University of Huddersfield - he is set to graduate next summer.He kept up his fitness playing wheelchair basketball for a team in Wakefield, who shared training facilities with Wheelchair Championship rugby league side Castleford. A friend urged him to sign up with Cas - and everything has snowballed from there.In April, he scored the winning try as they beat North Wales Crusaders to win the Wheelchair Challenge Trophy, for second-tier clubs. In June, he was called into England's 17-strong national performance squad.And then in August, he made the final 10 to fly to Australia - qualifying for the call-up on residency grounds. His domestic season was capped last month when Castleford beat Rochdale in the Wheelchair Championship Grand Final.\"It feels amazing to be part of the Ashes,\" he said. \"England is a family. I feel privileged to be part of this.\"I think my experiences with Portugal will help me to deal with the pressure. I can take some of the things I've learned in professional settings to this.\"At the moment, I'm enjoying this. Everything happens for a reason and you know, if I try to understand the reason, it won't be so. Whatever happens tomorrow, I'm not sure. I'm hoping it's a good thing, but I'm living today.\"",
        "Fri, 24 Oct: New South Wales v England (Sydney)Mon, 27 Oct: Queensland v England (Sunshine Coast)Thurs, 30 Oct: Australia v England (Gold Coast)Sun, 2 Nov: Australia v England (Gold Coast)",
        "Luis Domingos learned in August that he would be going to Australia for the wheelchair rugby league Ashes",
        "The story of how Luis Domingos switched from playing wheelchair basketball for Portugal to wheelchair rugby league for England is a complicated one. But it involves a business management degree in Huddersfield.",
        "Castleford Tigers' Domingos is one of two uncapped players in England's 10-man squad for the wheelchair rugby league Ashes. Tom Coyd's side will play four matches in late October and early November, including two Tests against Australia.",
        "It wasn't part of the 27-year-old's plan to make the Ashes squad when he returned to England after several years playing basketball professionally in Italy, Spain and Portugal. It just turned out that way.",
        "\"It was mainly because of family and wanting to achieve a goal of mine, which was to get a degree,\" he said.",
        "\"When you're doing a professional sport for so long, you get used to it and that becomes your normal. But I want to experience different things in life and getting a degree is one of the things I want to achieve. And I want to do it young, not after I finished my career.\"",
        "Born in Setubal, near Lisbon, of Angolan descent, Domingos is a wheelchair user as a result of a childhood bout of polio. He moved to Leeds with his family when he was 14 - \"I'm a Leeds United fan\" - and took up first wheelchair basketball with Leeds Spiders, for fun, and then rugby league with Leeds Rhinos, to improve his fitness.",
        "He was good enough at basketball to attract the attention of Portugal's co-captain Pedro Bartolo, who at the time was playing professionally in Italy's Serie A wheelchair basketball league with Varese. Domingos was invited to the northern Italian city, about 35 miles from Milan, for a trial.",
        "\"It was around 2019,\" he said. \"They invited me for two weeks' trial, but after three or four days, they said OK, just pack your stuff and come here. We like you.\"",
        "The offer of a professional contract came with a problem, though. Varese wanted Domingos straight away, but he was partway through studying for a healthcare qualification at Leeds City College. The solution? A chat with his friendly course leaders.",
        "\"I spoke to my college and they allowed me to do the course online,\" he said.",
        "\"It was too good an opportunity to turn down. For me it wasn't about the money - it was just about the opportunity to train every day.",
        "\"I went on my own. At the time, I didn't mind because I was going to live my dream. But as soon as I got there, I had a reality check. It was an expensive country. It was difficult to adapt from having my mum's food every day to having to cook every day, it was challenging. But it was an amazing experience.\"",
        "Domingos helped Castleford win the Wheelchair Championship Grand Final last month",
        "Domingos passed his healthcare course too - and over the next few years, spent time in Spain with second-tier Basketmi Ferrol and top-flight Servigest Burgos, then followed his friend and mentor Bartolo to Portugal to join BC Gaia, all the while racking up international appearances for the country of his birth.",
        "\"Spain's the biggest league in the world,\" Domingos said. \"It's the NBA of wheelchair basketball.",
        "\"I played alongside two of the best players: Mateusz Filipski - he's known as wheelchair basketball's Steph Curry. He can shoot from everywhere. He's a good leader, an amazing human. And I played alongside Lee Fryer, one of England's most exciting emerging players.\"",
        "But Domingos wanted to come back to England to study, starting a business management degree at the University of Huddersfield - he is set to graduate next summer.",
        "He kept up his fitness playing wheelchair basketball for a team in Wakefield, who shared training facilities with Wheelchair Championship rugby league side Castleford. A friend urged him to sign up with Cas - and everything has snowballed from there.",
        "In April, he scored the winning try as they beat North Wales Crusaders to win the Wheelchair Challenge Trophy, for second-tier clubs. In June, he was called into England's 17-strong national performance squad.",
        "And then in August, he made the final 10 to fly to Australia - qualifying for the call-up on residency grounds. His domestic season was capped last month when Castleford beat Rochdale in the Wheelchair Championship Grand Final.",
        "\"It feels amazing to be part of the Ashes,\" he said. \"England is a family. I feel privileged to be part of this.",
        "\"I think my experiences with Portugal will help me to deal with the pressure. I can take some of the things I've learned in professional settings to this.",
        "\"At the moment, I'm enjoying this. Everything happens for a reason and you know, if I try to understand the reason, it won't be so. Whatever happens tomorrow, I'm not sure. I'm hoping it's a good thing, but I'm living today.\"",
        "Fri, 24 Oct: New South Wales v England (Sydney)",
        "Mon, 27 Oct: Queensland v England (Sunshine Coast)",
        "Thurs, 30 Oct: Australia v England (Gold Coast)",
        "Sun, 2 Nov: Australia v England (Gold Coast)"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/cycling/articles/c62540zj7x6o",
      "main_category": "sport",
      "detailed_category": "disability-sport",
      "topic": "Cundy wins 22nd world track title in Rio",
      "content": [
        "Jody Cundy claimed his 22nd world track gold medal with victory in the 1km time trial at the Para-Cycling World Championships in Rio de Janeiro.Cundy, 47, led home a British one-two in the men's C4 event, finishing 1.7 seconds ahead of Archie Atkinson.It is an incredible 16th C4 1km world title in a row for the English rider.\"It's a bit of a surprise, this one,\" Cundy said. \"About two months ago, I really was to the point where I probably wasn't going to come - I just hadn't had a great year at all and nothing seemed to be sticking.\"The last couple of months it started to come together. Then we've got out here, and, yeah, I've surprised myself with how fast I've gone.\"Cundy - who has six Paralympic golds in cycling and three in swimming, first competed at the track worlds in 2006, two years after team-mate Atkinson was born.Reigning champion Blaine Hunt was second in the MC5 1km time trial, with Matthew Robertson third in the MC2 10km scratch race.The finals run until Sunday and are the fourth edition of the event to be held in the Olympic Velodrome in Rio, after 2018, 2021 and 2024.",
        "Jody Cundy is a multiple world and Paralympic champion in cycling and swimming",
        "Jody Cundy claimed his 22nd world track gold medal with victory in the 1km time trial at the Para-Cycling World Championships in Rio de Janeiro.",
        "Cundy, 47, led home a British one-two in the men's C4 event, finishing 1.7 seconds ahead of Archie Atkinson.",
        "It is an incredible 16th C4 1km world title in a row for the English rider.",
        "\"It's a bit of a surprise, this one,\" Cundy said.",
        "\"About two months ago, I really was to the point where I probably wasn't going to come - I just hadn't had a great year at all and nothing seemed to be sticking.",
        "\"The last couple of months it started to come together. Then we've got out here, and, yeah, I've surprised myself with how fast I've gone.\"",
        "Cundy - who has six Paralympic golds in cycling and three in swimming, first competed at the track worlds in 2006, two years after team-mate Atkinson was born.",
        "Reigning champion Blaine Hunt was second in the MC5 1km time trial, with Matthew Robertson third in the MC2 10km scratch race.",
        "The finals run until Sunday and are the fourth edition of the event to be held in the Olympic Velodrome in Rio, after 2018, 2021 and 2024."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/tennis/articles/c80gz1g9l4ro",
      "main_category": "sport",
      "detailed_category": "disability-sport",
      "topic": "Breakwell dreams of Grand Slams after career high",
      "content": [
        "It has been a year of debilitating lows and career highs for British wheelchair tennis player Abbie Breakwell.After recovering from an illness that was so bad she almost lost her sight, the Paralympian has managed to recover to climb to number 28 in the world rankings.And the 23-year-old did all that while completing her studies at Loughborough University.\"All the hard work is paying off,\" Breakwell, from Long Eaton, told BBC East Midlands Today.\"Even though my year was delayed and I couldn't properly start it until May, to keep pushing on and going from my ranking dropping to the lowest it's ever been to a career high is absolutely amazing.\"The fact that in such a short time I've managed to make such leaps to keep striving forwards really proves how well both me and my team have worked.\"",
        "Breakwell was forced out of action for almost three months after catching Covid-19 in February.She was hospitalised and even lost her sight for a time because of complications with the neurological condition she lives with, called spinal syrinx.But after a cluster of wins in the past few months, her world ranking has soared.Breakwell's mother, Sarah, said the year of trials and tribulations come down to her daughter simply \"never giving up\".\"The main thing is her determination never to stop and just keep driving forward,\"  Sarah continued.The season is now wrapping up for Breakwell, allowing her time to reflect and plan a much-deserved post-season treat.\"I'm going to see if I can go on holiday,\" she said. \"I'd love to go to Disney in Florida but we'll have to see what the bank can afford!\"And as for next year? \"I hope that I can get into a Grand Slam, but also I'm just looking forward to playing more tennis. You never know what's going to happen so let's see.\"",
        "This video can not be played",
        "Abbie Breakwell tells of her joy at achieving a career high ranking after a difficult year",
        "It has been a year of debilitating lows and career highs for British wheelchair tennis player Abbie Breakwell.",
        "After recovering from an illness that was so bad she almost lost her sight, the Paralympian has managed to recover to climb to number 28 in the world rankings.",
        "And the 23-year-old did all that while completing her studies at Loughborough University.",
        "\"All the hard work is paying off,\" Breakwell, from Long Eaton, told BBC East Midlands Today.",
        "\"Even though my year was delayed and I couldn't properly start it until May, to keep pushing on and going from my ranking dropping to the lowest it's ever been to a career high is absolutely amazing.",
        "\"The fact that in such a short time I've managed to make such leaps to keep striving forwards really proves how well both me and my team have worked.\"",
        "'I was losing my sight' - Breakwell on comeback from illness",
        "Breakwell was forced out of action for almost three months after catching Covid-19 in February.",
        "She was hospitalised and even lost her sight for a time because of complications with the neurological condition she lives with, called spinal syrinx.",
        "But after a cluster of wins in the past few months, her world ranking has soared.",
        "Breakwell's mother, Sarah, said the year of trials and tribulations come down to her daughter simply \"never giving up\".",
        "\"The main thing is her determination never to stop and just keep driving forward,\"  Sarah continued.",
        "The season is now wrapping up for Breakwell, allowing her time to reflect and plan a much-deserved post-season treat.",
        "\"I'm going to see if I can go on holiday,\" she said. \"I'd love to go to Disney in Florida but we'll have to see what the bank can afford!\"",
        "And as for next year? \"I hope that I can get into a Grand Slam, but also I'm just looking forward to playing more tennis. You never know what's going to happen so let's see.\""
      ]
    },
    {
      "url": "https://www.bbc.com/sport/athletics/articles/c4gqxl25w9eo",
      "main_category": "sport",
      "detailed_category": "disability-sport",
      "topic": "The Paralympic champion brewing beer for gold goal",
      "content": [
        "If Dan Pembroke isn't at the track, you will probably find him at his allotment.It is where the first seed of an idea grew into something far greater; an initial enjoyment of growing hops and dabbling with home brew kits has bloomed into an actual beer with his name on the can.In the lead-up to last year's Paralympics, Pembroke started brewing 'Paris Gold', as a physical representation of what he wanted and ultimately would go on to achieve in the French capital.Now Pembroke - a two-time Paralympic and world champion in the F13 javelin, for athletes with a visual impairment - has a new brew in the works that he hopes can have the same effect for his compatriots heading to the colder climates of the 2026 Winter Olympic and Paralympics in Italy.\"Two months before going to Paris, my new coach, John Trower, was talking about visualisation and manifestation, these things that he deemed very powerful in sport,\" Pembroke told BBC Sport.\"I'd never really dabbled with visualisation, so I thought, what way could I make this unique to myself? How could I manifest what I want out in Paris?\"I want to get the gold medal, I want it to be in Paris, and I want to hold up a beer to celebrate what I've done.\"After his success in Paris, Pembroke's home brewing caught the attention of a craft brewery, which has worked with the 34-year-old to produce it on a commercial scale.His new Milan beer will be an Italian pilsner using West Coast hops, as a nod to the next summer Games in Los Angeles.With plans for both alcoholic and non-alcoholic versions, he hopes to send batches to Italy for British athletes to enjoy after the Winter Games.\"I'm getting it out there and putting the message across about manifestation for them,\" Pembroke said.\"It's quite a wacky way to do it with beer and athletes, it's not something that normally goes together, but I think because of that it makes it stand out a little bit. And you've got to rock the boat a little bit sometimes to get eyes on you.\"",
        "Because for Pembroke - who has only 10% vision having been diagnosed with a degenerative eye condition, retinitis pigmentosa, when he was six - it's not just about beer.\"This is about me talking in front of crowds of people in conferences, in hospitality, about accessibility for people with invisible disabilities like myself,\" he said.\"I go into a restaurant or a bar and I often get asked 'do you have any dietary requirements?'. But never have I been asked 'do you have any accessibility requirements?'.\"Often I can't be accommodated for. I want to change that space for invisible disabilities, and in particular, visual impairments.\"",
        "Earlier in his athletics career, Pembroke was targeting the London 2012 Olympics before an elbow injury put paid to that dream.After a seven-year break and with his eyesight deteriorating, he came to Para-sport in 2019. Within two years he was Paralympic champion, throwing a Paralympic record of 69.52m in Tokyo.In Paris he reached new heights, breaking Uzbekistan's Aleksandr Svechnikov's seven-year world record with his third throw, before bettering that mark by more than three metres on his next effort with 74.49m to successfully defend his Paralympic crown.A year on from that golden achievement, Pembroke's next task is defending the global title he won in both 2023 and 2024 at the Para-athletics World Championships in New Delhi, which get under way on Saturday.As part of a 37-strong British contingent, external headed for India, he goes into the championships with \"my hunger back\", having struggled with the comedown from his Paralympic high.\"Paris was the pinnacle of my career so far,\" he said. \"It's weird to adjust coming back down the other side, because you need to reset your goals and your ambitions of where you want to go in the future.\"Those four months after Paris were very odd and strange for me. I was having ups and downs, but a big roller coaster of emotions, trying to adjust to what I'd done and where I'm going next.\"It wasn't all sunshine and rainbows, it was pretty difficult.\"Sunshine is now on the horizon, however - Pembroke and his wife, Martina, will welcome their first baby in November.The prospect of having his child trackside at the LA Paralympics in three years' time is providing added motivation for Pembroke to continue his work both in and out of athletics.\"I'm not getting any younger, and I want to make the most of how my body's feeling at the moment,\" he said.\"I think I have the potential to break the [world] record and go more than 75m. Leading up to LA, that's what I wanted to achieve.\"But when I do finally retire, and I'm not sure when that is yet, I want to have a wholesome feeling that I've done something good, not just from throwing javelins far, but I want to try and change the space in society that deals with visual impairment.\"",
        "Dan Pembroke is a two-time Paralympic and world champion",
        "If Dan Pembroke isn't at the track, you will probably find him at his allotment.",
        "It is where the first seed of an idea grew into something far greater; an initial enjoyment of growing hops and dabbling with home brew kits has bloomed into an actual beer with his name on the can.",
        "In the lead-up to last year's Paralympics, Pembroke started brewing 'Paris Gold', as a physical representation of what he wanted and ultimately would go on to achieve in the French capital.",
        "Now Pembroke - a two-time Paralympic and world champion in the F13 javelin, for athletes with a visual impairment - has a new brew in the works that he hopes can have the same effect for his compatriots heading to the colder climates of the 2026 Winter Olympic and Paralympics in Italy.",
        "\"Two months before going to Paris, my new coach, John Trower, was talking about visualisation and manifestation, these things that he deemed very powerful in sport,\" Pembroke told BBC Sport.",
        "\"I'd never really dabbled with visualisation, so I thought, what way could I make this unique to myself? How could I manifest what I want out in Paris?",
        "\"I want to get the gold medal, I want it to be in Paris, and I want to hold up a beer to celebrate what I've done.\"",
        "After his success in Paris, Pembroke's home brewing caught the attention of a craft brewery, which has worked with the 34-year-old to produce it on a commercial scale.",
        "His new Milan beer will be an Italian pilsner using West Coast hops, as a nod to the next summer Games in Los Angeles.",
        "With plans for both alcoholic and non-alcoholic versions, he hopes to send batches to Italy for British athletes to enjoy after the Winter Games.",
        "\"I'm getting it out there and putting the message across about manifestation for them,\" Pembroke said.",
        "\"It's quite a wacky way to do it with beer and athletes, it's not something that normally goes together, but I think because of that it makes it stand out a little bit. And you've got to rock the boat a little bit sometimes to get eyes on you.\"",
        "Dan Pembroke launches a javelin at the 2022 UK Championships",
        "Because for Pembroke - who has only 10% vision having been diagnosed with a degenerative eye condition, retinitis pigmentosa, when he was six - it's not just about beer.",
        "\"This is about me talking in front of crowds of people in conferences, in hospitality, about accessibility for people with invisible disabilities like myself,\" he said.",
        "\"I go into a restaurant or a bar and I often get asked 'do you have any dietary requirements?'. But never have I been asked 'do you have any accessibility requirements?'.",
        "\"Often I can't be accommodated for. I want to change that space for invisible disabilities, and in particular, visual impairments.\"",
        "Earlier in his athletics career, Pembroke was targeting the London 2012 Olympics before an elbow injury put paid to that dream.",
        "After a seven-year break and with his eyesight deteriorating, he came to Para-sport in 2019. Within two years he was Paralympic champion, throwing a Paralympic record of 69.52m in Tokyo.",
        "In Paris he reached new heights, breaking Uzbekistan's Aleksandr Svechnikov's seven-year world record with his third throw, before bettering that mark by more than three metres on his next effort with 74.49m to successfully defend his Paralympic crown.",
        "A year on from that golden achievement, Pembroke's next task is defending the global title he won in both 2023 and 2024 at the Para-athletics World Championships in New Delhi, which get under way on Saturday.",
        "As part of a 37-strong British contingent, external headed for India, he goes into the championships with \"my hunger back\", having struggled with the comedown from his Paralympic high.",
        "\"Paris was the pinnacle of my career so far,\" he said. \"It's weird to adjust coming back down the other side, because you need to reset your goals and your ambitions of where you want to go in the future.",
        "\"Those four months after Paris were very odd and strange for me. I was having ups and downs, but a big roller coaster of emotions, trying to adjust to what I'd done and where I'm going next.",
        "\"It wasn't all sunshine and rainbows, it was pretty difficult.\"",
        "Sunshine is now on the horizon, however - Pembroke and his wife, Martina, will welcome their first baby in November.",
        "The prospect of having his child trackside at the LA Paralympics in three years' time is providing added motivation for Pembroke to continue his work both in and out of athletics.",
        "\"I'm not getting any younger, and I want to make the most of how my body's feeling at the moment,\" he said.",
        "\"I think I have the potential to break the [world] record and go more than 75m. Leading up to LA, that's what I wanted to achieve.",
        "\"But when I do finally retire, and I'm not sure when that is yet, I want to have a wholesome feeling that I've done something good, not just from throwing javelins far, but I want to try and change the space in society that deals with visual impairment.\"",
        "Allotment helps paralympic champion to relax",
        "Paralympian says party snub example of inequality",
        "GB's Pembroke wins javelin gold with new world record"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/swimming/articles/c77dn53j0mno",
      "main_category": "sport",
      "detailed_category": "disability-sport",
      "topic": "'They assumed Id retire, that annoyed me' - Firth on motherhood and swimming return",
      "content": [
        "\"I love being a mum.\"That much is evident as Bethany Firth gives her daughter Charlotte a massive hug.\"Being a mum, it is the best thing I've ever done, but the hardest thing I've ever done,\" explained the six-time Paralympic swimming champion.\"She gives me so much more perspective, and I think she makes me want to be a better person. She makes me want to work harder and try harder and just keep going.\"Charlotte was born at the start of August 2024 to Bethany and husband Andrew.Now, just over a year later, she is getting ready for her first long-haul flight, as Charlotte will travel to Singapore with dad and her grandmother Lindsey to cheer on mum as Bethany returns to action at the World Para Swimming Championships.It will be the first time in more than two years that Firth has competed for Great Britain, the last occasion being the World Championships in Manchester in August 2023.Firth won two of her five world titles there and was preparing for the Paris Paralympics when she got news of her pregnancy.\"We missed out on Paris, but we got Charlotte instead,\" she said.",
        "Now as she prepares to return to international competition for the first time as a mother, Firth wants to be a role model for other female athletes who choose to start a family.\"Sport definitely is a very selfish thing, and I feel like it's really hard for women these days,\" she said.\"A lot of people expect you to choose, 'do you want a family, do you want sport?'\"I felt like whenever I announced that I was having Charlotte, everyone just assumed, 'oh, she's retired. That's it'.\"I felt that really hard. I was like, 'why are people making this decision for me?'\"I want her to be around the sport. I felt like I also don't want to give up. I wanted to show her, actually, we can do both.\"We're not going to give up. For me and my swimming, I've obviously not raced at Worlds yet, but I feel like it's definitely given me more purpose and more joy towards this sport.\"It doesn't have to be really regimental and really restrictive and really selfish. Sport can be fun, and, you know, having her has made me see that.\"",
        "There is no doubt that when you talk with Firth now, she has a different perspective on life and her swimming.\"People always put a lot of pressure on me. I felt like people expected me to win gold, and it turned into more of a pressure and something that I had to prove myself,\" she said.\"I felt like I wasn't good enough if I didn't get the gold, but having Charlotte just changed everything.\"Watching the girls compete in Paris, I thought it was great. It made me want to swim, but it didn't make me feel like I missed it, or I would change anything or I wanted to be there, to be truly honest.\"When I win a medal, you get that buzz for a few seconds. With Charlotte I get that buzz all the time, when she crawls or when she walks or when she does the little things she does.\"So, did she ever contemplate retirement? After all Firth is one of Northern Ireland's most successful athletes.Six Paralympic titles plus three silvers, five world titles, four silvers and a bronze and a gold for Northern Ireland at the 2022 Commonwealth Games. No one would have had anything negative to say if she had decided to stop.\"I think it was more that people assumed I would finish my career and the more they assumed, the more it annoyed me, and the more I thought, actually, this is really bad for women in sport,\" she added.\"Why do we have to choose? Why are people just assuming I'd stop if I had a child?\"It actually never crossed my mind. I knew it would be hard, and I think the challenge of it being hard crossed my mind, but having my family support me and having Charlotte it feels like it makes it all worth it.\"",
        "It's hasn't been easy getting back to being a world-class swimmer again.The morning we meet at the pool in Bangor, she is coming to the end of a two-hour training session after being there since 6am.Charlotte is suffering from a cold and kept her mum up most of the night while dad is working the night shift.Nana Firth has come around to the house at 5am to take over babysitting duties so her daughter can head to the pool.Firth is tired but her face lights up when Charlotte arrives to see her mum.\"It's extremely tough,\" she said. \"Your body goes through something incredible to have a baby and it is really tough coming back, and it's really tough seeing the times that you used to swim and know that you need to get back there if you want to be at the top. It's a really long road and really hard road.\"Coming back, I just kept thinking, 'I want to qualify for Worlds. I want to prove that I can at least qualify and get there.'\"And getting up in the morning when I haven't slept, but seeing her little face makes me be like, 'oh, I can do it'.\"But I won't lie, it is very tough, and I feel like you do need a really good support system around you, because if you don't have that, I don't know how you would cope.\"To be honest, if you had asked me throughout my career what's your proudest moment, I'd actually probably have been like, 'oh, I don't know.'\"But this honestly will be my proudest moment, coming back. It's made me really proud of myself.\"",
        "Firth will swim three individual events and maybe two relays in Singapore. She will stay in the team hotel but the family will not be too far away.Her times in training and at the few competitions she has taken part in this year are encouraging.What a moment it would be if she was to get on the podium again, this time as a mum with her daughter in the crowd.Is Charlotte a water baby?\"You love the water, you love splashing, don't you? I feel like she shows me how to kick, don't you?\" Firth says to Charlotte and gets a big grin in return.She is noncommittal about the future. There are the Commonwealth Games next year and then the bigger question of the 2028 LA Paralympics.\"I think what I've learned is that I'm actually not in control of what's coming in the future,\" she said.\"You know, I could tell you X, Y and Z and it's actually not going to happen.\"So I just believe that God has a plan for me and what comes next year will come next year.\"But I'm just really focused on getting over the 13-hour flight to Singapore and getting there and just having a really good time.\"I can't wait for Charlotte to be like, 'Go mummy'.\"I'm the only person she can shout, 'Go mummy' for in that pool.\"She won't remember but I can show her whenever she grows up and say that mummy never gave up, mummy kept going.\"",
        "This video can not be played",
        "Motherhood provides Firth with new perspective on swimming",
        "\"I love being a mum.\"",
        "That much is evident as Bethany Firth gives her daughter Charlotte a massive hug.",
        "\"Being a mum, it is the best thing I've ever done, but the hardest thing I've ever done,\" explained the six-time Paralympic swimming champion.",
        "\"She gives me so much more perspective, and I think she makes me want to be a better person. She makes me want to work harder and try harder and just keep going.\"",
        "Charlotte was born at the start of August 2024 to Bethany and husband Andrew.",
        "Now, just over a year later, she is getting ready for her first long-haul flight, as Charlotte will travel to Singapore with dad and her grandmother Lindsey to cheer on mum as Bethany returns to action at the World Para Swimming Championships.",
        "It will be the first time in more than two years that Firth has competed for Great Britain, the last occasion being the World Championships in Manchester in August 2023.",
        "Firth won two of her five world titles there and was preparing for the Paris Paralympics when she got news of her pregnancy.",
        "\"We missed out on Paris, but we got Charlotte instead,\" she said.",
        "Bethany and Charlotte Firth",
        "Now as she prepares to return to international competition for the first time as a mother, Firth wants to be a role model for other female athletes who choose to start a family.",
        "\"Sport definitely is a very selfish thing, and I feel like it's really hard for women these days,\" she said.",
        "\"A lot of people expect you to choose, 'do you want a family, do you want sport?'",
        "\"I felt like whenever I announced that I was having Charlotte, everyone just assumed, 'oh, she's retired. That's it'.",
        "\"I felt that really hard. I was like, 'why are people making this decision for me?'",
        "\"I want her to be around the sport. I felt like I also don't want to give up. I wanted to show her, actually, we can do both.",
        "\"We're not going to give up. For me and my swimming, I've obviously not raced at Worlds yet, but I feel like it's definitely given me more purpose and more joy towards this sport.",
        "\"It doesn't have to be really regimental and really restrictive and really selfish. Sport can be fun, and, you know, having her has made me see that.\"",
        "Baby Charlotte packing for her trip to Singapore to cheer on mum, Bethany Firth",
        "There is no doubt that when you talk with Firth now, she has a different perspective on life and her swimming.",
        "\"People always put a lot of pressure on me. I felt like people expected me to win gold, and it turned into more of a pressure and something that I had to prove myself,\" she said.",
        "\"I felt like I wasn't good enough if I didn't get the gold, but having Charlotte just changed everything.",
        "\"Watching the girls compete in Paris, I thought it was great. It made me want to swim, but it didn't make me feel like I missed it, or I would change anything or I wanted to be there, to be truly honest.",
        "\"When I win a medal, you get that buzz for a few seconds. With Charlotte I get that buzz all the time, when she crawls or when she walks or when she does the little things she does.\"",
        "So, did she ever contemplate retirement? After all Firth is one of Northern Ireland's most successful athletes.",
        "Six Paralympic titles plus three silvers, five world titles, four silvers and a bronze and a gold for Northern Ireland at the 2022 Commonwealth Games. No one would have had anything negative to say if she had decided to stop.",
        "\"I think it was more that people assumed I would finish my career and the more they assumed, the more it annoyed me, and the more I thought, actually, this is really bad for women in sport,\" she added.",
        "\"Why do we have to choose? Why are people just assuming I'd stop if I had a child?",
        "\"It actually never crossed my mind. I knew it would be hard, and I think the challenge of it being hard crossed my mind, but having my family support me and having Charlotte it feels like it makes it all worth it.\"",
        "It's hasn't been easy getting back to being a world-class swimmer again.",
        "The morning we meet at the pool in Bangor, she is coming to the end of a two-hour training session after being there since 6am.",
        "Charlotte is suffering from a cold and kept her mum up most of the night while dad is working the night shift.",
        "Nana Firth has come around to the house at 5am to take over babysitting duties so her daughter can head to the pool.",
        "Firth is tired but her face lights up when Charlotte arrives to see her mum.",
        "\"It's extremely tough,\" she said. \"Your body goes through something incredible to have a baby and it is really tough coming back, and it's really tough seeing the times that you used to swim and know that you need to get back there if you want to be at the top. It's a really long road and really hard road.",
        "\"Coming back, I just kept thinking, 'I want to qualify for Worlds. I want to prove that I can at least qualify and get there.'",
        "\"And getting up in the morning when I haven't slept, but seeing her little face makes me be like, 'oh, I can do it'.",
        "\"But I won't lie, it is very tough, and I feel like you do need a really good support system around you, because if you don't have that, I don't know how you would cope.",
        "\"To be honest, if you had asked me throughout my career what's your proudest moment, I'd actually probably have been like, 'oh, I don't know.'",
        "\"But this honestly will be my proudest moment, coming back. It's made me really proud of myself.\"",
        "Bethany Firth will be targeting medals at the World Para Swimming Championships",
        "Firth will swim three individual events and maybe two relays in Singapore. She will stay in the team hotel but the family will not be too far away.",
        "Her times in training and at the few competitions she has taken part in this year are encouraging.",
        "What a moment it would be if she was to get on the podium again, this time as a mum with her daughter in the crowd.",
        "Is Charlotte a water baby?",
        "\"You love the water, you love splashing, don't you? I feel like she shows me how to kick, don't you?\" Firth says to Charlotte and gets a big grin in return.",
        "She is noncommittal about the future. There are the Commonwealth Games next year and then the bigger question of the 2028 LA Paralympics.",
        "\"I think what I've learned is that I'm actually not in control of what's coming in the future,\" she said.",
        "\"You know, I could tell you X, Y and Z and it's actually not going to happen.",
        "\"So I just believe that God has a plan for me and what comes next year will come next year.",
        "\"But I'm just really focused on getting over the 13-hour flight to Singapore and getting there and just having a really good time.",
        "\"I can't wait for Charlotte to be like, 'Go mummy'.",
        "\"I'm the only person she can shout, 'Go mummy' for in that pool.",
        "\"She won't remember but I can show her whenever she grows up and say that mummy never gave up, mummy kept going.\""
      ]
    },
    {
      "url": "https://www.bbc.com/sport/articles/cvg3px16zlmo",
      "main_category": "sport",
      "detailed_category": "disability-sport",
      "topic": "How 'BMX in a wheelchair' became an online sensation",
      "content": [
        "Asked to describe the sport in which he is a triple world champion, Tomas Woods has it down to an elevator pitch: \"It's basically BMX in a wheelchair.\"In WCMX - short for wheelchair motocross - athletes perform tricks over 90 seconds to accrue points. Similar to skateboarding and BMX, you get three attempts on the park to perform your best run.For Woods, discovering the sport changed his life.\"I saw a video of people doing it in America and thought it was super cool, so I emailed my local skatepark asking whether this was something I could try,\" the 16-year-old from Preston tells BBC Sport at Greystone Action Sports in Salford, where he first tried the sport, used to work part-time and is now a celebrity.\"I came down in January 2020, and in October I was in my first competition. The rest is history.\"Woods now shares tips and tricks on Instagram, doing his best to grow the sport beyond its burgeoning online popularity.Many of Britain's WCMX athletes are popular on Instagram, with Woods, Lily Rice and Ben Sleet attracting thousands of followers.They post pictures of their travels and competitions, and videos of their tricks and skills - all with their wheelchairs proudly front and centre.\"The community is so vast - Australia, Brazil, all over Europe,\" Woods says. \"Having that online is so important.\"I was riding here at Graystone and had no clue what I was doing. Me and my coach would watch YouTube clips then try and run it back. Now we post tutorials, giving back to the next generation.\"",
        "When it comes to online popularity however, none of the British athletes can touch the man regarded as the godfather of WCMX.The sport has grown hugely since Aaron 'Wheelz' Fotheringham - followed by 865,000 people on Instagram - first coined the term in 2000.\"I just threw those letters together - like BMX, but with a wheelchair,\" he tells BBC Sport.\"Now I can log into Instagram and people are throwing in the craziest [stunts]. I don't know if I imagined this, but it's pretty cool to see the impact.\"WCMX is now worldwide and the World Championships returned to Europe in 2025 for the first time since the inaugural 2019 event in Hamburg. The Swiss city of Bulle hosted the event from 12 to 14 September. \"Swiss WCMX riders are a totally different breed, so bringing it to them is pretty cool,\" Fotheringham says. \"It's cool to see it bouncing around.\"There are different attitudes to the sport in different countries - it's cool to see people with different takes.\"",
        "The question WCMX faces now is what comes next? Is the answer: Paralympics? And if so, how does that happen?The closest it has come to the Games was when Fotheringham memorably performed in the opening ceremony of the Rio 2016 Paralympics, when he rode down a giant ramp and backflipped through a flaming hoop.World WCMX president Jo Woods says the sport was aiming to be included at Brisbane 2032, with hopes of a test event at LA 2028.She says talks are ongoing with World Skate - which runs Olympic skateboarding - over it taking on responsibility, which would boost its Paralympic chances.However the International Paralympic Committee (IPC) told BBC Sport there are no plans for test or demonstration sports at the next summer Games and WCMX has missed the boat for 2032 as well.",
        "An IPC spokesperson told BBC Sport: \"To be eligible for inclusion in the Paralympic Games sport programme, a sport must be governed by an International Federation that is either an IPC member organisation or an IPC Recognised Federation.\"WCMX is neither an IPC member International Federation or an IPC Recognised Federation and therefore is currently not eligible to apply for inclusion in the Brisbane 2032 Paralympic Games.\"The IPC states any sport seeking consideration must have a minimum of 32 countries from three regions to be regularly practising the sport.It must also have a recognised governing body capable of running competitions and Paralympic qualifying events and be in compliance with the world anti-doping code, and have a formal constitution and regulations.In countries like Germany, Switzerland and the United States, there are organised and active bodies. Others, including the United Kingdom, are works in progress.There also needs to be a codified rulebook for official competitions. Jo Woods said she contacted every country with a WCMX governing body and asked for their rules before she, in her words, \"mashed them all together\".Meanwhile double women's world champion Lorraine Truong has produced the first classification schedule, sorting which competitions athletes with varying disabilities should enter - a thorny issue in Paralympic sport.Woods, who completed a hat-trick of world titles in Switzerland, said the sport is \"not where we want it to be, but there are boots on the ground\".",
        "Closer to home, access to the sport in the UK remains an issue.Some skateparks, like Graystone, have WCMX chairs for hire on nights dedicated to the sport, but this is not universal.A specialist WCMX chair can cost up to 16,000, with Tomas Woods' first chair financed by his parents selling a car. He is now sponsored, but knows others are not so lucky.\"You can't go to Halfords and buy a cheap wheelchair,\" he says. \"Most skateparks will have a rental fleet of skateboards and BMX bikes - to have that for WCMX would be massive.\"But the dream of WCMX on the biggest stage remains alive.\"Yeah for sure,\" says Fotheringham when asked if his creation should be in the Paralympics. \"I've heard little things here and there, so this is me personally asking [the IPC].\"It draws a crowd, it is perfect for TikTok, the interest is there. To see it there would be unreal. It's just one of the sickest sports out there.\"",
        "This video can not be played",
        "How does wheelchair motocross work?",
        "Asked to describe the sport in which he is a triple world champion, Tomas Woods has it down to an elevator pitch: \"It's basically BMX in a wheelchair.\"",
        "In WCMX - short for wheelchair motocross - athletes perform tricks over 90 seconds to accrue points. Similar to skateboarding and BMX, you get three attempts on the park to perform your best run.",
        "For Woods, discovering the sport changed his life.",
        "\"I saw a video of people doing it in America and thought it was super cool, so I emailed my local skatepark asking whether this was something I could try,\" the 16-year-old from Preston tells BBC Sport at Greystone Action Sports in Salford, where he first tried the sport, used to work part-time and is now a celebrity.",
        "\"I came down in January 2020, and in October I was in my first competition. The rest is history.\"",
        "Woods now shares tips and tricks on Instagram, doing his best to grow the sport beyond its burgeoning online popularity.",
        "Many of Britain's WCMX athletes are popular on Instagram, with Woods, Lily Rice and Ben Sleet attracting thousands of followers.",
        "They post pictures of their travels and competitions, and videos of their tricks and skills - all with their wheelchairs proudly front and centre.",
        "\"The community is so vast - Australia, Brazil, all over Europe,\" Woods says. \"Having that online is so important.",
        "\"I was riding here at Graystone and had no clue what I was doing. Me and my coach would watch YouTube clips then try and run it back. Now we post tutorials, giving back to the next generation.\"",
        "Wheelchair Motocross - or WCMX - has become popular on social media",
        "When it comes to online popularity however, none of the British athletes can touch the man regarded as the godfather of WCMX.",
        "The sport has grown hugely since Aaron 'Wheelz' Fotheringham - followed by 865,000 people on Instagram - first coined the term in 2000.",
        "\"I just threw those letters together - like BMX, but with a wheelchair,\" he tells BBC Sport.",
        "\"Now I can log into Instagram and people are throwing in the craziest [stunts]. I don't know if I imagined this, but it's pretty cool to see the impact.\"",
        "WCMX is now worldwide and the World Championships returned to Europe in 2025 for the first time since the inaugural 2019 event in Hamburg. The Swiss city of Bulle hosted the event from 12 to 14 September.",
        "\"Swiss WCMX riders are a totally different breed, so bringing it to them is pretty cool,\" Fotheringham says. \"It's cool to see it bouncing around.",
        "\"There are different attitudes to the sport in different countries - it's cool to see people with different takes.\"",
        "WCMX events take place around the world, both indoors and outdoors",
        "The question WCMX faces now is what comes next? Is the answer: Paralympics? And if so, how does that happen?",
        "The closest it has come to the Games was when Fotheringham memorably performed in the opening ceremony of the Rio 2016 Paralympics, when he rode down a giant ramp and backflipped through a flaming hoop.",
        "World WCMX president Jo Woods says the sport was aiming to be included at Brisbane 2032, with hopes of a test event at LA 2028.",
        "She says talks are ongoing with World Skate - which runs Olympic skateboarding - over it taking on responsibility, which would boost its Paralympic chances.",
        "However the International Paralympic Committee (IPC) told BBC Sport there are no plans for test or demonstration sports at the next summer Games and WCMX has missed the boat for 2032 as well.",
        "Many WCMX athletes have to seek out sponsorship in order to fund themselves",
        "An IPC spokesperson told BBC Sport: \"To be eligible for inclusion in the Paralympic Games sport programme, a sport must be governed by an International Federation that is either an IPC member organisation or an IPC Recognised Federation.",
        "\"WCMX is neither an IPC member International Federation or an IPC Recognised Federation and therefore is currently not eligible to apply for inclusion in the Brisbane 2032 Paralympic Games.\"",
        "The IPC states any sport seeking consideration must have a minimum of 32 countries from three regions to be regularly practising the sport.",
        "It must also have a recognised governing body capable of running competitions and Paralympic qualifying events and be in compliance with the world anti-doping code, and have a formal constitution and regulations.",
        "In countries like Germany, Switzerland and the United States, there are organised and active bodies. Others, including the United Kingdom, are works in progress.",
        "There also needs to be a codified rulebook for official competitions. Jo Woods said she contacted every country with a WCMX governing body and asked for their rules before she, in her words, \"mashed them all together\".",
        "Meanwhile double women's world champion Lorraine Truong has produced the first classification schedule, sorting which competitions athletes with varying disabilities should enter - a thorny issue in Paralympic sport.",
        "Woods, who completed a hat-trick of world titles in Switzerland, said the sport is \"not where we want it to be, but there are boots on the ground\".",
        "Tomas Woods has become a double world champion since taking up WCMX",
        "Closer to home, access to the sport in the UK remains an issue.",
        "Some skateparks, like Graystone, have WCMX chairs for hire on nights dedicated to the sport, but this is not universal.",
        "A specialist WCMX chair can cost up to 16,000, with Tomas Woods' first chair financed by his parents selling a car. He is now sponsored, but knows others are not so lucky.",
        "\"You can't go to Halfords and buy a cheap wheelchair,\" he says. \"Most skateparks will have a rental fleet of skateboards and BMX bikes - to have that for WCMX would be massive.\"",
        "But the dream of WCMX on the biggest stage remains alive.",
        "\"Yeah for sure,\" says Fotheringham when asked if his creation should be in the Paralympics. \"I've heard little things here and there, so this is me personally asking [the IPC].",
        "\"It draws a crowd, it is perfect for TikTok, the interest is there. To see it there would be unreal. It's just one of the sickest sports out there.\""
      ]
    },
    {
      "url": "https://www.bbc.com/sport/motorsport/articles/cgk34yz8j4jo",
      "main_category": "sport",
      "detailed_category": "disability-sport",
      "topic": "'I didn't feel valuable' - life in the slipstream for Nic Hamilton",
      "content": [
        "Nic Hamilton sat in his dark, messy apartment on the phone to Samaritans. It was his lowest point.In 2016 the racing driver was out of the sport and a recovering gambling addict.\"I didn't feel valuable,\" he told the BBC's Sport's Greatest Underdogs podcast.\"I wasn't racing and I wasn't getting sponsorship. My dad is a multi-millionaire, my brother is a multi-millionaire and they are going on this upward trajectory.\"I felt very lost and lonely and I just stumbled across gambling.\"Five stories from Britain's best sporting underdogsNic is the younger brother of a British sporting icon - Lewis Hamilton. The Formula 1 driver has won a joint-record seven world championships.The brothers were guided towards a career in motorsport from an early age, with the main focus on Lewis.\"The first category in motorsport when Lewis was a kid was 'cadet karts' for ages eight to 10,\" Nic recalled.\"We had a cheap third hand go-kart, we had no money and we were in a Vauxhall Cavalier. The go-kart was hanging out of the boot with my Mum [Linda Hamilton] holding onto it,\" he added.\"We had a gas heater and chicken noodle soup was all we could afford, we put everything into Lewis' racing.\"",
        "Hamilton has cerebral palsy, external - a group of lifelong conditions that affect movement and co-ordination and which is caused by a problem with the brain that develops before, during or soon after birth - so that makes his success as a racing driver even more remarkable. He currently competes in British Touring Cars with the Un-Limited Motorsport team, becoming the series' first disabled driver in 2015.The 33-year-old began his motorsport career in the Renault Clio Cup in 2011, cutting his teeth whizzing around UK circuits which included Silverstone, where brother Lewis has won a record nine times in F1.Nic said it was dad Anthony's idea for him to follow in his big brother's tyre marks.\"My dad was like 'maybe we should just give it a go and see',\" he said. \"With my cerebral palsy I'm really hyper-sensitive to noise like loud or sudden bangs, they make me jump.\"So when they used to start the engine up for Lewis it used to scare me.\"It was in a car park where Nic first got behind the wheel of a kart, despite his nerves.\"I remember the anxiety I felt inside but excitement as well. I was wearing all Lewis' race kit,\" he added.\"I ended up crashing that go-kart, I hit a kerb and I disappeared down a six-foot drop.\"The world of virtual racing gave Nic the experience and confidence to think about a career in the sport. It is a path followed by current F1 world champion Max Verstappen - the Dutchman has his own sim racing team.Nic got used to controlling karts and fell in love with driving at speed. In 2011, three years after Lewis had won his first F1 world championship, Nic made it to the Clio Cup grid. It was at one of the most famous circuits in Europe, Brands Hatch, in Kent.\"It was amazing, I qualified last, which I expected,\" he said. \"I was the only disabled person on the grid, everyone else was able-bodied.\"I was actually closer than I ever expected. I'd never driven at Brands Hatch before, never driven this car before.\"Lewis was there and I love him being there, but it's hard as it brings even more attention than I already have.\"In that first season, Nic finished 14th overall out of 27 competitors.",
        "Nic was a bona fide professional motorsport competitor, but not emulating his brother's incredible achievements on tracks around the globe.After a serious crash in testing for his third-ever race at Thruxton, he was knocked unconscious after his car \"catapulted\".\"I'm riddled with fear and in a very lonely place because I landed on my side and you never expect to be laying like that in a car,\" he said.\"The first thing I heard is a marshal saying 'Lewis isn't going to be impressed by that', straight away.\"It's the worst thing anyone could say at any moment in my life.\"That's the problem I've had being Lewis' brother, people really don't understand - they don't get it.\"They panic and don't know what to say to me and it can be the most disrespectful thing. I have to just take it on the chin.\"After that crash, Nic jumped back in the car the next day but his parents were concerned about him continuing in the sport.\"My mum was crying her eyes out and my dad shows fear through anger,\" Nic said. \"He was like 'I told you, don't make mistakes, don't crash'. Then the media picked it up, so it was the biggest thing.\"The only person who wasn't angry and understood it was Lewis, because he'd been there.\"Following another year in the Clio Cup series he moved to the European Touring Car Cup. While competing for the Baporo Motorsport team, he finished the championship in last place.",
        "The move to British Touring Cars in 2015 should have been the start of good times for Nic, but it led him to the dark days.After a year he had lost his seat in the series and hit rock-bottom. He became a gambling addict.\"I was in the darkest space between 2016 and 2017,\" he recalled.\"I ended up telling my mum and then she brought my dad over and they reacted in the most decent and kind way.\"I'm a huge 'mummy's boy' and it was her who was like 'right Nic, we're going to put some structure in your life'. \"I was in such a hole, my apartment was a tip and I was eating Pot Noodles because that's all I could afford. I could just gamble and eat.\"I was literally gambling all night to 6am, then waking up and doing it again.\"Nic said he stopped gambling when he had no money left and his mum had taken control of his bank account.He was on the road back. Trips to the gym to work on his strength and cardio inspired him to return to motorsport.In 2019, he got a drive in Touring Cars with the Alliance Racing team. The comeback was completely funded by sponsorship deals that he had generated.His best result came in the 2023 season while driving for the Tony Gilham Racing team. Hamilton managed a sixth-placed finish in the second race of the campaign at Donnington Park.This season he is currently 27th in the standings with three rounds at Croft coming up on 2 and 3 August.Nic describes himself as a \"Paralympian at the Olympics\". He may never win a championship but his biggest achievement will be inspiring others.Future disabled motorsport stars can look to him and forge their own route to starting grids around the world.Listen to the Greatest Underdogs podcast here.If you have been affected by any of the issues in this article you can visit the BBC's Action Line for information and support.",
        "Nic Hamilton is currently competing in the British Touring Cars series",
        "Nic Hamilton sat in his dark, messy apartment on the phone to Samaritans. It was his lowest point.",
        "In 2016 the racing driver was out of the sport and a recovering gambling addict.",
        "\"I didn't feel valuable,\" he told the BBC's Sport's Greatest Underdogs podcast.",
        "\"I wasn't racing and I wasn't getting sponsorship. My dad is a multi-millionaire, my brother is a multi-millionaire and they are going on this upward trajectory.",
        "\"I felt very lost and lonely and I just stumbled across gambling.\"",
        "Five stories from Britain's best sporting underdogs",
        "Nic is the younger brother of a British sporting icon - Lewis Hamilton. The Formula 1 driver has won a joint-record seven world championships.",
        "The brothers were guided towards a career in motorsport from an early age, with the main focus on Lewis.",
        "\"The first category in motorsport when Lewis was a kid was 'cadet karts' for ages eight to 10,\" Nic recalled.",
        "\"We had a cheap third hand go-kart, we had no money and we were in a Vauxhall Cavalier. The go-kart was hanging out of the boot with my Mum [Linda Hamilton] holding onto it,\" he added.",
        "\"We had a gas heater and chicken noodle soup was all we could afford, we put everything into Lewis' racing.\"",
        "This video can not be played",
        "Hamilton on his recovery from a gambling addiction",
        "Hamilton has cerebral palsy, external - a group of lifelong conditions that affect movement and co-ordination and which is caused by a problem with the brain that develops before, during or soon after birth - so that makes his success as a racing driver even more remarkable.",
        "He currently competes in British Touring Cars with the Un-Limited Motorsport team, becoming the series' first disabled driver in 2015.",
        "The 33-year-old began his motorsport career in the Renault Clio Cup in 2011, cutting his teeth whizzing around UK circuits which included Silverstone, where brother Lewis has won a record nine times in F1.",
        "Nic said it was dad Anthony's idea for him to follow in his big brother's tyre marks.",
        "\"My dad was like 'maybe we should just give it a go and see',\" he said.",
        "\"With my cerebral palsy I'm really hyper-sensitive to noise like loud or sudden bangs, they make me jump.",
        "\"So when they used to start the engine up for Lewis it used to scare me.\"",
        "It was in a car park where Nic first got behind the wheel of a kart, despite his nerves.",
        "\"I remember the anxiety I felt inside but excitement as well. I was wearing all Lewis' race kit,\" he added.",
        "\"I ended up crashing that go-kart, I hit a kerb and I disappeared down a six-foot drop.\"",
        "The world of virtual racing gave Nic the experience and confidence to think about a career in the sport.",
        "It is a path followed by current F1 world champion Max Verstappen - the Dutchman has his own sim racing team.",
        "Nic got used to controlling karts and fell in love with driving at speed.",
        "In 2011, three years after Lewis had won his first F1 world championship, Nic made it to the Clio Cup grid. It was at one of the most famous circuits in Europe, Brands Hatch, in Kent.",
        "\"It was amazing, I qualified last, which I expected,\" he said. \"I was the only disabled person on the grid, everyone else was able-bodied.",
        "\"I was actually closer than I ever expected. I'd never driven at Brands Hatch before, never driven this car before.",
        "\"Lewis was there and I love him being there, but it's hard as it brings even more attention than I already have.\"",
        "In that first season, Nic finished 14th overall out of 27 competitors.",
        "Lewis and Nic Hamilton are often seen at races together",
        "Nic was a bona fide professional motorsport competitor, but not emulating his brother's incredible achievements on tracks around the globe.",
        "After a serious crash in testing for his third-ever race at Thruxton, he was knocked unconscious after his car \"catapulted\".",
        "\"I'm riddled with fear and in a very lonely place because I landed on my side and you never expect to be laying like that in a car,\" he said.",
        "\"The first thing I heard is a marshal saying 'Lewis isn't going to be impressed by that', straight away.",
        "\"It's the worst thing anyone could say at any moment in my life.",
        "\"That's the problem I've had being Lewis' brother, people really don't understand - they don't get it.",
        "\"They panic and don't know what to say to me and it can be the most disrespectful thing. I have to just take it on the chin.\"",
        "After that crash, Nic jumped back in the car the next day but his parents were concerned about him continuing in the sport.",
        "\"My mum was crying her eyes out and my dad shows fear through anger,\" Nic said.",
        "\"He was like 'I told you, don't make mistakes, don't crash'. Then the media picked it up, so it was the biggest thing.",
        "\"The only person who wasn't angry and understood it was Lewis, because he'd been there.\"",
        "Following another year in the Clio Cup series he moved to the European Touring Car Cup. While competing for the Baporo Motorsport team, he finished the championship in last place.",
        "'I'm like a Paralympian at the Olympics'",
        "Lewis Hamilton gets commentator a part in F1 movie",
        "What is Hamilton's record at Silverstone?",
        "The move to British Touring Cars in 2015 should have been the start of good times for Nic, but it led him to the dark days.",
        "After a year he had lost his seat in the series and hit rock-bottom. He became a gambling addict.",
        "\"I was in the darkest space between 2016 and 2017,\" he recalled.",
        "\"I ended up telling my mum and then she brought my dad over and they reacted in the most decent and kind way.",
        "\"I'm a huge 'mummy's boy' and it was her who was like 'right Nic, we're going to put some structure in your life'.",
        "\"I was in such a hole, my apartment was a tip and I was eating Pot Noodles because that's all I could afford. I could just gamble and eat.",
        "\"I was literally gambling all night to 6am, then waking up and doing it again.\"",
        "Nic said he stopped gambling when he had no money left and his mum had taken control of his bank account.",
        "He was on the road back. Trips to the gym to work on his strength and cardio inspired him to return to motorsport.",
        "In 2019, he got a drive in Touring Cars with the Alliance Racing team. The comeback was completely funded by sponsorship deals that he had generated.",
        "His best result came in the 2023 season while driving for the Tony Gilham Racing team. Hamilton managed a sixth-placed finish in the second race of the campaign at Donnington Park.",
        "This season he is currently 27th in the standings with three rounds at Croft coming up on 2 and 3 August.",
        "Nic describes himself as a \"Paralympian at the Olympics\".",
        "He may never win a championship but his biggest achievement will be inspiring others.",
        "Future disabled motorsport stars can look to him and forge their own route to starting grids around the world.",
        "Listen to the Greatest Underdogs podcast here.",
        "If you have been affected by any of the issues in this article you can visit the BBC's Action Line for information and support."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/equestrian/articles/cj4eengx4xwo",
      "main_category": "sport",
      "detailed_category": "disability-sport",
      "topic": "Equestrian body lifts Sir Lee Pearson's suspension",
      "content": [
        "British Equestrian and British Dressage have lifted 14-time Paralympic gold medallist Sir Lee Pearson's suspension after an internal investigation into his conduct.Pearson did not take part at the 2024 Paralympic Games in Paris but is now free to compete internationally after his membership was reinstated.\"With immediate effect, Sir Lee will return to the British Equestrian World Class Programme and his membership of British Dressage is fully reinstated which enables him to compete and coach nationally and internationally,\" a statement from British Equestrian read.The 51-year-old is Britain's third-most successful Paralympian with 14 gold medals, only bettered by cyclist Dame Sarah Storey and swimmer Mike Kenny.Pearson, a Great Britain flagbearer at Rio 2016, had stated his desire to compete at the Los Angeles Paralympics in 2028, something ParalympicsGB said it was open to in a statement released last year.\"Lee has publicly stated he did not seek to qualify for Paris 2024 for personal reasons,\" it read.\"This is a matter for him and British Equestrian and in no way detracts from his past achievements or possibility that he may seek to qualify for future Paralympic Games.\"Pearson's suspension was in place before a four-strong British Para-equestrian team was named for the Paris Paralympics last year. He had not competed since March 2023 and therefore was not eligible for selection.His suspension was not connected in any way to equine welfare.",
        "Sir Lee Pearson has competed in six Paralympics, winning a total of 17 medals",
        "British Equestrian and British Dressage have lifted 14-time Paralympic gold medallist Sir Lee Pearson's suspension after an internal investigation into his conduct.",
        "Pearson did not take part at the 2024 Paralympic Games in Paris but is now free to compete internationally after his membership was reinstated.",
        "\"With immediate effect, Sir Lee will return to the British Equestrian World Class Programme and his membership of British Dressage is fully reinstated which enables him to compete and coach nationally and internationally,\" a statement from British Equestrian read.",
        "The 51-year-old is Britain's third-most successful Paralympian with 14 gold medals, only bettered by cyclist Dame Sarah Storey and swimmer Mike Kenny.",
        "Pearson, a Great Britain flagbearer at Rio 2016, had stated his desire to compete at the Los Angeles Paralympics in 2028, something ParalympicsGB said it was open to in a statement released last year.",
        "\"Lee has publicly stated he did not seek to qualify for Paris 2024 for personal reasons,\" it read.",
        "\"This is a matter for him and British Equestrian and in no way detracts from his past achievements or possibility that he may seek to qualify for future Paralympic Games.\"",
        "Pearson's suspension was in place before a four-strong British Para-equestrian team was named for the Paris Paralympics last year. He had not competed since March 2023 and therefore was not eligible for selection.",
        "His suspension was not connected in any way to equine welfare."
      ]
    }
  ]
}