{
  "scraped_at": "2025-10-27T18:56:59.808546",
  "total_articles": 32,
  "category": "rugby-union",
  "articles_per_category": 100,
  "articles": [
    {
      "url": "https://www.bbc.com/sport/rugby-union/articles/c0qp850ql9yo",
      "main_category": "sport",
      "detailed_category": "rugby-union",
      "topic": "Tommy Fourman, Smith stars & Radwan's form - Prem talking points",
      "content": [
        "There was only one place to start last week and that is where we start again.Noah Caluori's five tries on his first Prem start brought an increased level of interest to his second start for Saracens on Friday against Northampton Saints.The 19-year-old's performance against Sale Sharks saw him named in Steve Borthwick's England training squad as a development player, and he sealed his spot in the final squad on Sunday.Now a known quantity, Saints reduced their kicking to Caluori to deal with the breakout star's freakish aerial ability, while the teenager struggled to get the ball in hand to show his running power.Instead it was Northampton's England winger Tommy Freeman who stole the show with four tries in an entertaining 43-31 win.His final score showed his impressive aerial ability as the 24-year-old caught the ball over his head and raced clear to seal the victory.Freeman, who has played at full-back this season, also started the final Six Nations game against Wales at outside centre.He started all three British and Irish Lions Tests in Australia this summer on the wing, but did not hit his top level in those Tests.Friday was a reminder of his class before England's match against Australia on Saturday.\"Tommy does so many things so well, and I think he looked physical, fast, skilful, he took the ball in the air beautifully and was in the right place,\" Northampton boss Phil Dowson said.\"An outstanding performance from him and he's just a phenom at the moment.\"The question now is where will he play this autumn and could his versatility perhaps enable Borthwick to hand a debut to Caluori, or use another of his electric wingers?",
        "If there is ever a time to drop a standout performance as an England international then it's the weekend before facing Australia.Harlequins fly-half Marcus Smith was at his magical best as Quins hammered Newcastle Red Bulls 52-14, bouncing back from a poor showing against Exeter Chiefs.The 26-year-old broke clear from his own half before sending scrum-half Will Porter  under the posts for a stunning score.\"Last week against Exeter everybody had a crack at him [Marcus Smith]. Now everyone's back on his bandwagon this week. When the team functions well that's when he's at his best,\" said head coach Jason Gilmore.Smith started all four of England's games last autumn and despite losing his fly-half spot to Fin Smith in the Six Nations, the Harlequins playmaker still played in a Lions Test over the summer ahead of his namesake.George Ford and Saints' Smith have started the last seven England internationals between them at fly-half.Marcus Smith's ability to play full-back has helped him gain caps from the bench but his performance on Saturday again showed why fly-half is where he is most dangerous.Winless Newcastle were ideal opposition for him to show off his undeniable talent, which was the bright spark in Borthwick's side's difficult autumn last year.The England 10 conversation is one that won't go away.",
        "Exeter shipped 528 points as they finished ninth in the league last season.Now they sit third in the Prem after three wins from the opening five games, with a 39-12 win over Gloucester on Saturday backing up their emphatic win over Quins.Rob Baxter has brought through a young squad and he is now bearing the fruits of his patience.England wing Immanuel Feyi-Waboso, 22, took his try sharply to head into the international camp injury free and in top form, with a league-leading seven tries so far this season.A big factor behind the back-to-back wins has been the centre combination of Australia's Len Ikitau and England's Henry Slade, who have hit the ground running to show their international quality.Slade, who last season was a regular under Borthwick, scored twice for the second consecutive weekend to strengthen his case to start against Australia.Baxter remained calm in last season's struggles and the age profile of his side will mean more growth will likely come.",
        "A penny for the thoughts of Adam Radwan.Without Caluori's sensational five tries against Sale Sharks, the 27-year-old would have likely been in the England camp this week.Named in the England training squad last week, it looked like the Leicester Tigers wing could finally add to his two caps gained in 2021.Radwan bagged two tries in Leicester's one-point win over Sale on Saturday - both of which showed off his electric acceleration.But it was not enough to gain a spot in Borthwick's final squad as Caluori was added at his expense.That decision likely came down to Caluori's unique aerial ability, which Borthwick would have had a close look at in camp last week.Sale, under the heavy influence of fly-half Ford, set up a nervy finish but new Tigers head coach Geoff Parling has instilled a desire to get over the line, which his side did again.",
        "Billy Searle's last-gasp penalty snatched a Tigers victory and ended Bath's winning start in round four.But the champions bounced back to thrash Bristol Bears 40-15 at home on Saturday to win a feisty West Country derby and pick up their fourth win of the season.Johann van Graan strengthened his side in the summer by bringing in the likes of dynamic backs Henry Arundell and Argentina's Santiago Carreras, who both started against Bristol.Bath finished the game strongly with Van Graan unloading a formidable bench that included Alfie Barbeary, Sam Underhill and Will Stuart on 61 minutes.That squad depth proved the difference as three tries followed, including an intercept try from deep inside his own half by Arundell for his fourth Prem try this season.Bristol have lost key half-backs Harry Randall and AJ MacGinty through injury as well as wingers Louis Rees-Zammit and Gabriel Ibitoye.The return Prem fixture comes in May when the Bears will hope to have a stronger side available.",
        "Tommy Freeman, Marcus Smith and Adam Radwan all feature in our Prem round-five talking points",
        "There was only one place to start last week and that is where we start again.",
        "Noah Caluori's five tries on his first Prem start brought an increased level of interest to his second start for Saracens on Friday against Northampton Saints.",
        "The 19-year-old's performance against Sale Sharks saw him named in Steve Borthwick's England training squad as a development player, and he sealed his spot in the final squad on Sunday.",
        "Now a known quantity, Saints reduced their kicking to Caluori to deal with the breakout star's freakish aerial ability, while the teenager struggled to get the ball in hand to show his running power.",
        "Instead it was Northampton's England winger Tommy Freeman who stole the show with four tries in an entertaining 43-31 win.",
        "His final score showed his impressive aerial ability as the 24-year-old caught the ball over his head and raced clear to seal the victory.",
        "Freeman, who has played at full-back this season, also started the final Six Nations game against Wales at outside centre.",
        "He started all three British and Irish Lions Tests in Australia this summer on the wing, but did not hit his top level in those Tests.",
        "Friday was a reminder of his class before England's match against Australia on Saturday.",
        "\"Tommy does so many things so well, and I think he looked physical, fast, skilful, he took the ball in the air beautifully and was in the right place,\" Northampton boss Phil Dowson said.",
        "\"An outstanding performance from him and he's just a phenom at the moment.\"",
        "The question now is where will he play this autumn and could his versatility perhaps enable Borthwick to hand a debut to Caluori, or use another of his electric wingers?",
        "Four-try Freeman stars as Saints beat Saracens",
        "Uncapped teenager Caluori makes full England squad",
        "Smith has been capped 44 times by England",
        "If there is ever a time to drop a standout performance as an England international then it's the weekend before facing Australia.",
        "Harlequins fly-half Marcus Smith was at his magical best as Quins hammered Newcastle Red Bulls 52-14, bouncing back from a poor showing against Exeter Chiefs.",
        "The 26-year-old broke clear from his own half before sending scrum-half Will Porter  under the posts for a stunning score.",
        "\"Last week against Exeter everybody had a crack at him [Marcus Smith]. Now everyone's back on his bandwagon this week. When the team functions well that's when he's at his best,\" said head coach Jason Gilmore.",
        "Smith started all four of England's games last autumn and despite losing his fly-half spot to Fin Smith in the Six Nations, the Harlequins playmaker still played in a Lions Test over the summer ahead of his namesake.",
        "George Ford and Saints' Smith have started the last seven England internationals between them at fly-half.",
        "Marcus Smith's ability to play full-back has helped him gain caps from the bench but his performance on Saturday again showed why fly-half is where he is most dangerous.",
        "Winless Newcastle were ideal opposition for him to show off his undeniable talent, which was the bright spark in Borthwick's side's difficult autumn last year.",
        "The England 10 conversation is one that won't go away.",
        "Smith masterclass as Quins crush winless Newcastle",
        "Len Ikitau started all three Tests for Australia against the British and Irish Lions in the summer",
        "Exeter shipped 528 points as they finished ninth in the league last season.",
        "Now they sit third in the Prem after three wins from the opening five games, with a 39-12 win over Gloucester on Saturday backing up their emphatic win over Quins.",
        "Rob Baxter has brought through a young squad and he is now bearing the fruits of his patience.",
        "England wing Immanuel Feyi-Waboso, 22, took his try sharply to head into the international camp injury free and in top form, with a league-leading seven tries so far this season.",
        "A big factor behind the back-to-back wins has been the centre combination of Australia's Len Ikitau and England's Henry Slade, who have hit the ground running to show their international quality.",
        "Slade, who last season was a regular under Borthwick, scored twice for the second consecutive weekend to strengthen his case to start against Australia.",
        "Baxter remained calm in last season's struggles and the age profile of his side will mean more growth will likely come.",
        "Exeter Chiefs up to third with Gloucester win",
        "Exeter showing 'A-game' after Gloucester victory",
        "This is Radwan's first full season at Leicester Tigers after his move from Newcastle prior to their takeover by Red Bull",
        "A penny for the thoughts of Adam Radwan.",
        "Without Caluori's sensational five tries against Sale Sharks, the 27-year-old would have likely been in the England camp this week.",
        "Named in the England training squad last week, it looked like the Leicester Tigers wing could finally add to his two caps gained in 2021.",
        "Radwan bagged two tries in Leicester's one-point win over Sale on Saturday - both of which showed off his electric acceleration.",
        "But it was not enough to gain a spot in Borthwick's final squad as Caluori was added at his expense.",
        "That decision likely came down to Caluori's unique aerial ability, which Borthwick would have had a close look at in camp last week.",
        "Sale, under the heavy influence of fly-half Ford, set up a nervy finish but new Tigers head coach Geoff Parling has instilled a desire to get over the line, which his side did again.",
        "Leicester edge out Sale by point in 10-try thriller",
        "Henry Arundell was named in the England squad for the autumn Tests",
        "Billy Searle's last-gasp penalty snatched a Tigers victory and ended Bath's winning start in round four.",
        "But the champions bounced back to thrash Bristol Bears 40-15 at home on Saturday to win a feisty West Country derby and pick up their fourth win of the season.",
        "Johann van Graan strengthened his side in the summer by bringing in the likes of dynamic backs Henry Arundell and Argentina's Santiago Carreras, who both started against Bristol.",
        "Bath finished the game strongly with Van Graan unloading a formidable bench that included Alfie Barbeary, Sam Underhill and Will Stuart on 61 minutes.",
        "That squad depth proved the difference as three tries followed, including an intercept try from deep inside his own half by Arundell for his fourth Prem try this season.",
        "Bristol have lost key half-backs Harry Randall and AJ MacGinty through injury as well as wingers Louis Rees-Zammit and Gabriel Ibitoye.",
        "The return Prem fixture comes in May when the Bears will hope to have a stronger side available.",
        "Six-try Bath prove too much for Bristol in derby"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/rugby-union/articles/ceq071epljwo",
      "main_category": "sport",
      "detailed_category": "rugby-union",
      "topic": "Faletau out of autumn Tests as Wales call Cracknell",
      "content": [
        "Wales have lost veteran number eight Taulupe Faletau for their autumn series to a knee injury.The 34-year-old British and Irish Lions forward has been replaced by uncapped Olly Cracknell, 31, of Leicester Tigers.Faletau limped off just four minutes into Cardiff's United Rugby Championship victory over Edinburgh on Saturday.Wales head coach Steve Tandy admitted it was \"hugely disappointing\" to lose the 109-cap back row, who turns 35 next month.He said: \"It's hugely disappointing to lose Toby to injury as he's a world-class player. \"But Olly's been playing really well for Leicester and we're excited to add him to the squad.\"Wales face Argentina on Sunday 9 November before going on to host Japan, New Zealand and South Africa in Cardiff.",
        "Former Ospreys player Cracknell, 31, has impressed for Tigers in recent seasons and has been selected ahead of Ross Moriarty of Ospreys.Born in Leeds, he qualifies for Wales through his grandfather and was capped six times at under-20s level before being called into the senior squad by Warren Gatland for the 2017 Six Nations.He made more than 100 appearances for Ospreys before joining London Irish in 2021Aaron Wainwright, Morgan Morse and Taine Plumtree are contenders for the Wales number eight spot as well as captain Jac Morgan.Morgan, usually a flanker, made his first appearance of the season off after struggling with a calf issue, coming off the bench as number eight for Ospreys as they drew at Dragons on Saturday.\"It was great to see him back. He fitted straight back in and was very prominent despite not playing since July,\" said Ospreys head coach Mark Jones.\"His energy was high, he worked hard in the game and you would never have known he'd been out so long.\"",
        "ForwardsKeiron Assiratti (Cardiff), Adam Beard (Montpellier), Liam Belcher (Cardiff), Rhys Carre (Saracens), Ben Carter (Dragons), Brodie Coghlan (Dragons), Christian Coleman (Dragons), Olly Cracknell (Leicester Tigers), Rhys Davies (Ospreys), James Fender (Ospreys), Archie Griffin (Bath), Dafydd Jenkins (Exeter Chiefs), Dewi Lake (Ospreys), Alex Mann (Cardiff), Jac Morgan (Ospreys), Morgan Morse (Ospreys), Taine Plumtree (Scarlets), Nicky Smith (Leicester Tigers), Danny Southworth (Cardiff), Gareth Thomas (Ospreys), Freddie Thomas (Gloucester), Aaron Wainwright (Dragons).BacksJosh Adams (Cardiff), Jacob Beetham (Cardiff), Rio Dyer (Dragons), Dan Edwards (Ospreys), Jarrod Evans (Harlequins), Kieran Hardy (Ospreys), Joe Hawkins (Scarlets), Louie Hennessey (Bath), Max Llewellyn (Gloucester), Reuben Morgan-Williams (Ospreys), Blair Murray (Scarlets), Louis Rees-Zammit (Bristol Bears), Tom Rogers (Scarlets), Callum Sheedy (Cardiff), Ben Thomas (Cardiff), Nick Tompkins (Saracens), Tomos Williams (Gloucester).",
        "Taulupe Faletau has been capped 109 times by Wales while Olly Cracknell has the chance to make his debut",
        "Wales have lost veteran number eight Taulupe Faletau for their autumn series to a knee injury.",
        "The 34-year-old British and Irish Lions forward has been replaced by uncapped Olly Cracknell, 31, of Leicester Tigers.",
        "Faletau limped off just four minutes into Cardiff's United Rugby Championship victory over Edinburgh on Saturday.",
        "Wales head coach Steve Tandy admitted it was \"hugely disappointing\" to lose the 109-cap back row, who turns 35 next month.",
        "He said: \"It's hugely disappointing to lose Toby to injury as he's a world-class player.",
        "\"But Olly's been playing really well for Leicester and we're excited to add him to the squad.\"",
        "Wales face Argentina on Sunday 9 November before going on to host Japan, New Zealand and South Africa in Cardiff.",
        "Cracknell on grief, bird watching and international ambitions",
        "What Welsh shake-up means and why it matters to rest of rugby world",
        "Wales recall Rees-Zammit for autumn Tests",
        "Former Ospreys player Cracknell, 31, has impressed for Tigers in recent seasons and has been selected ahead of Ross Moriarty of Ospreys.",
        "Born in Leeds, he qualifies for Wales through his grandfather and was capped six times at under-20s level before being called into the senior squad by Warren Gatland for the 2017 Six Nations.",
        "He made more than 100 appearances for Ospreys before joining London Irish in 2021",
        "Aaron Wainwright, Morgan Morse and Taine Plumtree are contenders for the Wales number eight spot as well as captain Jac Morgan.",
        "Morgan, usually a flanker, made his first appearance of the season off after struggling with a calf issue, coming off the bench as number eight for Ospreys as they drew at Dragons on Saturday.",
        "\"It was great to see him back. He fitted straight back in and was very prominent despite not playing since July,\" said Ospreys head coach Mark Jones.",
        "\"His energy was high, he worked hard in the game and you would never have known he'd been out so long.\"",
        "Keiron Assiratti (Cardiff), Adam Beard (Montpellier), Liam Belcher (Cardiff), Rhys Carre (Saracens), Ben Carter (Dragons), Brodie Coghlan (Dragons), Christian Coleman (Dragons), Olly Cracknell (Leicester Tigers), Rhys Davies (Ospreys), James Fender (Ospreys), Archie Griffin (Bath), Dafydd Jenkins (Exeter Chiefs), Dewi Lake (Ospreys), Alex Mann (Cardiff), Jac Morgan (Ospreys), Morgan Morse (Ospreys), Taine Plumtree (Scarlets), Nicky Smith (Leicester Tigers), Danny Southworth (Cardiff), Gareth Thomas (Ospreys), Freddie Thomas (Gloucester), Aaron Wainwright (Dragons).",
        "Josh Adams (Cardiff), Jacob Beetham (Cardiff), Rio Dyer (Dragons), Dan Edwards (Ospreys), Jarrod Evans (Harlequins), Kieran Hardy (Ospreys), Joe Hawkins (Scarlets), Louie Hennessey (Bath), Max Llewellyn (Gloucester), Reuben Morgan-Williams (Ospreys), Blair Murray (Scarlets), Louis Rees-Zammit (Bristol Bears), Tom Rogers (Scarlets), Callum Sheedy (Cardiff), Ben Thomas (Cardiff), Nick Tompkins (Saracens), Tomos Williams (Gloucester)."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/rugby-union/articles/cly2wk72zvzo",
      "main_category": "sport",
      "detailed_category": "rugby-union",
      "topic": "England pressure is unique in world rugby - Jones",
      "content": [
        "South Africa v JapanVenue: Wembley Stadium Date: Saturday, 1 November Kick-off: 15:10 GMT",
        "Eddie Jones says the unremitting pressure to win throughout the Rugby World Cup cycle makes the England head coach job the hardest in the sport.Jones was in charge of England for almost seven years, steering them to the final of Japan 2019.However, England won only five out of 12 Tests in 2022, leading to the Rugby Football Union (RFU) deciding to fire Jones nine months out from the next World Cup.\"In English rugby, you can never talk about rebuilding because the expectation is you win all the time,\" Jones told BBC Sport.",
        "Asked whether the England head coach role was uniquely difficult in that respect, Jones replied: \"It is, but that's the deal.\"You know when you get the job, you're accepting into that, so you can't complain about that. You've just got to get on with it.\"You've just got to make sure you keep your head above water, mate.\"South Africa, the reigning two-time world champions, have gone into the past two World Cups on the back of indifferent form in the preceding years.In 2018 - current coach Rassie Erasmus' first year in charge - the Springboks won seven of their 14 Tests. Across 2021 and 2022, their win rate was only 61.5%.They were ranked fifth and fourth in the world at the end of those respective periods, but timed their tilt at the Webb Ellis Cup to perfection on each occasion.Jones, now in charge of Japan, says his sacking by England coincided with hitting a \"no man's land\" between a set of experienced older players who had begun to fade, and a younger generation who were yet to develop enough to take their place.\"The team I inherited from the 2015 World Cup, we basically took the same team to the 2019 World Cup,\" said Jones.\"By the time you get to 2023, some of those players are starting to drop off. They're still good players, but they're not quite there.\"Then you've got that no man's land where you've got younger players who aren't quite good enough. They're good, but they're not quite good enough to be Test match winners.\"",
        "Jones believes his successor Steve Borthwick, under whom England have won their past seven Tests and finished third at the 2023 Rugby World Cup, is managing the transition well.\"Steve inherited that [situation] and did a great job at the 2023 World Cup,\" Jones said.\"He coached very efficiently and got the most out of that squad. And now he's creating a different squad.\"England's pair of Test wins against Argentina in the summer caught Jones' eye.\"He's starting to build a really effective style,\" Jones said. \"They played some really good rugby against Argentina - pragmatic, very efficient, tough, keep-at-it, all the attributes that Steve had as a player.\"Borthwick was Jones' forwards coach during the Australian's most successful spell with England, and the pair similarly combined to help Japan to a landmark win over South Africa at the 2015 World Cup.Jones says the Brave Blossoms' 34-32 win over the Springboks has had the biggest legacy of any result in his 30-year coaching career.\"How does it rate? Well, probably in terms of the implications of that win, it's the most important,\" Jones said.\"2015 was the catalyst for the 2019 World Cup, when Japan hosted a very, very good World Cup and, for the first time ever and the only time, made the quarter-final.\"That's a pretty rare achievement for a country outside the big eight in the world.\"The 2023 World Cup was a bit tougher for Japan, but it's allowed Japan to be in the top tier of countries in the world and compete at the highest level.\"Like this year, if you just look at our end-of-season tour, we play Australia, South Africa, Ireland, Wales, Georgia.\"When I had Japan in 2012, we came across and played Romania and Georgia and had a pick-up game against the French Barbarians.\"So it allows the players the opportunity to play against the best in the world, to put Japan in the top tier, all from that game in 2015.\"After overseeing Australia's pool-stage exit from the 2023 Rugby World Cup, Jones is leading Japan for a second time.On Saturday, some 10 years on from that shock in Brighton, his side take on South Africa again on British soil, meeting at Wembley Stadium.The match will pit Jones against South Africa's Erasmus, who has similarly mixed innovation and outspokenness during his coaching career.Jones says he learned most about Erasmus via a laptop he was given during a short-term stint with the Springboks during their title-winning run at the 2007 World Cup.",
        "\"I took over from Rassie in 2007 as a technical adviser, and I inherited his computer, which had the most intricate tactical information about the teams we were about to play,\" said Jones.\"He's always had that really sharp mind about rugby, and he's always coached to the edge, always looking to find a way to maximise the laws of the game.\"And he's always given me a nice bottle of South African red wine at the end of the games, which I always appreciate!\"",
        "Eddie Jones' Japan are one of 12 teams to have automatically qualified for the 2027 Rugby World Cup in Australia",
        "Venue: Wembley Stadium Date: Saturday, 1 November Kick-off: 15:10 GMT",
        "Eddie Jones says the unremitting pressure to win throughout the Rugby World Cup cycle makes the England head coach job the hardest in the sport.",
        "Jones was in charge of England for almost seven years, steering them to the final of Japan 2019.",
        "However, England won only five out of 12 Tests in 2022, leading to the Rugby Football Union (RFU) deciding to fire Jones nine months out from the next World Cup.",
        "\"In English rugby, you can never talk about rebuilding because the expectation is you win all the time,\" Jones told BBC Sport.",
        "Asked whether the England head coach role was uniquely difficult in that respect, Jones replied: \"It is, but that's the deal.",
        "\"You know when you get the job, you're accepting into that, so you can't complain about that. You've just got to get on with it.",
        "\"You've just got to make sure you keep your head above water, mate.\"",
        "South Africa, the reigning two-time world champions, have gone into the past two World Cups on the back of indifferent form in the preceding years.",
        "In 2018 - current coach Rassie Erasmus' first year in charge - the Springboks won seven of their 14 Tests. Across 2021 and 2022, their win rate was only 61.5%.",
        "They were ranked fifth and fourth in the world at the end of those respective periods, but timed their tilt at the Webb Ellis Cup to perfection on each occasion.",
        "Jones, now in charge of Japan, says his sacking by England coincided with hitting a \"no man's land\" between a set of experienced older players who had begun to fade, and a younger generation who were yet to develop enough to take their place.",
        "\"The team I inherited from the 2015 World Cup, we basically took the same team to the 2019 World Cup,\" said Jones.",
        "\"By the time you get to 2023, some of those players are starting to drop off. They're still good players, but they're not quite there.",
        "\"Then you've got that no man's land where you've got younger players who aren't quite good enough. They're good, but they're not quite good enough to be Test match winners.\"",
        "Borthwick and Jones first worked together at Saracens when the Australian came in as coach while Borthwick was still a player",
        "Jones believes his successor Steve Borthwick, under whom England have won their past seven Tests and finished third at the 2023 Rugby World Cup, is managing the transition well.",
        "\"Steve inherited that [situation] and did a great job at the 2023 World Cup,\" Jones said.",
        "\"He coached very efficiently and got the most out of that squad. And now he's creating a different squad.\"",
        "England's pair of Test wins against Argentina in the summer caught Jones' eye.",
        "\"He's starting to build a really effective style,\" Jones said. \"They played some really good rugby against Argentina - pragmatic, very efficient, tough, keep-at-it, all the attributes that Steve had as a player.\"",
        "Borthwick was Jones' forwards coach during the Australian's most successful spell with England, and the pair similarly combined to help Japan to a landmark win over South Africa at the 2015 World Cup.",
        "Jones says the Brave Blossoms' 34-32 win over the Springboks has had the biggest legacy of any result in his 30-year coaching career.",
        "\"How does it rate? Well, probably in terms of the implications of that win, it's the most important,\" Jones said.",
        "\"2015 was the catalyst for the 2019 World Cup, when Japan hosted a very, very good World Cup and, for the first time ever and the only time, made the quarter-final.",
        "\"That's a pretty rare achievement for a country outside the big eight in the world.",
        "\"The 2023 World Cup was a bit tougher for Japan, but it's allowed Japan to be in the top tier of countries in the world and compete at the highest level.",
        "\"Like this year, if you just look at our end-of-season tour, we play Australia, South Africa, Ireland, Wales, Georgia.",
        "\"When I had Japan in 2012, we came across and played Romania and Georgia and had a pick-up game against the French Barbarians.",
        "\"So it allows the players the opportunity to play against the best in the world, to put Japan in the top tier, all from that game in 2015.\"",
        "After overseeing Australia's pool-stage exit from the 2023 Rugby World Cup, Jones is leading Japan for a second time.",
        "On Saturday, some 10 years on from that shock in Brighton, his side take on South Africa again on British soil, meeting at Wembley Stadium.",
        "The match will pit Jones against South Africa's Erasmus, who has similarly mixed innovation and outspokenness during his coaching career.",
        "Jones says he learned most about Erasmus via a laptop he was given during a short-term stint with the Springboks during their title-winning run at the 2007 World Cup.",
        "Jones (left) advised Jake White (right) as South Africa won their second World Cup in France in 2007",
        "\"I took over from Rassie in 2007 as a technical adviser, and I inherited his computer, which had the most intricate tactical information about the teams we were about to play,\" said Jones.",
        "\"He's always had that really sharp mind about rugby, and he's always coached to the edge, always looking to find a way to maximise the laws of the game.",
        "\"And he's always given me a nice bottle of South African red wine at the end of the games, which I always appreciate!\"",
        "Listen: Sport's Strangest Crimes - Bloodgate",
        "Listen to the latest Rugby Union Weekly podcast"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/rugby-union/articles/cwypqv3dpwno",
      "main_category": "sport",
      "detailed_category": "rugby-union",
      "topic": "England centre Dingwall signs new Northampton deal",
      "content": [
        "England centre Fraser Dingwall has signed a contract extension with Northampton for the \"2026-27 season and beyond\".Dingwall joined the academy aged 14 and has made 150 first-team appearances, including the 2024 Premiership final against Bath, when Saints won their first title for a decade.He has won three international caps so far and is in Steve Borthwick's squad for the forthcoming autumn internationals.His new deal follows those signed by Saints and England team-mates Fin Smith and Alex Mitchell. \"You've seen from the lads who've re-signed recently just how much this place means to us,\" Dingwall said. \"But this isn't just about loyalty - I genuinely believe Saints is the best place for me to keep improving. \"It's an aspirational environment where players, coaches and staff are always pushing to be better. That's something I'm fully committed to.\"Northampton are top of the Prem table following last Friday's home win over Saracens and they have scored 181 points in five games so far.\"Dingers is outstanding – in his play, in his commitment, in his work-rate, in his leadership – and his impact within our set-up cannot be overstated,\" said director of rugby Phil Dowson.\"He is someone who often flies under the radar and doesn't always get the credit he deserves, but he's a huge part of what we're about.\"England will take on Australia at Allianz Stadium, Twickenham in their opening autumn Test on Saturday.",
        "Fraser Dingwall made his first-team debut for Northampton in October 2018",
        "England centre Fraser Dingwall has signed a contract extension with Northampton for the \"2026-27 season and beyond\".",
        "Dingwall joined the academy aged 14 and has made 150 first-team appearances, including the 2024 Premiership final against Bath, when Saints won their first title for a decade.",
        "He has won three international caps so far and is in Steve Borthwick's squad for the forthcoming autumn internationals.",
        "His new deal follows those signed by Saints and England team-mates Fin Smith and Alex Mitchell.",
        "\"You've seen from the lads who've re-signed recently just how much this place means to us,\" Dingwall said.",
        "\"But this isn't just about loyalty - I genuinely believe Saints is the best place for me to keep improving.",
        "\"It's an aspirational environment where players, coaches and staff are always pushing to be better. That's something I'm fully committed to.\"",
        "Northampton are top of the Prem table following last Friday's home win over Saracens and they have scored 181 points in five games so far.",
        "\"Dingers is outstanding – in his play, in his commitment, in his work-rate, in his leadership – and his impact within our set-up cannot be overstated,\" said director of rugby Phil Dowson.",
        "\"He is someone who often flies under the radar and doesn't always get the credit he deserves, but he's a huge part of what we're about.\"",
        "England will take on Australia at Allianz Stadium, Twickenham in their opening autumn Test on Saturday.",
        "Freeman looking to 'kick on' in autumn internationals",
        "Four-try Freeman stars as Saints beat Saracens"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/rugby-union/articles/cdjrl171m84o",
      "main_category": "sport",
      "detailed_category": "rugby-union",
      "topic": "Ireland v New Zealand - all you need to know",
      "content": [
        "Nine years on from a seismic day in Irish rugby, Ireland and New Zealand return to Soldier Field in Chicago for the latest instalment of what has become a major rivalry.Prior to their 40-29 win in 2016, Ireland had never beaten the All Blacks over the previous 111 years of the fixture, but the last 10 meetings have been shared equally between the nations.Certainly, the fear factor is now gone from an Irish perspective, while New Zealand have found themselves seeking to re-establish their dominance.A return to the scene of that seminal victory of 2016 will stir glorious memories for those in green, but the All Blacks will travel to the United States eager to make up for a defeat that changed the landscape of this fixture.This week's game also marks the start of Ireland's autumn internationals as after their American adventure, they will return home for Tests against Japan, Australia and South Africa.",
        "The match takes place at 20:10 GMT at Soldier Field on Saturday. Chicago is five hours behind GMT.",
        "There will be live audio commentary on BBC Sounds and BBC Radio Ulster with commentator Jim Neilly alongside former Ireland international Chris Henry from 20:00 GMT.The commentary will also be available on the BBC Sport website where you can also follow blow-by-blow action with our live text commentary.For all the build-up and analysis, make sure to follow our dedicated Irish Rugby page.",
        "Both teams are due to be announced on Thursday.",
        "French referee Pierre Brousset will be the man with the whistle in Chicago on Saturday.He will be assisted by compatriot Luc Ramos and England's Karl Dickson.England's Ian Tempest is the television match official (TMO) with another Englishman, Dan Jones, in charge of the foul play review process (FPRO).",
        "Ireland's Six Nations campaign saw them finish third. Despite winning four of their five games, a 15-point defeat by France in Dublin proved costly as with just three bonus points picked up overall, they finished two points behind Les Bleus with England one ahead in second.With 18 players involved in the British and Irish Lions' tour to Australia, it was an opportunity for many of those on the fringes to show what they could do as Ireland travelled to Georgia and Portugal in the summer, winning both Tests.New Zealand enjoyed a 3-0 home series win over France in the summer before turning their attention to the Rugby Championship where, after securing an opening win over Argentina, they were stunned by the Pumas seven days later.They shared the home series with South Africa and retained the Bledisloe Cup with back-to-back wins against Australia, but it was not enough to win the overall championship as they came up short on points difference to the Springboks.",
        "Ireland head coach Andy Farrell was forced to make some changes to his initial squad.Mack Hansen suffered a foot injury in last week's United Rugby Championship (URC) game for Connacht against the Bulls, while Munster pair Edwin Edogbo (concussion) and Brian Gleeson (elbow) have also been forced to stay at home.Into the squad have come uncapped Munster centre Tom Farrell and Leinster's Jimmy O'Brien.Bundee Aki (hip) and Robbie Henshaw (groin) have travelled with their progress to be monitored, while captain Caelan Doris may be in line for his first action since injuring his shoulder in Leinster's Investec Champions Cup semi-final against Northampton Saints in May.As for New Zealand, head coach Scott Robertson was also forced into a change from his initial squad with veteran lock Patrick Tuipulotu ruled out with a shoulder injury, replaced by Sam Darry.Josh Lord has been included among the locks with Tupou Vaa'i unavailable because of a knee injury, while uncapped prop Tevita Mafileo has been included as a thumb injury has ruled Tyrel Lomax out.",
        "As mentioned above, Ireland's victory over New Zealand in Chicago nine years ago proved a turning point in this fixture.While it was New Zealand dominance up until that point, the past 10 meetings have been shared equally.The All Blacks did gain revenge for their loss in Chicago by beating Ireland in Dublin a fortnight later, but in 2018, Ireland would then record their first win at home against New Zealand.In 2022, they won for the first time on New Zealand soil before backing it up seven days later to secure a 2-1 series win, but the All Blacks have always found a way to bounce back, thumping Ireland in a 2019 World Cup quarter-final in Japan and in the 2023 tournament in France, came through 28-24 as they held out despite latest Irish pressure.The last meeting between the teams took place in Dublin last year when the All Blacks came away with a 23-13 victory.Damian McKenzie kicked six penalties to give the All Blacks a lead midway through the second half despite a Josh van der Flier try for Ireland just after the break, but a Will Jordan try would put the issue beyond doubt.",
        "After temporarily stepping away after last year's autumn internationals to focus on his role as head coach of the British and Irish Lions, Andy Farrell is back at the helm with Ireland.Simon Easterby deputised in Farrell's absence, but the return of a man who guided Ireland to a Grand Slam in 2023 and a Six Nations championship the following year will be viewed as a boost with a degree of certainty returning.There may still be a little bit of settling back in to do for the coach and of course, those players he brought to Australia for the Lions tour.If there is one task to focus his mind back on the job, a Test against the All Blacks will be it, but it will be a test in every sense of the word and for the coach, he will be eager to ensure his return gets off to the best possible start.",
        "Ireland beat New Zealand for the first time in Chicago in 2016",
        "Nine years on from a seismic day in Irish rugby, Ireland and New Zealand return to Soldier Field in Chicago for the latest instalment of what has become a major rivalry.",
        "Prior to their 40-29 win in 2016, Ireland had never beaten the All Blacks over the previous 111 years of the fixture, but the last 10 meetings have been shared equally between the nations.",
        "Certainly, the fear factor is now gone from an Irish perspective, while New Zealand have found themselves seeking to re-establish their dominance.",
        "A return to the scene of that seminal victory of 2016 will stir glorious memories for those in green, but the All Blacks will travel to the United States eager to make up for a defeat that changed the landscape of this fixture.",
        "This week's game also marks the start of Ireland's autumn internationals as after their American adventure, they will return home for Tests against Japan, Australia and South Africa.",
        "The match takes place at 20:10 GMT at Soldier Field on Saturday. Chicago is five hours behind GMT.",
        "There will be live audio commentary on BBC Sounds and BBC Radio Ulster with commentator Jim Neilly alongside former Ireland international Chris Henry from 20:00 GMT.",
        "The commentary will also be available on the BBC Sport website where you can also follow blow-by-blow action with our live text commentary.",
        "For all the build-up and analysis, make sure to follow our dedicated Irish Rugby page.",
        "Both teams are due to be announced on Thursday.",
        "French referee Pierre Brousset will be the man with the whistle in Chicago on Saturday.",
        "He will be assisted by compatriot Luc Ramos and England's Karl Dickson.",
        "England's Ian Tempest is the television match official (TMO) with another Englishman, Dan Jones, in charge of the foul play review process (FPRO).",
        "Ireland's Six Nations campaign saw them finish third. Despite winning four of their five games, a 15-point defeat by France in Dublin proved costly as with just three bonus points picked up overall, they finished two points behind Les Bleus with England one ahead in second.",
        "With 18 players involved in the British and Irish Lions' tour to Australia, it was an opportunity for many of those on the fringes to show what they could do as Ireland travelled to Georgia and Portugal in the summer, winning both Tests.",
        "New Zealand enjoyed a 3-0 home series win over France in the summer before turning their attention to the Rugby Championship where, after securing an opening win over Argentina, they were stunned by the Pumas seven days later.",
        "They shared the home series with South Africa and retained the Bledisloe Cup with back-to-back wins against Australia, but it was not enough to win the overall championship as they came up short on points difference to the Springboks.",
        "Ireland captain Caelan Doris has returned to the squad after a shoulder injury kept him out of the British and Irish Lions tour to Australia",
        "Ireland head coach Andy Farrell was forced to make some changes to his initial squad.",
        "Mack Hansen suffered a foot injury in last week's United Rugby Championship (URC) game for Connacht against the Bulls, while Munster pair Edwin Edogbo (concussion) and Brian Gleeson (elbow) have also been forced to stay at home.",
        "Into the squad have come uncapped Munster centre Tom Farrell and Leinster's Jimmy O'Brien.",
        "Bundee Aki (hip) and Robbie Henshaw (groin) have travelled with their progress to be monitored, while captain Caelan Doris may be in line for his first action since injuring his shoulder in Leinster's Investec Champions Cup semi-final against Northampton Saints in May.",
        "As for New Zealand, head coach Scott Robertson was also forced into a change from his initial squad with veteran lock Patrick Tuipulotu ruled out with a shoulder injury, replaced by Sam Darry.",
        "Josh Lord has been included among the locks with Tupou Vaa'i unavailable because of a knee injury, while uncapped prop Tevita Mafileo has been included as a thumb injury has ruled Tyrel Lomax out.",
        "Will Jordan celebrates his try which helped New Zealand to a 23-13 win over Ireland in Dublin last year",
        "As mentioned above, Ireland's victory over New Zealand in Chicago nine years ago proved a turning point in this fixture.",
        "While it was New Zealand dominance up until that point, the past 10 meetings have been shared equally.",
        "The All Blacks did gain revenge for their loss in Chicago by beating Ireland in Dublin a fortnight later, but in 2018, Ireland would then record their first win at home against New Zealand.",
        "In 2022, they won for the first time on New Zealand soil before backing it up seven days later to secure a 2-1 series win, but the All Blacks have always found a way to bounce back, thumping Ireland in a 2019 World Cup quarter-final in Japan and in the 2023 tournament in France, came through 28-24 as they held out despite latest Irish pressure.",
        "The last meeting between the teams took place in Dublin last year when the All Blacks came away with a 23-13 victory.",
        "Damian McKenzie kicked six penalties to give the All Blacks a lead midway through the second half despite a Josh van der Flier try for Ireland just after the break, but a Will Jordan try would put the issue beyond doubt.",
        "Farrell took a year off to concentrate on his role as head coach of the British and Irish Lions",
        "After temporarily stepping away after last year's autumn internationals to focus on his role as head coach of the British and Irish Lions, Andy Farrell is back at the helm with Ireland.",
        "Simon Easterby deputised in Farrell's absence, but the return of a man who guided Ireland to a Grand Slam in 2023 and a Six Nations championship the following year will be viewed as a boost with a degree of certainty returning.",
        "There may still be a little bit of settling back in to do for the coach and of course, those players he brought to Australia for the Lions tour.",
        "If there is one task to focus his mind back on the job, a Test against the All Blacks will be it, but it will be a test in every sense of the word and for the coach, he will be eager to ensure his return gets off to the best possible start."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/rugby-union/articles/cy9pxyp53z9o",
      "main_category": "sport",
      "detailed_category": "rugby-union",
      "topic": "Freeman looking to 'kick on' in autumn internationals",
      "content": [
        "Wing Tommy Freeman is hoping to cause some \"damage\" for England in the Autumn Nations Series after scoring four tries in Northampton's win over Saracens.Friday's 43-31 victory at Franklin's Gardens was unbeaten Northampton's fourth in five Prem games this season and kept them top of the table.It was their last in the competition until 29 November with the Prem Rugby Cup returning while Freeman and five Saints team-mates are away with England.Steve Borthwick's side play Australia, Fiji, New Zealand and Argentina over four weekends next month at Twickenham's Allianz Stadium.\"We're looking to kick on. We did pretty well in the Six Nations and the lads did unbelievably well on the summer tour to Argentina as well,\" freeman told BBC Radio Northampton.\"You can really tell this is a close group and hopefully we do some damage this autumn.\"Joining them in the squad will be Saracen's teenage wing Noah Caluori, who trained with England after scoring five tries for his club against Sale recently, but failed to add to his tally at Northampton.  \"Noah's an unbelievable athlete, we saw glimpses of it in camp, and he does some pretty special stuff,\" added Freeman.\"We knew he was going to bring an aerial threat we had to contain and I think we did a pretty good job of that.\"",
        "Freeman described the game against Sarries as \"a lot of fun\" and he now has 64 tries in 102 appearances for the club.\"That's when we're in our stride, when we get fast ball, and can stay on top of teams like that. We knew Sarries would target our breakdown, try and slow our ball up,\" the 24 year-old added.\"There were a few lapses in concentration, discipline, (and we) probably let them back in but there was a definite improvement from last week on the discipline side of things, so we'll keep pushing on.\"Playing at home and playing away, it is a big difference and when you are here, you've definitely got the [fans as] 16th man, you can hear them the whole way through.\" \"The first couple of weeks were pretty rusty from all of us coming back in at different stages, at different times. It was good to all get on the same page  and you saw that in the first 20 [minutes] and last 40.\"",
        "Tommy Freeman touches down his fourth try against Saracens",
        "Wing Tommy Freeman is hoping to cause some \"damage\" for England in the Autumn Nations Series after scoring four tries in Northampton's win over Saracens.",
        "Friday's 43-31 victory at Franklin's Gardens was unbeaten Northampton's fourth in five Prem games this season and kept them top of the table.",
        "It was their last in the competition until 29 November with the Prem Rugby Cup returning while Freeman and five Saints team-mates are away with England.",
        "Steve Borthwick's side play Australia, Fiji, New Zealand and Argentina over four weekends next month at Twickenham's Allianz Stadium.",
        "\"We're looking to kick on. We did pretty well in the Six Nations and the lads did unbelievably well on the summer tour to Argentina as well,\" freeman told BBC Radio Northampton.",
        "\"You can really tell this is a close group and hopefully we do some damage this autumn.\"",
        "Joining them in the squad will be Saracen's teenage wing Noah Caluori, who trained with England after scoring five tries for his club against Sale recently, but failed to add to his tally at Northampton.",
        "\"Noah's an unbelievable athlete, we saw glimpses of it in camp, and he does some pretty special stuff,\" added Freeman.",
        "\"We knew he was going to bring an aerial threat we had to contain and I think we did a pretty good job of that.\"",
        "Four-try Freeman stars as Saints beat Saracens",
        "Saints must step up to plug experience gap - Freeman",
        "Freeman described the game against Sarries as \"a lot of fun\" and he now has 64 tries in 102 appearances for the club.",
        "\"That's when we're in our stride, when we get fast ball, and can stay on top of teams like that. We knew Sarries would target our breakdown, try and slow our ball up,\" the 24 year-old added.",
        "\"There were a few lapses in concentration, discipline, (and we) probably let them back in but there was a definite improvement from last week on the discipline side of things, so we'll keep pushing on.",
        "\"Playing at home and playing away, it is a big difference and when you are here, you've definitely got the [fans as] 16th man, you can hear them the whole way through.\"",
        "\"The first couple of weeks were pretty rusty from all of us coming back in at different stages, at different times. It was good to all get on the same page  and you saw that in the first 20 [minutes] and last 40.\"",
        "England pressure is unique in world rugby - Jones",
        "Uncapped teenager Caluori makes full England squad"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/rugby-union/articles/c5yp54jwg50o",
      "main_category": "sport",
      "detailed_category": "rugby-union",
      "topic": "What Welsh shake-up means and why it matters to rest of rugby world",
      "content": [
        "The rugby world so often looks on either in awe or pity as Welsh rugby's fortunes rise and fall like the landscape of the country.A nation of just three million - a third of the size of London - so regularly punches well above its weight on the pitch only to then inevitably suffer the deepest lows.It now faces its biggest shake-up in 20 years after Welsh rugby's governing body announced it will cut one professional team by 2027, invest further in the club level and revamp both the academy structure and women's game.BBC Sport looks at how we got here, why should anyone outside of Wales care and what could happen next.",
        "While the extremes can be thrilling and worrying in equal measure, world rugby cries out for stability in a country that was among the founding nations of, what is now, the Six Nations and the World Cup.\"Rugby needs a strong Wales like football needs a strong Brazil,\" said former Wales international Chris Horsman.\"The game needs a country that has all that heritage, history and passion for the sport. Even in England, they want to have a decent Wales, even if just for the rivalries.\"Wealthier clubs may start circling and national captain Jac Morgan has already been linked with Saracens after saying he would not stay in Wales if Ospreys do not exist.But there is a broader issue. At a time when the sport is fighting for eyeballs in a crowded market, rugby cannot afford not to have a strong global presence from a country with such a heartfelt investment in the game.A Six Nations trip to the Principality Stadium remains on the bucket list of players and supporters alike.But rugby is built on healthy rivalry and robust competition and the game at international and club level is poorer - financially and emotionally - for the lack of meaningful Welsh impact. \"Rugby finances across the world are challenging, with static media rights values and sponsors looking for improved deals in a sport that is struggling to grow its fan numbers,\" said Welsh Rugby Union chairman Richard Collier-Keywood.\"Wales is not alone. In their last set of accounts England lost £43m, Scotland lost £11m, Ireland lost £15m and France lost £11m.\"",
        "The ill-health of the Welsh game has not happened overnight. We are only now seeing the symptoms of neglect that lay below the surface of national success, steadily spreading through every limb, be it club, regional or elite level.\"I was fortunate in my time that there were people around the team that protected us from the suits and we had success on the field because of that,\" former captain Alun Wyn Jones told Scrum V.\"It was success that should have grown the game... but it didn't. We have wasted a lot of time.\"",
        "Money - and the lack of it - has inevitably played a major role in this decline.For too long Welsh rugby lived a life on credit, reliant on rich benefactors such as Peter Thomas (Cardiff), Tony Brown (Dragons) and Mike Cuddy (Ospreys) who repeatedly dipped into their hefty wallets to bring the likes of Percy Montgomery, Jerry Collins and even Jonah Lomu to Wales. They were megastars who people were happy to pay to watch, while a Welsh golden generation of Shane Williams, Alun Wyn Jones and George North emerged.But the loss in effect of the national academy - which has now been reversed - put a roundabout in the pathway system and Max Boyce's mythical 'outside-half factory' ground to a halt, pulled down the shutters and stuck a for sale sign outside.Wales is not alone in feeling the pinch, but perhaps feels it more acutely than other nations without those sugar daddies.\"We inherited a mess,\" was the damning summary from Collier-Keywood of the WRU finances when the new board took charge in January 2024.\"It felt like the organisation was not equipped to run a £100m business.\"Indeed, in January 2024 the WRU had run out of money - we were up against our overdraft limit, and we needed additional support from our banks. We were spending more than we were earning and the money received from CVC whereby we sold rights in URC and Six Nations has now run out.\"That decision, Collier-Keywood revealed, means Welsh rugby is missing out on £5m every year.Now the WRU says it is time to consolidate resources, finances and playing talent to even fewer teams.",
        "What emerged as a side topic from the WRU's public consultation was that Welsh rugby fans have limited affinity with the United Rugby Championship.This is not least due to the distances covered across five countries, including South Africa, and the subsequent lack of travelling supporters as well as a lack of heartfelt rivalry between the 16 teams. But the WRU spelled out why the prospect of an Anglo-Welsh league remains a faint one.\"A significant number of people advocated that Wales should play against English clubs in a new Anglo-Welsh league,\" said Collier-Keywood.\"To play in [The Prem], all 10 current PRL clubs would need to agree, together with the RFU, for us to be invited to join. This is not a choice within the control of the WRU board.\"Clubs in England's second-tier Championship would also oppose any such invitation, which would in addition involve untangling various broadcast deals across both The Prem and URC.A Welsh side has not won the URC - or even come close - since Scarlets in 2017, particularly since the arrival of South African teams, but fans must learn to love it, for now.",
        "MPs have already announced plans to question the WRU about the outcome of its consultation and the impact on the sport's wider economic and cultural importance in Wales. \"With rugby woven into the fabric of life in communities up and down the nation, the proposed structural changes announced by the WRU today will resonate far beyond the pitch,\" said Ruth Jones MP, chair of the Welsh Affairs Committee.But the big questions fans wants answering are which team will be cut and when?The WRU had sought to cull two regions amid unanimous calls for change but the backlash made it clear that was too far and too much to bear. But still, one will go.Despite attempts to play down the scenario, it appears a straight battle between Ospreys and Scarlets - the two most successful clubs in the regional rugby era which began in 2003 - for the single west Wales spot.There remains a hope within the governing body that the two clubs will merge, as they so nearly did so in 2019. That would certainly make a formidable combination but would take a enormous amount of diplomacy - or desperation.Both teams' funding deal with the WRU expires in June 2027 but the likelihood is that this will be decided before then.The WRU remained coy over how long they are contracted to provide four teams to the URC, who were firm in their desire for an even number of Welsh teams to safeguard the structure and format of the competition.The WRU could be liable to pay compensation for withdrawing a team prematurely but negotiations are already taking place over a 15-team league, or about who could take the final place if it remains at 16.South Africa are said to be against suggestions of inviting a club from the United States or Canada, because of the travel, so could a European option, say from Georgia, Spain or Portugal, or even an English Championship club be an option?",
        "A Six Nations trip to the Principality Stadium remain on most rugby fans' bucket list",
        "The rugby world so often looks on either in awe or pity as Welsh rugby's fortunes rise and fall like the landscape of the country.",
        "A nation of just three million - a third of the size of London - so regularly punches well above its weight on the pitch only to then inevitably suffer the deepest lows.",
        "It now faces its biggest shake-up in 20 years after Welsh rugby's governing body announced it will cut one professional team by 2027, invest further in the club level and revamp both the academy structure and women's game.",
        "BBC Sport looks at how we got here, why should anyone outside of Wales care and what could happen next.",
        "While the extremes can be thrilling and worrying in equal measure, world rugby cries out for stability in a country that was among the founding nations of, what is now, the Six Nations and the World Cup.",
        "\"Rugby needs a strong Wales like football needs a strong Brazil,\" said former Wales international Chris Horsman.",
        "\"The game needs a country that has all that heritage, history and passion for the sport. Even in England, they want to have a decent Wales, even if just for the rivalries.\"",
        "Wealthier clubs may start circling and national captain Jac Morgan has already been linked with Saracens after saying he would not stay in Wales if Ospreys do not exist.",
        "But there is a broader issue. At a time when the sport is fighting for eyeballs in a crowded market, rugby cannot afford not to have a strong global presence from a country with such a heartfelt investment in the game.",
        "A Six Nations trip to the Principality Stadium remains on the bucket list of players and supporters alike.",
        "But rugby is built on healthy rivalry and robust competition and the game at international and club level is poorer - financially and emotionally - for the lack of meaningful Welsh impact.",
        "\"Rugby finances across the world are challenging, with static media rights values and sponsors looking for improved deals in a sport that is struggling to grow its fan numbers,\" said Welsh Rugby Union chairman Richard Collier-Keywood.",
        "\"Wales is not alone. In their last set of accounts England lost £43m, Scotland lost £11m, Ireland lost £15m and France lost £11m.\"",
        "Welsh regions 'relieved and encouraged' despite WRU cut plan",
        "What grassroots rugby says about regions shake-up",
        "Welsh rugby aims to halt player-drain to England",
        "The ill-health of the Welsh game has not happened overnight. We are only now seeing the symptoms of neglect that lay below the surface of national success, steadily spreading through every limb, be it club, regional or elite level.",
        "\"I was fortunate in my time that there were people around the team that protected us from the suits and we had success on the field because of that,\" former captain Alun Wyn Jones told Scrum V.",
        "\"It was success that should have grown the game... but it didn't. We have wasted a lot of time.\"",
        "Money - and the lack of it - has inevitably played a major role in this decline.",
        "For too long Welsh rugby lived a life on credit, reliant on rich benefactors such as Peter Thomas (Cardiff), Tony Brown (Dragons) and Mike Cuddy (Ospreys) who repeatedly dipped into their hefty wallets to bring the likes of Percy Montgomery, Jerry Collins and even Jonah Lomu to Wales.",
        "They were megastars who people were happy to pay to watch, while a Welsh golden generation of Shane Williams, Alun Wyn Jones and George North emerged.",
        "But the loss in effect of the national academy - which has now been reversed - put a roundabout in the pathway system and Max Boyce's mythical 'outside-half factory' ground to a halt, pulled down the shutters and stuck a for sale sign outside.",
        "Wales is not alone in feeling the pinch, but perhaps feels it more acutely than other nations without those sugar daddies.",
        "\"We inherited a mess,\" was the damning summary from Collier-Keywood of the WRU finances when the new board took charge in January 2024.",
        "\"It felt like the organisation was not equipped to run a £100m business.",
        "\"Indeed, in January 2024 the WRU had run out of money - we were up against our overdraft limit, and we needed additional support from our banks. We were spending more than we were earning and the money received from CVC whereby we sold rights in URC and Six Nations has now run out.\"",
        "That decision, Collier-Keywood revealed, means Welsh rugby is missing out on £5m every year.",
        "Now the WRU says it is time to consolidate resources, finances and playing talent to even fewer teams.",
        "What emerged as a side topic from the WRU's public consultation was that Welsh rugby fans have limited affinity with the United Rugby Championship.",
        "This is not least due to the distances covered across five countries, including South Africa, and the subsequent lack of travelling supporters as well as a lack of heartfelt rivalry between the 16 teams.",
        "But the WRU spelled out why the prospect of an Anglo-Welsh league remains a faint one.",
        "\"A significant number of people advocated that Wales should play against English clubs in a new Anglo-Welsh league,\" said Collier-Keywood.",
        "\"To play in [The Prem], all 10 current PRL clubs would need to agree, together with the RFU, for us to be invited to join. This is not a choice within the control of the WRU board.\"",
        "Clubs in England's second-tier Championship would also oppose any such invitation, which would in addition involve untangling various broadcast deals across both The Prem and URC.",
        "A Welsh side has not won the URC - or even come close - since Scarlets in 2017, particularly since the arrival of South African teams, but fans must learn to love it, for now.",
        "This video can not be played",
        "Wales rugby: Collier-Keywood and Reddin defend roles amid revamp",
        "MPs have already announced plans to question the WRU about the outcome of its consultation and the impact on the sport's wider economic and cultural importance in Wales.",
        "\"With rugby woven into the fabric of life in communities up and down the nation, the proposed structural changes announced by the WRU today will resonate far beyond the pitch,\" said Ruth Jones MP, chair of the Welsh Affairs Committee.",
        "But the big questions fans wants answering are which team will be cut and when?",
        "The WRU had sought to cull two regions amid unanimous calls for change but the backlash made it clear that was too far and too much to bear. But still, one will go.",
        "Despite attempts to play down the scenario, it appears a straight battle between Ospreys and Scarlets - the two most successful clubs in the regional rugby era which began in 2003 - for the single west Wales spot.",
        "There remains a hope within the governing body that the two clubs will merge, as they so nearly did so in 2019. That would certainly make a formidable combination but would take a enormous amount of diplomacy - or desperation.",
        "Both teams' funding deal with the WRU expires in June 2027 but the likelihood is that this will be decided before then.",
        "The WRU remained coy over how long they are contracted to provide four teams to the URC, who were firm in their desire for an even number of Welsh teams to safeguard the structure and format of the competition.",
        "The WRU could be liable to pay compensation for withdrawing a team prematurely but negotiations are already taking place over a 15-team league, or about who could take the final place if it remains at 16.",
        "South Africa are said to be against suggestions of inviting a club from the United States or Canada, because of the travel, so could a European option, say from Georgia, Spain or Portugal, or even an English Championship club be an option?",
        "Watch: Scrum V Welsh rugby special",
        "Listen: Scrum V podcast - WRU decide to cut a professional side"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/rugby-union/articles/cq6zmq5z97mo",
      "main_category": "sport",
      "detailed_category": "rugby-union",
      "topic": "Dickens claims Newcastle have gone backwards",
      "content": [
        "Newcastle Red Bulls head coach Alan Dickens said his side have gone backwards after their 52-14 mauling at Harlequins.Dickens saw much positivity in Newcastle's spirited display against Gallagher Prem leaders Northampton Saints in losing 36-19 earlier this month and hoped they would carry this into the game against Harlequins on Saturday.Instead Newcastle flopped and Dickens admits the players exchanged \"harsh words\" after coming in 35-0 down at half-time.Pointless Newcastle are bottom of the Gallagher Prem and a frustrated Dickens told BBC Radio Newcastle: \"Look, it's kind of one step forward, two steps back really.\"I think there were a lot of disappointed players in the changing room, not at the end of the game, at half-time.\"There were some harsh words spoken between themselves in terms of saying that performance wasn't good enough, that they needed to go out in second half and put that right.\"Certainly in the first half, we weren't accurate enough. There were little knock-ons, forward passes, going into touch and that handed the ball back to Harlequins and they are a very, very dangerous side.\"The other element of the first half is we dropped off too many tackles, and all of those compiled meant it was a very, very tough first half.\"It's a very, very disappointing result, certainly the way we started.\"",
        "Newcastle Red Bulls have conceded 222 points, 32 more than the next worst team in the Prem",
        "Newcastle Red Bulls head coach Alan Dickens said his side have gone backwards after their 52-14 mauling at Harlequins.",
        "Dickens saw much positivity in Newcastle's spirited display against Gallagher Prem leaders Northampton Saints in losing 36-19 earlier this month and hoped they would carry this into the game against Harlequins on Saturday.",
        "Instead Newcastle flopped and Dickens admits the players exchanged \"harsh words\" after coming in 35-0 down at half-time.",
        "Pointless Newcastle are bottom of the Gallagher Prem and a frustrated Dickens told BBC Radio Newcastle: \"Look, it's kind of one step forward, two steps back really.",
        "\"I think there were a lot of disappointed players in the changing room, not at the end of the game, at half-time.",
        "\"There were some harsh words spoken between themselves in terms of saying that performance wasn't good enough, that they needed to go out in second half and put that right.",
        "\"Certainly in the first half, we weren't accurate enough. There were little knock-ons, forward passes, going into touch and that handed the ball back to Harlequins and they are a very, very dangerous side.",
        "\"The other element of the first half is we dropped off too many tackles, and all of those compiled meant it was a very, very tough first half.",
        "\"It's a very, very disappointing result, certainly the way we started.\""
      ]
    },
    {
      "url": "https://www.bbc.com/sport/rugby-union/articles/cr43wrl0qd2o",
      "main_category": "sport",
      "detailed_category": "rugby-union",
      "topic": "Uncapped teenager Caluori makes full England squad",
      "content": [
        "Uncapped Saracens wing Noah Caluori is among the players named in Steve Borthwick's 36-man England squad for the autumn internationals.Caluori, 19, was invited to train with England last week after scoring five tries on his full Premiership debut in Saracens' win over Sale, but now makes the full international squad.Sale pair Tom Curry and Raffi Quirke are also back in the squad after injury issues but Leicester forward Emeka Ilione misses out with a shoulder problem.England begin their autumn internationals against Australia at Twickenham on next Saturday (15:10 GMT).\"Our focus is on making the most of the time we have together as we approach what will be a fiercely competitive series,\" Borthwick said.\"Facing Australia in the opening match will be a great test against a team that has been training and playing together for some time and is one of the in-form teams in the world.\"",
        "Scrum-half Quirke won two caps under former England coach Eddie Jones four years ago but a succession of injuries halted the 24-year-old's progress.Club-mate Curry had an operation on a long-standing wrist ligament injury after helping the British and Irish Lions to a successful series win in Australia over the summer.Former captain Owen Farrell misses out as expected.After beginning the series against Australia, England will also face Fiji, New Zealand and Argentina this autumn.",
        "ForwardsFin Baxter (Harlequins), Ollie Chessum (Leicester Tigers), Alex Coles (Northampton Saints), Luke Cowan-Dickie (Sale Sharks), Chandler Cunningham-South (Harlequins), Tom Curry (Sale Sharks), Theo Dan (Saracens), Ben Earl (Saracens), Ellis Genge (Bristol Bears), Jamie George (Saracens), Joe Heyes (Leicester Tigers), Maro Itoje (Saracens), Nick Isiekwe (Saracens), Jack Kenningham (Harlequins), Asher Opoku-Fordjour (Sale Sharks), Guy Pepper (Bath Rugby), Henry Pollock (Northampton Saints), Will Stuart (Bath Rugby), Sam Underhill (Bath Rugby)BacksHenry Arundell (Bath Rugby), Noah Caluori (Saracens), Fraser Dingwall (Northampton Saints), Immanuel Feyi-Waboso (Exeter Chiefs), George Ford (Sale Sharks), Tommy Freeman (Northampton Saints), Ollie Lawrence (Bath Rugby), Alex Mitchell (Northampton Saints), Cadan Murley (Harlequins), Max Ojomoh (Bath Rugby), Raffi Quirke (Sale Sharks), Tom Roebuck (Sale Sharks), Henry Slade (Exeter Chiefs), Fin Smith (Northampton Saints), Marcus Smith (Harlequins), Ben Spencer (Bath Rugby), Freddie Steward (Leicester Tigers)",
        "Noah Caluori represented England at the under-20s World Cup in the summer",
        "Uncapped Saracens wing Noah Caluori is among the players named in Steve Borthwick's 36-man England squad for the autumn internationals.",
        "Caluori, 19, was invited to train with England last week after scoring five tries on his full Premiership debut in Saracens' win over Sale, but now makes the full international squad.",
        "Sale pair Tom Curry and Raffi Quirke are also back in the squad after injury issues but Leicester forward Emeka Ilione misses out with a shoulder problem.",
        "England begin their autumn internationals against Australia at Twickenham on next Saturday (15:10 GMT).",
        "\"Our focus is on making the most of the time we have together as we approach what will be a fiercely competitive series,\" Borthwick said.",
        "\"Facing Australia in the opening match will be a great test against a team that has been training and playing together for some time and is one of the in-form teams in the world.\"",
        "Scrum-half Quirke won two caps under former England coach Eddie Jones four years ago but a succession of injuries halted the 24-year-old's progress.",
        "Club-mate Curry had an operation on a long-standing wrist ligament injury after helping the British and Irish Lions to a successful series win in Australia over the summer.",
        "Former captain Owen Farrell misses out as expected.",
        "After beginning the series against Australia, England will also face Fiji, New Zealand and Argentina this autumn.",
        "Fin Baxter (Harlequins), Ollie Chessum (Leicester Tigers), Alex Coles (Northampton Saints), Luke Cowan-Dickie (Sale Sharks), Chandler Cunningham-South (Harlequins), Tom Curry (Sale Sharks), Theo Dan (Saracens), Ben Earl (Saracens), Ellis Genge (Bristol Bears), Jamie George (Saracens), Joe Heyes (Leicester Tigers), Maro Itoje (Saracens), Nick Isiekwe (Saracens), Jack Kenningham (Harlequins), Asher Opoku-Fordjour (Sale Sharks), Guy Pepper (Bath Rugby), Henry Pollock (Northampton Saints), Will Stuart (Bath Rugby), Sam Underhill (Bath Rugby)",
        "Henry Arundell (Bath Rugby), Noah Caluori (Saracens), Fraser Dingwall (Northampton Saints), Immanuel Feyi-Waboso (Exeter Chiefs), George Ford (Sale Sharks), Tommy Freeman (Northampton Saints), Ollie Lawrence (Bath Rugby), Alex Mitchell (Northampton Saints), Cadan Murley (Harlequins), Max Ojomoh (Bath Rugby), Raffi Quirke (Sale Sharks), Tom Roebuck (Sale Sharks), Henry Slade (Exeter Chiefs), Fin Smith (Northampton Saints), Marcus Smith (Harlequins), Ben Spencer (Bath Rugby), Freddie Steward (Leicester Tigers)",
        "England add coach McGuigan on job share with Sale",
        "Six-try Bath prove too much for Bristol in derby",
        "Leicester edge out Sale by point in 10-try thriller"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/rugby-union/articles/c0qp8epvve0o",
      "main_category": "sport",
      "detailed_category": "rugby-union",
      "topic": "PWR champions Gloucester-Hartpury thrash Saracens",
      "content": [
        "Premiership Women's RugbyGloucester-Hartpury: (19) 40Tries: Muir, Jones 2, Shekells, Monaghan, Heard Cons: Sing 5 Saracens: (0) 14Tries: Campbell, MacDougall Cons: Harrison 2",
        "Reigning Premiership Women's Rugby champions Gloucester-Hartpury opened their new season with a convincing six-try 40-14 win against Saracens. The fixture was a rematch of last season's PWR final and featured 11 internationals from England and Canada who played in the World Cup final just four weeks ago.It was Gloucester-Hartpury's all-star cast who came out firmly on top in front of a crowd of 4,200 at Kingsholm, racing to a 26-0 lead before Saracens put anything on the board. Wales' Kelsey Jones scored twice while Red Roses Maud Muir, Jade Shekells and Tatyana Heard all crossed, along with Sam Monaghan, as May Campbell and Amelia MacDougall scored Saracens' two tries.Despite not playing together since they clinched their title in March, Gloucester-Harptury showed no sign of cobwebs needing to be brushed off or weariness following the World Cup as they dominated possession, territory and the scoreboard.It marked the start of a new era for the three-time champions as the first league outing for new head of rugby Dan Murphy. But the outcome on the pitch was much the same as it has been for the past three campaigns as they brushed aside the Londoners - themselves three-time champions and featuring Canada's World Player of the Year Sophie de Goede and England's World Cup top try-scorer Jess Breach in their starting XV  - with relative ease.",
        "Muir caught scrum-half Natasha 'Mo' Hunt's quick pass to barrel through two tacklers and under the posts inside two minutes and set the tone. Jones, who missed last season after suffering an ACL injury, powered over as the hosts' maul surged forward from a third consecutive line-out, and Shekells added their third as the ball went wide and Gloucester-Hartpury exploited their numbers on the overlap.While Saracens came into the game having won six matches in recent weeks to clinch the PWR Cup, they were outdone in every area and Ireland's Monaghan - on her first start for Gloucester-Hartpury since the PWR final in June 2024 following knee surgery - stretched over for the bonus point fourth try on 47 minutes.\"I was smiling from ear to ear that whole game, it was a bit of a dream being back out there with the girls and the atmosphere the crowd bring is magic,\" Monaghan told BBC Sport.\"We've only had a couple of weeks together and to put out a performance like that shows the determination and the drive of this group,\" she added.\"We know there's still so much more to come, there's so much to grow in that game and we can improve week on week.\" The Londoners finally put points on the board through Campbell but just five minutes later Gloucester-Hartpury had another at the other end as Jones scored her second try.England centre Heard added a sixth, scooping up the ball as it went loose from a ruck and surging over after Bethan Lewis had made a line break.",
        "Gloucester-Hartpury: Sing; Venner, Shekells, Heard, Metcalfe; George, Hunt (c); Perry, K. Jones, Muir; Monaghan, Beckett, Stratford (c), Brock, Matthews.Replacements: N. Jones, Bradley, Samuda, Williams, Lewis, Davies, Goulden, Dallavalle.Saracens: McKenna; Breach, Gregson, Hardy, Corrigan; Harrison (c), Sellors; Clifford, Field, Tremelling; De Goede, Galligan, Evans, Cleall, M. Packer.Replacements: Campbell, Crake, Rose, McMillan, Wright-Haley, MacDougall, Blacklock, Linkins.Referee: Holly Wood",
        "Jade Shekells was among the Gloucester-Hartpury scorers as they picked up where they had left off in last season's PWR final with another win against Saracens",
        "Premiership Women's Rugby",
        "Gloucester-Hartpury: (19) 40",
        "Tries: Muir, Jones 2, Shekells, Monaghan, Heard Cons: Sing 5",
        "Tries: Campbell, MacDougall Cons: Harrison 2",
        "Reigning Premiership Women's Rugby champions Gloucester-Hartpury opened their new season with a convincing six-try 40-14 win against Saracens.",
        "The fixture was a rematch of last season's PWR final and featured 11 internationals from England and Canada who played in the World Cup final just four weeks ago.",
        "It was Gloucester-Hartpury's all-star cast who came out firmly on top in front of a crowd of 4,200 at Kingsholm, racing to a 26-0 lead before Saracens put anything on the board.",
        "Wales' Kelsey Jones scored twice while Red Roses Maud Muir, Jade Shekells and Tatyana Heard all crossed, along with Sam Monaghan, as May Campbell and Amelia MacDougall scored Saracens' two tries.",
        "Despite not playing together since they clinched their title in March, Gloucester-Harptury showed no sign of cobwebs needing to be brushed off or weariness following the World Cup as they dominated possession, territory and the scoreboard.",
        "It marked the start of a new era for the three-time champions as the first league outing for new head of rugby Dan Murphy.",
        "But the outcome on the pitch was much the same as it has been for the past three campaigns as they brushed aside the Londoners - themselves three-time champions and featuring Canada's World Player of the Year Sophie de Goede and England's World Cup top try-scorer Jess Breach in their starting XV  - with relative ease.",
        "Quins win thriller as Kildunne and Packer return",
        "PWR: Sale thrash Tigers, Exeter beat Trailfinders",
        "Muir caught scrum-half Natasha 'Mo' Hunt's quick pass to barrel through two tacklers and under the posts inside two minutes and set the tone.",
        "Jones, who missed last season after suffering an ACL injury, powered over as the hosts' maul surged forward from a third consecutive line-out, and Shekells added their third as the ball went wide and Gloucester-Hartpury exploited their numbers on the overlap.",
        "While Saracens came into the game having won six matches in recent weeks to clinch the PWR Cup, they were outdone in every area and Ireland's Monaghan - on her first start for Gloucester-Hartpury since the PWR final in June 2024 following knee surgery - stretched over for the bonus point fourth try on 47 minutes.",
        "\"I was smiling from ear to ear that whole game, it was a bit of a dream being back out there with the girls and the atmosphere the crowd bring is magic,\" Monaghan told BBC Sport.",
        "\"We've only had a couple of weeks together and to put out a performance like that shows the determination and the drive of this group,\" she added.",
        "\"We know there's still so much more to come, there's so much to grow in that game and we can improve week on week.\"",
        "The Londoners finally put points on the board through Campbell but just five minutes later Gloucester-Hartpury had another at the other end as Jones scored her second try.",
        "England centre Heard added a sixth, scooping up the ball as it went loose from a ruck and surging over after Bethan Lewis had made a line break.",
        "Gloucester-Hartpury: Sing; Venner, Shekells, Heard, Metcalfe; George, Hunt (c); Perry, K. Jones, Muir; Monaghan, Beckett, Stratford (c), Brock, Matthews.",
        "Replacements: N. Jones, Bradley, Samuda, Williams, Lewis, Davies, Goulden, Dallavalle.",
        "Saracens: McKenna; Breach, Gregson, Hardy, Corrigan; Harrison (c), Sellors; Clifford, Field, Tremelling; De Goede, Galligan, Evans, Cleall, M. Packer.",
        "Replacements: Campbell, Crake, Rose, McMillan, Wright-Haley, MacDougall, Blacklock, Linkins."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/rugby-union/articles/c5ypkdwy844o",
      "main_category": "sport",
      "detailed_category": "rugby-union",
      "topic": "Exeter showing 'A-game' after Gloucester victory",
      "content": [
        "Exeter attack coach Dave Walder says his side are showing their 'A-game' after moving up to third in the Prem.Chief's 39-12 win over Gloucester was their third bonus-point victory in as many home games this season.It is part of a massive turnaround from last season where Exeter won just four matches and ended second-from-bottom, their worst top-flight campaign. \"Rob (Baxter, director of rugby), was pretty clear from day one of pre-season what our goals were and what our focus has needed to be and how he's going to treat the players,\" Walder told BBC Radio Devon.\"I think they've responded brilliantly. We can set them up but ultimately it's what they do on the pitch each week that matters.\"At the moment they're bringing their A-game and they're playing really well.\"We've got room for improvement, as every team has, but it's a positive start to the season for us.\"",
        "For the second successive week Henry Slade impressed as the England centre scored two more tries and kicked a further 12 points.It took his career tally beyond 1,000 points for Exeter and he is top of the Prem's points-scorers after five games with 70, while his five tries put him joint-third on the try-scoring charts.He is two tries behind team-mate and England winger Immanuel Feyi-Waboso, with both part of an exciting set of backs that now includes Australia centre Len Ikitau. \"He's been fantastic since I've come to the club, he's been fantastic here for a long time watching from afar, he's great to work with,\" Walder said of Slade.\"I think he's enjoying his rugby - the way he's playing he's certainly getting plenty of positive touches - and having other people around who can maybe take the load off and create moments of magic across the backline, it's very exciting for us.\"I think it's making sure that as a collective we're as powerful as we are individually,\" he added.\"Individually, each and every player we have on the whole backline, and the guys that weren't playing today, have got a huge amount of individual talent.\"It's making sure we put our best foot forward collectively on the pitch each week and enjoy what we do, and at the moment I'm loving it.\"",
        "Exeter are four points off leaders Northampton after five games of the Prem season",
        "Exeter attack coach Dave Walder says his side are showing their 'A-game' after moving up to third in the Prem.",
        "Chief's 39-12 win over Gloucester was their third bonus-point victory in as many home games this season.",
        "It is part of a massive turnaround from last season where Exeter won just four matches and ended second-from-bottom, their worst top-flight campaign.",
        "\"Rob (Baxter, director of rugby), was pretty clear from day one of pre-season what our goals were and what our focus has needed to be and how he's going to treat the players,\" Walder told BBC Radio Devon.",
        "\"I think they've responded brilliantly. We can set them up but ultimately it's what they do on the pitch each week that matters.",
        "\"At the moment they're bringing their A-game and they're playing really well.",
        "\"We've got room for improvement, as every team has, but it's a positive start to the season for us.\"",
        "Henry Slade has scored 70 points in five games this season - 20 more than nearest rival Owen Farrell",
        "For the second successive week Henry Slade impressed as the England centre scored two more tries and kicked a further 12 points.",
        "It took his career tally beyond 1,000 points for Exeter and he is top of the Prem's points-scorers after five games with 70, while his five tries put him joint-third on the try-scoring charts.",
        "He is two tries behind team-mate and England winger Immanuel Feyi-Waboso, with both part of an exciting set of backs that now includes Australia centre Len Ikitau.",
        "\"He's been fantastic since I've come to the club, he's been fantastic here for a long time watching from afar, he's great to work with,\" Walder said of Slade.",
        "\"I think he's enjoying his rugby - the way he's playing he's certainly getting plenty of positive touches - and having other people around who can maybe take the load off and create moments of magic across the backline, it's very exciting for us.",
        "\"I think it's making sure that as a collective we're as powerful as we are individually,\" he added.",
        "\"Individually, each and every player we have on the whole backline, and the guys that weren't playing today, have got a huge amount of individual talent.",
        "\"It's making sure we put our best foot forward collectively on the pitch each week and enjoy what we do, and at the moment I'm loving it.\""
      ]
    },
    {
      "url": "https://www.bbc.com/sport/rugby-union/articles/c0qpg3k47gwo",
      "main_category": "sport",
      "detailed_category": "rugby-union",
      "topic": "Munster edge past Connacht for fifth-straight win",
      "content": [
        "United Rugby ChampionshipMunster (12) 17Tries: O'Donoghue 2, Kilgallen Con: HanrahanConnacht (15) 15Tries: Ralston 2, BoyleMunster maintained their winning start to the United Rugby Championship (URC) as they emerged from an error-strewn game against Connacht at Thomond Park.Although both sides scored three tries, just one was converted with JJ Hanrahan's first-half kick proving the difference in what was an arm-wrestle of a game.The result leaves Munster joint-top of the table with the Stormers as the URC takes a break for the autumn internationals, with Connacht now in 12th with just one win from four, but did take a losing bonus point for their efforts.Both sides were without their Ireland internationals who have crossed the Atlantic to prepare for next week's test match against New Zealand and perhaps the changes contributed to an untidy game, yet it was Munster who made it back-to-back wins over Irish rivals following their victory over Leinster at Croke Park last week.",
        "The hosts asked the early questions but couldn't capitalise until Diarmuid Kilgallen, making his first appearance of the season, fielded a Connacht penalty that failed to find touch.His burst forward created an opening with the ball spread to the opposite wing where Alex Nankivell put captain Jack O'Donoghue in for the score after 14 minutes.Connacht would waste little time hitting back as they worked there way into the Munster 22 with Josh Ioane popping a deft reverse offload to Byron Ralston to scamper over.This was a confidence boost for the visitors as they were soon knocking on the door again as when hammering at the line, Ioane was again the creator for Ralston, flinging a perfect pass out to the winger who had a simple finish.Just as it seemed Ioane could do no wrong, his attempted pass  just inside Munster territory was read perfectly by Kilgallen who intercepted and raced clear for the score which, for the first and only time of the night, was converted as JJ Hanrahan added the extras to put Munster back into the lead.There was still time for another lead change before the half as Connacht took advantage of a late penalty, kicking to the corner and after winning the line-out, laid siege to the Munster line. Referee Andrea Piardi was unsure whether Paul Boyle had managed to ground the ball when driving over, but the TMO confirmed he had to the displeasure of the home support as Connacht took a 15-12 lead as early replacement Sean Naughton missed his third conversion of the half.It took a little time for the second half to settle following a lengthy stoppage which saw Ralston's night come to an end, but it remained untidy with errors on both sides.When Munster injected a bit of pace, they carried more of a threat but their persistence finally paid off in the 67th minute when O'Donoghue powered over for his second score of the night as the lead changed for the fourth and final time.The hosts sought the bonus point try in the closing stages but coughed up a penalty when metres from the Connacht line in the final minute, giving the visitors one last opportunity, but they were unable to do anything with it as Munster held on for their fifth win out of five.",
        "Munster: Daly; Kilgallen, Kelly, Nankivell, Abrahams; Hanrahan, Coughlan; Milne, Barron, Ryan; Kleyn, Wycherley; O'Donoghue (capt), Hodnett, Coombes.Replacements: Scannell, Loughman, Foxe, O'Connell, Quinn, O'Riordan, Butler, McCarthyConnacht: West; Ralston, Gavin, Forde, Treacy; Ioane, B Murphy; Duggan, Heffernan, Illo; Joyce, D Murray; J Murphy, Boyle (capt), Jansen.Replacements: Tierney-Martin, Dooley, Barrett, N Murray, O'Connor, Devine, Naughton, O'BrienReferee: Andrea Piardi (FIR)",
        "Jack O'Donoghue takes the congratulations after scoring what proved to be the winning try",
        "United Rugby Championship",
        "Tries: O'Donoghue 2, Kilgallen Con: Hanrahan",
        "Tries: Ralston 2, Boyle",
        "Munster maintained their winning start to the United Rugby Championship (URC) as they emerged from an error-strewn game against Connacht at Thomond Park.",
        "Although both sides scored three tries, just one was converted with JJ Hanrahan's first-half kick proving the difference in what was an arm-wrestle of a game.",
        "The result leaves Munster joint-top of the table with the Stormers as the URC takes a break for the autumn internationals, with Connacht now in 12th with just one win from four, but did take a losing bonus point for their efforts.",
        "Both sides were without their Ireland internationals who have crossed the Atlantic to prepare for next week's test match against New Zealand and perhaps the changes contributed to an untidy game, yet it was Munster who made it back-to-back wins over Irish rivals following their victory over Leinster at Croke Park last week.",
        "Diarmuid Kilgallen races clear for his try in the first half",
        "The hosts asked the early questions but couldn't capitalise until Diarmuid Kilgallen, making his first appearance of the season, fielded a Connacht penalty that failed to find touch.",
        "His burst forward created an opening with the ball spread to the opposite wing where Alex Nankivell put captain Jack O'Donoghue in for the score after 14 minutes.",
        "Connacht would waste little time hitting back as they worked there way into the Munster 22 with Josh Ioane popping a deft reverse offload to Byron Ralston to scamper over.",
        "This was a confidence boost for the visitors as they were soon knocking on the door again as when hammering at the line, Ioane was again the creator for Ralston, flinging a perfect pass out to the winger who had a simple finish.",
        "Just as it seemed Ioane could do no wrong, his attempted pass  just inside Munster territory was read perfectly by Kilgallen who intercepted and raced clear for the score which, for the first and only time of the night, was converted as JJ Hanrahan added the extras to put Munster back into the lead.",
        "There was still time for another lead change before the half as Connacht took advantage of a late penalty, kicking to the corner and after winning the line-out, laid siege to the Munster line.",
        "Referee Andrea Piardi was unsure whether Paul Boyle had managed to ground the ball when driving over, but the TMO confirmed he had to the displeasure of the home support as Connacht took a 15-12 lead as early replacement Sean Naughton missed his third conversion of the half.",
        "It took a little time for the second half to settle following a lengthy stoppage which saw Ralston's night come to an end, but it remained untidy with errors on both sides.",
        "When Munster injected a bit of pace, they carried more of a threat but their persistence finally paid off in the 67th minute when O'Donoghue powered over for his second score of the night as the lead changed for the fourth and final time.",
        "The hosts sought the bonus point try in the closing stages but coughed up a penalty when metres from the Connacht line in the final minute, giving the visitors one last opportunity, but they were unable to do anything with it as Munster held on for their fifth win out of five.",
        "Munster: Daly; Kilgallen, Kelly, Nankivell, Abrahams; Hanrahan, Coughlan; Milne, Barron, Ryan; Kleyn, Wycherley; O'Donoghue (capt), Hodnett, Coombes.",
        "Replacements: Scannell, Loughman, Foxe, O'Connell, Quinn, O'Riordan, Butler, McCarthy",
        "Connacht: West; Ralston, Gavin, Forde, Treacy; Ioane, B Murphy; Duggan, Heffernan, Illo; Joyce, D Murray; J Murphy, Boyle (capt), Jansen.",
        "Replacements: Tierney-Martin, Dooley, Barrett, N Murray, O'Connor, Devine, Naughton, O'Brien",
        "Referee: Andrea Piardi (FIR)"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/rugby-union/articles/cd7rve5yr4ro",
      "main_category": "sport",
      "detailed_category": "rugby-union",
      "topic": "Leicester edge out Sale by point in 10-try thriller",
      "content": [
        "The PremLeicester (22) 36Tries: Radwan (2), Henderson, Ilione, Whiteley Cons: O'Connor (3), Searle Pens: O'Connor Sale (7) 35Tries: O'Flaherty, James (3), Roebuck Cons: Ford (5)",
        "Leicester Tigers edged past a resurgent Sale Sharks in a nail-biting 10-try thriller in the Prem at Mattioli Woods Welford Road.In a first half devoid of spark for long periods, Adam Radwan scored twice before Tom O'Flaherty finally got the visitors on the board with a diving, inch-perfect effort.The tries flowed freely from that point on, Cameron Henderson and Luke James' scores cancelled each other out either side of the break, before Emeka Ilione added another to bolster his increasingly growing reputation.Tom Roebuck and Tom Whiteley then exchanged tries before James secured his hat-trick, but seventh-placed Sale were never quite able to seize the game from their hosts, who moved up up to fifth spot.",
        "Following a series of drives in the Sale 22 it was the Tigers who struck first.With the visiting defence numbered up it looked like the opportunity had gone, but quick hands from Freddie Steward sent Radwan clear down the wing for the first try of the afternoon.The Sharks, still reeling from last week's humbling 65-14 defeat by Saracens struggled to match the Tigers' early intensity, but were almost gifted a score following a loose Leicester pass, only for the opportunity to be ultimately squandered thanks to a knock-on.Amid a flurry of penalties, handling errors and misplaced line-outs, it was the Tigers who grabbed the initiative.Following an attacking Leicester line-out, the ensuing rolling maul was halted by the Sharks, but the ball was recycled across to Steward who once again fed Radwan to pick the perfect angle to scythe through and increase the lead still further.The winger's second seemed to spark something in the visitors, however.Shortly after the restart, O'Flaherty forced his way over in the corner, despite the attentions of Whiteley, after a determined period of Sharks pressure.But with half-time looming, Leicester found the line againFollowing a break by Olly Cracknell, Whiteley spotted a gap in the Sale defence and kept his hands free to offload to Henderson for a surprisingly healthy 15-point lead at the break.",
        "The second half could not have been more different from the first as Sale started with a much greater sense of purpose.After a series of drives up to the Tigers' line, and with the defence narrowed, George Ford fed James to jog over untouched.Any feel-good factor from that score was quickly extinguished when Leicester added their bonus-point score.With the visitors' defence seemingly set, Hanro Liebenberg's slip pass found Ilione who stole through a gap to dive over next to the posts.The game had opened up and with both defences out on their heels, Sale drove up to the Leicester line again.In a near carbon copy of his first try, James found a gap after a pinpoint pass from Ford to secure his brace and keep the visitors in contention.The lively Whiteley was next on the scoresheet, the scrum-half taking advantage to snipe over from close range after Ollie Chessum had been repelled.With both teams seemingly scoring at will, it was only fitting that Sale scored their bonus-point try soon after as Rob du Preez exploited a gap in the Tigers defence before being dragged down. Replacement Raffi Quirke marshalled his forwards before eventually passing to Roebuck to add to the try bonanza.Breaking the tit-for-tat cycle, Sale scored a fifth. James claimed his hat-trick after the imperious Ford sent Marius Louw through a gap - the South African found the full-back as the Tigers ran out of defenders.But Sale were unable to find that decisive final score and Billy Searle had no difficulty in kicking the ball dead as time elapsed.",
        "Leicester: Steward; Radwan, Perese, Kata, Hassell-Collins; O'Connor, Whiteley; Smith, Blamire, Heyes, Henderson, Chessum (c), Liebenberg, Reffell, Cracknell.Replacements: Clare, Haffar, Hurd, Wells, Ilione, Allan, Searle, Bailey.Sale: James, Roebuck, du Preez, Ma'asi-White, O'Flaherty; Ford, Warr; Opoku-Fordjour, Cowan-Hickie, Harper, van Rhyn (c), Bamber, Vermuelen, Woodman, Dugdale.Replacements: Jibulu. Onasanya, Bell, Burrow, du Preez, Quirke, Louw, Reed.Referee: Karl Dickson.",
        "Adam Radwan capped a fine performance with two first-half tries",
        "Tries: Radwan (2), Henderson, Ilione, Whiteley Cons: O'Connor (3), Searle Pens: O'Connor",
        "Tries: O'Flaherty, James (3), Roebuck Cons: Ford (5)",
        "Leicester Tigers edged past a resurgent Sale Sharks in a nail-biting 10-try thriller in the Prem at Mattioli Woods Welford Road.",
        "In a first half devoid of spark for long periods, Adam Radwan scored twice before Tom O'Flaherty finally got the visitors on the board with a diving, inch-perfect effort.",
        "The tries flowed freely from that point on, Cameron Henderson and Luke James' scores cancelled each other out either side of the break, before Emeka Ilione added another to bolster his increasingly growing reputation.",
        "Tom Roebuck and Tom Whiteley then exchanged tries before James secured his hat-trick, but seventh-placed Sale were never quite able to seize the game from their hosts, who moved up up to fifth spot.",
        "Following a series of drives in the Sale 22 it was the Tigers who struck first.",
        "With the visiting defence numbered up it looked like the opportunity had gone, but quick hands from Freddie Steward sent Radwan clear down the wing for the first try of the afternoon.",
        "The Sharks, still reeling from last week's humbling 65-14 defeat by Saracens struggled to match the Tigers' early intensity, but were almost gifted a score following a loose Leicester pass, only for the opportunity to be ultimately squandered thanks to a knock-on.",
        "Amid a flurry of penalties, handling errors and misplaced line-outs, it was the Tigers who grabbed the initiative.",
        "Following an attacking Leicester line-out, the ensuing rolling maul was halted by the Sharks, but the ball was recycled across to Steward who once again fed Radwan to pick the perfect angle to scythe through and increase the lead still further.",
        "The winger's second seemed to spark something in the visitors, however.",
        "Shortly after the restart, O'Flaherty forced his way over in the corner, despite the attentions of Whiteley, after a determined period of Sharks pressure.",
        "But with half-time looming, Leicester found the line again",
        "Following a break by Olly Cracknell, Whiteley spotted a gap in the Sale defence and kept his hands free to offload to Henderson for a surprisingly healthy 15-point lead at the break.",
        "Tom O'Flaherty scored Sale's only try of the first half",
        "The second half could not have been more different from the first as Sale started with a much greater sense of purpose.",
        "After a series of drives up to the Tigers' line, and with the defence narrowed, George Ford fed James to jog over untouched.",
        "Any feel-good factor from that score was quickly extinguished when Leicester added their bonus-point score.",
        "With the visitors' defence seemingly set, Hanro Liebenberg's slip pass found Ilione who stole through a gap to dive over next to the posts.",
        "The game had opened up and with both defences out on their heels, Sale drove up to the Leicester line again.",
        "In a near carbon copy of his first try, James found a gap after a pinpoint pass from Ford to secure his brace and keep the visitors in contention.",
        "The lively Whiteley was next on the scoresheet, the scrum-half taking advantage to snipe over from close range after Ollie Chessum had been repelled.",
        "With both teams seemingly scoring at will, it was only fitting that Sale scored their bonus-point try soon after as Rob du Preez exploited a gap in the Tigers defence before being dragged down.",
        "Replacement Raffi Quirke marshalled his forwards before eventually passing to Roebuck to add to the try bonanza.",
        "Breaking the tit-for-tat cycle, Sale scored a fifth.",
        "James claimed his hat-trick after the imperious Ford sent Marius Louw through a gap - the South African found the full-back as the Tigers ran out of defenders.",
        "But Sale were unable to find that decisive final score and Billy Searle had no difficulty in kicking the ball dead as time elapsed.",
        "Leicester: Steward; Radwan, Perese, Kata, Hassell-Collins; O'Connor, Whiteley; Smith, Blamire, Heyes, Henderson, Chessum (c), Liebenberg, Reffell, Cracknell.",
        "Replacements: Clare, Haffar, Hurd, Wells, Ilione, Allan, Searle, Bailey.",
        "Sale: James, Roebuck, du Preez, Ma'asi-White, O'Flaherty; Ford, Warr; Opoku-Fordjour, Cowan-Hickie, Harper, van Rhyn (c), Bamber, Vermuelen, Woodman, Dugdale.",
        "Replacements: Jibulu. Onasanya, Bell, Burrow, du Preez, Quirke, Louw, Reed.",
        "Referee: Karl Dickson."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/rugby-union/articles/cy9pvdj9gzro",
      "main_category": "sport",
      "detailed_category": "rugby-union",
      "topic": "Six-try Bath prove too much for Bristol in derby",
      "content": [
        "The PremBath (19) 40Tries: Pepper, Repath, Du Toit, Cokanasiga, Underhill, Arundell Cons: Russell 5 Bristol (15) 15Tries: Ravouvou, Oghre Con: Worsley Pen: Worsley",
        "Bath overcame a resilient Bristol 40-15 in a fierce West Country derby at the Rec to move up to second in the Prem before the league's four-week break.Bristol had their neighbours on the back foot for much of the first half, opening a 10-point lead through Kalaveti Ravouvou and Gabriel Oghre tries and a Sam Worsley penalty.But Bath mounted a rapid comeback, scoring twice in four minutes as Ollie Lawrence and Cameron Redpath added to Guy Pepper's earlier try to take a four-point lead at the break.Bristol's defence impressively kept a relentless Bath at bay for long periods until Joe Cokanasiga added the fourth try to open daylight on the scoreboard, and a late flurry saw Sam Underhill and Henry Arundell add two more in the closing minutes.",
        "Finn Russell's clearance from kick-off was charged down to put Bristol immediately on the front foot and it set the tone, as the ball was recycled wide and Ravouvou scored with less than one minute on the clock.Bath's first attack was held up and their second then repelled from a metre out yet, on the third, they found a way through, as the Bears' clearance only went as far as Russell on halfway and Pepper side-stepped Ravouvou before swan diving over to level the score.As the conditions worsened, Bristol capitalised. Scrum-half Kieron Marmion deftly crept to the front of a line-out and a one-two with Oghre, who threw the ball straight to him, allowed the hooker to catch Bath totally off guard and charge over.Sam Worsley then kicked another three points from the tee to make it 15-5 as tensions flared into scuffles.Yet Bath were instantly galvanised and pulled one back when Russell chipped the ball for Lawrence to collect and touch down.With their tails up, they came straight back at Bristol and after 10 phases of pressure, slick passing from Beno Obano and Tom Dunn helped Redpath go over in the corner as Bath somehow headed in at the break 19-15 ahead.",
        "By the start of the second half the clouds had cleared and Bath were relentless, camping in Bristol's 22 and forcing constant defence from the visitors. They saw two tries chalked off as checks by the television match official (TMO) revealed knock-ons in both build-ups before Bath found their bonus-point fourth try on 65 minutes. With Santiago Grondona in the bin following a series of penalties and six Bath replacements all brought on at once, Cokanasiga caught Russell's chip to open an 11-point lead.Underhill powered over in the dying stages and as the clock ticked into an 86th minute and Bristol tried to score a fourth try of their own to take a point from the game, Arundell snatched an interception and sprinted in for Bath's sixth.",
        "Bath head of rugby Johann van Graan said:\"Loved the attitude to keep going, it felt like we had more in us.\"I don't know where that 20 minutes of weather came from, that wind was almost impossible, they got ahead but very satisfying to go in at the half 19-15. \"Then to nil them in the second half, it was a real 23-man effort. We were over the line twice - twice the TMO came in. \"I felt they were lucky not to receive multiple yellow cards, they were so negative at their own try line. Then again, six forwards coming on gave us a lot of energy. \"I thought the way we defended the 22 in that second half was amazing, they weren't really [ever] five yards out.\"",
        "Bristol director of rugby Pat Lam said: \"For 65 minutes it was 19-15, with three minutes to go it was 26-15, but at the end the boys wanted to keep going and fighting for it. \"There were some big swings in that game, our penalty count was 26 which is a big penalty count. \"I loved the fight. This four weeks has been hugely challenging but one thing that's really revealing is the character of the group. \"The boys put their bodies on the line - the tackle count I heard is something like 230 to 100. Fitz Harding - 28 tackles - he's a legend, he got a few jackals in there as well. \"You really do see when your back's against the wall with the injuries that we have real character and I'm enjoying that.\"",
        "Bath: Carreras; Cokanasiga, Lawrence, Redpath, Arundell; Russell, Spencer (c); Obano, Dunn, Du Toit; Roux, Molony, Bayliss, Pepper, Reid.Replacements: Tuipulotu, Van Wyk, Stuart, Richards, Underhill, Carr-Smith, Ojomoh, Barbeary.Sin bin: Van Wyk (81)Bristol: Elizalde; Bates, Moroni, Janse van Rensburg, Ravouvou; Worsley, Marmion; Genge, Oghre, Kloska; Rubiolo, Batley, S. Grondona, Harding (c), Mata.Replacements: Thacker, Woolmore, Chawatama, Owen, B. Grondona, Lennon, Carrington, Fricker.Sin bin: Santiago Grondona (59)Referee: Ian Tempest",
        "Bath bounced back from defeat against Leicester to beat their neighbours Bristol",
        "Tries: Pepper, Repath, Du Toit, Cokanasiga, Underhill, Arundell Cons: Russell 5",
        "Tries: Ravouvou, Oghre Con: Worsley Pen: Worsley",
        "Bath overcame a resilient Bristol 40-15 in a fierce West Country derby at the Rec to move up to second in the Prem before the league's four-week break.",
        "Bristol had their neighbours on the back foot for much of the first half, opening a 10-point lead through Kalaveti Ravouvou and Gabriel Oghre tries and a Sam Worsley penalty.",
        "But Bath mounted a rapid comeback, scoring twice in four minutes as Ollie Lawrence and Cameron Redpath added to Guy Pepper's earlier try to take a four-point lead at the break.",
        "Bristol's defence impressively kept a relentless Bath at bay for long periods until Joe Cokanasiga added the fourth try to open daylight on the scoreboard, and a late flurry saw Sam Underhill and Henry Arundell add two more in the closing minutes.",
        "Finn Russell's clearance from kick-off was charged down to put Bristol immediately on the front foot and it set the tone, as the ball was recycled wide and Ravouvou scored with less than one minute on the clock.",
        "Bath's first attack was held up and their second then repelled from a metre out yet, on the third, they found a way through, as the Bears' clearance only went as far as Russell on halfway and Pepper side-stepped Ravouvou before swan diving over to level the score.",
        "As the conditions worsened, Bristol capitalised.",
        "Scrum-half Kieron Marmion deftly crept to the front of a line-out and a one-two with Oghre, who threw the ball straight to him, allowed the hooker to catch Bath totally off guard and charge over.",
        "Sam Worsley then kicked another three points from the tee to make it 15-5 as tensions flared into scuffles.",
        "Yet Bath were instantly galvanised and pulled one back when Russell chipped the ball for Lawrence to collect and touch down.",
        "With their tails up, they came straight back at Bristol and after 10 phases of pressure, slick passing from Beno Obano and Tom Dunn helped Redpath go over in the corner as Bath somehow headed in at the break 19-15 ahead.",
        "An intercept from Henry Arundell in the closing seconds took Bath's try-tally to six",
        "By the start of the second half the clouds had cleared and Bath were relentless, camping in Bristol's 22 and forcing constant defence from the visitors.",
        "They saw two tries chalked off as checks by the television match official (TMO) revealed knock-ons in both build-ups before Bath found their bonus-point fourth try on 65 minutes.",
        "With Santiago Grondona in the bin following a series of penalties and six Bath replacements all brought on at once, Cokanasiga caught Russell's chip to open an 11-point lead.",
        "Underhill powered over in the dying stages and as the clock ticked into an 86th minute and Bristol tried to score a fourth try of their own to take a point from the game, Arundell snatched an interception and sprinted in for Bath's sixth.",
        "Bath head of rugby Johann van Graan said:",
        "\"Loved the attitude to keep going, it felt like we had more in us.",
        "\"I don't know where that 20 minutes of weather came from, that wind was almost impossible, they got ahead but very satisfying to go in at the half 19-15.",
        "\"Then to nil them in the second half, it was a real 23-man effort. We were over the line twice - twice the TMO came in.",
        "\"I felt they were lucky not to receive multiple yellow cards, they were so negative at their own try line. Then again, six forwards coming on gave us a lot of energy.",
        "\"I thought the way we defended the 22 in that second half was amazing, they weren't really [ever] five yards out.\"",
        "Bristol director of rugby Pat Lam said:",
        "\"For 65 minutes it was 19-15, with three minutes to go it was 26-15, but at the end the boys wanted to keep going and fighting for it.",
        "\"There were some big swings in that game, our penalty count was 26 which is a big penalty count.",
        "\"I loved the fight. This four weeks has been hugely challenging but one thing that's really revealing is the character of the group.",
        "\"The boys put their bodies on the line - the tackle count I heard is something like 230 to 100. Fitz Harding - 28 tackles - he's a legend, he got a few jackals in there as well.",
        "\"You really do see when your back's against the wall with the injuries that we have real character and I'm enjoying that.\"",
        "Bath: Carreras; Cokanasiga, Lawrence, Redpath, Arundell; Russell, Spencer (c); Obano, Dunn, Du Toit; Roux, Molony, Bayliss, Pepper, Reid.",
        "Replacements: Tuipulotu, Van Wyk, Stuart, Richards, Underhill, Carr-Smith, Ojomoh, Barbeary.",
        "Sin bin: Van Wyk (81)",
        "Bristol: Elizalde; Bates, Moroni, Janse van Rensburg, Ravouvou; Worsley, Marmion; Genge, Oghre, Kloska; Rubiolo, Batley, S. Grondona, Harding (c), Mata.",
        "Replacements: Thacker, Woolmore, Chawatama, Owen, B. Grondona, Lennon, Carrington, Fricker.",
        "Sin bin: Santiago Grondona (59)"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/rugby-union/articles/cy4p8k8rn7wo",
      "main_category": "sport",
      "detailed_category": "rugby-union",
      "topic": "Lloyd clinches win for Cardiff against Edinburgh",
      "content": [
        "United Rugby ChampionshipCardiff (12) 20Tries: Mulder, Adams, Sebastian Cons: Lloyd Pen: LloydEdinburgh (19) 19Tries: Wells, Shiel, Ashman Cons: Scott, Lang",
        "Cardiff's impressive home form continued in the United Rugby Championship (URC) as Ioan Lloyd kicked them to a dramatic one-point victory over Edinburgh.There were five tries in a breathless first half, with Lewis Wells, Charlie Shiel and Ewan Ashman crossing for the visitors, while Johan Mulder and Josh Adams kept Cardiff in the contest.Javan Sebastian scored against his former side to bring Cardiff closer after the break, while Lloyd sealed the win with a penalty from the halfway line.It capped a player of the match performance for the fly-half on his first Cardiff start.His side now head into the international break having won four from five matches, while Edinburgh have only one win to their name.",
        "Edinburgh were without Scotland wings Duhan van der Merwe and Darcy Graham, but still arrived in the Welsh capital littered with internationals, including the skipper Magnus Bradbury who was recalled to Scotland's squad this week.And it was the visitors who got off to the perfect start, crossing in the corner with some fans barely taking their seats at the Arms Park.Wes Goosen's break did the initial damage, with Cammy Scott given space to put in a perfectly weighted kick for Wells to go over.Cardiff were dealt a further blow when Taulupe Faletau was forced off, with the number eight no doubt an injury concern for Wales' autumn internationals.But they re-grouped when Taine Basham was quickest to pounce on a loose ball and tore down the wing before finding Mulder in support.Edinburgh hit back almost straight from the re-start, Shiel taking route one to the try line after a big carry from D'arcy Rae.Two further tries came inside a breathless opening quarter, Adams starting and finishing a superb 90m counter-attack before Ashman powered his way to the line to restore Edinburgh's lead, one they held until the break.",
        "Sebastian relished scoring against his former side after the break, the Scotland prop bulldozing his way through two defenders.But Lloyd's wayward boot ensured Edinburgh held on to a slender two point lead.Errors crept into both side's games as the rain came in, while Adams was denied a second try just after the hour mark.He looked certain to score after Ben Thomas' offload, but a late intervention from Luke Crosby forced a knock-on.Adams later hobbled off the field to add to Wales' injury concerns.Cardiff had another chance to take the lead eight minutes from time after some good work at the breakdown from Thomas forced a penalty.Lloyd, who had missed two easier attempts from the tee, stepped up and confidently struck a 49m penalty to put his side ahead for the first time in the match.It was a lead they held onto as they secured a fifth straight victory at the Arms Park for the first time in six years.",
        "Cardiff coach Corniel Van Zyl said: \"I'm so chuffed for the boys, they put in a great shift to end up on top, we knew it was going to be a tough battle.\"We spoke a lot about going into the dark places and just enjoying it, I know it was tough and you can see the boys were really tired.\"The first thing [to work on] after tonight is obviously lineouts, that's definitely something we need to sort out, we'll look at our game and see where we can improve, but ultimately you can't coach the fighting spirit.\"Edinburgh head coach Sean Everitt said: \"I was disappointed in the second half.\"We made a lot of kicking errors and folded under pressure in the kicking game and perhaps were not patient enough.\"It's been frustrating because we've had three away games and one home game and the three away games have been lost by four points – if you add them all up.\"But that doesn't matter, it's still losses, so we've got to get better away from home.\"",
        "Cardiff: Beetham; Adams, Millard, B Thomas, Bowen; Lloyd, Mulder; Southworth, Belcher (capt), Sebastian, McNally, Nott, Mann, Basham, Faletau.Replacements: Hughes, Domachowski, Assiratti, Donnell, Lawrence, D Thomas, Davies, Sheedy.Edinburgh: Goosen; McCann, O'Conor, Lang, Wells; Scott, Shiel; Schoeman, Ashman, Rae, Sykes, Gilchrist, McConnell, Richardson, Bradbury (capt).Replacements: Harrison, Venter, Hill, Hunter-Hill, Crosbie, McAlpine, Thompson, Davidson.Referee: Andrew Brace (IRFU)Assistant referees: Craig Evans (WRU), Carwyn Sion (WRU)TMO: Colin Stanley (IRFU)",
        "Ioan Lloyd joined his hometown club Cardiff from Scarlets in the summer",
        "United Rugby Championship",
        "Tries: Mulder, Adams, Sebastian Cons: Lloyd Pen: Lloyd",
        "Tries: Wells, Shiel, Ashman Cons: Scott, Lang",
        "Cardiff's impressive home form continued in the United Rugby Championship (URC) as Ioan Lloyd kicked them to a dramatic one-point victory over Edinburgh.",
        "There were five tries in a breathless first half, with Lewis Wells, Charlie Shiel and Ewan Ashman crossing for the visitors, while Johan Mulder and Josh Adams kept Cardiff in the contest.",
        "Javan Sebastian scored against his former side to bring Cardiff closer after the break, while Lloyd sealed the win with a penalty from the halfway line.",
        "It capped a player of the match performance for the fly-half on his first Cardiff start.",
        "His side now head into the international break having won four from five matches, while Edinburgh have only one win to their name.",
        "Edinburgh were without Scotland wings Duhan van der Merwe and Darcy Graham, but still arrived in the Welsh capital littered with internationals, including the skipper Magnus Bradbury who was recalled to Scotland's squad this week.",
        "And it was the visitors who got off to the perfect start, crossing in the corner with some fans barely taking their seats at the Arms Park.",
        "Wes Goosen's break did the initial damage, with Cammy Scott given space to put in a perfectly weighted kick for Wells to go over.",
        "Cardiff were dealt a further blow when Taulupe Faletau was forced off, with the number eight no doubt an injury concern for Wales' autumn internationals.",
        "But they re-grouped when Taine Basham was quickest to pounce on a loose ball and tore down the wing before finding Mulder in support.",
        "Edinburgh hit back almost straight from the re-start, Shiel taking route one to the try line after a big carry from D'arcy Rae.",
        "Two further tries came inside a breathless opening quarter, Adams starting and finishing a superb 90m counter-attack before Ashman powered his way to the line to restore Edinburgh's lead, one they held until the break.",
        "Dragons miss late chance at rare win against Ospreys",
        "Star-studded Sharks turn up heat against Scarlets",
        "Sebastian relished scoring against his former side after the break, the Scotland prop bulldozing his way through two defenders.",
        "But Lloyd's wayward boot ensured Edinburgh held on to a slender two point lead.",
        "Errors crept into both side's games as the rain came in, while Adams was denied a second try just after the hour mark.",
        "He looked certain to score after Ben Thomas' offload, but a late intervention from Luke Crosby forced a knock-on.",
        "Adams later hobbled off the field to add to Wales' injury concerns.",
        "Cardiff had another chance to take the lead eight minutes from time after some good work at the breakdown from Thomas forced a penalty.",
        "Lloyd, who had missed two easier attempts from the tee, stepped up and confidently struck a 49m penalty to put his side ahead for the first time in the match.",
        "It was a lead they held onto as they secured a fifth straight victory at the Arms Park for the first time in six years.",
        "Cardiff coach Corniel Van Zyl said: \"I'm so chuffed for the boys, they put in a great shift to end up on top, we knew it was going to be a tough battle.",
        "\"We spoke a lot about going into the dark places and just enjoying it, I know it was tough and you can see the boys were really tired.",
        "\"The first thing [to work on] after tonight is obviously lineouts, that's definitely something we need to sort out, we'll look at our game and see where we can improve, but ultimately you can't coach the fighting spirit.\"",
        "Edinburgh head coach Sean Everitt said: \"I was disappointed in the second half.",
        "\"We made a lot of kicking errors and folded under pressure in the kicking game and perhaps were not patient enough.",
        "\"It's been frustrating because we've had three away games and one home game and the three away games have been lost by four points – if you add them all up.",
        "\"But that doesn't matter, it's still losses, so we've got to get better away from home.\"",
        "Cardiff: Beetham; Adams, Millard, B Thomas, Bowen; Lloyd, Mulder; Southworth, Belcher (capt), Sebastian, McNally, Nott, Mann, Basham, Faletau.",
        "Replacements: Hughes, Domachowski, Assiratti, Donnell, Lawrence, D Thomas, Davies, Sheedy.",
        "Edinburgh: Goosen; McCann, O'Conor, Lang, Wells; Scott, Shiel; Schoeman, Ashman, Rae, Sykes, Gilchrist, McConnell, Richardson, Bradbury (capt).",
        "Replacements: Harrison, Venter, Hill, Hunter-Hill, Crosbie, McAlpine, Thompson, Davidson.",
        "Referee: Andrew Brace (IRFU)",
        "Assistant referees: Craig Evans (WRU), Carwyn Sion (WRU)",
        "TMO: Colin Stanley (IRFU)"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/rugby-union/articles/cm2e5j4g93mo",
      "main_category": "sport",
      "detailed_category": "rugby-union",
      "topic": "Exeter Chiefs up to third with Gloucester win",
      "content": [
        "The PremExeter (27) 39Tries: Dweba, Slade (2), Feyi-Waboso, Yeandle Cons: Slade (3), Hodge Pens: Slade (2) Gloucester (12) 12Tries: Joseph, Thomas Cons: Byrne",
        "Exeter Chiefs moved up to third in the Prem table with a confident 39-12 victory over the still winless Gloucester at Sandy Park.In a frantic first half, Joseph Dweba touched down for the home side before Will Joseph's stunning end-to-end effort brought Gloucester level.Henry Slade and Immanuel Feyi-Waboso's efforts put the Chiefs on top again before Freddie Thomas restored hope for the visitors.But it was Rob Baxter's men who proved the more composed in the second half, adding further tries through Slade and Jack Yeandle to claim a bonus point.With no points to take back up the M5, Gloucester remain in ninth place.",
        "The Chiefs were looking to build on their dominant victory against Harlequins last weekend and were clearly intent on replicating that form from the first whistle.Having won a penalty on Gloucester's scrum, Slade forced the visitors back into their own 22 with a touch kick.Having secured the line-out, it was Dweba who ultimately benefitted, emerging with the ball at the back of the maul for the first try of the day.But that lead was not to last for long.With seemingly nothing on, academy star Jack Cotgreave broke around the outside of the Exeter defence before side-stepping a surprisingly flat-footed Feyi-Waboso.On the verge of being tackled, he fed Williams, who then off-loaded to Joseph to outpace the final defender for an early try-of-the-season contender.With neither team seemingly too concerned about defending, the Chiefs were soon in for their second.Following a cross-field kick from Harvey Skinner, the ball was recycled, ultimately ending up in the hands of Slade who had only to dive over the line amid scrambling Gloucester defenders.Feyi-Waboso then got in on the act, the England winger capitalising from a well-worked Chiefs set play, sidestepping two defenders before fighting his way over for the home team's third.Gloucester, still missing 11 men due to their extensive injury list, responded in seemingly the only way they know how.Following an intricate series of offloads on the far wing, the ball made its way to Cotgreave who fought his way to the line, only to be bear tackled by Feyi-Waboso. With Chiefs defenders retreating, it then only took a pinpoint pass from Williams to send Thomas over.The Chiefs, sensing blood, thought they had their fourth on the verge of half-time, but Josh Iosefa-Scott's close-range effort was ruled out for an earlier forward pass.",
        "The second half, by comparison, was rather prosaic.Playing under a rainbow, Gloucester simply could not find their way over the line, coughing up possession in several promising situations.Exeter had their moments in the third quarter, with Stephen Varney one grubber kick away from potentially scoring, but defences were on top having been found so sorely lacking in the first half.The deadlock was eventually broken and it was only fitting that the moment belonged to Slade.The centre recovered a pinpoint cross-field kick from Josh Hodge, kicked ahead and fought off George Barton for the bonus-point score.Yeandle then added a deserved fifth try at the death, having been denied by the television match official (TMO) moments earlier.",
        "Exeter Chiefs attack coach Dave Walder spoke to BBC Radio Devon:\"It's the end of a really positive block – to get three wins in the first block of five (matches) is really important and after the high of last week against Harlequins it was important that we were mentally in the right place.\"I thought we started the game brilliantly, we switched off a little bit but ultimately did really well to come back and to keep them to 12 points is a testament to how we defended. \"We did our work early in attack and got a bonus point, which was nice. If we defend like we did today, we'll be very competitive through the season.\"Gloucester head coach George Skivington spoke to BBC Radio Gloucester:\"We've had different line ups every single week these first five games. People playing out of position. Even today, James Venter, Will Joseph having to come off - nothing's gone to plan frankly. \"This break has come at a good time – hopefully we get some bodies, a bit of recovery done.\"We played some really exciting rugby last year and we're digging in and trying to play that exciting brand of rugby, but there are too many guys who aren't in tune with the system.\"",
        "Exeter: Hodge; Feyi-Waboso, Slade, Ikitau, Woodburn; Skinner, Varney; Sio, Dweba, Iosefa-Scott, Jenkins (c), Tuima, Hooper, Roots, Fisilau.Replacements: Yeandle, Burger, Tchumbadze, Zambonin, James, Chapman, Haydon-Wood, Hammersley.Gloucester: C Atkinson; Redshaw, Joseph, Llewellyn, Cotgreave; Byrne, Williams (c); Knight, Blake, Laulala, Thomas, Alemanno, Basham, Venter, Bokenham.Replacements: Innard, Bleuler, Fasogbon, Jordan, Mann, Englefield, Barton, Knight.Referee: Adam Leal.",
        "Henry Slade contributed 22 of Exeter's 39 points during the win over Gloucester",
        "Tries: Dweba, Slade (2), Feyi-Waboso, Yeandle Cons: Slade (3), Hodge Pens: Slade (2)",
        "Tries: Joseph, Thomas Cons: Byrne",
        "Exeter Chiefs moved up to third in the Prem table with a confident 39-12 victory over the still winless Gloucester at Sandy Park.",
        "In a frantic first half, Joseph Dweba touched down for the home side before Will Joseph's stunning end-to-end effort brought Gloucester level.",
        "Henry Slade and Immanuel Feyi-Waboso's efforts put the Chiefs on top again before Freddie Thomas restored hope for the visitors.",
        "But it was Rob Baxter's men who proved the more composed in the second half, adding further tries through Slade and Jack Yeandle to claim a bonus point.",
        "With no points to take back up the M5, Gloucester remain in ninth place.",
        "The Chiefs were looking to build on their dominant victory against Harlequins last weekend and were clearly intent on replicating that form from the first whistle.",
        "Having won a penalty on Gloucester's scrum, Slade forced the visitors back into their own 22 with a touch kick.",
        "Having secured the line-out, it was Dweba who ultimately benefitted, emerging with the ball at the back of the maul for the first try of the day.",
        "But that lead was not to last for long.",
        "With seemingly nothing on, academy star Jack Cotgreave broke around the outside of the Exeter defence before side-stepping a surprisingly flat-footed Feyi-Waboso.",
        "On the verge of being tackled, he fed Williams, who then off-loaded to Joseph to outpace the final defender for an early try-of-the-season contender.",
        "With neither team seemingly too concerned about defending, the Chiefs were soon in for their second.",
        "Following a cross-field kick from Harvey Skinner, the ball was recycled, ultimately ending up in the hands of Slade who had only to dive over the line amid scrambling Gloucester defenders.",
        "Feyi-Waboso then got in on the act, the England winger capitalising from a well-worked Chiefs set play, sidestepping two defenders before fighting his way over for the home team's third.",
        "Gloucester, still missing 11 men due to their extensive injury list, responded in seemingly the only way they know how.",
        "Following an intricate series of offloads on the far wing, the ball made its way to Cotgreave who fought his way to the line, only to be bear tackled by Feyi-Waboso.",
        "With Chiefs defenders retreating, it then only took a pinpoint pass from Williams to send Thomas over.",
        "The Chiefs, sensing blood, thought they had their fourth on the verge of half-time, but Josh Iosefa-Scott's close-range effort was ruled out for an earlier forward pass.",
        "Will Joseph's acrobatic first-half effort proved in vain as Gloucester remain in search of their first victory of the season",
        "The second half, by comparison, was rather prosaic.",
        "Playing under a rainbow, Gloucester simply could not find their way over the line, coughing up possession in several promising situations.",
        "Exeter had their moments in the third quarter, with Stephen Varney one grubber kick away from potentially scoring, but defences were on top having been found so sorely lacking in the first half.",
        "The deadlock was eventually broken and it was only fitting that the moment belonged to Slade.",
        "The centre recovered a pinpoint cross-field kick from Josh Hodge, kicked ahead and fought off George Barton for the bonus-point score.",
        "Yeandle then added a deserved fifth try at the death, having been denied by the television match official (TMO) moments earlier.",
        "Exeter Chiefs attack coach Dave Walder spoke to BBC Radio Devon:",
        "\"It's the end of a really positive block – to get three wins in the first block of five (matches) is really important and after the high of last week against Harlequins it was important that we were mentally in the right place.",
        "\"I thought we started the game brilliantly, we switched off a little bit but ultimately did really well to come back and to keep them to 12 points is a testament to how we defended.",
        "\"We did our work early in attack and got a bonus point, which was nice. If we defend like we did today, we'll be very competitive through the season.\"",
        "Gloucester head coach George Skivington spoke to BBC Radio Gloucester:",
        "\"We've had different line ups every single week these first five games. People playing out of position. Even today, James Venter, Will Joseph having to come off - nothing's gone to plan frankly.",
        "\"This break has come at a good time – hopefully we get some bodies, a bit of recovery done.",
        "\"We played some really exciting rugby last year and we're digging in and trying to play that exciting brand of rugby, but there are too many guys who aren't in tune with the system.\"",
        "Exeter: Hodge; Feyi-Waboso, Slade, Ikitau, Woodburn; Skinner, Varney; Sio, Dweba, Iosefa-Scott, Jenkins (c), Tuima, Hooper, Roots, Fisilau.",
        "Replacements: Yeandle, Burger, Tchumbadze, Zambonin, James, Chapman, Haydon-Wood, Hammersley.",
        "Gloucester: C Atkinson; Redshaw, Joseph, Llewellyn, Cotgreave; Byrne, Williams (c); Knight, Blake, Laulala, Thomas, Alemanno, Basham, Venter, Bokenham.",
        "Replacements: Innard, Bleuler, Fasogbon, Jordan, Mann, Englefield, Barton, Knight."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/rugby-union/articles/cp3dqdenwn5o",
      "main_category": "sport",
      "detailed_category": "rugby-union",
      "topic": "Sale thrash Tigers, Exeter beat Trailfinders in PWR",
      "content": [
        "Sale Sharks, who managed just one win last season, enjoyed an excellent start to their Premiership Women's Rugby campaign as they cruised to a 46-17 triumph against Leicester Tigers.Earlier on Saturday, a dominant first-half display helped Exeter Chiefs to a 24-12 victory at Trailfinders.An expert performance before the break made the difference for Sale, too, as they entered half-time leading 34-5.Amy Cokayne, Erica Jarrell, Holly Thorpe, Rhona Lloyd and Katie Childs scored first-half tries for the hosts, while they also benefited from a penalty try and Lizzie Duffy successfully converted once. Tess Feury went over for Leicester, but Sale soon replied as Amy Relf added another try in the 43rd minute, with Duffy converting, before Trudy Cowan made it 46-5 in the 60th minute.In a lively end to the game, Fleury added another try, Leicester earned a penalty try and Childs was sent off for a second yellow card.",
        "Exeter started brightly in their victory over Trailfinders, with Liv McGoverne opening the scoring after 13 minutes before Hope Rogers seized a loose ball and went over six minutes later, with McGoverne successfully converting.In an excellent quick attacking move, Maisy Allen sent a pass to Gabriella Nigrelli out wide who delivered her side's third try, with McGoverne adding the extras to make it 19-0 at the break.McGoverne was involved once again as her side made it 24-0 in the 49th minute, setting up England's Claudia Moloney-MacDonald out wide with a looping pass.While Trailfinders looked like they were firmly out of contention, Kate Zackary gave the hosts hope when she spotted a gap and dived over in the 54th minute, with Meg Jones converting.Their positive second-half display only brought five more points, though, as Georgia Ponsonby grounded in a crowded area out wide to reduce the deficit.On Friday evening, the PWR season began as Harlequins beat Loughborough Lightning 52-48.",
        "A victory over Exeter Chiefs last season was Sale's only win as they went on to finish last with four points",
        "Sale Sharks, who managed just one win last season, enjoyed an excellent start to their Premiership Women's Rugby campaign as they cruised to a 46-17 triumph against Leicester Tigers.",
        "Earlier on Saturday, a dominant first-half display helped Exeter Chiefs to a 24-12 victory at Trailfinders.",
        "An expert performance before the break made the difference for Sale, too, as they entered half-time leading 34-5.",
        "Amy Cokayne, Erica Jarrell, Holly Thorpe, Rhona Lloyd and Katie Childs scored first-half tries for the hosts, while they also benefited from a penalty try and Lizzie Duffy successfully converted once.",
        "Tess Feury went over for Leicester, but Sale soon replied as Amy Relf added another try in the 43rd minute, with Duffy converting, before Trudy Cowan made it 46-5 in the 60th minute.",
        "In a lively end to the game, Fleury added another try, Leicester earned a penalty try and Childs was sent off for a second yellow card.",
        "Exeter started brightly in their victory over Trailfinders, with Liv McGoverne opening the scoring after 13 minutes before Hope Rogers seized a loose ball and went over six minutes later, with McGoverne successfully converting.",
        "In an excellent quick attacking move, Maisy Allen sent a pass to Gabriella Nigrelli out wide who delivered her side's third try, with McGoverne adding the extras to make it 19-0 at the break.",
        "McGoverne was involved once again as her side made it 24-0 in the 49th minute, setting up England's Claudia Moloney-MacDonald out wide with a looping pass.",
        "While Trailfinders looked like they were firmly out of contention, Kate Zackary gave the hosts hope when she spotted a gap and dived over in the 54th minute, with Meg Jones converting.",
        "Their positive second-half display only brought five more points, though, as Georgia Ponsonby grounded in a crowded area out wide to reduce the deficit.",
        "On Friday evening, the PWR season began as Harlequins beat Loughborough Lightning 52-48."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/rugby-union/articles/ce3kv417dpgo",
      "main_category": "sport",
      "detailed_category": "rugby-union",
      "topic": "Smith masterclass as Quins crush winless Newcastle",
      "content": [
        "The PremHarlequins (35) 52Tries: Northmore, T Green (2), Porter, Isgro, Evans, Cleaves, Turner  Cons: Smith (6)Newcastle (0) 14Tries: Leatherbarrow, McCallum Cons: Connon (2)",
        "Marcus Smith warmed up for the autumn internationals with a standout  performance in a dominant 52-14 Harlequins victory over bottom side Newcastle Red Bulls.With Steve Borthwick's England set to take on improving Australia at Twickenham next weekend, Smith delivered a timely reminder of his talents.The 26-year-old was superb with ball in hand with two try-assists as Quins ran in eight in all and his kicking was on point too, converting six of them from all angles.Defeat for Newcastle left them still winless and rooted to the bottom of the Prem table, extending their losing run on the road to nearly three years since their last away league win at Gloucester in November 2022.",
        "Smith's performance must surely place him in the conversation over the identity of England's playmaker as they prepare for forthcoming Tests against Australia, Fiji, New Zealand and Argentina over the next four weeks.His critics will point to inconsistency from week to week and he would be the first to admit he was not at his best against title contenders Exeter last weekend as Quins went down 38-0.Yet here the best of Smith was on show and time and again it was the Quins star who punched holes in Newcastle's defence. There were two brilliant assists either side of half-time, first setting up Will Porter after 23 minutes and then flying replacement wing Cassius Cleaves before the hour mark.Luke Northmore had set the ball rolling, going over from close range after 10 minutes before Tyrone Green added a second with the visitors' defence stretched to breaking point seven minutes later.Porter's execution after Smith's darting burst preceded a brilliantly taken fourth try from Rodrigo Isgro, the Pumas wing getting to Porter's grubber ahead of a dithering Simon Benitez Cruz to volley the ball forward and touch down, before Green's second gave Quins a 35-0 half-time lead.Will Evans finished off a driving maul early in the second period and Cleaves went in in the corner to decorate Smith's dummy and inside pass, before replacement hooker George Turner finished off a driving maul to complete Quins' scoring at 52-0.To their credit Newcastle rallied late on, finishing with a flourish with tries from Ollie Leatherbarrow and Murray McCallum, both converted by Brett Connon.Coach Alan Dickens will hope that late momentum can be taken into next weekend's visit of Leicester Tigers to Kingston Park as they resume their search for a first win - and a first point - of the Prem campaign.",
        "Harlequins: T Green; Isgro, Northmore, J Evans, Murley; Smith, Porter; Baxter, Walker, Williams, Petti Pagadizabal, Lewies, Kenningham, Evans, CarrReplacements: Turner, Wenger, Delgado, Launchbury, J Green, M Green, Benson, CleavesNewcastle: Coetzee; Obatoyinbo, Spencer, Clark, Hearle; Connon, Cruz; Brocklebank, McGuigan, Palframan, Hodgson, Clarke, Lee-Warner, Gordon, MafiReplacements: Fletcher, McCallum, De Bruin, Usher, Lockwood, Elliott, Leatherbarrow, GreenwoodReferee: Craig Maxwell-Keys",
        "Marcus Smith provided two assists as Harlequins beat Newcastle Red Bulls",
        "Tries: Northmore, T Green (2), Porter, Isgro, Evans, Cleaves, Turner  Cons: Smith (6)",
        "Tries: Leatherbarrow, McCallum Cons: Connon (2)",
        "Marcus Smith warmed up for the autumn internationals with a standout  performance in a dominant 52-14 Harlequins victory over bottom side Newcastle Red Bulls.",
        "With Steve Borthwick's England set to take on improving Australia at Twickenham next weekend, Smith delivered a timely reminder of his talents.",
        "The 26-year-old was superb with ball in hand with two try-assists as Quins ran in eight in all and his kicking was on point too, converting six of them from all angles.",
        "Defeat for Newcastle left them still winless and rooted to the bottom of the Prem table, extending their losing run on the road to nearly three years since their last away league win at Gloucester in November 2022.",
        "Smith's performance must surely place him in the conversation over the identity of England's playmaker as they prepare for forthcoming Tests against Australia, Fiji, New Zealand and Argentina over the next four weeks.",
        "His critics will point to inconsistency from week to week and he would be the first to admit he was not at his best against title contenders Exeter last weekend as Quins went down 38-0.",
        "Yet here the best of Smith was on show and time and again it was the Quins star who punched holes in Newcastle's defence.",
        "There were two brilliant assists either side of half-time, first setting up Will Porter after 23 minutes and then flying replacement wing Cassius Cleaves before the hour mark.",
        "Luke Northmore had set the ball rolling, going over from close range after 10 minutes before Tyrone Green added a second with the visitors' defence stretched to breaking point seven minutes later.",
        "Porter's execution after Smith's darting burst preceded a brilliantly taken fourth try from Rodrigo Isgro, the Pumas wing getting to Porter's grubber ahead of a dithering Simon Benitez Cruz to volley the ball forward and touch down, before Green's second gave Quins a 35-0 half-time lead.",
        "Will Evans finished off a driving maul early in the second period and Cleaves went in in the corner to decorate Smith's dummy and inside pass, before replacement hooker George Turner finished off a driving maul to complete Quins' scoring at 52-0.",
        "To their credit Newcastle rallied late on, finishing with a flourish with tries from Ollie Leatherbarrow and Murray McCallum, both converted by Brett Connon.",
        "Coach Alan Dickens will hope that late momentum can be taken into next weekend's visit of Leicester Tigers to Kingston Park as they resume their search for a first win - and a first point - of the Prem campaign.",
        "Harlequins: T Green; Isgro, Northmore, J Evans, Murley; Smith, Porter; Baxter, Walker, Williams, Petti Pagadizabal, Lewies, Kenningham, Evans, Carr",
        "Replacements: Turner, Wenger, Delgado, Launchbury, J Green, M Green, Benson, Cleaves",
        "Newcastle: Coetzee; Obatoyinbo, Spencer, Clark, Hearle; Connon, Cruz; Brocklebank, McGuigan, Palframan, Hodgson, Clarke, Lee-Warner, Gordon, Mafi",
        "Replacements: Fletcher, McCallum, De Bruin, Usher, Lockwood, Elliott, Leatherbarrow, Greenwood",
        "Referee: Craig Maxwell-Keys"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/rugby-union/articles/c874je7pg91o",
      "main_category": "sport",
      "detailed_category": "rugby-union",
      "topic": "Ulster lose to Lions despite Baloucoune hat-trick",
      "content": [
        "United Rugby ChampionshipLions (17) 49Tries: Kotze, Keyter, Venter, Du Plessis, Van Wyk, Van Vuuren, Brandon Cons: Smith 4 Pens: Smith 2Ulster (19) 31Tries: Baloucoune 3, Hume, McCann Cons: Doak 2, Flannery",
        "Rob Baloucoune's superb hat-trick was not enough to stop Ulster falling to a first defeat of the season as the Lions hit seven tries to win a high-scoring United Rugby Championship encounter at Ellis Park.Winger Baloucoune's first two tries and a fine James Hume score helped Ulster lead 19-17 at the break as they chased a fourth consecutive win. And while Baloucoune scored his third to secure a try bonus point for the Irish province, the Lions went over five times in an impressive second-half display to take the maximum five points. Ulster end their South African tour with six points from two matches after last week's bonus-point success over the Sharks in Durban, but they go into the autumn break with their early-season momentum dashed after running out of steam in the Johannesburg heat and altitude.It is a second win of the season for the Lions, who were helped over the line by assured kicking from Chris Smith, the fly-half contributing 14 points.",
        "Ulster went into Saturday's game without Jacob Stockdale, Stuart McCloskey, Iain Henderson and Nick Timoney, who are on Ireland duty, and they were forced into a last-minute reshuffle when Juarno Augustus failed a late fitness test. The South African's withdrawal pushed debutant Bryn Ward into a makeshift back row alongside Tom Stewart, who made a surprising switch from hooker to open-side flanker.In Durban, Ulster built the platform for an impressive win with early tries from Michael Lowry and Werner Kok, but they found themselves trading blows with the Lions during a chaotic opening to the game as SJ Kotze and Eduan Keyter went over for the hosts either side of Baloucoune's opening score.Ulster have looked more expressive in attack this season under Mark Sexton's guidance, and after Keyter's second was ruled out for a forward pass, the visitors showed imagination and cutting edge to draw level again through Hume. The centre raced on to Jack Murphy's deft chip to touch down under the posts, the score surviving a television match official (TMO) review to check the grounding.",
        "The Lions were reduced to 14 men when Asenathi Ntlabakanye was yellow-carded for a high tackle on Jude Postlethwaite, but the hosts edged ahead through Chris Smith's 33rd-minute penalty.Determined to finish the half on a high, Ulster took the lead for the first time when Baloucoune collected Murphy's pass and finished superbly in the corner after a sustained spell of pressure in the closing moments of the first half. Baloucoune, who has been ravaged by injuries over the past two seasons, was not done there. After Ruan Venter re-established the Lions' lead, the Ireland international sprinted over for his third after Hume's clever chip and chase drove Ulster up the field. Renzo du Plessis and Ulster back row Dave McCann traded tries, but the away side's hopes of completing a South African clean sweep were dashed as Henco van Wyk, Conrad van Vuuren and Morne Brandon scored late to seal a home win. While five tries was a commendable return for Ulster, they must wait over a month before attempting to regain their momentum against Benetton at home on 28 November following the autumn break.",
        "Speaking after the game, Ulster head coach Richie Murphy lamented his side's error count.\"It's a difficult one to take in the end, we're in that game for 55, 60 minutes and let it get away from us in the end,\" he said.\"Over the course of the game, our error count was probably too high and we just invited the Lions into the game. \"Scrum dominance from them put us under a lot of pressure, but it's a massive effort from the players in a very tough situation, 28 or 29 degrees at altitude, it's not an easy place to be.\"On Baloucoune's hat-trick, Murphy added: \"Incredible. We have an embarrassment of riches in the back three. Zac [Ward] has been on fire, Werner [Kok] has been really good and Mikey [Lowry]'s flying. \"Having Rob back is fantastic. He got through another full game, which is exciting for us, and long may that fitness level continue.\"",
        "Lions: Q Horn; Keyter, Van Wyk, Mills, Davids; Smith, Steyn; Kotze, Marais, Ntlabakanye, Oosthuizen, Nothnagel, Cairns, Venter, F. Horn (capt).Replacements: Brandon, Schoeman, van Vuuren, Landsberg, du Plessis, L Horn, Lombard, Mpeku.Sin-bin: Ntlabakanye (27)Ulster: Lowry; Baloucoune, Hume, Postlethwaite, Z Ward; Murphy, Doak; Crean, Herring (capt), O'Toole, Sheridan, Hopes, McCann, Stewart, B Ward.Replacements: McCormick, Reid, Wilson, Dalton, Rea, McKee, Flannery, Kok.Referee: Ben Connor (WRU)",
        "Rob Baloucoune's inspired display was not enough to secure a fourth straight win for Ulster",
        "United Rugby Championship",
        "Tries: Kotze, Keyter, Venter, Du Plessis, Van Wyk, Van Vuuren, Brandon Cons: Smith 4 Pens: Smith 2",
        "Tries: Baloucoune 3, Hume, McCann Cons: Doak 2, Flannery",
        "Rob Baloucoune's superb hat-trick was not enough to stop Ulster falling to a first defeat of the season as the Lions hit seven tries to win a high-scoring United Rugby Championship encounter at Ellis Park.",
        "Winger Baloucoune's first two tries and a fine James Hume score helped Ulster lead 19-17 at the break as they chased a fourth consecutive win.",
        "And while Baloucoune scored his third to secure a try bonus point for the Irish province, the Lions went over five times in an impressive second-half display to take the maximum five points.",
        "Ulster end their South African tour with six points from two matches after last week's bonus-point success over the Sharks in Durban, but they go into the autumn break with their early-season momentum dashed after running out of steam in the Johannesburg heat and altitude.",
        "It is a second win of the season for the Lions, who were helped over the line by assured kicking from Chris Smith, the fly-half contributing 14 points.",
        "Lions loss 'difficult one to take' for Murphy",
        "Gritty Glasgow dig deep to down Bulls in URC",
        "Ulster went into Saturday's game without Jacob Stockdale, Stuart McCloskey, Iain Henderson and Nick Timoney, who are on Ireland duty, and they were forced into a last-minute reshuffle when Juarno Augustus failed a late fitness test.",
        "The South African's withdrawal pushed debutant Bryn Ward into a makeshift back row alongside Tom Stewart, who made a surprising switch from hooker to open-side flanker.",
        "In Durban, Ulster built the platform for an impressive win with early tries from Michael Lowry and Werner Kok, but they found themselves trading blows with the Lions during a chaotic opening to the game as SJ Kotze and Eduan Keyter went over for the hosts either side of Baloucoune's opening score.",
        "Ulster have looked more expressive in attack this season under Mark Sexton's guidance, and after Keyter's second was ruled out for a forward pass, the visitors showed imagination and cutting edge to draw level again through Hume.",
        "The centre raced on to Jack Murphy's deft chip to touch down under the posts, the score surviving a television match official (TMO) review to check the grounding.",
        "Bryn Ward was called into the line-up to make his debut from the start after Juarno Augustus failed a late fitness test",
        "The Lions were reduced to 14 men when Asenathi Ntlabakanye was yellow-carded for a high tackle on Jude Postlethwaite, but the hosts edged ahead through Chris Smith's 33rd-minute penalty.",
        "Determined to finish the half on a high, Ulster took the lead for the first time when Baloucoune collected Murphy's pass and finished superbly in the corner after a sustained spell of pressure in the closing moments of the first half.",
        "Baloucoune, who has been ravaged by injuries over the past two seasons, was not done there. After Ruan Venter re-established the Lions' lead, the Ireland international sprinted over for his third after Hume's clever chip and chase drove Ulster up the field.",
        "Renzo du Plessis and Ulster back row Dave McCann traded tries, but the away side's hopes of completing a South African clean sweep were dashed as Henco van Wyk, Conrad van Vuuren and Morne Brandon scored late to seal a home win.",
        "While five tries was a commendable return for Ulster, they must wait over a month before attempting to regain their momentum against Benetton at home on 28 November following the autumn break.",
        "Speaking after the game, Ulster head coach Richie Murphy lamented his side's error count.",
        "\"It's a difficult one to take in the end, we're in that game for 55, 60 minutes and let it get away from us in the end,\" he said.",
        "\"Over the course of the game, our error count was probably too high and we just invited the Lions into the game.",
        "\"Scrum dominance from them put us under a lot of pressure, but it's a massive effort from the players in a very tough situation, 28 or 29 degrees at altitude, it's not an easy place to be.\"",
        "On Baloucoune's hat-trick, Murphy added: \"Incredible. We have an embarrassment of riches in the back three. Zac [Ward] has been on fire, Werner [Kok] has been really good and Mikey [Lowry]'s flying.",
        "\"Having Rob back is fantastic. He got through another full game, which is exciting for us, and long may that fitness level continue.\"",
        "Lions: Q Horn; Keyter, Van Wyk, Mills, Davids; Smith, Steyn; Kotze, Marais, Ntlabakanye, Oosthuizen, Nothnagel, Cairns, Venter, F. Horn (capt).",
        "Replacements: Brandon, Schoeman, van Vuuren, Landsberg, du Plessis, L Horn, Lombard, Mpeku.",
        "Sin-bin: Ntlabakanye (27)",
        "Ulster: Lowry; Baloucoune, Hume, Postlethwaite, Z Ward; Murphy, Doak; Crean, Herring (capt), O'Toole, Sheridan, Hopes, McCann, Stewart, B Ward.",
        "Replacements: McCormick, Reid, Wilson, Dalton, Rea, McKee, Flannery, Kok.",
        "Referee: Ben Connor (WRU)"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/rugby-union/articles/czdry13l5qvo",
      "main_category": "sport",
      "detailed_category": "rugby-union",
      "topic": "Welsh rugby aims to halt player-drain to England",
      "content": [
        "Welsh rugby bosses aim to halt the flow of playing talent heading to England with a radical shake up of the women's game in Wales.While a cut in the number of professional men's teams dominated Friday's announcement by the Welsh Rugby Union (WRU), major changes were also unveiled for women's domestic rugby.As well as extra funding for the regional level teams - Brython Thunder and Gwalia Lightning - there will be a new four-club league, a national academy and player development centres.WRU chair of the women's committee Amanda Bennett said: \"This is an historic moment. Never before has the WRU made such a commitment to the success of the women's game in Wales.\"",
        "Bennett admitted the club level was not meeting the needs of the growing number of girls and women taking up rugby, leading many to play in England.But the national team is also suffering.Wales have finished bottom of the past two Six Nations having won just two of their last 13 games in the tournament, despite the arrival of new head coach Sean Lynn.And they hit a low point this summer when they crashed out of the World Cup pool stage having lost all three matches for the first time.As a team they have the fourth-highest investment in women's international rugby with almost 40 full-time professional players, most playing for clubs in England.\"Many of our best players head east to England,\" said Bennett.\"There's an argument that it is a benefit for them to be training next to world champions as England's players are now, but that creates issues over access for the Wales national coaches while too many of those players are not playing.\"We have seen in WXV tournaments and the last World Cup that many of our players were not physically or psychology prepared.\"",
        "Regional sides Thunder and Lightning, who compete in the Celtic Challenge against teams from Ireland and Scotland, will also be further developed, including dual contracts and additional coaching staff, with the aim of attracting Welsh talent to return from outside Wales.The WRU has also announced a pilot scheme to run four teams at club level, based around the country alongside current established men's clubs that have the \"facilities, commitment and support\" to work in partnership.These will initially receive funding of £96,000 each per year, rising to up to £250,000 and will compete against each other in a league format over three months.It is hoped this will provide playing, training and conditioning opportunities for younger players aged 18 to 24 alongside adult players and could be expanded to eight clubs if the playing base expands.A national academy is also to be established along with three player development centres and nine satellite locations across Wales.Bennett added: \"This is a transformative moment for women's rugby in Wales. The WRU's commitment to funding and infrastructure will help us attract and retain top talent and build a competitive domestic structure. \"We all saw the amazing success of the Women's World Cup tournament this year. This is an area for growth in the sport both globally and in Wales.\"",
        "Gwalia Lightning compete in the tri-nation Celtic Challenge",
        "Welsh rugby bosses aim to halt the flow of playing talent heading to England with a radical shake up of the women's game in Wales.",
        "While a cut in the number of professional men's teams dominated Friday's announcement by the Welsh Rugby Union (WRU), major changes were also unveiled for women's domestic rugby.",
        "As well as extra funding for the regional level teams - Brython Thunder and Gwalia Lightning - there will be a new four-club league, a national academy and player development centres.",
        "WRU chair of the women's committee Amanda Bennett said: \"This is an historic moment. Never before has the WRU made such a commitment to the success of the women's game in Wales.\"",
        "The inquest begins into Wales' woeful World Cup",
        "Women pro teams in Wales 'symbolise positivity'",
        "Welsh regions 'relieved and encouraged' despite WRU cut plan",
        "Bennett admitted the club level was not meeting the needs of the growing number of girls and women taking up rugby, leading many to play in England.",
        "But the national team is also suffering.",
        "Wales have finished bottom of the past two Six Nations having won just two of their last 13 games in the tournament, despite the arrival of new head coach Sean Lynn.",
        "And they hit a low point this summer when they crashed out of the World Cup pool stage having lost all three matches for the first time.",
        "As a team they have the fourth-highest investment in women's international rugby with almost 40 full-time professional players, most playing for clubs in England.",
        "\"Many of our best players head east to England,\" said Bennett.",
        "\"There's an argument that it is a benefit for them to be training next to world champions as England's players are now, but that creates issues over access for the Wales national coaches while too many of those players are not playing.",
        "\"We have seen in WXV tournaments and the last World Cup that many of our players were not physically or psychology prepared.\"",
        "Wales captain Bethan Lewis is among many Welsh players based at Gloucester-Hartpury",
        "Regional sides Thunder and Lightning, who compete in the Celtic Challenge against teams from Ireland and Scotland, will also be further developed, including dual contracts and additional coaching staff, with the aim of attracting Welsh talent to return from outside Wales.",
        "The WRU has also announced a pilot scheme to run four teams at club level, based around the country alongside current established men's clubs that have the \"facilities, commitment and support\" to work in partnership.",
        "These will initially receive funding of £96,000 each per year, rising to up to £250,000 and will compete against each other in a league format over three months.",
        "It is hoped this will provide playing, training and conditioning opportunities for younger players aged 18 to 24 alongside adult players and could be expanded to eight clubs if the playing base expands.",
        "A national academy is also to be established along with three player development centres and nine satellite locations across Wales.",
        "Bennett added: \"This is a transformative moment for women's rugby in Wales. The WRU's commitment to funding and infrastructure will help us attract and retain top talent and build a competitive domestic structure.",
        "\"We all saw the amazing success of the Women's World Cup tournament this year. This is an area for growth in the sport both globally and in Wales.\""
      ]
    },
    {
      "url": "https://www.bbc.com/sport/rugby-union/articles/c3vn99pqdd2o",
      "main_category": "sport",
      "detailed_category": "rugby-union",
      "topic": "Dragons miss late chance at rare win against Ospreys",
      "content": [
        "United Rugby ChampionshipDragons (7) 19Tries: Williams, Coughlan, Burrows Cons: De Beer 2Ospreys (12) 19Tries: Deaves, Cokasinga, Hopkins Cons: Edwards 2",
        "Tinus de Beer missed a late kick to halt Dragons' winless league run from extending to 22 games as they were held by Ospreys.De Beer pushed a 79th minute penalty wide at the end of a pulsating derby given added spice by the political controversy in Welsh rugby.Harri Deaves, Phil Cokanasiga and Iestyn Hopkins had put Ospreys in control despite Rhodri Williams crossing for the hosts.Dragons staged a rousing comeback to level through Brodie Coughlan and Oli Burrows but could not claim a first league win since beating Ospreys in September 2024.But there was positive news for Wales head coach Steve Tandy as Jac Morgan made his first appearance of the season ahead of the autumn Tests.",
        "Players and coaches try to separate rugby and politics but it was impossible to do so barely 24 hours after the Welsh Rugby Union confirmed cutting the number of regions from four to three by 2027.The announcement appeared to give Dragons a stay of execution but left Ospreys with their head on the chopping block with only one region set to continue in west Wales.Supporters from both teams marched together through Newport in protest against the WRU before rivalries resumed on the pitch in the first derby since Steve Tandy named his first Wales squad.",
        "But it was several players overlooked by Tandy who shone brightest early on. Tom Botha edged Wyn Jones in the scrums, Ross Moriarty carried hard while Deaves scampered over from 30 metres out for the opening try.Cokasinga followed six minutes later after combining with Max Nagy, a late for replacement for centre Kieran Williams.Dragons, trailing 12-0, had to score next and did so when scrum-half Williams snuck over just moments after Thomas Young was denied a debut try for an earlier obstruction.Williams backed up the score just a minute into the second half with a crucial turnover on his own try-line to deny Huw Sutton.But Ospreys were on the front foot and when Nagy out-jumped Angus O'Brien for a high ball, the back-line combined to send Hopkins over in the corner.Wales captain Morgan came on as a replacement on 52 minutes, packing down first at blindside flanker and then number eight following other injuries.It did not take long for the British & Irish Lion to show his class with a crucial turnover as Dragons staged a thunderous comeback.The visitors may have used their hands but Dragons used brute force to strike back twice with 11 men shoving over new Wales squad member Coughlan and then Burrows.De Beer was off-target with conversion before another burst from man of the match Aaron Wainwright set up a last-minute chance that went agonisingly wide.",
        "Dragons: O'Brien (co-capt), Inisi, Westwood, Owen, Anderson, de Beer, Williams; Jones, Coghlan, Coleman, Screech, Carter (co-capt), Woodman, Young, WainwrightReplacements: Burrows, Martinez, Lewis, Lewis-Hughes, Beddall, Armstrong, Evans, RichardsOspreys: Walsh; Kasende, Cokanasiga, Nagy, Hopkins; Edwards, Morgan-Williams; Thomas, Lake (capt), Botha, R Davies, Fender, Sutton, Deaves, MoriartyReplacements: Lloyd, Phillips, Warren, Morse, Morgan, L Davies, Boshoff, Morgan",
        "Referee: Ben Breakspear (WRU)Assistants: Adam Jones (WRU), Amber Stamp-Dunstan (WRU)TMO: Aled Griffiths (WRU)",
        "Dragons have not won a league match since beating Ospreys in September 2024",
        "United Rugby Championship",
        "Tries: Williams, Coughlan, Burrows Cons: De Beer 2",
        "Tries: Deaves, Cokasinga, Hopkins Cons: Edwards 2",
        "Tinus de Beer missed a late kick to halt Dragons' winless league run from extending to 22 games as they were held by Ospreys.",
        "De Beer pushed a 79th minute penalty wide at the end of a pulsating derby given added spice by the political controversy in Welsh rugby.",
        "Harri Deaves, Phil Cokanasiga and Iestyn Hopkins had put Ospreys in control despite Rhodri Williams crossing for the hosts.",
        "Dragons staged a rousing comeback to level through Brodie Coughlan and Oli Burrows but could not claim a first league win since beating Ospreys in September 2024.",
        "But there was positive news for Wales head coach Steve Tandy as Jac Morgan made his first appearance of the season ahead of the autumn Tests.",
        "Players and coaches try to separate rugby and politics but it was impossible to do so barely 24 hours after the Welsh Rugby Union confirmed cutting the number of regions from four to three by 2027.",
        "The announcement appeared to give Dragons a stay of execution but left Ospreys with their head on the chopping block with only one region set to continue in west Wales.",
        "Supporters from both teams marched together through Newport in protest against the WRU before rivalries resumed on the pitch in the first derby since Steve Tandy named his first Wales squad.",
        "Supporters from both sides marched through Newport before the game against proposed cuts to the number of regions",
        "But it was several players overlooked by Tandy who shone brightest early on. Tom Botha edged Wyn Jones in the scrums, Ross Moriarty carried hard while Deaves scampered over from 30 metres out for the opening try.",
        "Cokasinga followed six minutes later after combining with Max Nagy, a late for replacement for centre Kieran Williams.",
        "Dragons, trailing 12-0, had to score next and did so when scrum-half Williams snuck over just moments after Thomas Young was denied a debut try for an earlier obstruction.",
        "Williams backed up the score just a minute into the second half with a crucial turnover on his own try-line to deny Huw Sutton.",
        "But Ospreys were on the front foot and when Nagy out-jumped Angus O'Brien for a high ball, the back-line combined to send Hopkins over in the corner.",
        "Wales captain Morgan came on as a replacement on 52 minutes, packing down first at blindside flanker and then number eight following other injuries.",
        "It did not take long for the British & Irish Lion to show his class with a crucial turnover as Dragons staged a thunderous comeback.",
        "The visitors may have used their hands but Dragons used brute force to strike back twice with 11 men shoving over new Wales squad member Coughlan and then Burrows.",
        "De Beer was off-target with conversion before another burst from man of the match Aaron Wainwright set up a last-minute chance that went agonisingly wide.",
        "Dragons: O'Brien (co-capt), Inisi, Westwood, Owen, Anderson, de Beer, Williams; Jones, Coghlan, Coleman, Screech, Carter (co-capt), Woodman, Young, Wainwright",
        "Replacements: Burrows, Martinez, Lewis, Lewis-Hughes, Beddall, Armstrong, Evans, Richards",
        "Ospreys: Walsh; Kasende, Cokanasiga, Nagy, Hopkins; Edwards, Morgan-Williams; Thomas, Lake (capt), Botha, R Davies, Fender, Sutton, Deaves, Moriarty",
        "Replacements: Lloyd, Phillips, Warren, Morse, Morgan, L Davies, Boshoff, Morgan",
        "Referee: Ben Breakspear (WRU)",
        "Assistants: Adam Jones (WRU), Amber Stamp-Dunstan (WRU)",
        "TMO: Aled Griffiths (WRU)"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/rugby-union/articles/c5y0x2gq6vyo",
      "main_category": "sport",
      "detailed_category": "rugby-union",
      "topic": "Youthful Leinster score eight tries in Zebre win",
      "content": [
        "United Rugby ChampionshipLeinster (26) 50Tries: Kenny 2, Soroka 2, Cahir, Byrne, Snyman, Connors Cons: Byrne 5 Zebre (21) 26Tries: Belloni, Dominguez, Quattrini, Zanon Cons: Da Re 3",
        "A youthful Leinster team ran in eight tries to overwhelm Zebre as the Irish province bounced back from last week's derby defeat by Munster with a bonus-point victory at Aviva Stadium. With their sizeable Ireland cohort in Chicago to prepare for next week's All Blacks Test, Leinster's second string - which included six debutants - delivered a much-needed win for head coach Leo Cullen with a vibrant display.Joshua Kenny and Alex Soroka scored two tries apiece before the break, with debutant Jerry Cahir, Harry Byrne, RG Snyman and Will Connors piling the misery on Zebre in the second half. While the Italian side remain without a win over Leinster, they did not leave Dublin empty-handed as Marco Zanon's late score clinched a try bonus point.Both sides received 20-minute red cards with Leinster wing Andrew Osborne dismissed, before Zebre scrum-half Thomas Dominguez's yellow was upgraded during the half-time interval.",
        "The loss to Munster at Croke Park was the third in four games for Leinster, but the United Rugby Championship holders were immediately on the front foot against the Italians as Kenny scored his first try for the club in the second minute.Soroka, a late replacement for the injured Max Deegan in the line-up, then scored either side of Mirko Belloni's try to give Leinster clear daylight. Belloni's score was created by Dominguez's superb cross-field kick into the corner and the scrum-half teed himself up for a try when he took a tap penalty and nipped through the home side's defence. Kenny delivered the hosts' bonus-point score in the 27th minute before Leinster lost Osborne, whose yellow card for a collision in the air with Lorenzo Pani was later upgraded to a 20-minute red card.Giovanni Quattrini scored Zebre's third try, but their momentum was punctured when Dominguez failed to wrap his tackle on Leinster back row James Culhane, resulting in another 20-minute red card.Leinster started the second half with renewed intent and, after Luke McGrath's try was ruled out for a knock-on, loose-head prop Cahir powered his way over from close range in the 48th minute.Having kicked four conversions, Byrne marked his return to the line-up with his first Leinster try since March 2023, before replacement lock Snyman touched down. After Zanon grabbed Zebre's bonus score, replacement flanker Connors wrapped up a comfortable win that gets Leinster's title defence back on track before the autumn break.",
        "Leinster: McLaughlin; Kenny, Cooney, Tector, A Osborne; Byrne, McGrath (capt); Cahir, McKee, Slimani, Deeny, D Mangan, Soroka, Penny, Culhane.Replacements: B Sheehan, Usanov, Sparrow, Snyman, C Mangan, Connors, Gunne, Gabriel.Red card: Osborne (30)Zebre: Pani; Belloni, Bertaccini, Zanon, Batista; Da Re, Dominguez; Hasa, Quattrini, Nocera, Carrera, Krumov (capt), Ferrari, Locatelli, Odiase.Replacements: Di Bartolomeo, Buonfiglio, Gallorini, Milano, Licata, Prinsloo, Farias, Morisi.Red card: Dominguez (37)Referee: Ian Kenny (SRU)",
        "Alex Soroka (centre) scored two tries after being drafted into the line-up just before kick-off",
        "United Rugby Championship",
        "Tries: Kenny 2, Soroka 2, Cahir, Byrne, Snyman, Connors Cons: Byrne 5",
        "Tries: Belloni, Dominguez, Quattrini, Zanon Cons: Da Re 3",
        "A youthful Leinster team ran in eight tries to overwhelm Zebre as the Irish province bounced back from last week's derby defeat by Munster with a bonus-point victory at Aviva Stadium.",
        "With their sizeable Ireland cohort in Chicago to prepare for next week's All Blacks Test, Leinster's second string - which included six debutants - delivered a much-needed win for head coach Leo Cullen with a vibrant display.",
        "Joshua Kenny and Alex Soroka scored two tries apiece before the break, with debutant Jerry Cahir, Harry Byrne, RG Snyman and Will Connors piling the misery on Zebre in the second half.",
        "While the Italian side remain without a win over Leinster, they did not leave Dublin empty-handed as Marco Zanon's late score clinched a try bonus point.",
        "Both sides received 20-minute red cards with Leinster wing Andrew Osborne dismissed, before Zebre scrum-half Thomas Dominguez's yellow was upgraded during the half-time interval.",
        "Ulster lose to Lions despite Baloucoune hat-trick",
        "Lions loss 'difficult one to take' for Murphy",
        "The loss to Munster at Croke Park was the third in four games for Leinster, but the United Rugby Championship holders were immediately on the front foot against the Italians as Kenny scored his first try for the club in the second minute.",
        "Soroka, a late replacement for the injured Max Deegan in the line-up, then scored either side of Mirko Belloni's try to give Leinster clear daylight.",
        "Belloni's score was created by Dominguez's superb cross-field kick into the corner and the scrum-half teed himself up for a try when he took a tap penalty and nipped through the home side's defence.",
        "Kenny delivered the hosts' bonus-point score in the 27th minute before Leinster lost Osborne, whose yellow card for a collision in the air with Lorenzo Pani was later upgraded to a 20-minute red card.",
        "Giovanni Quattrini scored Zebre's third try, but their momentum was punctured when Dominguez failed to wrap his tackle on Leinster back row James Culhane, resulting in another 20-minute red card.",
        "Leinster started the second half with renewed intent and, after Luke McGrath's try was ruled out for a knock-on, loose-head prop Cahir powered his way over from close range in the 48th minute.",
        "Having kicked four conversions, Byrne marked his return to the line-up with his first Leinster try since March 2023, before replacement lock Snyman touched down.",
        "After Zanon grabbed Zebre's bonus score, replacement flanker Connors wrapped up a comfortable win that gets Leinster's title defence back on track before the autumn break.",
        "Leinster: McLaughlin; Kenny, Cooney, Tector, A Osborne; Byrne, McGrath (capt); Cahir, McKee, Slimani, Deeny, D Mangan, Soroka, Penny, Culhane.",
        "Replacements: B Sheehan, Usanov, Sparrow, Snyman, C Mangan, Connors, Gunne, Gabriel.",
        "Red card: Osborne (30)",
        "Zebre: Pani; Belloni, Bertaccini, Zanon, Batista; Da Re, Dominguez; Hasa, Quattrini, Nocera, Carrera, Krumov (capt), Ferrari, Locatelli, Odiase.",
        "Replacements: Di Bartolomeo, Buonfiglio, Gallorini, Milano, Licata, Prinsloo, Farias, Morisi.",
        "Red card: Dominguez (37)",
        "Referee: Ian Kenny (SRU)"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/rugby-union/articles/cy8vqgp1240o",
      "main_category": "sport",
      "detailed_category": "rugby-union",
      "topic": "Star-studded Sharks turn up heat against Scarlets",
      "content": [
        "United Rugby ChampionshipSharks (19) 29Tries: V Tshitukav, M Tshitukav, Mazibuko, Kolisi Cons: Smith 3 Pen: SmithScarlets (14) 19Tries: van der Merwe, Murray, Rogers Cons: Costelow 2",
        "Sharks celebrated a first win of the United Rugby Championship (URC) season by edging a spirited Scarlets.Both sides headed into the Durban heat winless and in desperate need of picking up points before the international break.Sharks had 13 current Springboks in their squad and it was their star power that swung the contest.Tshitukav siblings Vincent and Manu crossed along with Lee-Marvin Mazibuko for the hosts, while a moment of magic from Blair Murray and Marnus van der Merwe kept Scarlets in touch.Tom Rogers, one of five returning internationals, hit back after the break, but Sharks pulled away with a Siya Kolisi try and the reliable boot of Jean Smith.",
        "Scarlets finish the first block rooted to the bottom of the URC table having had one game postponed in round two, while Stormers climb up to 12th.A barnstorming break from Kolisi paved the way for the opening try, the Springbok captain drawing in defenders which allowed the ball to be floated out to Vincent Tshitukav.Scarlets hit back 10 minutes later and it was skipper Johnny Williams who made the break, with Harvey Cuckson finding Scarlets' own Springbok Van der Merwe in support.Sam Costelow's conversion gave Scarlets the lead, but it was short lived after Manu Tshitukav showed good footwork to join his brother on the scoreboard.Murray made his own luck for Scarlets' second score, the full-back scooping up a loose clearance before putting in a speculative kick which ricocheted into his path.Sharks turned down a kickable penalty, rightfully backing their line-out which led to Mazibuko's close-range effort and handed the hosts a five point lead heading into the welcome shade of the tunnel.",
        "Scarlets came out firing in the second half, a solid scrum and neat pop pass released the returning Rogers who had the gas and strength to beat the covering defence. With the scores tied, Sharks once again backed their set piece and Kolisi wriggled out of the driving line-out to score his second try in as many weeks and bag the all-important bonus-point.The game began to get niggly, with Taine Plumtree - the son of Sharks head coach John - involved in a scuffle with Kolisi, while Costelow took advantage of a break in play with a meandering run, but could not find the support.Sharks showed Scarlets respect in opting for posts, with the impressive Smith kicking his side two scores ahead.Dan Davis and Dane Blacker both came close for Scarlets but the accuracy was not there when it mattered and Sharks celebrated a much-needed win with home fans.",
        "Sharks head coach John Plumtree said: \"Relieved. I was really pleased for the boys that came out, I think Jean Smith played pretty well in the conditions.\"We looked like a side that's low on confidence, quite often we had some opportunities to score in the wider channels, we're not quite there but I'm pleased with the way the boys hung in there.\"I thought the Scarlets were great physically, the big boys that they've brought into their side really fronted up.\"Today was just about getting a win for everyone that supports us, I know it's been really tough.\"Scarlets head coach Dwayne Peel said: \"It was definitely a step forward for us and I felt like we looked like ourselves a bit more.\"Obviously we're frustrated as there were a couple of bonus-points we could have got and we leave with nothing for a lot of effort.\"There were some poor execution moments, we just couldn't quite get over the line and coughed up some soft tries as well, but I think it's a step in the right direction .\"It's been tough couple of games for us and a lot of hard work is needed this month.\"",
        "Sharks: J Hendrikse; Hooker, Am, Esterhuizen, van der Merwe; Smith, Williams; Nche, Mbonambi, Mazibuko, Etzebeth (capt), Orie, Kolisi, V Tshituka, E TshitukaReplacements: Mbatha, Dawson, Mdanda, Scheepers, Buthelezi, J Hendrikse, JuliusScarlets: Murray; Rogers, Roberts, Williams (capt), Mee; Costelow, Blacker; Mathias, van der Merwe, Holz, Ball, Cuckson, Lousi, Davis, Plumtree.Replacements: Myhill, Hepburn, Thomas, Groves, Taylor, Hughes, Hawkins, Nicholas.",
        "Referee: Sam Grove-White (Scotland)Assistants: Griffin Colby (South Africa), Aimee Barrett-Theron (South Africa)TMO: Eoghan Cross (Ireland)",
        "Temperatures reached close to 30 degrees at Hollywoodbets Kings Park",
        "United Rugby Championship",
        "Tries: V Tshitukav, M Tshitukav, Mazibuko, Kolisi Cons: Smith 3 Pen: Smith",
        "Tries: van der Merwe, Murray, Rogers Cons: Costelow 2",
        "Sharks celebrated a first win of the United Rugby Championship (URC) season by edging a spirited Scarlets.",
        "Both sides headed into the Durban heat winless and in desperate need of picking up points before the international break.",
        "Sharks had 13 current Springboks in their squad and it was their star power that swung the contest.",
        "Tshitukav siblings Vincent and Manu crossed along with Lee-Marvin Mazibuko for the hosts, while a moment of magic from Blair Murray and Marnus van der Merwe kept Scarlets in touch.",
        "Tom Rogers, one of five returning internationals, hit back after the break, but Sharks pulled away with a Siya Kolisi try and the reliable boot of Jean Smith.",
        "Scarlets finish the first block rooted to the bottom of the URC table having had one game postponed in round two, while Stormers climb up to 12th.",
        "A barnstorming break from Kolisi paved the way for the opening try, the Springbok captain drawing in defenders which allowed the ball to be floated out to Vincent Tshitukav.",
        "Scarlets hit back 10 minutes later and it was skipper Johnny Williams who made the break, with Harvey Cuckson finding Scarlets' own Springbok Van der Merwe in support.",
        "Sam Costelow's conversion gave Scarlets the lead, but it was short lived after Manu Tshitukav showed good footwork to join his brother on the scoreboard.",
        "Murray made his own luck for Scarlets' second score, the full-back scooping up a loose clearance before putting in a speculative kick which ricocheted into his path.",
        "Sharks turned down a kickable penalty, rightfully backing their line-out which led to Mazibuko's close-range effort and handed the hosts a five point lead heading into the welcome shade of the tunnel.",
        "Macleod out of Wales contention for autumn series",
        "Wales recall Rees-Zammit for autumn Tests",
        "Scarlets came out firing in the second half, a solid scrum and neat pop pass released the returning Rogers who had the gas and strength to beat the covering defence.",
        "With the scores tied, Sharks once again backed their set piece and Kolisi wriggled out of the driving line-out to score his second try in as many weeks and bag the all-important bonus-point.",
        "The game began to get niggly, with Taine Plumtree - the son of Sharks head coach John - involved in a scuffle with Kolisi, while Costelow took advantage of a break in play with a meandering run, but could not find the support.",
        "Sharks showed Scarlets respect in opting for posts, with the impressive Smith kicking his side two scores ahead.",
        "Dan Davis and Dane Blacker both came close for Scarlets but the accuracy was not there when it mattered and Sharks celebrated a much-needed win with home fans.",
        "Sharks head coach John Plumtree said: \"Relieved. I was really pleased for the boys that came out, I think Jean Smith played pretty well in the conditions.",
        "\"We looked like a side that's low on confidence, quite often we had some opportunities to score in the wider channels, we're not quite there but I'm pleased with the way the boys hung in there.",
        "\"I thought the Scarlets were great physically, the big boys that they've brought into their side really fronted up.",
        "\"Today was just about getting a win for everyone that supports us, I know it's been really tough.\"",
        "Scarlets head coach Dwayne Peel said: \"It was definitely a step forward for us and I felt like we looked like ourselves a bit more.",
        "\"Obviously we're frustrated as there were a couple of bonus-points we could have got and we leave with nothing for a lot of effort.",
        "\"There were some poor execution moments, we just couldn't quite get over the line and coughed up some soft tries as well, but I think it's a step in the right direction .",
        "\"It's been tough couple of games for us and a lot of hard work is needed this month.\"",
        "Sharks: J Hendrikse; Hooker, Am, Esterhuizen, van der Merwe; Smith, Williams; Nche, Mbonambi, Mazibuko, Etzebeth (capt), Orie, Kolisi, V Tshituka, E Tshituka",
        "Replacements: Mbatha, Dawson, Mdanda, Scheepers, Buthelezi, J Hendrikse, Julius",
        "Scarlets: Murray; Rogers, Roberts, Williams (capt), Mee; Costelow, Blacker; Mathias, van der Merwe, Holz, Ball, Cuckson, Lousi, Davis, Plumtree.",
        "Replacements: Myhill, Hepburn, Thomas, Groves, Taylor, Hughes, Hawkins, Nicholas.",
        "Referee: Sam Grove-White (Scotland)",
        "Assistants: Griffin Colby (South Africa), Aimee Barrett-Theron (South Africa)",
        "TMO: Eoghan Cross (Ireland)"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/rugby-union/articles/c8eyp7l10ezo",
      "main_category": "sport",
      "detailed_category": "rugby-union",
      "topic": "Four-try Freeman stars as Saints beat Saracens",
      "content": [
        "The Prem, cinch Franklin's GardensNorthampton (17) 43Tries: Hendy, Pearson (2), Freeman (4) Cons: Smith (4)Saracens (19) 31Tries: Burke, J Bracken, Gonzalez, Tizard, Malins Cons: Farrell (3)",
        "Northampton Saints winger Tommy Freeman gave a polite reminder that he remains England's premier winger with four tries to help his side to victory over Saracens.His first followed tries from full-back George Hendy and flanker Tom Pearson but Saints trailed 19-17 at the break as Fergus Burke, Jack Bracken and Juan Martin Gonzalez went over for Saracens.Hugh Tizard extended the lead before Northampton rediscovered themselves and Pearson and Freeman both added their second tries to put the hosts back in front.Freeman took Rory Hutchinson's pass to walk in for his hat-trick before collecting Fin Smith's kick to score his fourth try, either side of Max Malins sliding over for Saracens' fifth.",
        "Amid speculation of how Bath's Henry Arundel, Leicester's Adam Radwan or even Saracens' 19-year-old Noah Caluori could feature for England in the coming weeks, Freeman offered a timely reminder of his international class.Caluori, who trained with England this week, had a very quiet night with Saints able to exploit his defensive inexperience before he was withdrawn carrying an injury with 15 minutes remaining.It was Freeman's night as he helped deliver a fourth win in five games for unbeaten Saints and a second defeat for Saracens as the Prem now pauses for the autumn internationals, which begin with England hosting Australia next Saturday.Freeman began by taking Smith's cross-field kick to break up the right wing before the play was worked left and Smith this time grubbered in behind the Sarries defence, with Hendy collecting to dive over the line.A second try soon followed as another Smith grubber wasn't grounded by Sarries full-back Malins and Pearson took advantage to touch down. And when Smith's superb pass to the right wing freed Hendy, he released Freeman into the corner for Saints' third try.",
        "After finding themselves 17-0 down in the 24th minute, Sarries found a reply as centre Nick Tompkins broke through midfield and sent Burke under the posts.Burke then turned provider when his kick into the left corner was collected superbly by winger Jack Bracken to touch down.A succession of penalties then led to a yellow card for Pearson and Gonzalez barged over from close range to give Saracens a two-point lead at half-time.And six minutes after the break, Sarries had a bonus point as Tom Willis carried almost to the line and Tizard picked and dived over.But the game turned again as Henry Pollock intercepted Burke's pass to send Saints into Saracens territory, visiting prop Marco Riccioni was sin-binned for deliberate offside, and Saints took advantage from the penalty to work Pearson over for his second try of the night.Another penalty gave Saints more field position and patient build-up created space for Freeman to coast in for his second try before more close-range work from the forwards created space on the right wing where the England back completed his hat-trick.",
        "At 12 points down, Saracens stayed alive as scrum-half Charlie Bracken took a tap penalty, kicked delicately in behind the defence, gathered himself and passed for Malins to go into the right corner.But another comeback was snuffed out as Smith's high cross-field kick was taken by Freeman who ran in to finally settle the game and ensure Saints will stay top of the pile until the return to league action in late November.",
        "Saints director of rugby Phil Dowson told BBC Radio Northampton:\"Both sides went for it today and it had a bit of everything. We stuck at it and showed the tenacity that we've been looking for.\"There was no sense of panic when the lead slipped, they're allowed to be good too and are packed full of good players.\"The momentum shifted heavily in the first half but the character to deal with that and go again in the second half is outstanding.\"Saracens director of rugby Mark McCall: \"The first 20-odd minutes we were clearly second best. They had a lot of the ball, winning lots of collisions, getting speed of ball and looking really good, and we struggled to stop them, to be honest.\"We did mount a bit of a fightback, which we should be proud of and to go in leading at half-time was good, and they were down to 14 men at the start of that [second] half.\"We had a chance and we took a chance and gave ourselves a bit of a lead, but I didn't really enjoy how it played out from there.\"We threw a long pass, they intercepted and all of a sudden the tide turned quick, and if we want to be the team we want to be, to concede two or three tries quickfire, like we did, it's not what we want to be like.\"",
        "Northampton Saints: Hendy; Freeman, Hutchinson, Dingwall (c), Todaro; Smith, Mitchell; Fischetti, Smith, Davison, Lockett, Van der Mescht, Coles, Pearson, PollockReplacements: Wright, Iyogun, Green, Prowse, Chick, McParland, Belleau, LitchfieldYellow card: Pearson (40)Saracens: Malins; Caluori, Tompkins, Farrell, J Bracken; Burke, C Bracken; Mawi, Dan, Riccioni, Itoje, Tizard, Gonzalez, Onyeama-Christie, WillisReplacements: Hadfield, Carre, Street, Isiekwe, McFarland, Earl, Simpson, HallYellow card: Riccioni (54)Referee: Anthony Woodthorpe",
        "Tommy Freeman scored four tries in an impressive win for leaders Northampton",
        "The Prem, cinch Franklin's Gardens",
        "Tries: Hendy, Pearson (2), Freeman (4) Cons: Smith (4)",
        "Tries: Burke, J Bracken, Gonzalez, Tizard, Malins Cons: Farrell (3)",
        "Northampton Saints winger Tommy Freeman gave a polite reminder that he remains England's premier winger with four tries to help his side to victory over Saracens.",
        "His first followed tries from full-back George Hendy and flanker Tom Pearson but Saints trailed 19-17 at the break as Fergus Burke, Jack Bracken and Juan Martin Gonzalez went over for Saracens.",
        "Hugh Tizard extended the lead before Northampton rediscovered themselves and Pearson and Freeman both added their second tries to put the hosts back in front.",
        "Freeman took Rory Hutchinson's pass to walk in for his hat-trick before collecting Fin Smith's kick to score his fourth try, either side of Max Malins sliding over for Saracens' fifth.",
        "Amid speculation of how Bath's Henry Arundel, Leicester's Adam Radwan or even Saracens' 19-year-old Noah Caluori could feature for England in the coming weeks, Freeman offered a timely reminder of his international class.",
        "Caluori, who trained with England this week, had a very quiet night with Saints able to exploit his defensive inexperience before he was withdrawn carrying an injury with 15 minutes remaining.",
        "It was Freeman's night as he helped deliver a fourth win in five games for unbeaten Saints and a second defeat for Saracens as the Prem now pauses for the autumn internationals, which begin with England hosting Australia next Saturday.",
        "Freeman began by taking Smith's cross-field kick to break up the right wing before the play was worked left and Smith this time grubbered in behind the Sarries defence, with Hendy collecting to dive over the line.",
        "A second try soon followed as another Smith grubber wasn't grounded by Sarries full-back Malins and Pearson took advantage to touch down.",
        "And when Smith's superb pass to the right wing freed Hendy, he released Freeman into the corner for Saints' third try.",
        "After finding themselves 17-0 down in the 24th minute, Sarries found a reply as centre Nick Tompkins broke through midfield and sent Burke under the posts.",
        "Burke then turned provider when his kick into the left corner was collected superbly by winger Jack Bracken to touch down.",
        "A succession of penalties then led to a yellow card for Pearson and Gonzalez barged over from close range to give Saracens a two-point lead at half-time.",
        "And six minutes after the break, Sarries had a bonus point as Tom Willis carried almost to the line and Tizard picked and dived over.",
        "But the game turned again as Henry Pollock intercepted Burke's pass to send Saints into Saracens territory, visiting prop Marco Riccioni was sin-binned for deliberate offside, and Saints took advantage from the penalty to work Pearson over for his second try of the night.",
        "Another penalty gave Saints more field position and patient build-up created space for Freeman to coast in for his second try before more close-range work from the forwards created space on the right wing where the England back completed his hat-trick.",
        "At 12 points down, Saracens stayed alive as scrum-half Charlie Bracken took a tap penalty, kicked delicately in behind the defence, gathered himself and passed for Malins to go into the right corner.",
        "But another comeback was snuffed out as Smith's high cross-field kick was taken by Freeman who ran in to finally settle the game and ensure Saints will stay top of the pile until the return to league action in late November.",
        "Saints director of rugby Phil Dowson told BBC Radio Northampton:",
        "\"Both sides went for it today and it had a bit of everything. We stuck at it and showed the tenacity that we've been looking for.",
        "\"There was no sense of panic when the lead slipped, they're allowed to be good too and are packed full of good players.",
        "\"The momentum shifted heavily in the first half but the character to deal with that and go again in the second half is outstanding.\"",
        "Saracens director of rugby Mark McCall:",
        "\"The first 20-odd minutes we were clearly second best. They had a lot of the ball, winning lots of collisions, getting speed of ball and looking really good, and we struggled to stop them, to be honest.",
        "\"We did mount a bit of a fightback, which we should be proud of and to go in leading at half-time was good, and they were down to 14 men at the start of that [second] half.",
        "\"We had a chance and we took a chance and gave ourselves a bit of a lead, but I didn't really enjoy how it played out from there.",
        "\"We threw a long pass, they intercepted and all of a sudden the tide turned quick, and if we want to be the team we want to be, to concede two or three tries quickfire, like we did, it's not what we want to be like.\"",
        "Northampton Saints: Hendy; Freeman, Hutchinson, Dingwall (c), Todaro; Smith, Mitchell; Fischetti, Smith, Davison, Lockett, Van der Mescht, Coles, Pearson, Pollock",
        "Replacements: Wright, Iyogun, Green, Prowse, Chick, McParland, Belleau, Litchfield",
        "Yellow card: Pearson (40)",
        "Saracens: Malins; Caluori, Tompkins, Farrell, J Bracken; Burke, C Bracken; Mawi, Dan, Riccioni, Itoje, Tizard, Gonzalez, Onyeama-Christie, Willis",
        "Replacements: Hadfield, Carre, Street, Isiekwe, McFarland, Earl, Simpson, Hall",
        "Yellow card: Riccioni (54)",
        "Referee: Anthony Woodthorpe"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/rugby-union/articles/c3w9107wv2jo",
      "main_category": "sport",
      "detailed_category": "rugby-union",
      "topic": "Defending champions Gloucester-Hartpury's 'next act'",
      "content": [
        "For the past three seasons, Gloucester-Hartpury have been the all-conquering team in Premiership Women's Rugby (PWR).They secured their third consecutive league title in March but with head coach Sean Lynn having since left the club, for a team that calls itself 'the Circus' it is fitting that new head of rugby Dan Murphy has described the 2025-26 campaign as their \"next act\".\"I've spoke quite openly about the next act and that's what we are,\" Murphy told BBC Radio Gloucestershire.\"The main event, the circus, has been amazing for a long time, but now we want to see who these new centre-stage athletes are.\"",
        "Murphy's appointment signals the start of a new era at the club which has been the standard bearer in recent seasons. But rather than overhauling what has gone before his approach is more to freshen up what is already there. For a start, he is far from new to the Gloucester-Hartpury set-up, having worked as the team's scrum coach under Lynn for the past four seasons. Lewis Arnold also remains as forwards coach with former England back Matt Banahan brought on to the staff.Co-captain Zoe Aldcroft, now known by her married name Stratford, said the team has got the same feeling with Murphy now at the helm.\"Murph's been with us for many years before,\" she told BBC Radio Gloucestershire.\"We've experienced him and know what he's like as a person. \"Him coming in and bringing his view on things has been really great and refreshing, actually, as well as having Matt Banahan here leading our attack and bringing new ideas. \"It's always good to have that new freshness in and keep things motivated.\"How a team that completed a three-peat in the spring, and features no fewer than eight England internationals, including Red Roses captain Stratford - who lifted the World Cup trophy in Twickenham just four weeks ago - continues to find motivation might sound like a challenge. But Stratford said it is simple. Their motivation this season is the same as it always has been - \"winning\".\"We absolutely love that - we're a team where we're very competitive, and when we take the field, we put our bodies on the line for each other, and we love doing it for each other as well,\" she said.",
        "Gloucester-Hartpury's on-field form speaks for itself. They have lost just six of their past 55 league games, and much of their success was built on togetherness and consistency in the squad. Their international contingent has been retained for the new season with Red Roses Tatyana Heard, Alex Matthews, Mackenzie Carson and Maud Muir among those to sign new deals in the spring, along with Wales fly-half Lleucu George - one of 13 Wales internationals also in the squad.\"They're such an infectious group - the way they're determined, they're driven, the standards they expect of people around them within the team, they're just a great group to work with,\" Murphy said.The biggest challenge for a team that has long been at the top is how to retain the same high standard and push on further, to ensure they stay there. And with the PWR becoming ever more competitive each season, as the gap between the top and bottom continues to narrow, a fourth title is far from guaranteed. \"We've already touched on that - we don't want to lean into that complacency,\" said prop Carson.\"How do we push forward and get those one per cent's and keep pushing when we've won it the last few years?\"Especially Murph, he wants to put his own mark on it. He's not won as a head coach yet so that'll be his goal to win the PWR as the head coach.\"",
        "Things do not get much tougher for Gloucester-Hartpury to begin their season than a repeat of last season's final against Saracens at Kingsholm on Sunday. Saracens - also three-times league champions - come into the game having won the PWR Cup two weeks ago. They are loaded with their own crop of World Cup winners, including top try-scorer Jess Breach, former England captain Marlie Packer and World Player of the Year, Canada's Sophie de Goede.\"You get one chance to make a first impression in life and this weekend is that,\" Murphy said.\"Yes, we are the same team and the same group, but these are the games that you look for in the fixture list. \"We've got a tough start. We've got Sarries, Exeter, Quins and Sale, thick and fast, and that's the strength of the league now.\"Additional reporting by Paul Furley and Mike Henson.",
        "Gloucester-Hartpury have a new head coach but are still as focused on \"winning\" as ever, says their captain Zoe Stratford (right)",
        "For the past three seasons, Gloucester-Hartpury have been the all-conquering team in Premiership Women's Rugby (PWR).",
        "They secured their third consecutive league title in March but with head coach Sean Lynn having since left the club, for a team that calls itself 'the Circus' it is fitting that new head of rugby Dan Murphy has described the 2025-26 campaign as their \"next act\".",
        "\"I've spoke quite openly about the next act and that's what we are,\" Murphy told BBC Radio Gloucestershire.",
        "\"The main event, the circus, has been amazing for a long time, but now we want to see who these new centre-stage athletes are.\"",
        "Ibiza, Lady Gaga, DIY & PWR - what the Red Roses did next",
        "Where are England's World Cup winners playing?",
        "Murphy's appointment signals the start of a new era at the club which has been the standard bearer in recent seasons. But rather than overhauling what has gone before his approach is more to freshen up what is already there.",
        "For a start, he is far from new to the Gloucester-Hartpury set-up, having worked as the team's scrum coach under Lynn for the past four seasons. Lewis Arnold also remains as forwards coach with former England back Matt Banahan brought on to the staff.",
        "Co-captain Zoe Aldcroft, now known by her married name Stratford, said the team has got the same feeling with Murphy now at the helm.",
        "\"Murph's been with us for many years before,\" she told BBC Radio Gloucestershire.",
        "\"We've experienced him and know what he's like as a person.",
        "\"Him coming in and bringing his view on things has been really great and refreshing, actually, as well as having Matt Banahan here leading our attack and bringing new ideas.",
        "\"It's always good to have that new freshness in and keep things motivated.\"",
        "How a team that completed a three-peat in the spring, and features no fewer than eight England internationals, including Red Roses captain Stratford - who lifted the World Cup trophy in Twickenham just four weeks ago - continues to find motivation might sound like a challenge.",
        "But Stratford said it is simple. Their motivation this season is the same as it always has been - \"winning\".",
        "\"We absolutely love that - we're a team where we're very competitive, and when we take the field, we put our bodies on the line for each other, and we love doing it for each other as well,\" she said.",
        "Gloucester-Hartpury's on-field form speaks for itself. They have lost just six of their past 55 league games, and much of their success was built on togetherness and consistency in the squad.",
        "Their international contingent has been retained for the new season with Red Roses Tatyana Heard, Alex Matthews, Mackenzie Carson and Maud Muir among those to sign new deals in the spring, along with Wales fly-half Lleucu George - one of 13 Wales internationals also in the squad.",
        "\"They're such an infectious group - the way they're determined, they're driven, the standards they expect of people around them within the team, they're just a great group to work with,\" Murphy said.",
        "The biggest challenge for a team that has long been at the top is how to retain the same high standard and push on further, to ensure they stay there.",
        "And with the PWR becoming ever more competitive each season, as the gap between the top and bottom continues to narrow, a fourth title is far from guaranteed.",
        "\"We've already touched on that - we don't want to lean into that complacency,\" said prop Carson.",
        "\"How do we push forward and get those one per cent's and keep pushing when we've won it the last few years?",
        "\"Especially Murph, he wants to put his own mark on it. He's not won as a head coach yet so that'll be his goal to win the PWR as the head coach.\"",
        "Gloucester-Hartpury start the new PWR campaign against Saracens, who they beat in last season's final",
        "Things do not get much tougher for Gloucester-Hartpury to begin their season than a repeat of last season's final against Saracens at Kingsholm on Sunday.",
        "Saracens - also three-times league champions - come into the game having won the PWR Cup two weeks ago. They are loaded with their own crop of World Cup winners, including top try-scorer Jess Breach, former England captain Marlie Packer and World Player of the Year, Canada's Sophie de Goede.",
        "\"You get one chance to make a first impression in life and this weekend is that,\" Murphy said.",
        "\"Yes, we are the same team and the same group, but these are the games that you look for in the fixture list.",
        "\"We've got a tough start. We've got Sarries, Exeter, Quins and Sale, thick and fast, and that's the strength of the league now.\"",
        "Additional reporting by Paul Furley and Mike Henson."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/rugby-union/articles/cvgvnegl8x7o",
      "main_category": "sport",
      "detailed_category": "rugby-union",
      "topic": "Conan dismisses talk of Lions hangover for Ireland",
      "content": [
        "Ireland back row Jack Conan says a hangover from the British and Irish Lions tour \"is not on anyone's mind\" before the Chicago rematch with New Zealand.Andy Farrell's Lions' panel contained 18 Ireland players, but Leinster - who had a 14-strong contingent in Australia - have lost three out of four United Rugby Championship games this season.Ireland will face New Zealand in Chicago on 1 November at Soldier Field, where the they famously defeated the All Blacks for the first time in 2016.\"I don't think it's a thing myself,\" said Conan when asked if he had any worries about a lingering hangover for Ireland from the Lions tour.\"I don't think anyone could say that Tadhg Beirne has had a Lions malaise or however you put it. Over the weekend [in Munster's 31-14 win over Leinster] he was fantastic. \"Obviously things didn't go right for the Leinster lads against Munster the other day but there was still some good performances in there. \"It's not something that is on anyone's mind. I think the lads will be fresh and ready to go. There will be no lack of motivation for next week or the coming weeks.\" Conan missed the Munster defeat with a \"niggle\" but could make his first appearance of the season in Chicago against New Zealand.As a large number of Ireland's internationals were away with the Lions in the summer, the last time a full-strength Irish side played together was in March's Six Nations finale in Italy. In that time, New Zealand have played nine matches and narrowly missed out on winning the Rugby Championship - and Conan says Farrell's side will be ready to face the All Blacks despite the lack of international minutes. \"It's unacceptable in this environment to have any excuses for not performing well,\" Conan said. \"There's no excuses. It's great to be over here now to have the time to train together without the distraction of travel. \"We'll prep really well for next week. We've done it before and we'll do it again.\"",
        "Jack Conan played in all three Test matches as the British and Irish Lions defeated Australia in the summer",
        "Ireland back row Jack Conan says a hangover from the British and Irish Lions tour \"is not on anyone's mind\" before the Chicago rematch with New Zealand.",
        "Andy Farrell's Lions' panel contained 18 Ireland players, but Leinster - who had a 14-strong contingent in Australia - have lost three out of four United Rugby Championship games this season.",
        "Ireland will face New Zealand in Chicago on 1 November at Soldier Field, where the they famously defeated the All Blacks for the first time in 2016.",
        "\"I don't think it's a thing myself,\" said Conan when asked if he had any worries about a lingering hangover for Ireland from the Lions tour.",
        "\"I don't think anyone could say that Tadhg Beirne has had a Lions malaise or however you put it. Over the weekend [in Munster's 31-14 win over Leinster] he was fantastic.",
        "\"Obviously things didn't go right for the Leinster lads against Munster the other day but there was still some good performances in there.",
        "\"It's not something that is on anyone's mind. I think the lads will be fresh and ready to go. There will be no lack of motivation for next week or the coming weeks.\"",
        "Conan missed the Munster defeat with a \"niggle\" but could make his first appearance of the season in Chicago against New Zealand.",
        "As a large number of Ireland's internationals were away with the Lions in the summer, the last time a full-strength Irish side played together was in March's Six Nations finale in Italy.",
        "In that time, New Zealand have played nine matches and narrowly missed out on winning the Rugby Championship - and Conan says Farrell's side will be ready to face the All Blacks despite the lack of international minutes.",
        "\"It's unacceptable in this environment to have any excuses for not performing well,\" Conan said.",
        "\"There's no excuses. It's great to be over here now to have the time to train together without the distraction of travel.",
        "\"We'll prep really well for next week. We've done it before and we'll do it again.\""
      ]
    },
    {
      "url": "https://www.bbc.com/sport/rugby-union/articles/cj3zxx0r8mvo",
      "main_category": "sport",
      "detailed_category": "rugby-union",
      "topic": "Ibiza, Lady Gaga, DIY & PWR - what the Red Roses did next",
      "content": [
        "Premiership Women's Rugby - Harlequins v Loughborough LightningVenue: Twickenham Stoop Date: Friday 24 October Kick-off: 19:30 BST Coverage: Live on BBC iPlayer and BBC Sport website & app",
        "The Red Roses were last spotted looking tired, emotional, happy and glorious.After beating Canada in the Women's Rugby World Cup final on 27 September, they celebrated long into the night at Twickenham's Cabbage Patch pub, before emerging bleary-eyed the next morning for a news conference and a public celebration at Battersea Power Station.\"It's been a bit of a whirlwind, I don't think I have taken it all in yet,\" said fly-half Holly Aitchison, nearly a month on.A week of media duties followed as the squad surfed between breakfast TV sofas, radio studios and podcast appearances, while also sneaking in some more celebrating. A trip to see Lady Gaga at the O2 strained vocal cords.The weekend after winning the final, all members of the Red Roses squad travelled to various grassroots clubs for Rugby Fest, a nationwide open day designed to draw more women's players into the sport.Second row Lilli Ives Campion went to Macclesfield, with team-mate Morwenna Talling.\"The amount of people who turned up was insane, actually crazy. There were girls coming over from rugby league teams and all over,\" she said.Then, four months after their first Rugby World Cup training camp, three weeks before the start of the season, there was a brief window for players to get away.Captain Zoe Aldcroft squeezed in two holidays, taking in the Spanish city of Malaga with her husband Luke, before joining a 10-strong Red Roses' trip to Ibiza.\"Both different, both fun!\" she said.Hannah Botterman, Emily Scarratt, Natasha Hunt, Tatyana Heard, MacKenzie Carson, Campion and Abbie Ward (a late joiner after missing her flight out) were among the Red Roses on the White Isle.\"We had a great time, we did all the classic Ibiza things, went to O Beach, which was fun,\" said Botterman\"After years going through it, chasing one goal, and then to achieve it, to be able to celebrate that with people who have done the same thing is really special.\"",
        "Not everyone's celebrations were as exotic.\"I would say my celebrations have been long, but not as intense as the Ibiza crew,\" said prop Sarah Bern.\"I felt I needed some downtime to regulate myself and just to drink water for a start!\"And I actually did a bit of DIY.\"Campion says the interactions and invitations have brought home how much the team's Rugby World Cup win cut through with the general public\"I went to Northampton's win over Leicester in the Prem and the guy sat next to me messaged me after to say it was incredible to be alongside a World Cup winner,\" she said.\"I have also been to my first film premiere – it was for Christy, a film about a female boxer – and it was pretty exciting.\"You could not predict how any of this would have gone, but to do it with these incredible girls is amazing.\"Fewer than four weeks on from Twickenham glory though, the celebratory glitz and glitter shifts into a brand-new Premiership Women's Rugby (PWR) season with the stars on show for their club sides.It begins with Ellie Kildunne and her Harlequins team-mates taking on Sadia Kabeya's Loughborough Lightning in the campaign opener live on BBC Sport on Friday evening.",
        "Saracens' Sophie de Goede, Canada's World Player of the year, also went away after the World Cup final, travelling to Portugal with three international team-mates.\"We just kind of tuned out of everything, but when I got back to London and turned my phone back on, there was this big flood of messages, showing the excitement about the whole of the World Cup,\" she said.\"So, I feel a big mix of things, pride at how well the tournament went but also devastation and disappointment and frustration at how we played in the final. It is a funny feeling holding both those emotions at the same time.\"We have four more years of fuel now though, so lots to look forward to.\"De Goede says that PWR was key to Canada's run to the final and future hopes.She was one of five Saracens players in Canada's World Cup final squad, with another six of their matchday 23 also playing in the English top flight.Saracens coach Alex Austerberry was part of Canada's backroom staff during their World Cup campaign as well.\"PWR is a strong league globally and we want to be able to play in the preeminent leagues and to continue to get better and learn winning habits,\" said De Goede.\"We needed to learn how to win big, tight games when there are lots of fans in the stadium.\"De Goede says the level of fan interest has been \"helpful\" in upping the quality of rugby, both individually for players and as a team.\"Hopefully we've helped the PWR continue to grow and get stronger as a league and put out a better product on the field,\" she added.In the wake of lifting the World Cup, England coach John Mitchell stressed that the league had to provide a conveyor belt of talent for the Red Roses.\"I love seeing 100 English girls playing in PWR, I would love to see more play because then I can have the opportunity to select more,\" he said.\"The league is a great competition because we are playing against other world-class players, but we have to be mindful that we are still growing our English players.\"Clubs are required to have an average of 13 England-qualified players in their 23-strong matchday squads.However, De Goede has been joined by other global superstars in the league this summer, with Ireland back row Aoife Wafer moving to Harlequins, Canada's Laetitia Royer coming to Saracens, Scotland wing Rhona Lloyd signing for Sale and New Zealand duo Alana Borland and Georgia Ponsonby linking up with Trailfinders.Loughborough Lightning captain and England back row Daisy Hibbert-Jones made her PWR debut as a teenager for Firwood Waterloo. She believes overseas stars have elevated the standard of the league and also lifted the age profile of the English prospects who appear in it.\"The international players make our league really exciting, they bring a different brand of rugby and new faces,\" she said.\"I think the rules around English-qualified players mean you have to invest in your pathway and young players otherwise there is no longevity for a team.\"Previously people may have made their debuts younger, but that doesn't happen so much now with how professional the league has become.\"",
        "There is another league that wants to recruit the biggest names in women's rugby.R360, the planned global series featuring all-star franchises sides, aims to run four women's teams as part of its event which is slated to begin in October 2026.It has been reported by the Daily Telegraph, external that R360 has made approaches to a number of Red Roses. \"I have heard very little about it,\" said Aldcroft.\"My thoughts on it? I am not really sure, at the moment I am just full-on Gloucester Hartpury and happy to be in the PWR.\"The amount we have grown the PWR over the past few years is incredible.\"Who knows what this league is going to bring? Maybe they could invest in our PWR, that would be good.\"League boss Genevieve Shore has said that she could fully understand if any PWR stars did opt to sign a larger contract in R360, but claimed a four-team competition lacked the depth and variety on offer in England and would not develop the stars of tomorrow.England, along with seven other leading nations, have ruled out picking R360 recruits for their national side.",
        "Zoe Aldcroft estimated that she got less than two hours sleep before appearing at a media conference the morning after England's Rugby World Cup win",
        "Premiership Women's Rugby - Harlequins v Loughborough Lightning",
        "Venue: Twickenham Stoop Date: Friday 24 October Kick-off: 19:30 BST",
        "Coverage: Live on BBC iPlayer and BBC Sport website & app",
        "The Red Roses were last spotted looking tired, emotional, happy and glorious.",
        "After beating Canada in the Women's Rugby World Cup final on 27 September, they celebrated long into the night at Twickenham's Cabbage Patch pub, before emerging bleary-eyed the next morning for a news conference and a public celebration at Battersea Power Station.",
        "\"It's been a bit of a whirlwind, I don't think I have taken it all in yet,\" said fly-half Holly Aitchison, nearly a month on.",
        "A week of media duties followed as the squad surfed between breakfast TV sofas, radio studios and podcast appearances, while also sneaking in some more celebrating. A trip to see Lady Gaga at the O2 strained vocal cords.",
        "The weekend after winning the final, all members of the Red Roses squad travelled to various grassroots clubs for Rugby Fest, a nationwide open day designed to draw more women's players into the sport.",
        "Second row Lilli Ives Campion went to Macclesfield, with team-mate Morwenna Talling.",
        "\"The amount of people who turned up was insane, actually crazy. There were girls coming over from rugby league teams and all over,\" she said.",
        "Then, four months after their first Rugby World Cup training camp, three weeks before the start of the season, there was a brief window for players to get away.",
        "Captain Zoe Aldcroft squeezed in two holidays, taking in the Spanish city of Malaga with her husband Luke, before joining a 10-strong Red Roses' trip to Ibiza.",
        "\"Both different, both fun!\" she said.",
        "Hannah Botterman, Emily Scarratt, Natasha Hunt, Tatyana Heard, MacKenzie Carson, Campion and Abbie Ward (a late joiner after missing her flight out) were among the Red Roses on the White Isle.",
        "\"We had a great time, we did all the classic Ibiza things, went to O Beach, which was fun,\" said Botterman",
        "\"After years going through it, chasing one goal, and then to achieve it, to be able to celebrate that with people who have done the same thing is really special.\"",
        "Allow Instagram content?",
        "This article contains content provided by Instagram.  We ask for your permission before anything is loaded, as they may be using cookies and other technologies.  You may want to read Meta’s Instagram cookie policy, external and privacy policy, external before accepting. To view this content choose ‘accept and continue’.",
        "Not everyone's celebrations were as exotic.",
        "\"I would say my celebrations have been long, but not as intense as the Ibiza crew,\" said prop Sarah Bern.",
        "\"I felt I needed some downtime to regulate myself and just to drink water for a start!",
        "\"And I actually did a bit of DIY.\"",
        "Campion says the interactions and invitations have brought home how much the team's Rugby World Cup win cut through with the general public",
        "\"I went to Northampton's win over Leicester in the Prem and the guy sat next to me messaged me after to say it was incredible to be alongside a World Cup winner,\" she said.",
        "\"I have also been to my first film premiere – it was for Christy, a film about a female boxer – and it was pretty exciting.",
        "\"You could not predict how any of this would have gone, but to do it with these incredible girls is amazing.\"",
        "Fewer than four weeks on from Twickenham glory though, the celebratory glitz and glitter shifts into a brand-new Premiership Women's Rugby (PWR) season with the stars on show for their club sides.",
        "It begins with Ellie Kildunne and her Harlequins team-mates taking on Sadia Kabeya's Loughborough Lightning in the campaign opener live on BBC Sport on Friday evening.",
        "Where are England's World Cup winners playing?",
        "Black Ferns Sae and Mikaele-Tu'u join Harlequins",
        "England's Breach signs new Saracens contract",
        "De Goede, who spent nearly a year sidelined by a serious knee injury, is back to spearhead Saracens' title challenge",
        "Saracens' Sophie de Goede, Canada's World Player of the year, also went away after the World Cup final, travelling to Portugal with three international team-mates.",
        "\"We just kind of tuned out of everything, but when I got back to London and turned my phone back on, there was this big flood of messages, showing the excitement about the whole of the World Cup,\" she said.",
        "\"So, I feel a big mix of things, pride at how well the tournament went but also devastation and disappointment and frustration at how we played in the final. It is a funny feeling holding both those emotions at the same time.",
        "\"We have four more years of fuel now though, so lots to look forward to.\"",
        "De Goede says that PWR was key to Canada's run to the final and future hopes.",
        "She was one of five Saracens players in Canada's World Cup final squad, with another six of their matchday 23 also playing in the English top flight.",
        "Saracens coach Alex Austerberry was part of Canada's backroom staff during their World Cup campaign as well.",
        "\"PWR is a strong league globally and we want to be able to play in the preeminent leagues and to continue to get better and learn winning habits,\" said De Goede.",
        "\"We needed to learn how to win big, tight games when there are lots of fans in the stadium.\"",
        "De Goede says the level of fan interest has been \"helpful\" in upping the quality of rugby, both individually for players and as a team.",
        "\"Hopefully we've helped the PWR continue to grow and get stronger as a league and put out a better product on the field,\" she added.",
        "In the wake of lifting the World Cup, England coach John Mitchell stressed that the league had to provide a conveyor belt of talent for the Red Roses.",
        "\"I love seeing 100 English girls playing in PWR, I would love to see more play because then I can have the opportunity to select more,\" he said.",
        "\"The league is a great competition because we are playing against other world-class players, but we have to be mindful that we are still growing our English players.\"",
        "Clubs are required to have an average of 13 England-qualified players in their 23-strong matchday squads.",
        "However, De Goede has been joined by other global superstars in the league this summer, with Ireland back row Aoife Wafer moving to Harlequins, Canada's Laetitia Royer coming to Saracens, Scotland wing Rhona Lloyd signing for Sale and New Zealand duo Alana Borland and Georgia Ponsonby linking up with Trailfinders.",
        "Loughborough Lightning captain and England back row Daisy Hibbert-Jones made her PWR debut as a teenager for Firwood Waterloo.",
        "She believes overseas stars have elevated the standard of the league and also lifted the age profile of the English prospects who appear in it.",
        "\"The international players make our league really exciting, they bring a different brand of rugby and new faces,\" she said.",
        "\"I think the rules around English-qualified players mean you have to invest in your pathway and young players otherwise there is no longevity for a team.",
        "\"Previously people may have made their debuts younger, but that doesn't happen so much now with how professional the league has become.\"",
        "Gloucester-Hartpury lifted a third successive PWR title with victory over Saracens in last season's final",
        "There is another league that wants to recruit the biggest names in women's rugby.",
        "R360, the planned global series featuring all-star franchises sides, aims to run four women's teams as part of its event which is slated to begin in October 2026.",
        "It has been reported by the Daily Telegraph, external that R360 has made approaches to a number of Red Roses.",
        "\"I have heard very little about it,\" said Aldcroft.",
        "\"My thoughts on it? I am not really sure, at the moment I am just full-on Gloucester Hartpury and happy to be in the PWR.",
        "\"The amount we have grown the PWR over the past few years is incredible.",
        "\"Who knows what this league is going to bring? Maybe they could invest in our PWR, that would be good.\"",
        "League boss Genevieve Shore has said that she could fully understand if any PWR stars did opt to sign a larger contract in R360, but claimed a four-team competition lacked the depth and variety on offer in England and would not develop the stars of tomorrow.",
        "England, along with seven other leading nations, have ruled out picking R360 recruits for their national side.",
        "Listen: Sport's Strangest Crimes - Bloodgate",
        "Listen to the latest Rugby Union Weekly podcast"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/rugby-union/articles/c781eyvwxlpo",
      "main_category": "sport",
      "detailed_category": "rugby-union",
      "topic": "'The perfect time to call it a night' - Scarratt retires on own terms",
      "content": [
        "England great Emily Scarratt says she could have prolonged her playing career, but that winning a second Rugby World Cup felt like the perfect conclusion to 17 years in the Test game.\"I probably could have done a bit more, but I don't think I needed to,\" the 35-year-old told Rugby Union Weekly.  \"That's why it feels right.\"It is the perfect time to call it a night. I have had an amazing time, I am in a good place, I can make this decision on my own terms.\"However, Scarratt, who announced her retirement from playing on Tuesday, admitted she has found stepping away tough.\"I have been overwhelmed, and probably a bit unsure about how I feel,\" she added.\"It's been in my mind for a little while, but it is one thing thinking it, another deciding on it, and a third continually saying it and everyone knowing.\"The bit coming back at you is the bit I struggle with - I have had some lovely messages that have tipped me over the edge a little bit with people saying some nice things.\"I am obviously a bit heavy hearted as it's the game I've loved for so long and given so much to but, on reflection, I am proud and excited about the next bit as well.\"An 18-year-old Scarratt came off the bench to score a try on her England debut against the United States in August 2008. She could have appeared for the national team a few months before, but opted to concentrate on her A-Levels, rather than go on a summer tour.Since then she has scored 754 points - an all-time Red Roses record - and was named World Player of the Year in 2019.The last of 119 caps was also against the United States, coming off the bench for a 20-minute cameo in the 2025 Rugby World Cup opener.",
        "It was Scarratt's only game time of the campaign, but she says she feels that her contribution on the sidelines and around the camp was just as crucial as her more obvious involvement in four previous World Cups.\"I genuinely really enjoyed the whole tournament, obviously I am a rugby player and therefore want to play rugby, but this tournament was slightly different and my role was not probably never going to be front and centre of playing,\" she said.\"I always have tried to be the team player, but for such a long period of my career I was always starting, therefore I think it is a lot harder to show it.\"But it has always been quite important to me to be able to show the strength of a team is the entire team, no matter what role you have within that.\"Left out of the matchday squad, Scarratt frequently carried the water bottles for the Red Roses as they closed in on victory.She had the role for the final in front of 81,885 fans as England successfully saw off Canada to win the World Cup once more.\"I was very conscious of keeping an eye on the clock and doing my job, but there was a point with about 30 seconds to go when I was on the radio,\" she remembered. \"I looked up to the coaches boxes and probably said a few expletives along with 'we're world champions'.\"That feeling in that stadium, it was unbelievable. I never thought I would experience something like that, because I didn't see it happening in our game.\"To be at home, to be successful in front of that many people - I was very glassy eyed at the end... and probably also because I knew it was going to be the end [for me] as well.\"In the aftermath of England's victory, it was reported that R360 - a proposed new global series involving top players - had contacted England stars to recruit them as figurehead signings for the inaugural 2026 edition., externalThe Rugby Football Union, in coordination with other leading nations, subsequently banned any R360 players from representing their national sides.\"I don't know if I should be offended, but I definitely wasn't approached to play in it!\" Scarratt joked.\"Potentially for the women's game, it is slightly different to the men's - we are constantly looking for investment and financial support.\"It is going to be an interesting time with players deciding whether international stuff or the lure of potential money [is the right choice for them]. I'd love there to be a place for it all.\"Scarratt will continue her involvement in the game as an assistant coach for Loughborough Lightning, a television pundit, a podcast presenter and working with the RFU on the development of young talent.",
        "This video can not be played",
        "I'm able to make this decision on my terms - Scarratt on retirement",
        "England great Emily Scarratt says she could have prolonged her playing career, but that winning a second Rugby World Cup felt like the perfect conclusion to 17 years in the Test game.",
        "\"I probably could have done a bit more, but I don't think I needed to,\" the 35-year-old told Rugby Union Weekly.  \"That's why it feels right.",
        "\"It is the perfect time to call it a night. I have had an amazing time, I am in a good place, I can make this decision on my own terms.\"",
        "However, Scarratt, who announced her retirement from playing on Tuesday, admitted she has found stepping away tough.",
        "\"I have been overwhelmed, and probably a bit unsure about how I feel,\" she added.",
        "\"It's been in my mind for a little while, but it is one thing thinking it, another deciding on it, and a third continually saying it and everyone knowing.",
        "\"The bit coming back at you is the bit I struggle with - I have had some lovely messages that have tipped me over the edge a little bit with people saying some nice things.",
        "\"I am obviously a bit heavy hearted as it's the game I've loved for so long and given so much to but, on reflection, I am proud and excited about the next bit as well.\"",
        "An 18-year-old Scarratt came off the bench to score a try on her England debut against the United States in August 2008. She could have appeared for the national team a few months before, but opted to concentrate on her A-Levels, rather than go on a summer tour.",
        "Since then she has scored 754 points - an all-time Red Roses record - and was named World Player of the Year in 2019.",
        "The last of 119 caps was also against the United States, coming off the bench for a 20-minute cameo in the 2025 Rugby World Cup opener.",
        "Scarratt came on as a second-half replacement against the United States in the Rugby World Cup opener at Sunderland's Stadium of Light",
        "It was Scarratt's only game time of the campaign, but she says she feels that her contribution on the sidelines and around the camp was just as crucial as her more obvious involvement in four previous World Cups.",
        "\"I genuinely really enjoyed the whole tournament, obviously I am a rugby player and therefore want to play rugby, but this tournament was slightly different and my role was not probably never going to be front and centre of playing,\" she said.",
        "\"I always have tried to be the team player, but for such a long period of my career I was always starting, therefore I think it is a lot harder to show it.",
        "\"But it has always been quite important to me to be able to show the strength of a team is the entire team, no matter what role you have within that.\"",
        "Left out of the matchday squad, Scarratt frequently carried the water bottles for the Red Roses as they closed in on victory.",
        "She had the role for the final in front of 81,885 fans as England successfully saw off Canada to win the World Cup once more.",
        "\"I was very conscious of keeping an eye on the clock and doing my job, but there was a point with about 30 seconds to go when I was on the radio,\" she remembered.",
        "\"I looked up to the coaches boxes and probably said a few expletives along with 'we're world champions'.",
        "\"That feeling in that stadium, it was unbelievable. I never thought I would experience something like that, because I didn't see it happening in our game.",
        "\"To be at home, to be successful in front of that many people - I was very glassy eyed at the end... and probably also because I knew it was going to be the end [for me] as well.\"",
        "In the aftermath of England's victory, it was reported that R360 - a proposed new global series involving top players - had contacted England stars to recruit them as figurehead signings for the inaugural 2026 edition., external",
        "The Rugby Football Union, in coordination with other leading nations, subsequently banned any R360 players from representing their national sides.",
        "\"I don't know if I should be offended, but I definitely wasn't approached to play in it!\" Scarratt joked.",
        "\"Potentially for the women's game, it is slightly different to the men's - we are constantly looking for investment and financial support.",
        "\"It is going to be an interesting time with players deciding whether international stuff or the lure of potential money [is the right choice for them]. I'd love there to be a place for it all.\"",
        "Scarratt will continue her involvement in the game as an assistant coach for Loughborough Lightning, a television pundit, a podcast presenter and working with the RFU on the development of young talent.",
        "Listen: Sport's Strangest Crimes - Bloodgate",
        "Listen to the latest Rugby Union Weekly podcast"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/rugby-union/articles/c867wze69lqo",
      "main_category": "sport",
      "detailed_category": "rugby-union",
      "topic": "'Lost for words', 'England, get him in' - how good is five-try Caluori?",
      "content": [
        "English rugby union may well have witnessed the birth of a superstar on Saturday.Teenage winger Noah Caluori scored five tries as he inspired Saracens to a 65-14 win over Sale Sharks on a simply stunning full Premiership debut.Caluori's 6ft 5in frame was too much for the Sale defence to handle as he ran them ragged time and again, both in the air and on the ground.Former Wales captain Sam Warburton was so dazzled he thinks England boss Steve Borthwick should call up the 19-year-old for the Autumn internationals.\"I haven't seen a player this good in the air, ever, and he's a teenager,\" said Warburton in his role as a TNT Sports pundit.\"Get him in the England squad. He's got it. This kid is going to be amazing.\"",
        "Former England winger Chris Ashton, another TNT pundit, said he was \"lost for words\" after watching Caluori's explosive performance.Caluori even emulated ex-Sarries hero Ashton's trademark swan dive scoring celebration - and that's not all Ashton thinks the teenager might take from him.\"He'll only need 20 games to get [my] record if he plays like that,\" joked Ashton, referencing his own status as all-time top-flight leading try scorer with 101.\"I've seen his ability in the air, but he's gliding past players with ease which you don't see very often. He's scored three or four really good tries, you might get one [normally].\"He's in a great team and, yes, Sale went down to 14 men, but in the first half, Sale didn't know how to deal with his ability in the air. To get five tries on your first start is... I'm lost for words. It is that good.\"Has he set the bar too high?\"Even beaten Sale boss Alex Sanderson could not hide his admiration.\"I don't think it could have gone any better for him. Five tries? He beat us alone in that sense, if you look at the scoreline,\" Sanderson said.\"Fair play to him, he was brilliant and he was as dangerous with the ball in the wide channels as he was with the ball aerially. He's a rare talent.\"",
        "Caluori's future looks incredibly bright and it would be easy to see his stunning display as a launching pad for a successful career in club and international rugby.But Saracens director of rugby Mark McCall warned against such expectations hitting too lofty levels.\"Noah's aerial ability is unique, but everyone has got to take a breath,\" McCall said.\"He's quite a special player and a great kid as well. He's a very balanced and sensible young fella who is obviously going to get a lot of attention.\"He's capable of dealing with that, but he's not the perfect player yet – far from it.\"He knows he has a lot of things to improve on. His ceiling's absolutely huge, but let's enjoy him and let him grow in the right way.\"McCall also warned Caluori needs to be looked after as his burgeoning reputation continues to grow.\"There's a responsibility and duty of care to a very young man, on us as a club and the media as well, to protect him and look after him in the right way,\" he added.",
        "Caluori was visibly ecstatic with his night's work, and said he would re-live the experience as soon as he could.\"I'm probably going to watch it back and think 'how did this happen?',\" Caluori told TNT.\"I just wanted to take the opportunity and make the most out of it. As a team, we had a set goal this week to going back to being ruthless, bouncing back to zero and going again, putting our all into this game.\"I was speaking to my mates back home saying I couldn't believe names like Maro Itoje are my team-mates now. All of us youngsters are trying to learn as much as we can from them.\"Itoje might well be his team-mate for both club and country, if Caluori keeps up the form he showed on Saturday.And for former British & Irish Lions skipper Warburton, that should happen sooner rather than later.\"I cannot believe the height he can get off the ground - he's almost undefendable,\" Warburton added.\"I've never seen anyone like him. I'm not saying you'd start him, but get him in the [England] environment. I'm telling you now, he's going to be a special player.\"",
        "Noah Caluori is an England under-21 international",
        "English rugby union may well have witnessed the birth of a superstar on Saturday.",
        "Teenage winger Noah Caluori scored five tries as he inspired Saracens to a 65-14 win over Sale Sharks on a simply stunning full Premiership debut.",
        "Caluori's 6ft 5in frame was too much for the Sale defence to handle as he ran them ragged time and again, both in the air and on the ground.",
        "Former Wales captain Sam Warburton was so dazzled he thinks England boss Steve Borthwick should call up the 19-year-old for the Autumn internationals.",
        "\"I haven't seen a player this good in the air, ever, and he's a teenager,\" said Warburton in his role as a TNT Sports pundit.",
        "\"Get him in the England squad. He's got it. This kid is going to be amazing.\"",
        "Former England winger Chris Ashton, another TNT pundit, said he was \"lost for words\" after watching Caluori's explosive performance.",
        "Caluori even emulated ex-Sarries hero Ashton's trademark swan dive scoring celebration - and that's not all Ashton thinks the teenager might take from him.",
        "\"He'll only need 20 games to get [my] record if he plays like that,\" joked Ashton, referencing his own status as all-time top-flight leading try scorer with 101.",
        "\"I've seen his ability in the air, but he's gliding past players with ease which you don't see very often. He's scored three or four really good tries, you might get one [normally].",
        "\"He's in a great team and, yes, Sale went down to 14 men, but in the first half, Sale didn't know how to deal with his ability in the air. To get five tries on your first start is... I'm lost for words. It is that good.",
        "\"Has he set the bar too high?\"",
        "Even beaten Sale boss Alex Sanderson could not hide his admiration.",
        "\"I don't think it could have gone any better for him. Five tries? He beat us alone in that sense, if you look at the scoreline,\" Sanderson said.",
        "\"Fair play to him, he was brilliant and he was as dangerous with the ball in the wide channels as he was with the ball aerially. He's a rare talent.\"",
        "Four of Noah Caluori's five tries against Sale came in the second half",
        "Caluori's future looks incredibly bright and it would be easy to see his stunning display as a launching pad for a successful career in club and international rugby.",
        "But Saracens director of rugby Mark McCall warned against such expectations hitting too lofty levels.",
        "\"Noah's aerial ability is unique, but everyone has got to take a breath,\" McCall said.",
        "\"He's quite a special player and a great kid as well. He's a very balanced and sensible young fella who is obviously going to get a lot of attention.",
        "\"He's capable of dealing with that, but he's not the perfect player yet – far from it.",
        "\"He knows he has a lot of things to improve on. His ceiling's absolutely huge, but let's enjoy him and let him grow in the right way.\"",
        "McCall also warned Caluori needs to be looked after as his burgeoning reputation continues to grow.",
        "\"There's a responsibility and duty of care to a very young man, on us as a club and the media as well, to protect him and look after him in the right way,\" he added.",
        "Caluori was visibly ecstatic with his night's work, and said he would re-live the experience as soon as he could.",
        "\"I'm probably going to watch it back and think 'how did this happen?',\" Caluori told TNT.",
        "\"I just wanted to take the opportunity and make the most out of it. As a team, we had a set goal this week to going back to being ruthless, bouncing back to zero and going again, putting our all into this game.",
        "\"I was speaking to my mates back home saying I couldn't believe names like Maro Itoje are my team-mates now. All of us youngsters are trying to learn as much as we can from them.\"",
        "Itoje might well be his team-mate for both club and country, if Caluori keeps up the form he showed on Saturday.",
        "And for former British & Irish Lions skipper Warburton, that should happen sooner rather than later.",
        "\"I cannot believe the height he can get off the ground - he's almost undefendable,\" Warburton added.",
        "\"I've never seen anyone like him. I'm not saying you'd start him, but get him in the [England] environment. I'm telling you now, he's going to be a special player.\""
      ]
    },
    {
      "url": "https://www.bbc.com/sport/rugby-union/articles/ckgz0yjlv7vo",
      "main_category": "sport",
      "detailed_category": "rugby-union",
      "topic": "'If it's not R360, another disrupter will come for rugby'",
      "content": [
        "You may dimly remember the Indian Cricket League.Launched by billionaire media baron Subhash Chandra in 2007, it was, at the time, a revolutionary idea; a T20 tournament based in India and played by the biggest stars in world cricket.Indian great Kapil Dev was the frontman, with Brian Lara, Inzamam-ul-Haq and Chris Cairns the big-hitting overseas headliners for the first edition. The final was played at a packed-out stadium to a backdrop of blaring music, cheerleaders and Bollywood stars.The Board of Control for Cricket in India (BCCI), the governing body of the sport in the country, was, publicly at least, not impressed.It called the unsanctioned ICL a \"veterans' series no-one will want to watch\", blocked any players involved from representing India and convinced other countries to bring in similar Test bans.It then duly set up the Indian Premier League (IPL) - an almost identical concept - which bloomed into the biggest tournament in the sport, with media rights worth billions., externalIt is a lesson Rowena Samarasinhe says rugby needs to heed.\"It took a few years to get its rhythm, but now no-one can imagine a life without the IPL now,\" she says.",
        "Samarasinhe hoped that the World 12s would be rugby's equivalent. She was chief executive of the proposed event, the most recent rebel disrupter to the game before R360.World 12s aimed to launch in August 2022, staging an annual three-week 12-a-side event, featuring the sport's biggest names, in a major global city.Ultimately, despite blue-chip ambassadors such as former All Blacks captain Kieran Read and Springbok legend Schalk Burger, and promises that stars could earn in excess of £250,000 for less than a month's work, it failed to get off the ground.Samarasinhe says the concepts will keep coming though unless rugby, like the BCCI, seizes the opportunity itself.\"I still believe in what we were doing was right,\" she says.\"World Rugby are going to keep getting hit - if it's not R360, if it's not World 12s, it's going to be something else.\"Actually they need to innovate the sport. My point to rugby's authorities is why don't we do something from within, rather than waiting for someone to come from outside?\"Despite leading unions and rugby league's NRL insisting recruits will be exiled from their teams, R360's organisers are confident they can still fill out teams for their October 2026 start date.Samarasinhe has seen the enthusiasm among players for a potential bumper pay day.\"I would say 99% of the players I spoke to were so excited about it,\" she says of her experience with World 12s.\"They were asking me what they could do to help get this off the ground.\"I think a large part of that was, quite transparently, the money, because we know that rugby players do not earn enough money across their careers, but there was also the chance to play a new format alongside players they only ever play against normally.\"",
        "World 12s faced the twin challenges that R360, or any other rugby start-up, face. Investors want to know players are on board before they commit, while players want to know the money is there before they break cover and sign up.\"It is a real chicken-and-egg situation,\" says Samarasinhe, who fielded interest from more than 500 players in World 12s.\"The first thing investors will ask is where are all the players. My investor with World 12s wanted to send a list of 200 players, who had signed provisional agreements, to World Rugby.\"But I was never going to put the players on the line until I was clear that there was a path to success.\"Ultimately, for World 12s, there wasn't.It struggled to find a national union who would back the idea to the rest of World Rugby. The 12-a-side format, unlike 15, Sevens or 10s, wasn't part of the law book. Investment got complicated.In October 2021, World Rugby said it did not \"wish to explore the concept further at this time\", effectively ending World 12s' hopes of becoming reality.Compared to R360, World 12s would have had little impact on rugby's calendar.It hoped to run for three weeks in one location - Los Angeles was pegged as host for the first edition - in August.It would pay a release fee, putting much-needed money back into players' clubs. It planned to field players from second-tier rugby nations alongside superstars to grow the game globally.R360's approach is more expansive and aggressive, with an itinerary that covers the globe and eats up five months of the year.Its players would be signed permanently from clubs, removing stars from the existing domestic game.",
        "R360 spoke to Samarasinhe more than a year ago as they plotted out their own concept.\"I'm not convinced about it,\" she says.\"How will R360 fill stadiums in Miami and all of these cool, glamorous places?\"Will people travel for it? Or will you rely on local people? I don't know if they have underestimated that task.\"I think if you do an enclosed tournament, then you create that sort of major-event buzz.\"I was very passionate about launching in Los Angeles, because it is a big sports city with an appetite for the new, different and disruptive.\"R360 will hope that appetite is keen and widespread enough to ensure their own venture takes flight.\"Staying stagnant isn't going help us in rugby,\" concludes Samarasinhe.\"We need to do something, and not more of the same.\"",
        "Samarasinhe is now managing director of GENSport, a consultancy specialising in women's sport",
        "You may dimly remember the Indian Cricket League.",
        "Launched by billionaire media baron Subhash Chandra in 2007, it was, at the time, a revolutionary idea; a T20 tournament based in India and played by the biggest stars in world cricket.",
        "Indian great Kapil Dev was the frontman, with Brian Lara, Inzamam-ul-Haq and Chris Cairns the big-hitting overseas headliners for the first edition. The final was played at a packed-out stadium to a backdrop of blaring music, cheerleaders and Bollywood stars.",
        "The Board of Control for Cricket in India (BCCI), the governing body of the sport in the country, was, publicly at least, not impressed.",
        "It called the unsanctioned ICL a \"veterans' series no-one will want to watch\", blocked any players involved from representing India and convinced other countries to bring in similar Test bans.",
        "It then duly set up the Indian Premier League (IPL) - an almost identical concept - which bloomed into the biggest tournament in the sport, with media rights worth billions., external",
        "It is a lesson Rowena Samarasinhe says rugby needs to heed.",
        "\"It took a few years to get its rhythm, but now no-one can imagine a life without the IPL now,\" she says.",
        "Former England centre and 2003 Rugby World Cup winner Mike Tindall is one of the founders of R360",
        "Samarasinhe hoped that the World 12s would be rugby's equivalent. She was chief executive of the proposed event, the most recent rebel disrupter to the game before R360.",
        "World 12s aimed to launch in August 2022, staging an annual three-week 12-a-side event, featuring the sport's biggest names, in a major global city.",
        "Ultimately, despite blue-chip ambassadors such as former All Blacks captain Kieran Read and Springbok legend Schalk Burger, and promises that stars could earn in excess of £250,000 for less than a month's work, it failed to get off the ground.",
        "Samarasinhe says the concepts will keep coming though unless rugby, like the BCCI, seizes the opportunity itself.",
        "\"I still believe in what we were doing was right,\" she says.",
        "\"World Rugby are going to keep getting hit - if it's not R360, if it's not World 12s, it's going to be something else.",
        "\"Actually they need to innovate the sport. My point to rugby's authorities is why don't we do something from within, rather than waiting for someone to come from outside?\"",
        "Despite leading unions and rugby league's NRL insisting recruits will be exiled from their teams, R360's organisers are confident they can still fill out teams for their October 2026 start date.",
        "Samarasinhe has seen the enthusiasm among players for a potential bumper pay day.",
        "\"I would say 99% of the players I spoke to were so excited about it,\" she says of her experience with World 12s.",
        "\"They were asking me what they could do to help get this off the ground.",
        "\"I think a large part of that was, quite transparently, the money, because we know that rugby players do not earn enough money across their careers, but there was also the chance to play a new format alongside players they only ever play against normally.\"",
        "George Ford has turned his back on an R360 approach to sign a contract extension with Sale",
        "World 12s faced the twin challenges that R360, or any other rugby start-up, face. Investors want to know players are on board before they commit, while players want to know the money is there before they break cover and sign up.",
        "\"It is a real chicken-and-egg situation,\" says Samarasinhe, who fielded interest from more than 500 players in World 12s.",
        "\"The first thing investors will ask is where are all the players. My investor with World 12s wanted to send a list of 200 players, who had signed provisional agreements, to World Rugby.",
        "\"But I was never going to put the players on the line until I was clear that there was a path to success.\"",
        "Ultimately, for World 12s, there wasn't.",
        "It struggled to find a national union who would back the idea to the rest of World Rugby. The 12-a-side format, unlike 15, Sevens or 10s, wasn't part of the law book. Investment got complicated.",
        "In October 2021, World Rugby said it did not \"wish to explore the concept further at this time\", effectively ending World 12s' hopes of becoming reality.",
        "Compared to R360, World 12s would have had little impact on rugby's calendar.",
        "It hoped to run for three weeks in one location - Los Angeles was pegged as host for the first edition - in August.",
        "It would pay a release fee, putting much-needed money back into players' clubs. It planned to field players from second-tier rugby nations alongside superstars to grow the game globally.",
        "R360's approach is more expansive and aggressive, with an itinerary that covers the globe and eats up five months of the year.",
        "Its players would be signed permanently from clubs, removing stars from the existing domestic game.",
        "England's Ford turned down R360 to stay at Sale",
        "Nations issue international ban on R360 players",
        "Questions mount for rebel R360 circuit",
        "R360 spoke to Samarasinhe more than a year ago as they plotted out their own concept.",
        "\"I'm not convinced about it,\" she says.",
        "\"How will R360 fill stadiums in Miami and all of these cool, glamorous places?",
        "\"Will people travel for it? Or will you rely on local people? I don't know if they have underestimated that task.",
        "\"I think if you do an enclosed tournament, then you create that sort of major-event buzz.",
        "\"I was very passionate about launching in Los Angeles, because it is a big sports city with an appetite for the new, different and disruptive.\"",
        "R360 will hope that appetite is keen and widespread enough to ensure their own venture takes flight.",
        "\"Staying stagnant isn't going help us in rugby,\" concludes Samarasinhe.",
        "\"We need to do something, and not more of the same.\"",
        "Listen: Sport's Strangest Crimes - Bloodgate",
        "Listen to the latest Rugby Union Weekly podcast"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/rugby-union/articles/c0jdpdj22p8o",
      "main_category": "sport",
      "detailed_category": "rugby-union",
      "topic": "How Leicester's Ilione juggles time in scrubs and scrums",
      "content": [
        "Emeka Ilione knows there are \"no shortcuts\" to get him where he wants to go.He was Leicester Tigers' breakout star last season who is now in his final year as a medical student.The 23-year-old back-row has spent as much time in blue scrubs over the past few years than he has in the green, red and white of the Tigers.Ilione says he has got used to bouncing between hospital wards and Leicester's home of Mattioli Woods Welford Road, where he has forged a fearsome reputation as a ball-carrier and grabbed the attention of England bosses familiar with his juggling act.The former England Under-20 captain was called up to the senior national team for a training camp for the first time in May.England head coach Steve Borthwick was Tigers boss when, as a teenager coming through Leicester's academy, Ilione got the news that he had been accepted into medical school at the University of Nottingham.\"The club made it very clear that as long as I'm working hard and as long as I communicate early, it's something that they would support me and help me through,\" Ilione said of efforts to juggle his playing career and medical studies.\"The university has done exactly the same - as long as I communicate early and I'm proactive and I'm staying on top of the academics and placement and doing everything I need to do, then they're willing to support me.\"If you're going to be a doctor you can't have shortcuts to it. I get leeway in terms of I go in on Saturdays and Sundays to pick up placements, but I still have to do the same as everyone else. #\"There's not a case of me getting special treatment in that regard.\"",
        "It was three years ago that Mansfield-born Ilione spoke to BBC Radio Leicester about contemplating a future in epidemiology or cardiology, while pursing what was then still only an embryonic rugby career at Leicester.He made his Premiership debut for the club in January 2023 and by December had earned his first league start - although it was another campaign in which he saw more action for the Tigers in the second-string cup competition than the league itself.That all changed under head coach Michael Cheika last season, with Ilione making 17 league appearances while also starting in a European Champions Cup match for for the first time.He was constantly used as a wrecking ball off the bench, and that's the role he played when he stormed over for a late try in June's Premiership Grand Final to set up a thrilling – if ultimately futile – attempt to overpower Bath in the dying moments of the decider at Twickenham.Ilione says the impact he made at the national stadium that day was only partly down to how he has learned to throw his weight around – all 115kg, packed into his 6ft 2in (1.88m) frame.\"I'm probably the strongest and fittest I've ever been, which obviously helps,\" he told BBC Radio Leicester.\"But it's sort of the mindset around when you're carrying - having the internal belief that you are a good carrier and that you can get through the contact and that the team needs you to go forward, so you do go forward.\"In three Prem games this season, Ilione is already being relied on to do that more than ever before.He has started every league game under new coach Geoff Parling, with two appearances at flanker before being moved to number eight in Saturday's East Midlands derby defeat by Northampton Saints.Ilione is relishing the \"intensity and standards\" being demanded by the rookie head coach, and added that their one-to-one work on \"details and accuracy\" has helped him find \"that right headspace\" when playing.\"I'm someone who likes to overthink, so if I can have as little information in my head and just play on instinct, then that's the perfect place for me,\" Ilione said.",
        "Emeka Ilione emerged from the Leicester Tigers academy",
        "Emeka Ilione knows there are \"no shortcuts\" to get him where he wants to go.",
        "He was Leicester Tigers' breakout star last season who is now in his final year as a medical student.",
        "The 23-year-old back-row has spent as much time in blue scrubs over the past few years than he has in the green, red and white of the Tigers.",
        "Ilione says he has got used to bouncing between hospital wards and Leicester's home of Mattioli Woods Welford Road, where he has forged a fearsome reputation as a ball-carrier and grabbed the attention of England bosses familiar with his juggling act.",
        "The former England Under-20 captain was called up to the senior national team for a training camp for the first time in May.",
        "England head coach Steve Borthwick was Tigers boss when, as a teenager coming through Leicester's academy, Ilione got the news that he had been accepted into medical school at the University of Nottingham.",
        "\"The club made it very clear that as long as I'm working hard and as long as I communicate early, it's something that they would support me and help me through,\" Ilione said of efforts to juggle his playing career and medical studies.",
        "\"The university has done exactly the same - as long as I communicate early and I'm proactive and I'm staying on top of the academics and placement and doing everything I need to do, then they're willing to support me.",
        "\"If you're going to be a doctor you can't have shortcuts to it. I get leeway in terms of I go in on Saturdays and Sundays to pick up placements, but I still have to do the same as everyone else. #",
        "\"There's not a case of me getting special treatment in that regard.\"",
        "Listen to the Tigers Rugby Show on BBC Radio Leicester",
        "Ilione balances Tigers career with medical degree",
        "It was three years ago that Mansfield-born Ilione spoke to BBC Radio Leicester about contemplating a future in epidemiology or cardiology, while pursing what was then still only an embryonic rugby career at Leicester.",
        "He made his Premiership debut for the club in January 2023 and by December had earned his first league start - although it was another campaign in which he saw more action for the Tigers in the second-string cup competition than the league itself.",
        "That all changed under head coach Michael Cheika last season, with Ilione making 17 league appearances while also starting in a European Champions Cup match for for the first time.",
        "He was constantly used as a wrecking ball off the bench, and that's the role he played when he stormed over for a late try in June's Premiership Grand Final to set up a thrilling – if ultimately futile – attempt to overpower Bath in the dying moments of the decider at Twickenham.",
        "Ilione says the impact he made at the national stadium that day was only partly down to how he has learned to throw his weight around – all 115kg, packed into his 6ft 2in (1.88m) frame.",
        "\"I'm probably the strongest and fittest I've ever been, which obviously helps,\" he told BBC Radio Leicester.",
        "\"But it's sort of the mindset around when you're carrying - having the internal belief that you are a good carrier and that you can get through the contact and that the team needs you to go forward, so you do go forward.\"",
        "In three Prem games this season, Ilione is already being relied on to do that more than ever before.",
        "He has started every league game under new coach Geoff Parling, with two appearances at flanker before being moved to number eight in Saturday's East Midlands derby defeat by Northampton Saints.",
        "Ilione is relishing the \"intensity and standards\" being demanded by the rookie head coach, and added that their one-to-one work on \"details and accuracy\" has helped him find \"that right headspace\" when playing.",
        "\"I'm someone who likes to overthink, so if I can have as little information in my head and just play on instinct, then that's the perfect place for me,\" Ilione said."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/rugby-union/articles/cdr61plm727o",
      "main_category": "sport",
      "detailed_category": "rugby-union",
      "topic": "Blowing whistle on racism killed my career - Burrell",
      "content": [
        "Warning: This article contains details of racially offensive language and behaviour",
        "Former England centre Luther Burrell says going public to reveal racism in rugby union brought his career to an early end.In a June 2022 interview with the Mail on Sunday, external, Burrell described racism as being \"rife\" in the game, showing Whatsapp messages and recalling training ground \"jokes\" he had been subject to while playing for Newcastle.Then 34 and out of contract, Burrell's only professional rugby since has been three appearances with invitational side the Barbarians.\"I have absolutely had to retire because of what went on,\" said Burrell, who spent seven years at Northampton before joining Newcastle.\"I wanted to carry on playing, of course I did. I pursued that, and it fell through when word came out that there were investigations going on.\"That was difficult - I had to just accept the fate and accept that this whole process is a lot bigger than me.\"A Rugby Football Union (RFU) report in April 2023 found Burrell's claims were true \"on the balance of probability\", but said it could not collect enough evidence to definitively say they occurred at Newcastle., external",
        "Burrell told BBC Sport he also faced prejudice within the England set-up, during a Test career that saw him win 15 caps after his debut in February 2014.\"I've had several traumatic experiences within England camp,\" he said.\"Some discrimination and some just old-school mentality that's really unacceptable.\"Racism had become normalised in dressing rooms, in Burrell's experience.\"It's something that has been dressed up as banter and that's been the problem that I've personally suffered and seen,\" said Burrell, who is of Jamaican descent.\"Over a period of time you just learn to believe that it's the norm and that is fine and that it's not malicious, but that's nonsense.\"Burrell says he was eventually spurred to speak out after a team-mate at Newcastle referred to him as a \"slave\" and told him to put sun cream on his wrists and ankles \"where your shackles were\".The RFU said Burrell's revelations had led to \"a deeper look at the culture within the elite game and to the implementation of an action plan for the professional game\".\"The RFU has placed significant focus on inclusion and diversity in rugby union and a great deal of work undertaken both before and since Luther Burrell came forward and shared his experiences of racism and classism,\" it added.\"We are continuing work with clubs and stakeholders in the professional game to strive for a culture of inclusivity but acknowledge this takes time and is an ongoing process.\"Every Prem and PWR club now has face-to-face education on building inclusive cultures, with its success monitored via individual reports and surveys.All England players, including age-grade squads, are trained in being \"active bystanders\" to intervene and protect others from harmful behaviour.\"You should be so proud of what you have done,\" Burrell's mother Joyce told him as part of the BBC iPlayer documentary Luther Burrell - Rugby, Racism and Redemption.\"I know it has had this effect on you and finished your career, but in our eyes, you have done so well. We are so proud of you and to have you as a son.\"Burrell's father Geoff died shortly after the filming of the documentary, and his sister died earlier this year.",
        "Burrell, who grew up on a council estate in Huddersfield, continues his work to make the game more open.His 12 Foundation aims to reach children in under-served communities and help them thrive on and off the pitch with free sports coaching, mentoring and nutrition education.\"My intentions are pure, I want to see the evolution of the game and if nobody else is prepared to share their story then I'll continue to fight that fight because I'm not just doing this for myself,\" he said.\"We have an obligation to make the sport as great as it can be and the more I talk about it hopefully the more comfortable others will feel about sharing their own stories as well.\"I need to grab the bull by the horns and keep carrying this flag and keep carrying this weight and do what I can to create opportunities and make the sport more attractive and more inclusive.\"There's a lot of underprivileged children and a lot of poverty and I honestly believe that rugby has the ability to transform their lives, just as it did for me.\"",
        "If you are affected by any of the issues in this article you can find details of organisations that can help via the BBC Action Line.",
        "This video can not be played",
        "Burrell: 'I wanted to carry on playing'",
        "Warning: This article contains details of racially offensive language and behaviour",
        "Former England centre Luther Burrell says going public to reveal racism in rugby union brought his career to an early end.",
        "In a June 2022 interview with the Mail on Sunday, external, Burrell described racism as being \"rife\" in the game, showing Whatsapp messages and recalling training ground \"jokes\" he had been subject to while playing for Newcastle.",
        "Then 34 and out of contract, Burrell's only professional rugby since has been three appearances with invitational side the Barbarians.",
        "\"I have absolutely had to retire because of what went on,\" said Burrell, who spent seven years at Northampton before joining Newcastle.",
        "\"I wanted to carry on playing, of course I did. I pursued that, and it fell through when word came out that there were investigations going on.",
        "\"That was difficult - I had to just accept the fate and accept that this whole process is a lot bigger than me.\"",
        "A Rugby Football Union (RFU) report in April 2023 found Burrell's claims were true \"on the balance of probability\", but said it could not collect enough evidence to definitively say they occurred at Newcastle., external",
        "Luther Burrell started all of England's Six Nations games in 2014 and 2015, but was controversially overlooked for their squad for the 2015 World Cup",
        "Burrell told BBC Sport he also faced prejudice within the England set-up, during a Test career that saw him win 15 caps after his debut in February 2014.",
        "\"I've had several traumatic experiences within England camp,\" he said.",
        "\"Some discrimination and some just old-school mentality that's really unacceptable.\"",
        "Racism had become normalised in dressing rooms, in Burrell's experience.",
        "\"It's something that has been dressed up as banter and that's been the problem that I've personally suffered and seen,\" said Burrell, who is of Jamaican descent.",
        "\"Over a period of time you just learn to believe that it's the norm and that is fine and that it's not malicious, but that's nonsense.\"",
        "Burrell says he was eventually spurred to speak out after a team-mate at Newcastle referred to him as a \"slave\" and told him to put sun cream on his wrists and ankles \"where your shackles were\".",
        "The RFU said Burrell's revelations had led to \"a deeper look at the culture within the elite game and to the implementation of an action plan for the professional game\".",
        "\"The RFU has placed significant focus on inclusion and diversity in rugby union and a great deal of work undertaken both before and since Luther Burrell came forward and shared his experiences of racism and classism,\" it added.",
        "\"We are continuing work with clubs and stakeholders in the professional game to strive for a culture of inclusivity but acknowledge this takes time and is an ongoing process.\"",
        "Every Prem and PWR club now has face-to-face education on building inclusive cultures, with its success monitored via individual reports and surveys.",
        "All England players, including age-grade squads, are trained in being \"active bystanders\" to intervene and protect others from harmful behaviour.",
        "\"You should be so proud of what you have done,\" Burrell's mother Joyce told him as part of the BBC iPlayer documentary Luther Burrell - Rugby, Racism and Redemption.",
        "\"I know it has had this effect on you and finished your career, but in our eyes, you have done so well. We are so proud of you and to have you as a son.\"",
        "Burrell's father Geoff died shortly after the filming of the documentary, and his sister died earlier this year.",
        "Luther Burrell - Rugby, Racism and Redemption",
        "Burrell, who grew up on a council estate in Huddersfield, continues his work to make the game more open.",
        "His 12 Foundation aims to reach children in under-served communities and help them thrive on and off the pitch with free sports coaching, mentoring and nutrition education.",
        "\"My intentions are pure, I want to see the evolution of the game and if nobody else is prepared to share their story then I'll continue to fight that fight because I'm not just doing this for myself,\" he said.",
        "\"We have an obligation to make the sport as great as it can be and the more I talk about it hopefully the more comfortable others will feel about sharing their own stories as well.",
        "\"I need to grab the bull by the horns and keep carrying this flag and keep carrying this weight and do what I can to create opportunities and make the sport more attractive and more inclusive.",
        "\"There's a lot of underprivileged children and a lot of poverty and I honestly believe that rugby has the ability to transform their lives, just as it did for me.\"",
        "Burrell scored for the Barbarians on a return to former club Northampton in November 2022",
        "If you are affected by any of the issues in this article you can find details of organisations that can help via the BBC Action Line.",
        "Listen to the latest Rugby Union Weekly podcast"
      ]
    }
  ]
}