{
  "scraped_at": "2025-10-27T18:56:59.771546",
  "total_articles": 20,
  "category": "cricket",
  "articles_per_category": 100,
  "articles": [
    {
      "url": "https://www.bbc.com/sport/cricket/articles/cvgd975xpn2o",
      "main_category": "sport",
      "detailed_category": "cricket",
      "topic": "'Out of time' - Cummins ruled out of first Ashes Test",
      "content": [
        "Australia have confirmed captain Pat Cummins will not be fit for the first Ashes Test, with Steve Smith set to lead the side in his absence.Talismanic fast bowler Cummins has been suffering with a back injury and said earlier this month he was \"less than likely\" to feature in the first Test in Perth on 21 November.Although the 32-year-old has \"run out of time\" for the series opener, he is returning to bowling in the nets this week and head coach Andrew McDonald said he was \"really optimistic\" Cummins would be available for the second Test in Brisbane starting 4 December.\"We've grappled with it for a little while, and the nature of the injury is that you grapple with it day-by-day,\" McDonald said. \"We're really optimistic and hopeful for the second Test match. He'll be back bowling this week, that's a huge step.\"It is a huge blow for Australia to lose their influential captain and premier fast bowler.Reports of fitness doubts first appeared in September, with Cummins then ruled out of the white-ball series against New Zealand and India with a lumbar stress fracture.Speaking two weeks ago, Cummins said time was beginning to get \"tight\" for the first Test, because he needed at least a month in the nets in order to be match-fit.Cummins was appointed captain on the eve of the last Ashes series in Australia in 2021-22. The home side won 4-0 despite Cummins missing the second Test because of a Covid scare.He led Australia to win the World Test Championship and World Cup in 2023, the same year the Ashes series in the UK was drawn 2-2.",
        "In terms of the captaincy, Smith is a more than able replacement. The 36-year-old is himself an Ashes-winning skipper and only lost the captaincy in 2018 because of the 'sandpapergate' ball-tampering scandal.The batter, one of the all-time great Ashes run-scorers, has stood in for Cummins as captain on six previous occasions.Cummins' place in the bowling attack is likely to go to Scott Boland, who has a peerless average of 12.63 in Test in Australia. Boland, 36, is likely to join Mitchell Starc and Josh Hazlewood, both also in their mid-30s, in a seam attack for a gruelling five-Test series crammed into just over seven weeks. \"Losing your captain is not ideal, but when you're talking about Scott Boland as a potential replacement, it's not a bad position to be in,\" McDonald said. With or without Cummins, Australia are likely to have to call on some inexperienced or untried reserves like Michael Neser, Brendan Doggett, or Fergus O'Neill, although McDonald has not ruled out a Test return for Mitchell Marsh. Australia's white-ball captain, who earned the most recent of his 46 caps last December, averages 28.5 with the bat and 40.4 with the ball in Tests. \"We would be comfortable picking someone, and if you want to put a name to it Mitch Marsh, out of white-ball cricket, if we felt like that was going to benefit the Test team,\" said McDonald. \"We feel he's batting as well as he has for a long period of time. We still haven't given up on Mitch Marsh's Test career.\"",
        "The question over what involvement Cummins may have and the bowlers Australia could use fuels the suspicion that pace bowling will be a determining factor in the eventual Ashes winners.England have named a battery of quick bowlers in their squad, probably the most hostile group they have sent down under since 1970.There are questions over some members of the attack. Mark Wood has not played a Test since August of last year, Jofra Archer has a long injury history, while all of Gus Atkinson, Brydon Carse and Josh Tongue have had lay-offs in the past year.England's Ashes squad is slowly assembling, with many in the side beaten by New Zealand in the opening one-day international on Sunday.Others, like Wood and Tongue, are not part of the New Zealand series but are in the country as part of their preparations.Captain Ben Stokes is one of the later members to travel after spending time with the England rugby league team before their first Ashes Test against Australia on Saturday.Stokes has not played since July because of a shoulder injury, yet is thought to be on course for the first Ashes Test. England play their only warm-up match, against an England Lions team, in Perth on 13 November.All-rounder Stokes has not played a full part in any of England's past four Test series because of a variety of injuries.It could be the Ashes is ultimately decided by which of captains Cummins and Stokes is able to spend most time on the field.",
        "Pat Cummins has been Australia Test captain since November 2021",
        "Australia have confirmed captain Pat Cummins will not be fit for the first Ashes Test, with Steve Smith set to lead the side in his absence.",
        "Talismanic fast bowler Cummins has been suffering with a back injury and said earlier this month he was \"less than likely\" to feature in the first Test in Perth on 21 November.",
        "Although the 32-year-old has \"run out of time\" for the series opener, he is returning to bowling in the nets this week and head coach Andrew McDonald said he was \"really optimistic\" Cummins would be available for the second Test in Brisbane starting 4 December.",
        "\"We've grappled with it for a little while, and the nature of the injury is that you grapple with it day-by-day,\" McDonald said.",
        "\"We're really optimistic and hopeful for the second Test match. He'll be back bowling this week, that's a huge step.\"",
        "It is a huge blow for Australia to lose their influential captain and premier fast bowler.",
        "Reports of fitness doubts first appeared in September, with Cummins then ruled out of the white-ball series against New Zealand and India with a lumbar stress fracture.",
        "Speaking two weeks ago, Cummins said time was beginning to get \"tight\" for the first Test, because he needed at least a month in the nets in order to be match-fit.",
        "Cummins was appointed captain on the eve of the last Ashes series in Australia in 2021-22. The home side won 4-0 despite Cummins missing the second Test because of a Covid scare.",
        "He led Australia to win the World Test Championship and World Cup in 2023, the same year the Ashes series in the UK was drawn 2-2.",
        "In terms of the captaincy, Smith is a more than able replacement.",
        "The 36-year-old is himself an Ashes-winning skipper and only lost the captaincy in 2018 because of the 'sandpapergate' ball-tampering scandal.",
        "The batter, one of the all-time great Ashes run-scorers, has stood in for Cummins as captain on six previous occasions.",
        "Cummins' place in the bowling attack is likely to go to Scott Boland, who has a peerless average of 12.63 in Test in Australia.",
        "Boland, 36, is likely to join Mitchell Starc and Josh Hazlewood, both also in their mid-30s, in a seam attack for a gruelling five-Test series crammed into just over seven weeks.",
        "\"Losing your captain is not ideal, but when you're talking about Scott Boland as a potential replacement, it's not a bad position to be in,\" McDonald said.",
        "With or without Cummins, Australia are likely to have to call on some inexperienced or untried reserves like Michael Neser, Brendan Doggett, or Fergus O'Neill, although McDonald has not ruled out a Test return for Mitchell Marsh.",
        "Australia's white-ball captain, who earned the most recent of his 46 caps last December, averages 28.5 with the bat and 40.4 with the ball in Tests.",
        "\"We would be comfortable picking someone, and if you want to put a name to it Mitch Marsh, out of white-ball cricket, if we felt like that was going to benefit the Test team,\" said McDonald.",
        "\"We feel he's batting as well as he has for a long period of time. We still haven't given up on Mitch Marsh's Test career.\"",
        "The question over what involvement Cummins may have and the bowlers Australia could use fuels the suspicion that pace bowling will be a determining factor in the eventual Ashes winners.",
        "England have named a battery of quick bowlers in their squad, probably the most hostile group they have sent down under since 1970.",
        "There are questions over some members of the attack. Mark Wood has not played a Test since August of last year, Jofra Archer has a long injury history, while all of Gus Atkinson, Brydon Carse and Josh Tongue have had lay-offs in the past year.",
        "England's Ashes squad is slowly assembling, with many in the side beaten by New Zealand in the opening one-day international on Sunday.",
        "Others, like Wood and Tongue, are not part of the New Zealand series but are in the country as part of their preparations.",
        "Captain Ben Stokes is one of the later members to travel after spending time with the England rugby league team before their first Ashes Test against Australia on Saturday.",
        "Stokes has not played since July because of a shoulder injury, yet is thought to be on course for the first Ashes Test. England play their only warm-up match, against an England Lions team, in Perth on 13 November.",
        "All-rounder Stokes has not played a full part in any of England's past four Test series because of a variety of injuries.",
        "It could be the Ashes is ultimately decided by which of captains Cummins and Stokes is able to spend most time on the field.",
        "The Ashes: Australia v England",
        "21 November 2025 - 7 January 2026",
        "Ball-by-ball commentary on BBC Sounds, BBC Radio 5 Sports Extra and the BBC Sport website and app, which will also have live text commentary and daily features and analysis",
        "Get cricket news sent straight to your phone"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/cricket/articles/czxnyy99pdro",
      "main_category": "sport",
      "detailed_category": "cricket",
      "topic": "How to beat the unbeatable - can anybody stop Australia?",
      "content": [
        "At the conclusion of the group stage of the Women's World Cup and with the semi-finals on the horizon, one specific question has been doing the rounds throughout. How do you beat Australia?  The defending champions have reached the knockouts unbeaten, the group stage culminating in their most convincing win so far as they bowled out South Africa - who are England's semi-final opponents - for just 97. Even their biggest wobble - the slump to 76-7 against Pakistan - ended up being a showcase of why they are such heavy favourites, as Beth Mooney's century revived them to 221-9.They rightly have unwavering confidence in their staggering batting depth, and part of what makes them so hard to beat is the sheer amount of all-rounders. Of the XI that beat England comfortably in Indore, eight of them were genuine bowling options. Australia slipped to 68-4 in that game, but even then, captain Alyssa Healy said there was no doubt they would get over the line.\"It's been the nature of the tournament where teams have struggled at the top,\" Healy told BBC's No Balls podcast.\"I've been saying the whole way you've got to back your depth. They keep stepping up, sticking their hands up and getting the job done no matter the situation. \"There was frustration [against England] but no, I don't think there was ever any worry.\"Between the 2022 World Cup and the start of this edition, Australia played 31 one-day internationals, winning 26 and losing four, with one washed out. They have not lost a World Cup game since being knocked out in the last four by India in 2017, which kickstarted this phenomenal run.However, those rare defeats have come against the other semi-finalists, with two against England in the 2023 Ashes and one each against India and South Africa. BBC Sport and data analysts CricViz have looked at the statistics at the end of the group stage to see their greatest strengths and whether there are any weaknesses in their game for opponents to target.",
        "It is the aforementioned batting depth which has set Australia apart from the rest for the past few years of dominance. They have the formidable luxury of Tahlia McGrath at seven and Georgia Wareham at eight (when she can get in the side), meaning that even if a top-order wobble occurs, they have a lengthy safety net - and crucially, they have the grit and mentality from 1-11 so that someone always catches them. It also means they can be more aggressive earlier, and take more risks rather than worrying about wickets in hand. That is showcased by their powerplay run-rate of 6.26, the highest in the tournament, and their strike-rates of 107.2 against pace and 92.3 against spin. Crucially, this also makes their batting a team effort with no particular dependency on one or two world-class players. They are averaging 73 for the first wicket - although that was as high as 89.8 when Healy was with Phoebe Litchfield - even before you get to the powerhouses in the middle. Skipper Healy and Ash Gardner - a number six who would stroll into every other country's top three or four - have scored two centuries so far in this World Cup, Mooney has one and Annabel Sutherland has an unbeaten 98. Sutherland had not made it to double figures in three innings before that knock against England, but has now truly marked her authority on the tournament as one of the world's premier all-rounders. They also have Gardner's off-spin, and when the likes of McGrath and Ellyse Perry are not even required to bowl, you know you are contending with something very special.",
        "It is Sutherland, seen for years as the heir to Perry's throne, who has also led the way with the ball as she has delivered several masterclasses in middle-overs bowling, mixing up her pace and using the short ball smartly to end the group stage with 15 wickets - joint top with India's Deepti Sharma. However, one area where teams could target Australia is in the powerplay with the ball as quicks Kim Garth, Darcie Brown and Megan Schutt have struggled at times on surfaces which have either been flat or spin-friendly. Their seamers have taken the second-most wickets of the eight teams (24) but both South Africa and England have been more economical in the first 10 overs, and only Sri Lanka, Bangladesh and New Zealand are ranked below them for their average bowling to the opening partnership (47 at 5.33 runs per over). This is where Sutherland has often been brought into the attack to regain control, but another weapon of theirs is leg-spinner Alana King, whose recent spells of 1-20 and 7-18 against England and South Africa have come at the perfect time after a slow start to the tournament. It means their spinners have the best average too. There are very few weak links in the batting line-up but it is possible to suggest that bowling first might be the way to go.They have been exceptional when chasing but have had their two wobbles (against New Zealand and Pakistan) when batting first - so teams could look to get early breakthroughs, and hope that it sees them fall short of a good score. This trend also means their death overs batting has not been hugely tested - and in many games not needed - so they are striking at 7.55 runs per over between overs 41-50 - behind South Africa and India. It could be that this strategy is tested for the first time under the highest pressure.",
        "Despite losing three games in the group stages, India - their semi-final opponents - still feel the most likely team to beat them, having posted 330 against them in the pick of the group-stage games, only for it to prove at least 20 runs short. They are also the most recent team to beat Australia in an ODI, in the pre-World Cup series which Healy's side won 2-1, and will have a lively home crowd in their favour. It makes for an intriguing batting match-up. Similarly, India have a very strong opening partnership in Smriti Mandhana and Pratika Rawal, who are averaging 82.8,  but the latter has since been ruled out of the tournament with injury.They also have strong batting depth but it has cost them in the bowling department, which could be the difference. India, with fewer all-rounders, have mostly opted for the extra batter and five bowlers but that saw Australia chase 330 with relative ease, so they are still searching for the right balance with their XI. For England, they are outperforming their rivals with the ball in both the powerplay and the death overs, while their spin attack has taken the second-most wickets (37) and has the second-best average (19.2). However, they are considerably far behind with the bat with strike-rates of 85.8 and 74 against pace and spin respectively - particularly struggling in the middle overs where they score at 4.55 runs per over at an average of 34.South Africa, meanwhile, have the best powerplay bowling record in terms of economy, which could be a good contest considering Australia's top-order strength.They also have considerably the best batting record between overs 41-50, thanks to the lower order power-hitting of Nadine de Klerk in clutch chases against India and Bangladesh. They average 53 in overs 41-50 with the next best being Australia's 31.3.A huge element to the challenge of coming up against Australia, though, is not one that can be conveyed through stats - it comes from the mental game. Whoever is to beat them knows they must put out pretty much the perfect performance under the highest pressure, and even then they might still be relying on Australia to make a few mistakes of their own.Speaking of which, Australia mistakes in the field are rare - they take almost 77% of their catches, which ranks them second in the tournament.They are behind England who, after so much criticism about fielding standards and fitness in recent years, top the catching charts with an efficiency of almost 83%.",
        "Annabel Sutherland (middle) is the tournament's joint-leading wicket-taker",
        "At the conclusion of the group stage of the Women's World Cup and with the semi-finals on the horizon, one specific question has been doing the rounds throughout.",
        "How do you beat Australia?",
        "The defending champions have reached the knockouts unbeaten, the group stage culminating in their most convincing win so far as they bowled out South Africa - who are England's semi-final opponents - for just 97.",
        "Even their biggest wobble - the slump to 76-7 against Pakistan - ended up being a showcase of why they are such heavy favourites, as Beth Mooney's century revived them to 221-9.",
        "They rightly have unwavering confidence in their staggering batting depth, and part of what makes them so hard to beat is the sheer amount of all-rounders. Of the XI that beat England comfortably in Indore, eight of them were genuine bowling options.",
        "Australia slipped to 68-4 in that game, but even then, captain Alyssa Healy said there was no doubt they would get over the line.",
        "\"It's been the nature of the tournament where teams have struggled at the top,\" Healy told BBC's No Balls podcast.",
        "\"I've been saying the whole way you've got to back your depth. They keep stepping up, sticking their hands up and getting the job done no matter the situation.",
        "\"There was frustration [against England] but no, I don't think there was ever any worry.\"",
        "Between the 2022 World Cup and the start of this edition, Australia played 31 one-day internationals, winning 26 and losing four, with one washed out.",
        "They have not lost a World Cup game since being knocked out in the last four by India in 2017, which kickstarted this phenomenal run.",
        "However, those rare defeats have come against the other semi-finalists, with two against England in the 2023 Ashes and one each against India and South Africa.",
        "BBC Sport and data analysts CricViz have looked at the statistics at the end of the group stage to see their greatest strengths and whether there are any weaknesses in their game for opponents to target.",
        "ICC Women's Cricket World Cup semi-finals",
        "29 & 30 October, 2025",
        "In-play clips and highlights on BBC Sport website and app. Ball-by-ball commentary on BBC Sounds, BBC Radio 5 Sports Extra and the BBC Sport website and app",
        "It is the aforementioned batting depth which has set Australia apart from the rest for the past few years of dominance.",
        "They have the formidable luxury of Tahlia McGrath at seven and Georgia Wareham at eight (when she can get in the side), meaning that even if a top-order wobble occurs, they have a lengthy safety net - and crucially, they have the grit and mentality from 1-11 so that someone always catches them.",
        "It also means they can be more aggressive earlier, and take more risks rather than worrying about wickets in hand. That is showcased by their powerplay run-rate of 6.26, the highest in the tournament, and their strike-rates of 107.2 against pace and 92.3 against spin.",
        "Crucially, this also makes their batting a team effort with no particular dependency on one or two world-class players.",
        "They are averaging 73 for the first wicket - although that was as high as 89.8 when Healy was with Phoebe Litchfield - even before you get to the powerhouses in the middle.",
        "Skipper Healy and Ash Gardner - a number six who would stroll into every other country's top three or four - have scored two centuries so far in this World Cup, Mooney has one and Annabel Sutherland has an unbeaten 98.",
        "Sutherland had not made it to double figures in three innings before that knock against England, but has now truly marked her authority on the tournament as one of the world's premier all-rounders.",
        "They also have Gardner's off-spin, and when the likes of McGrath and Ellyse Perry are not even required to bowl, you know you are contending with something very special.",
        "It is Sutherland, seen for years as the heir to Perry's throne, who has also led the way with the ball as she has delivered several masterclasses in middle-overs bowling, mixing up her pace and using the short ball smartly to end the group stage with 15 wickets - joint top with India's Deepti Sharma.",
        "However, one area where teams could target Australia is in the powerplay with the ball as quicks Kim Garth, Darcie Brown and Megan Schutt have struggled at times on surfaces which have either been flat or spin-friendly.",
        "Their seamers have taken the second-most wickets of the eight teams (24) but both South Africa and England have been more economical in the first 10 overs, and only Sri Lanka, Bangladesh and New Zealand are ranked below them for their average bowling to the opening partnership (47 at 5.33 runs per over).",
        "This is where Sutherland has often been brought into the attack to regain control, but another weapon of theirs is leg-spinner Alana King, whose recent spells of 1-20 and 7-18 against England and South Africa have come at the perfect time after a slow start to the tournament. It means their spinners have the best average too.",
        "There are very few weak links in the batting line-up but it is possible to suggest that bowling first might be the way to go.",
        "They have been exceptional when chasing but have had their two wobbles (against New Zealand and Pakistan) when batting first - so teams could look to get early breakthroughs, and hope that it sees them fall short of a good score.",
        "This trend also means their death overs batting has not been hugely tested - and in many games not needed - so they are striking at 7.55 runs per over between overs 41-50 - behind South Africa and India. It could be that this strategy is tested for the first time under the highest pressure.",
        "Despite losing three games in the group stages, India - their semi-final opponents - still feel the most likely team to beat them, having posted 330 against them in the pick of the group-stage games, only for it to prove at least 20 runs short.",
        "They are also the most recent team to beat Australia in an ODI, in the pre-World Cup series which Healy's side won 2-1, and will have a lively home crowd in their favour.",
        "It makes for an intriguing batting match-up. Similarly, India have a very strong opening partnership in Smriti Mandhana and Pratika Rawal, who are averaging 82.8,  but the latter has since been ruled out of the tournament with injury.",
        "They also have strong batting depth but it has cost them in the bowling department, which could be the difference. India, with fewer all-rounders, have mostly opted for the extra batter and five bowlers but that saw Australia chase 330 with relative ease, so they are still searching for the right balance with their XI.",
        "For England, they are outperforming their rivals with the ball in both the powerplay and the death overs, while their spin attack has taken the second-most wickets (37) and has the second-best average (19.2).",
        "However, they are considerably far behind with the bat with strike-rates of 85.8 and 74 against pace and spin respectively - particularly struggling in the middle overs where they score at 4.55 runs per over at an average of 34.",
        "South Africa, meanwhile, have the best powerplay bowling record in terms of economy, which could be a good contest considering Australia's top-order strength.",
        "They also have considerably the best batting record between overs 41-50, thanks to the lower order power-hitting of Nadine de Klerk in clutch chases against India and Bangladesh. They average 53 in overs 41-50 with the next best being Australia's 31.3.",
        "A huge element to the challenge of coming up against Australia, though, is not one that can be conveyed through stats - it comes from the mental game.",
        "Whoever is to beat them knows they must put out pretty much the perfect performance under the highest pressure, and even then they might still be relying on Australia to make a few mistakes of their own.",
        "Speaking of which, Australia mistakes in the field are rare - they take almost 77% of their catches, which ranks them second in the tournament.",
        "They are behind England who, after so much criticism about fielding standards and fitness in recent years, top the catching charts with an efficiency of almost 83%.",
        "Get cricket news sent straight to your phone"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/cricket/articles/cy8vk17r781o",
      "main_category": "sport",
      "detailed_category": "cricket",
      "topic": "Verma replaces Rawal in India squad for semi-final",
      "content": [
        "India have called up batter Shafali Verma in place of the injured Pratika Rawal for their Women's World Cup semi-final against Australia.Rawal sustained an ankle injury while fielding during India's final group game against Bangladesh on Sunday.The 25-year-old opener tried to stop a boundary on the slippery outfield at the DY Patil Stadium in Navi Mumbai and was later unable to bat in the match.Rawal is the tournament's second-highest run-scorer with 308 in six innings at 51.33, behind only fellow India opening batter Smriti Mandhana.India's request to replace Rawal in their squad with Verma was approved by the International Cricket Council's event technical committee for the tournament.Verma has not played a one-day international for India since October 2024 but has played 50-over cricket for India A in recent months.The 21-year-old was left out of India's original squad for the World Cup but will now come into contention for a place against Australia in the semi-final showdown on 30 October.Amanjot Kaur opened against Bangladesh after Rawal limped out while Uma Chetry and Jemimah Rodrigues are other potential partners for Mandhana at the top of the order.",
        "Shafali Verma has made 644 runs in 29 ODI innings at an average of 23",
        "India have called up batter Shafali Verma in place of the injured Pratika Rawal for their Women's World Cup semi-final against Australia.",
        "Rawal sustained an ankle injury while fielding during India's final group game against Bangladesh on Sunday.",
        "The 25-year-old opener tried to stop a boundary on the slippery outfield at the DY Patil Stadium in Navi Mumbai and was later unable to bat in the match.",
        "Rawal is the tournament's second-highest run-scorer with 308 in six innings at 51.33, behind only fellow India opening batter Smriti Mandhana.",
        "India's request to replace Rawal in their squad with Verma was approved by the International Cricket Council's event technical committee for the tournament.",
        "Verma has not played a one-day international for India since October 2024 but has played 50-over cricket for India A in recent months.",
        "The 21-year-old was left out of India's original squad for the World Cup but will now come into contention for a place against Australia in the semi-final showdown on 30 October.",
        "Amanjot Kaur opened against Bangladesh after Rawal limped out while Uma Chetry and Jemimah Rodrigues are other potential partners for Mandhana at the top of the order.",
        "ICC Women's Cricket World Cup semi-finals",
        "29 & 30 October, 2025",
        "In-play clips and highlights on BBC Sport website and app. Ball-by-ball commentary on BBC Sounds, BBC Radio 5 Sports Extra and the BBC Sport website and app",
        "How to beat the unbeatable - can anybody stop Australia?",
        "Get cricket news sent straight to your phone",
        "Psychology and cricket - meet India's latest batting star"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/cricket/articles/cy9pxple1ydo",
      "main_category": "sport",
      "detailed_category": "cricket",
      "topic": "India batter Iyer hospitalised with lacerated spleen",
      "content": [
        "India batter Shreyas Iyer is \"recovering well\" in hospital after suffering a lacerated spleen while taking a catch in the third ODI against Australia in Sydney on Saturday.Iyer sustained the injury while fielding in the 34th over, running backwards to take a catch to dismiss Alex Carey and landing awkwardly on his side.The 30-year-old immediately clutched his side and received treatment on the field before being taken to hospital.The Board of Control for Cricket in India (BCCI) has not put a timeline on his return but confirmed he is \"medically stable\".\"Shreyas Iyer sustained an impact injury to his left lower rib cage region while fielding during the third ODI against Australia in Sydney. He was taken to hospital for further evaluation,\" the BCCI said in a statement on Monday.\"Scans have revealed a laceration injury to the spleen. He is under treatment, medically stable, and recovering well.\"The BCCI medical team, in consultation with specialists in Sydney and India, is closely monitoring his injury status. The Indian team doctor will remain in Sydney with Shreyas to evaluate his day-to-day progress.\"India went on to win the match by nine wickets but lost the series 2-1.A five-match T20 series between the two sides begins in Canberra on Wednesday.",
        "Iyer has made 138 appearances for India across all formats since making his debut in 2017",
        "India batter Shreyas Iyer is \"recovering well\" in hospital after suffering a lacerated spleen while taking a catch in the third ODI against Australia in Sydney on Saturday.",
        "Iyer sustained the injury while fielding in the 34th over, running backwards to take a catch to dismiss Alex Carey and landing awkwardly on his side.",
        "The 30-year-old immediately clutched his side and received treatment on the field before being taken to hospital.",
        "The Board of Control for Cricket in India (BCCI) has not put a timeline on his return but confirmed he is \"medically stable\".",
        "\"Shreyas Iyer sustained an impact injury to his left lower rib cage region while fielding during the third ODI against Australia in Sydney. He was taken to hospital for further evaluation,\" the BCCI said in a statement on Monday.",
        "\"Scans have revealed a laceration injury to the spleen. He is under treatment, medically stable, and recovering well.",
        "\"The BCCI medical team, in consultation with specialists in Sydney and India, is closely monitoring his injury status. The Indian team doctor will remain in Sydney with Shreyas to evaluate his day-to-day progress.\"",
        "India went on to win the match by nine wickets but lost the series 2-1.",
        "A five-match T20 series between the two sides begins in Canberra on Wednesday.",
        "Get cricket news sent straight to your phone"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/cricket/articles/cq83zdyww0lo",
      "main_category": "sport",
      "detailed_category": "cricket",
      "topic": "Essex in frame to host Ireland v Bangladesh in 2026",
      "content": [
        "Essex are among the counties in the frame to host a portion of Ireland's men's white-ball series against Bangladesh next summer.BBC Sport understands Cricket Ireland have held talks with the England and Wales Cricket Board (ECB) over hosting the series on English soil.County Championship clubs have since been asked by the ECB to submit expressions of interest in staging the series, which will consist of three one-day internationals and three T20 internationals.At this stage it is not certain whether all six games will be staged at county grounds in England, or just some of them, with several venues under discussion.",
        "Cricket Ireland's eagerness to move the matches across the Irish Sea is driven in part by the desire to boost attendance figures with UK-based Bangladesh and Irish fans.The governing body also believe holding some of the games against Bangladesh in England will relieve financial concerns, and ease the strain on pitches, to enable more fixtures to be played across Ireland next summer.Essex previously hosted an ODI series between Ireland and Bangladesh in May 2023 and are understood to have expressed their interest in hosting the T20 fixtures in Chelmsford this time around.A collective 10,000 fans came through the gates at the County Ground for those ODIs a couple of years ago - one of which was lost to the weather - and included two sold-out fixtures.Approximately 650,000 Bangladeshis live in the UK with many based in east London which is a short train or bus journey from the 6,500-capacity venue in Chelmsford.The 2026 series is listed for August on the International Cricket Council's Future Tours Programme but there is said to be some flexibility over scheduling.Cricket Ireland have faced challenges with hosting matches on home turf in recent years due to financial and logistical pressures.In 2024, Cricket Ireland cancelled a T20 and ODI series against Australia citing a lack of permanent facilities and the cost of temporary infrastructure.They hope to have a new purpose-built stadium on the outskirts of Dublin completed by 2028.",
        "Harry Tector in action for Ireland during a T20 international against England at Malahide in September 2025",
        "Essex are among the counties in the frame to host a portion of Ireland's men's white-ball series against Bangladesh next summer.",
        "BBC Sport understands Cricket Ireland have held talks with the England and Wales Cricket Board (ECB) over hosting the series on English soil.",
        "County Championship clubs have since been asked by the ECB to submit expressions of interest in staging the series, which will consist of three one-day internationals and three T20 internationals.",
        "At this stage it is not certain whether all six games will be staged at county grounds in England, or just some of them, with several venues under discussion.",
        "Cricket Ireland's eagerness to move the matches across the Irish Sea is driven in part by the desire to boost attendance figures with UK-based Bangladesh and Irish fans.",
        "The governing body also believe holding some of the games against Bangladesh in England will relieve financial concerns, and ease the strain on pitches, to enable more fixtures to be played across Ireland next summer.",
        "Essex previously hosted an ODI series between Ireland and Bangladesh in May 2023 and are understood to have expressed their interest in hosting the T20 fixtures in Chelmsford this time around.",
        "A collective 10,000 fans came through the gates at the County Ground for those ODIs a couple of years ago - one of which was lost to the weather - and included two sold-out fixtures.",
        "Approximately 650,000 Bangladeshis live in the UK with many based in east London which is a short train or bus journey from the 6,500-capacity venue in Chelmsford.",
        "The 2026 series is listed for August on the International Cricket Council's Future Tours Programme but there is said to be some flexibility over scheduling.",
        "Cricket Ireland have faced challenges with hosting matches on home turf in recent years due to financial and logistical pressures.",
        "In 2024, Cricket Ireland cancelled a T20 and ODI series against Australia citing a lack of permanent facilities and the cost of temporary infrastructure.",
        "They hope to have a new purpose-built stadium on the outskirts of Dublin completed by 2028.",
        "Cricket Ireland appoints Keane as new CEO",
        "Ireland to take uncapped quintet to Bangladesh",
        "India visit & T20 hope - 'belief' lifts Ireland"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/cricket/articles/cglgzk087p8o",
      "main_category": "sport",
      "detailed_category": "cricket",
      "topic": "'No doubt' England make World Cup final - Hartley",
      "content": [
        "There is \"no doubt\" that England will reach the Women's World Cup final, said former spinner Alex Hartley after Nat Sciver-Brunt's side thrashed New Zealand to conclude the group stage. The win saw England finish second in the table behind defending champions Australia and they will face South Africa in the first semi-final on Wednesday.They are playing in Guwahati, the same venue where England thumped the Proteas in their tournament opener by bowling them out for just 69.\"England will take so much confidence into their game against South Africa,\" Hartley, a World Cup winner in 2017, told BBC Test Match Special.\"Guwahati suits their bowling, the slow tracks and the way they use their spinners. \"I just have a feeling, and there is no doubt in my mind that England will beat South Africa and make it through to the final.\"",
        "England have overcome some stutters with the bat during the tournament, notably against weaker opponents Bangladesh and Pakistan, but have also shown improvement under pressure by edging past co-hosts India in a four-run thriller. Contrastingly, South Africa ended their group stage with a brutal defeat by Australia, suffering another batting collapse to spin as they were skittled for 97, but Hartley also warned that England should not take their opponents lightly.\"England are a better team, but that does not mean that South Africa can't have their day.\"We have seen it in the T20 World Cup when they knocked out Australia last year, so England cannot go into the game complacent - but they are the better side.\" England have beaten South Africa in the semi-finals of both previous editions of the tournament, before their famous win over India at Lord's in 2017 and defeat by Australia in 2022.",
        "England's bowling has impressed since the beginning of the tournament, particularly the spin trio of Sophie Ecclestone, Linsey Smith and Charlie Dean - though they will be nervously waiting on the fitness of the former after she hurt her shoulder against the White Ferns. The batting line-up presented more concerns but openers Tammy Beaumont and Amy Jones, who added their fourth stand of more than fifty at Visakhapatnam on Sunday, have started to find their groove at a very convenient time. \"There have been a lot of questions about Jones and Beaumont at the top of the order being able to play the in-swinging ball,\" Hartley added.\"Tammy has made a shift and is batting on off-stump now and she looks a lot more comfortable. She would have wanted to get more runs against New Zealand but that opening partnership is just starting to tick as we are getting down to the nitty gritty.\"That's what you want - you want to be playing your best cricket as you are getting into the latter stages.\"Heather Knight and Sciver-Brunt have been fluent throughout but there are still question marks over the middle order, which coach Charlotte Edwards rejigged against New Zealand but they were not needed in the eight-wicket win.Emma Lamb, who struggled at number six with 36 runs in five innings, was dropped for Danni Wyatt-Hodge while Alice Capsey was listed to come in at five instead of seven, swapping with the out of form Sophia Dunkley.England must be prepared to adapt as they return to the slow, spin-friendly surface of Guwahati from the flatter pitches of Indore and Vizag, while India and Australia contest the second semi in Navi Mumbai, which is also hosting the final on 2 November.",
        "This video can not be played",
        "Jones powers England to emphatic win over New Zealand",
        "There is \"no doubt\" that England will reach the Women's World Cup final, said former spinner Alex Hartley after Nat Sciver-Brunt's side thrashed New Zealand to conclude the group stage.",
        "The win saw England finish second in the table behind defending champions Australia and they will face South Africa in the first semi-final on Wednesday.",
        "They are playing in Guwahati, the same venue where England thumped the Proteas in their tournament opener by bowling them out for just 69.",
        "\"England will take so much confidence into their game against South Africa,\" Hartley, a World Cup winner in 2017, told BBC Test Match Special.",
        "\"Guwahati suits their bowling, the slow tracks and the way they use their spinners.",
        "\"I just have a feeling, and there is no doubt in my mind that England will beat South Africa and make it through to the final.\"",
        "England have overcome some stutters with the bat during the tournament, notably against weaker opponents Bangladesh and Pakistan, but have also shown improvement under pressure by edging past co-hosts India in a four-run thriller.",
        "Contrastingly, South Africa ended their group stage with a brutal defeat by Australia, suffering another batting collapse to spin as they were skittled for 97, but Hartley also warned that England should not take their opponents lightly.",
        "\"England are a better team, but that does not mean that South Africa can't have their day.",
        "\"We have seen it in the T20 World Cup when they knocked out Australia last year, so England cannot go into the game complacent - but they are the better side.\"",
        "England have beaten South Africa in the semi-finals of both previous editions of the tournament, before their famous win over India at Lord's in 2017 and defeat by Australia in 2022.",
        "Ecclestone shoulder injury to be monitored",
        "Women’s World Cup: England finish group on high as Devine departs",
        "Women's World Cup semi-finals - schedule & how to follow",
        "England's bowling has impressed since the beginning of the tournament, particularly the spin trio of Sophie Ecclestone, Linsey Smith and Charlie Dean - though they will be nervously waiting on the fitness of the former after she hurt her shoulder against the White Ferns.",
        "The batting line-up presented more concerns but openers Tammy Beaumont and Amy Jones, who added their fourth stand of more than fifty at Visakhapatnam on Sunday, have started to find their groove at a very convenient time.",
        "\"There have been a lot of questions about Jones and Beaumont at the top of the order being able to play the in-swinging ball,\" Hartley added.",
        "\"Tammy has made a shift and is batting on off-stump now and she looks a lot more comfortable. She would have wanted to get more runs against New Zealand but that opening partnership is just starting to tick as we are getting down to the nitty gritty.",
        "\"That's what you want - you want to be playing your best cricket as you are getting into the latter stages.\"",
        "Heather Knight and Sciver-Brunt have been fluent throughout but there are still question marks over the middle order, which coach Charlotte Edwards rejigged against New Zealand but they were not needed in the eight-wicket win.",
        "Emma Lamb, who struggled at number six with 36 runs in five innings, was dropped for Danni Wyatt-Hodge while Alice Capsey was listed to come in at five instead of seven, swapping with the out of form Sophia Dunkley.",
        "England must be prepared to adapt as they return to the slow, spin-friendly surface of Guwahati from the flatter pitches of Indore and Vizag, while India and Australia contest the second semi in Navi Mumbai, which is also hosting the final on 2 November.",
        "Get cricket news sent straight to your phone"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/cricket/articles/c4gk210zx1xo",
      "main_category": "sport",
      "detailed_category": "cricket",
      "topic": "England beaten by NZ despite Brook's majestic 135",
      "content": [
        "First one-day international, Mount MaunganuiEngland 223 (35.2 overs): Brook 135 (101), Overton 46 (54); Foulkes 4-41New Zealand 224-6 (36.4 overs): Mitchell 78* (91), Bracewell 51 (51); Carse 3-45New Zealand won by four wickets; lead series 1-0Scorecard",
        "England were beaten by four wickets by New Zealand in the first one-day international, despite Harry Brook's outrageous century threatening to rescue his side after an awful top-order batting collapse.The tourists lost Jamie Smith to the first ball of the match, were 5-3 at the end of the second over with Joe Root bowled for two, and 33-5 in the ninth.Their hopes, along with any idea of Root and co easing into form before the Ashes, appeared in tatters but captain Brook counter-attacked against superb New Zealand bowling in favourable, seaming conditions, hitting an audacious 135 from 101 balls to drag his side to 223 in Mount Maunganui.No other batter in England's top seven made double figures but Brook struck 11 sixes - seven of which came as he dominated a 10th-wicket stand of 57 with last man Luke Wood.Although England were all out in 35.2 overs, Brook had given his side a chance and when Brydon Carse took three wickets in a fine new-ball spell the Black Caps were in real danger at 66-4.Crucially, though, England dropped Michael Bracewell on two and Daryl Mitchell on 33. Bracewell went on to make 51 and Mitchell 78 not out as the hosts won with 13.2 overs to spare.",
        "England can level the series in the second match in Hamilton on Wednesday (01:00 GMT) but this match will be best remembered for: Brook continuing his form with an all-time great knockA difficult start to the winter for England's other Test batters - with some extenuating circumstancesCarse showing why he could be crucial for England in Australia",
        "It is no secret England are using this tour, including the stop-start rain-affected T20s that preceded these ODIs, to build towards the Ashes.While others are yet to find form, the question for Brook, who scored 78 in the second T20 last week, is whether he can maintain his through the switch in conditions and formats. On the evidence so far, the answer is a resounding yes.Batting was perilously difficult when he came in.Brook was hit on the body three times as he failed to score from his first six deliveries. He advanced to his seventh to drive Matt Henry through the covers and it showed him the way.The 26-year-old reached 50 in 36 deliveries before settling into a stand of 87 with Jamie Overton. When Overton fell to a leading edge for 46, Carse and Adil Rashid quickly followed and Brook cut loose while farming the strike to protect Wood.He hit three consecutive sixes off Jacob Duffy to reach his hundred and struck another three in one over from Henry - targeting the leg side and dispatching anything short by either flicking it over fine leg or cracking it over mid-wicket.The low-key nature of this series and the fact it came in a disappointing defeat should not prevent this knock from being rated among the best for England in ODIs.He scored 60.5% of England's runs - putting him 12th on the all-time list for that statistic in ODIs. It was also Brook's highest score in the format.",
        "While Brook has had two weeks in New Zealand, Root, Smith and fellow opener Ben Duckett were in the middle for the first time in more than six weeks.The two remaining matches in this series, plus the one warm-up in Australia, will be their only further opportunities to find form before the first Test on 21 November.Four runs combined for three players so crucial to England's hopes is clearly not ideal but significant credit must be given to New Zealand's new-ball bowlers.Henry began the match with a delivery that jagged back significantly to bowl Smith through the gate and barely relented with his accuracy throughout his opening spell of eight overs.Returning figures of 4-41 in his second ODI, Zak Foulkes was highly impressive and found 0.96 degrees of seam movement plus 1.99 degrees of swing in the first 10 overs - a significant jump from the recent average of 0.89 and 1.41 respectively at this ground.Duckett nicked a Foulkes ball from round the wicket that angled in before moving away and Root was bowled by a hooping inswinger, albeit one not full enough for his booming drive.Perhaps the 23-year-old's best delivery was saved for Jacob Bethell.The left-hander looked to play straight down the pitch but was bowled when the ball swung away late to beat his outside edge.It left Bethell helpless as he tried to apply more pressure to Ollie Pope's position as Test number three.",
        "Brook said afterwards he felt England's score was defendable. Had his side held their catches he may well have been right.Both misses were regulation. The hosts were 75-4 when Root put down Bracewell low at slip off Jamie Overton.The Black Caps still needed another 93 when Luke Wood dropped the ball when a reverse sweep from Mitchell looped up to him at backward point.That allowed the Kiwi pair to combine for a measured partnership of 92 and steer New Zealand clear of the early danger caused by Carse.The 30-year-old seamer found bite from a hard length near the top of the stumps to nick off Kane Williamson first ball, but quick, full deliveries also burst through the defences of opener Will Young and former captain Tom Latham, who had eased to 24 before being pinned lbw.They were all deliveries that should transfer to pitches in Australia.",
        "England captain Harry Brook: \"We didn't get off to a good start and I tried to take it upon myself first to have a counter-punch and thankfully it came off. I felt in good touch.\"I've done it a few times [from that position]. It's a do or die moment and thankfully I've been on the right side of that a few times and managed to get us to a decent-ish score to try to defend.\"New Zealand captain Mitchell Santner: \"Our opening bowlers were outstanding. We know Matt Henry can do that. Then Zak Foulkes was outstanding with the way he swung it. He looked a nightmare, especially for the left-handers.\"With the bat we lost a couple more than we would have liked with the chase. But the intent was great. We knew one big partnership would get us close and Daryl Mitchell and Michael Bracewell's partnership was massive for us.\"",
        "Brook's 135 beat his previous high score of 110 not out in ODIs",
        "First one-day international, Mount Maunganui",
        "England 223 (35.2 overs): Brook 135 (101), Overton 46 (54); Foulkes 4-41",
        "New Zealand 224-6 (36.4 overs): Mitchell 78* (91), Bracewell 51 (51); Carse 3-45",
        "New Zealand won by four wickets; lead series 1-0",
        "England were beaten by four wickets by New Zealand in the first one-day international, despite Harry Brook's outrageous century threatening to rescue his side after an awful top-order batting collapse.",
        "The tourists lost Jamie Smith to the first ball of the match, were 5-3 at the end of the second over with Joe Root bowled for two, and 33-5 in the ninth.",
        "Their hopes, along with any idea of Root and co easing into form before the Ashes, appeared in tatters but captain Brook counter-attacked against superb New Zealand bowling in favourable, seaming conditions, hitting an audacious 135 from 101 balls to drag his side to 223 in Mount Maunganui.",
        "No other batter in England's top seven made double figures but Brook struck 11 sixes - seven of which came as he dominated a 10th-wicket stand of 57 with last man Luke Wood.",
        "Although England were all out in 35.2 overs, Brook had given his side a chance and when Brydon Carse took three wickets in a fine new-ball spell the Black Caps were in real danger at 66-4.",
        "Crucially, though, England dropped Michael Bracewell on two and Daryl Mitchell on 33. Bracewell went on to make 51 and Mitchell 78 not out as the hosts won with 13.2 overs to spare.",
        "England can level the series in the second match in Hamilton on Wednesday (01:00 GMT) but this match will be best remembered for:",
        "Brook continuing his form with an all-time great knock",
        "A difficult start to the winter for England's other Test batters - with some extenuating circumstances",
        "Carse showing why he could be crucial for England in Australia",
        "Brisbane Test 'realistic' for Cummins return - Lyon",
        "Notifications, social media and more with BBC Sport",
        "It is no secret England are using this tour, including the stop-start rain-affected T20s that preceded these ODIs, to build towards the Ashes.",
        "While others are yet to find form, the question for Brook, who scored 78 in the second T20 last week, is whether he can maintain his through the switch in conditions and formats. On the evidence so far, the answer is a resounding yes.",
        "Batting was perilously difficult when he came in.",
        "Brook was hit on the body three times as he failed to score from his first six deliveries. He advanced to his seventh to drive Matt Henry through the covers and it showed him the way.",
        "The 26-year-old reached 50 in 36 deliveries before settling into a stand of 87 with Jamie Overton. When Overton fell to a leading edge for 46, Carse and Adil Rashid quickly followed and Brook cut loose while farming the strike to protect Wood.",
        "He hit three consecutive sixes off Jacob Duffy to reach his hundred and struck another three in one over from Henry - targeting the leg side and dispatching anything short by either flicking it over fine leg or cracking it over mid-wicket.",
        "The low-key nature of this series and the fact it came in a disappointing defeat should not prevent this knock from being rated among the best for England in ODIs.",
        "He scored 60.5% of England's runs - putting him 12th on the all-time list for that statistic in ODIs. It was also Brook's highest score in the format.",
        "Brook had a false shot percentage - any miss or edge - of 22.3% throughout his innings. The rest of England's XI had a false shot percentage of 33.6%",
        "While Brook has had two weeks in New Zealand, Root, Smith and fellow opener Ben Duckett were in the middle for the first time in more than six weeks.",
        "The two remaining matches in this series, plus the one warm-up in Australia, will be their only further opportunities to find form before the first Test on 21 November.",
        "Four runs combined for three players so crucial to England's hopes is clearly not ideal but significant credit must be given to New Zealand's new-ball bowlers.",
        "Henry began the match with a delivery that jagged back significantly to bowl Smith through the gate and barely relented with his accuracy throughout his opening spell of eight overs.",
        "Returning figures of 4-41 in his second ODI, Zak Foulkes was highly impressive and found 0.96 degrees of seam movement plus 1.99 degrees of swing in the first 10 overs - a significant jump from the recent average of 0.89 and 1.41 respectively at this ground.",
        "Duckett nicked a Foulkes ball from round the wicket that angled in before moving away and Root was bowled by a hooping inswinger, albeit one not full enough for his booming drive.",
        "Perhaps the 23-year-old's best delivery was saved for Jacob Bethell.",
        "The left-hander looked to play straight down the pitch but was bowled when the ball swung away late to beat his outside edge.",
        "It left Bethell helpless as he tried to apply more pressure to Ollie Pope's position as Test number three.",
        "Jamie Smith, Joe Root and Ben Duckett were batting for the first time since the third ODI against South Africa on 7 September",
        "Brook said afterwards he felt England's score was defendable. Had his side held their catches he may well have been right.",
        "Both misses were regulation. The hosts were 75-4 when Root put down Bracewell low at slip off Jamie Overton.",
        "The Black Caps still needed another 93 when Luke Wood dropped the ball when a reverse sweep from Mitchell looped up to him at backward point.",
        "That allowed the Kiwi pair to combine for a measured partnership of 92 and steer New Zealand clear of the early danger caused by Carse.",
        "The 30-year-old seamer found bite from a hard length near the top of the stumps to nick off Kane Williamson first ball, but quick, full deliveries also burst through the defences of opener Will Young and former captain Tom Latham, who had eased to 24 before being pinned lbw.",
        "They were all deliveries that should transfer to pitches in Australia.",
        "England captain Harry Brook: \"We didn't get off to a good start and I tried to take it upon myself first to have a counter-punch and thankfully it came off. I felt in good touch.",
        "\"I've done it a few times [from that position]. It's a do or die moment and thankfully I've been on the right side of that a few times and managed to get us to a decent-ish score to try to defend.\"",
        "New Zealand captain Mitchell Santner: \"Our opening bowlers were outstanding. We know Matt Henry can do that. Then Zak Foulkes was outstanding with the way he swung it. He looked a nightmare, especially for the left-handers.",
        "\"With the bat we lost a couple more than we would have liked with the chase. But the intent was great. We knew one big partnership would get us close and Daryl Mitchell and Michael Bracewell's partnership was massive for us.\""
      ]
    },
    {
      "url": "https://www.bbc.com/sport/cricket/articles/c4gpe14p1eeo",
      "main_category": "sport",
      "detailed_category": "cricket",
      "topic": "England conclude group stage with crushing win v NZ",
      "content": [
        "ICC Women's World Cup, Visakhapatnam New Zealand 168 (38.2 overs): Plimmer 43 (57); Smith 3-30England 172-2 (29.2 overs): Jones 86* (92); Tahuhu 1-9England won by eight wickets Scorecard, Table",
        "England will take winning momentum into the semi-finals of the Women's World Cup as they concluded the group stage with a crushing eight-wicket victory over New Zealand in Visakhapatnam. In a bizarre first innings, England were uncharacteristically sloppy with the ball but a New Zealand side lacking in confidence failed to punish them and were bowled out for 168 in 38.2 overs.Linsey Smith, who particularly struggled with a loss of control in the powerplay, ended up with figures of 3-30 but England are waiting on the fitness of Sophie Ecclestone, who only bowled four balls in the innings after injuring her shoulder following a misfield in the first over.  England were then ruthless in the chase, cruising to their target in 29.2 overs with opener Amy Jones finishing unbeaten on 86.Jones added 75 for the first wicket with Tammy Beaumont, who made 40, and 83 with Heather Knight who fell for 33 with England on the brink of victory but it was a welcome return to winning form after their defeat by Australia.New Zealand were already eliminated, but it marked a significant occasion as veteran all-rounder Sophie Devine played her 159th and final one-day international.After the soft dismissal of Suzie Bates to one of a few full tosses from Smith, Melie Kerr and Georgia Plimmer rebuilt with a steady stand of 68 before the game shifted in the space of two balls, with the former falling to Alice Capsey for 35 and Plimmer pinned lbw by Charlie Dean for 43. Devine made 23 in her final knock but England dominated the middle overs to take the final five wickets for just 13 runs, with two apiece for Capsey and Nat Sciver-Brunt. England travel to Guwahati for their semi-final against South Africa, which takes place on Wednesday, followed by India v Australia the following day.This victory ensures England finish second in the group and if the semi-final is washed out on both Wednesday and the reserve day they would progress by virtue of their higher finish in the groups.",
        "Smith's role in the powerplay has been a huge success for England throughout the tournament so far, but in the only early start of the group stage - with England having already qualified - it was curiously sloppy.Smith lost her rhythm with an array of full tosses and drag downs while seamer Lauren Bell also bowled too short as New Zealand reached 57-1 at the end of the powerplay.It was the sort of performance England would not get away with against Australia in particular but New Zealand, whose poor campaign has been thwarted by the rain in Colombo, were unable to capitalise.Smith was gifted the wicket of Bates, who chipped to mid-off, before fellow opener Plimmer and Kerr looked untroubled and played with much more intent in attempting to punish England's inconsistency.But Kerr threw her wicket away, caught at long-on off Capsey - who performed brilliantly as a part-timer in the absence of Ecclestone - and Plimmer was trapped on the crease which prompted England's shift in momentum.Ecclestone attempted to bowl after she had landed awkwardly while failing to save a boundary, and Brooke Halliday had a shocking lapse in judgement as she slogged out to deep mid-wicket for four, only for the spinner to leave the field immediately after.Devine nicked behind to Jones which prompted an emotional trudge from the field, as she joined the ranks of New Zealand batters guilty of making a start but failing to kick on despite England's off-day with the ball. They hit a good line and length with just 29.7% of their balls bowled, which was the lowest for any game of the competition.The tournament generally has been a cruel goodbye for one of the game's finest servants in Devine, who has been vocal about the disappointment surrounding the scheduling in Sri Lanka's monsoon season, but she is expected to continue in the T20 format, in which New Zealand are world champions.",
        "After a tricky start to the tournament for England's openers, Jones and Beaumont have enjoyed the more batter-friendly surfaces of Indore and Vizag to find promising form as the knockouts approach.Jones made her first half-century of the tournament against India before Beaumont followed suit against Australia, and it was the latter who initially took the game on in the powerplay as New Zealand's seamers strayed both sides of the wicket.In scorching and humid conditions, England would have been grateful for the low target but Jones and Beaumont added their fourth stand of more than fifty – the most of any team in the tournament – without giving a chance.Beaumont was trapped lbw by Lea Tahuhu which allowed Jones to take responsibility, reaching a 71-ball half-century with a six.Knight also continued her fine form before she was also pinned in front by Devine – which again sparked emotion as there were joyful celebrations for her final ODI wicket.Knight's dismissal gave Danni Wyatt-Hodge a brief stint in the middle as she was brought in to the middle order for the struggling Emma Lamb, but there were only 11 runs required for victory when she came to the crease before Jones whacked her 11th four to seal a comprehensive win. England's batters will have to adapt again, however, to the slower and spin-friendly surface in Guwahati - though they bowled South Africa out for 69 at the same venue in their opener, and they also come in to the game on the back of a thumping from Australia.",
        "This video can not be played",
        "Jones powers England to emphatic win over New Zealand",
        "ICC Women's World Cup, Visakhapatnam",
        "New Zealand 168 (38.2 overs): Plimmer 43 (57); Smith 3-30",
        "England 172-2 (29.2 overs): Jones 86* (92); Tahuhu 1-9",
        "England won by eight wickets",
        "England will take winning momentum into the semi-finals of the Women's World Cup as they concluded the group stage with a crushing eight-wicket victory over New Zealand in Visakhapatnam.",
        "In a bizarre first innings, England were uncharacteristically sloppy with the ball but a New Zealand side lacking in confidence failed to punish them and were bowled out for 168 in 38.2 overs.",
        "Linsey Smith, who particularly struggled with a loss of control in the powerplay, ended up with figures of 3-30 but England are waiting on the fitness of Sophie Ecclestone, who only bowled four balls in the innings after injuring her shoulder following a misfield in the first over.",
        "England were then ruthless in the chase, cruising to their target in 29.2 overs with opener Amy Jones finishing unbeaten on 86.",
        "Jones added 75 for the first wicket with Tammy Beaumont, who made 40, and 83 with Heather Knight who fell for 33 with England on the brink of victory but it was a welcome return to winning form after their defeat by Australia.",
        "New Zealand were already eliminated, but it marked a significant occasion as veteran all-rounder Sophie Devine played her 159th and final one-day international.",
        "After the soft dismissal of Suzie Bates to one of a few full tosses from Smith, Melie Kerr and Georgia Plimmer rebuilt with a steady stand of 68 before the game shifted in the space of two balls, with the former falling to Alice Capsey for 35 and Plimmer pinned lbw by Charlie Dean for 43.",
        "Devine made 23 in her final knock but England dominated the middle overs to take the final five wickets for just 13 runs, with two apiece for Capsey and Nat Sciver-Brunt.",
        "England travel to Guwahati for their semi-final against South Africa, which takes place on Wednesday, followed by India v Australia the following day.",
        "This victory ensures England finish second in the group and if the semi-final is washed out on both Wednesday and the reserve day they would progress by virtue of their higher finish in the groups.",
        "'No doubt' England make World Cup final - Hartley",
        "Ecclestone shoulder injury to be monitored before semi-final",
        "Women’s World Cup: England finish group on high as Devine departs",
        "This video can not be played",
        "'Miserable dismissal!' - Bates hits Smith full toss straight to Lamb at mid-off",
        "Smith's role in the powerplay has been a huge success for England throughout the tournament so far, but in the only early start of the group stage - with England having already qualified - it was curiously sloppy.",
        "Smith lost her rhythm with an array of full tosses and drag downs while seamer Lauren Bell also bowled too short as New Zealand reached 57-1 at the end of the powerplay.",
        "It was the sort of performance England would not get away with against Australia in particular but New Zealand, whose poor campaign has been thwarted by the rain in Colombo, were unable to capitalise.",
        "Smith was gifted the wicket of Bates, who chipped to mid-off, before fellow opener Plimmer and Kerr looked untroubled and played with much more intent in attempting to punish England's inconsistency.",
        "But Kerr threw her wicket away, caught at long-on off Capsey - who performed brilliantly as a part-timer in the absence of Ecclestone - and Plimmer was trapped on the crease which prompted England's shift in momentum.",
        "Ecclestone attempted to bowl after she had landed awkwardly while failing to save a boundary, and Brooke Halliday had a shocking lapse in judgement as she slogged out to deep mid-wicket for four, only for the spinner to leave the field immediately after.",
        "Devine nicked behind to Jones which prompted an emotional trudge from the field, as she joined the ranks of New Zealand batters guilty of making a start but failing to kick on despite England's off-day with the ball. They hit a good line and length with just 29.7% of their balls bowled, which was the lowest for any game of the competition.",
        "The tournament generally has been a cruel goodbye for one of the game's finest servants in Devine, who has been vocal about the disappointment surrounding the scheduling in Sri Lanka's monsoon season, but she is expected to continue in the T20 format, in which New Zealand are world champions.",
        "Women's World Cup semi-finals - schedule & how to follow",
        "Women's World Cup table, top run-scorers & wicket-takers",
        "This video can not be played",
        "'Elegant' Jones knock helps England run away with win over New Zealand",
        "After a tricky start to the tournament for England's openers, Jones and Beaumont have enjoyed the more batter-friendly surfaces of Indore and Vizag to find promising form as the knockouts approach.",
        "Jones made her first half-century of the tournament against India before Beaumont followed suit against Australia, and it was the latter who initially took the game on in the powerplay as New Zealand's seamers strayed both sides of the wicket.",
        "In scorching and humid conditions, England would have been grateful for the low target but Jones and Beaumont added their fourth stand of more than fifty – the most of any team in the tournament – without giving a chance.",
        "Beaumont was trapped lbw by Lea Tahuhu which allowed Jones to take responsibility, reaching a 71-ball half-century with a six.",
        "Knight also continued her fine form before she was also pinned in front by Devine – which again sparked emotion as there were joyful celebrations for her final ODI wicket.",
        "Knight's dismissal gave Danni Wyatt-Hodge a brief stint in the middle as she was brought in to the middle order for the struggling Emma Lamb, but there were only 11 runs required for victory when she came to the crease before Jones whacked her 11th four to seal a comprehensive win.",
        "England's batters will have to adapt again, however, to the slower and spin-friendly surface in Guwahati - though they bowled South Africa out for 69 at the same venue in their opener, and they also come in to the game on the back of a thumping from Australia.",
        "This video can not be played",
        "Ecclestone takes wicket and then leaves the field injured",
        "Notifications, social media and more with BBC Sport"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/cricket/articles/cp9720x189mo",
      "main_category": "sport",
      "detailed_category": "cricket",
      "topic": "Two Australia players 'touched inappropriately'",
      "content": [
        "Two Australia cricketers were \"approached and touched inappropriately\" while in India for the Women's Cricket World Cup, Cricket Australia has said. The incident occurred in Indore on Thursday, the morning after Australia had beaten England, as the players were walking to a cafe.Police in Indore confirmed a man has been arrested. \"We can confirm two members of the Australian Women's Team were approached and touched inappropriately by a motorcyclist while walking to a cafe in Indore,\" Cricket Australia said in a statement.\"The matter was reported by team security to police who are handling the matter.\"Rajesh Dandotiya, additional deputy commissioner of police (crime) in Indore, told BBC News Hindi: \"The accused followed the women players for some distance and kept passing lewd remarks. \"He then moved his motorcycle closer... making inappropriate physical contact. The accused was identified through CCTV footage and arrested.\"Australia are playing South Africa in their final group-stage match of the tournament on Saturday in Indore.Devajit Saikia, honorary secretary of the BCCI, said: \"This is a deeply regrettable and isolated incident. India has always been known for its warmth, hospitality and care towards all guests. \"We maintain a zero-tolerance policy towards such acts. We appreciate the swift and effective action taken by the Madhya Pradesh Police in apprehending the accused. The law will take its due course to ensure justice is served. \"We will also review our existing safety protocols and strengthen them further, if necessary, to ensure such incidents are not repeated.\"",
        "Two Australia cricketers were \"approached and touched inappropriately\" while in India for the Women's Cricket World Cup, Cricket Australia has said.",
        "The incident occurred in Indore on Thursday, the morning after Australia had beaten England, as the players were walking to a cafe.",
        "Police in Indore confirmed a man has been arrested.",
        "\"We can confirm two members of the Australian Women's Team were approached and touched inappropriately by a motorcyclist while walking to a cafe in Indore,\" Cricket Australia said in a statement.",
        "\"The matter was reported by team security to police who are handling the matter.\"",
        "Rajesh Dandotiya, additional deputy commissioner of police (crime) in Indore, told BBC News Hindi: \"The accused followed the women players for some distance and kept passing lewd remarks.",
        "\"He then moved his motorcycle closer... making inappropriate physical contact. The accused was identified through CCTV footage and arrested.\"",
        "Australia are playing South Africa in their final group-stage match of the tournament on Saturday in Indore.",
        "Devajit Saikia, honorary secretary of the BCCI, said: \"This is a deeply regrettable and isolated incident. India has always been known for its warmth, hospitality and care towards all guests.",
        "\"We maintain a zero-tolerance policy towards such acts. We appreciate the swift and effective action taken by the Madhya Pradesh Police in apprehending the accused. The law will take its due course to ensure justice is served.",
        "\"We will also review our existing safety protocols and strengthen them further, if necessary, to ensure such incidents are not repeated.\"",
        "Get cricket news sent straight to your phone"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/cricket/articles/cwyn65d04q6o",
      "main_category": "sport",
      "detailed_category": "cricket",
      "topic": "King takes 7-18 as Australia thrash South Africa",
      "content": [
        "ICC Women's World Cup, IndoreSouth Africa 97 (24 overs): Wolvaardt 31 (26); King 7-18Australia 98-3 (16.5 overs): Mooney 42 (41); Kapp 1-11Australia won by seven wicketsScorecard, Table",
        "Alana King returned the best figures in Women's World Cup history as Australia hammered South Africa by seven wickets to set up a semi-final meeting with India.The leg-spinner claimed 7-18 from seven overs as South Africa collapsed from 32-0 to 97 all out in 24 overs, with Australia completing their chase with 199 balls to spare. King became just the sixth woman and third Australian to take seven wickets in a women's ODI and the first to do it at a Women's World Cup, surpassing New Zealand bowler Jackie Lord's record of 6-10 against India in 1982.The victory in Indore secures top spot in the table for Australia, who have won all six of their completed matches in the group stage, and means they will face fourth-place India in Navi Mumbai on Thursday, 30 October.South Africa will play England, who could leapfrog them into second place with victory over New Zealand on Sunday, in the first semi-final in Guwahati on Wednesday, 29 October.",
        "Opening batter Laura Wolvaardt was one of only three South Africa batters to reach double figures, smacking seven boundaries in the opening six overs to gift her side the perfect start before being removed for 31 by Megan Schutt, King taking the catch at mid-wicket. Kim Garth then trapped Tazmin Brits lbw in the final over of the powerplay before King struck twice in five balls as South Africa collapsed from 42-1 to 43-4. King took five of the remaining six wickets to fall - Ash Gardner bowled Masabata Klaas - as South Africa were bowled out for under 100 for the second time in the tournament, having previously been skittled for 69 by semi-final opponents England in their opener. The defending champions briefly wobbled in their chase, slipping to 11-2 inside six overs, before Beth Mooney (42) and Georgia Voll (38 not out) came together to guide them to a routine win.",
        "Alana King (Australia) - 7-18 v South Africa (2025)Jackie Lord (New Zealand) - 6-10 v India (1982)Glenys Page (New Zealand) - 6-20 v Trinidad & Tobago (1973)Sophie Ecclestone (England) - 6-36 v South Africa (2022)Anya Shrubsole (England) - 6-46 v India (2017)",
        "South Africa have previous for being dismantled by spin. In their 10-wicket demolition at the hands of England, left-arm spinner Linsey Smith accounted for Wolvaardt, Brits, and Kapp as she claimed figures of 3-7 while Sophie Ecclestone and Charlie Dean took two wickets apiece.On Saturday, an inspired performance from King was at the heart of their collapse, exposing frailties against spin, when batting first, and when their top-order fails to fire.Australia, by contrast, head into the semi-finals not only unbeaten, but boosted by yet another player stepping up with a match-defining performance.King's first two wickets were handed to her, Sune Luus and Marizanne Kapp both attempting needlessly aggressive shots and popping simple catches to fielders, but there was little good fortune about the rest of her spell.She began with 14 consecutive dot balls, taking wickets with four of them, and bowled 33 in total from 42 deliveries.Four of her seven wickets were bowled, with Annerie Dercksen undone by a flighted delivery and Sinalo Jafta, Masabata Klaas, and Nadine de Klerk falling victim to the grip and turn she got off the surface.Relentless in her approach, the majority of her deliveries, including six of her seven wicket-taking balls, were good or back of a length.King had largely gone under the radar during Australia's campaign. Economical but unremarkable in the middle overs, her six wickets had been overshadowed by all-round contributions from fellow spinner Gardner and Annabel Sutherland.But on Saturday, she reminded everyone of the threat she poses in the middle overs, orchestrating South Africa's collapse from 42-2 to 97 all out.She has now taken 13 wickets at this World Cup and 25 wickets in just 12 ODIs in 2025, with the latter haul bettered by only Deepti Sharma, Sneh Rana, and Nonkululeko Mlaba, all of whom have played at least three matches more than the Australian and cannot match her average (15.52) or economy (4.34).",
        "This video can not be played",
        "Highlights: King takes 7-18 as Australia ease past South Africa",
        "ICC Women's World Cup, Indore",
        "South Africa 97 (24 overs): Wolvaardt 31 (26); King 7-18",
        "Australia 98-3 (16.5 overs): Mooney 42 (41); Kapp 1-11",
        "Australia won by seven wickets",
        "Alana King returned the best figures in Women's World Cup history as Australia hammered South Africa by seven wickets to set up a semi-final meeting with India.",
        "The leg-spinner claimed 7-18 from seven overs as South Africa collapsed from 32-0 to 97 all out in 24 overs, with Australia completing their chase with 199 balls to spare.",
        "King became just the sixth woman and third Australian to take seven wickets in a women's ODI and the first to do it at a Women's World Cup, surpassing New Zealand bowler Jackie Lord's record of 6-10 against India in 1982.",
        "The victory in Indore secures top spot in the table for Australia, who have won all six of their completed matches in the group stage, and means they will face fourth-place India in Navi Mumbai on Thursday, 30 October.",
        "South Africa will play England, who could leapfrog them into second place with victory over New Zealand on Sunday, in the first semi-final in Guwahati on Wednesday, 29 October.",
        "Opening batter Laura Wolvaardt was one of only three South Africa batters to reach double figures, smacking seven boundaries in the opening six overs to gift her side the perfect start before being removed for 31 by Megan Schutt, King taking the catch at mid-wicket.",
        "Kim Garth then trapped Tazmin Brits lbw in the final over of the powerplay before King struck twice in five balls as South Africa collapsed from 42-1 to 43-4.",
        "King took five of the remaining six wickets to fall - Ash Gardner bowled Masabata Klaas - as South Africa were bowled out for under 100 for the second time in the tournament, having previously been skittled for 69 by semi-final opponents England in their opener.",
        "The defending champions briefly wobbled in their chase, slipping to 11-2 inside six overs, before Beth Mooney (42) and Georgia Voll (38 not out) came together to guide them to a routine win.",
        "Alana King (Australia) - 7-18 v South Africa (2025)",
        "Jackie Lord (New Zealand) - 6-10 v India (1982)",
        "Glenys Page (New Zealand) - 6-20 v Trinidad & Tobago (1973)",
        "Sophie Ecclestone (England) - 6-36 v South Africa (2022)",
        "Anya Shrubsole (England) - 6-46 v India (2017)",
        "Two Australia players 'touched inappropriately'",
        "Women's World Cup table, top run-scorers & wicket-takers",
        "This video can not be played",
        "'What a performance!' - King takes seven wickets to break record",
        "South Africa have previous for being dismantled by spin. In their 10-wicket demolition at the hands of England, left-arm spinner Linsey Smith accounted for Wolvaardt, Brits, and Kapp as she claimed figures of 3-7 while Sophie Ecclestone and Charlie Dean took two wickets apiece.",
        "On Saturday, an inspired performance from King was at the heart of their collapse, exposing frailties against spin, when batting first, and when their top-order fails to fire.",
        "Australia, by contrast, head into the semi-finals not only unbeaten, but boosted by yet another player stepping up with a match-defining performance.",
        "King's first two wickets were handed to her, Sune Luus and Marizanne Kapp both attempting needlessly aggressive shots and popping simple catches to fielders, but there was little good fortune about the rest of her spell.",
        "She began with 14 consecutive dot balls, taking wickets with four of them, and bowled 33 in total from 42 deliveries.",
        "Four of her seven wickets were bowled, with Annerie Dercksen undone by a flighted delivery and Sinalo Jafta, Masabata Klaas, and Nadine de Klerk falling victim to the grip and turn she got off the surface.",
        "Relentless in her approach, the majority of her deliveries, including six of her seven wicket-taking balls, were good or back of a length.",
        "King had largely gone under the radar during Australia's campaign. Economical but unremarkable in the middle overs, her six wickets had been overshadowed by all-round contributions from fellow spinner Gardner and Annabel Sutherland.",
        "But on Saturday, she reminded everyone of the threat she poses in the middle overs, orchestrating South Africa's collapse from 42-2 to 97 all out.",
        "She has now taken 13 wickets at this World Cup and 25 wickets in just 12 ODIs in 2025, with the latter haul bettered by only Deepti Sharma, Sneh Rana, and Nonkululeko Mlaba, all of whom have played at least three matches more than the Australian and cannot match her average (15.52) or economy (4.34).",
        "Notifications, social media and more with BBC Sport"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/cricket/articles/cgjd81pyv3jo",
      "main_category": "sport",
      "detailed_category": "cricket",
      "topic": "Women's World Cup semi-finals - schedule & how to follow",
      "content": [
        "After four weeks, the Women's World Cup has reached the knockout stages.Holders Australia, co-hosts India, 2017 winners England and South Africa are into the last four.Here's everything you need to know.",
        "Australia reached the semi-finals after four wins and a washout in their first five games. They are the only unbeaten team left in the competition. South Africa were the next side to progress after other results went in their favour, and they finish the group stage with five wins. Their campaign was bookended by heavy defeats against England and Australia.England qualified with two games to spare, following a victory over India, before suffering their first defeat against Australia on Wednesday. India became the final team to book a semi-final spot with a win over New Zealand on Thursday.",
        "Wednesday, 29 OctoberEngland v South Africa (09:30 GMT)Barsapara Cricket Stadium, GuwahatiThursday, 30 OctoberAustralia v India (09:30 GMT)Dr DY Patil Sports Academy, Navi Mumbai",
        "The final takes place on Sunday, 2 November from 09:30 GMT. It will take place at the Dr DY Patil Sports Academy in Navi Mumbai.",
        "There will be ball-by-ball commentary on all three games on BBC Sounds, BBC Radio 5 Sports Extra and the BBC Sport website and app (UK users only). The website and app will have live text updates, alongside in-play video clips and post-match highlights (UK users only).You will also be able to keep up to date with the game across BBC Sport's social media channels, with BBCTMS on X and BBCCricket on Instagram.",
        "England, South Africa, Australia and India are the four semi-finalists in the Women's World Cup 2025.",
        "After four weeks, the Women's World Cup has reached the knockout stages.",
        "Holders Australia, co-hosts India, 2017 winners England and South Africa are into the last four.",
        "Here's everything you need to know.",
        "Australia reached the semi-finals after four wins and a washout in their first five games. They are the only unbeaten team left in the competition.",
        "South Africa were the next side to progress after other results went in their favour, and they finish the group stage with five wins. Their campaign was bookended by heavy defeats against England and Australia.",
        "England qualified with two games to spare, following a victory over India, before suffering their first defeat against Australia on Wednesday.",
        "India became the final team to book a semi-final spot with a win over New Zealand on Thursday.",
        "Wednesday, 29 October",
        "England v South Africa (09:30 GMT)",
        "Barsapara Cricket Stadium, Guwahati",
        "Australia v India (09:30 GMT)",
        "Dr DY Patil Sports Academy, Navi Mumbai",
        "The final takes place on Sunday, 2 November from 09:30 GMT.",
        "It will take place at the Dr DY Patil Sports Academy in Navi Mumbai.",
        "There will be ball-by-ball commentary on all three games on BBC Sounds, BBC Radio 5 Sports Extra and the BBC Sport website and app (UK users only).",
        "The website and app will have live text updates, alongside in-play video clips and post-match highlights (UK users only).",
        "You will also be able to keep up to date with the game across BBC Sport's social media channels, with BBCTMS on X and BBCCricket on Instagram.",
        "Get cricket news sent straight to your phone"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/cricket/articles/cy40kd8vxkgo",
      "main_category": "sport",
      "detailed_category": "cricket",
      "topic": "Rohit and Kohli star as India hammer Australia",
      "content": [
        "Third one-day international, SydneyAustralia 236 all out (46.4 overs): Renshaw 56 (58), Rana 4-39India 237-1 (38.3 overs): Rohit 121* (125), Kohli 74* (81); Hazlewood 1-23India won by nine wickets; Australia win series 2-1Scorecard",
        "Rohit Sharma scored his 50th international hundred as India thrashed Australia in the third one-day international to earn a consolation win.An unbroken partnership of 168 between Rohit (121*) and Virat Kohli (74*) led India to their target of 237 with 69 balls to spare in Sydney. Kohli, who was dismissed without scoring in the first two games which India lost, passed Kumar Sangakkara to become the second-highest run scorer in the format.The 36-year-old now has 14,255 runs in ODIs, but has some way to go to pass Sachin Tendulkar's record 18,426.Australia won the toss and chose to bat, but were bowled out in the 47th over with seamer Harshit Rana taking 4-39.Matt Renshaw top-scored with 56, his first ODI half-century having made his debut in this series, while the remainder of Australia's top six made scores between 23 and 41 but failed to push on.Captain Shubman Gill was the one man to fall in India's reply, caught behind off Josh Hazlewood for 24, before Kohli and Rohit comfortably guided the tourists to victory.The two sides now meet in five T20 internationals, with the first in Canberra on Wednesday.",
        "Rohit Sharma now has 33 ODI hundreds, the third most in history - behind Sachin Tendulkar (49) and Virat Kohli (51)",
        "Third one-day international, Sydney",
        "Australia 236 all out (46.4 overs): Renshaw 56 (58), Rana 4-39",
        "India 237-1 (38.3 overs): Rohit 121* (125), Kohli 74* (81); Hazlewood 1-23",
        "India won by nine wickets; Australia win series 2-1",
        "Rohit Sharma scored his 50th international hundred as India thrashed Australia in the third one-day international to earn a consolation win.",
        "An unbroken partnership of 168 between Rohit (121*) and Virat Kohli (74*) led India to their target of 237 with 69 balls to spare in Sydney.",
        "Kohli, who was dismissed without scoring in the first two games which India lost, passed Kumar Sangakkara to become the second-highest run scorer in the format.",
        "The 36-year-old now has 14,255 runs in ODIs, but has some way to go to pass Sachin Tendulkar's record 18,426.",
        "Australia won the toss and chose to bat, but were bowled out in the 47th over with seamer Harshit Rana taking 4-39.",
        "Matt Renshaw top-scored with 56, his first ODI half-century having made his debut in this series, while the remainder of Australia's top six made scores between 23 and 41 but failed to push on.",
        "Captain Shubman Gill was the one man to fall in India's reply, caught behind off Josh Hazlewood for 24, before Kohli and Rohit comfortably guided the tourists to victory.",
        "The two sides now meet in five T20 internationals, with the first in Canberra on Wednesday.",
        "Notifications, social media and more with BBC Sport"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/cricket/articles/cx23dnp8ne6o",
      "main_category": "sport",
      "detailed_category": "cricket",
      "topic": "Women's World Cup table, top run-scorers & wicket-takers",
      "content": [
        "The World Cup in India and Sri Lanka has entered the knockout stage. But which players are topping the run-scoring and wicket-taking charts?BBC Sport digs out all of the important numbers.",
        "*top four qualify for the semi-finals with first playing fourth and second facing third. Teams on the same points are separated by number of wins initially and then net run-rate.",
        "Most runs1. Smriti Mandhana (India) - 3652. Pratika Rawal (India) - 3083. Laura Wolvaardt (South Africa) - 3014. Alyssa Healy (Australia) - 2945. Sophie Devine (New Zealand) - 289Highest score1. Alyssa Healy (Australia v India) - 1422.  Pratika Rawal (India v New Zealand) - 1223. Nat Sciver-Brunt (England v Sri Lanka) - 1174. Ash Gardner (Australia v New Zealand) - 1155. Alyssa Healy (Australia v Bangladesh) - 113*Average1. Alyssa Healy (Australia) - 982. Ash Gardner (Australia) - 88.333. Smriti Mandhana (India) - 60.834. Nadine de Klerk (South Africa) - 59.665. Sophie Devine (New Zealand) - 57.80Strike-rate1. Nadine de Klerk (South Africa) - 134.582. Alyssa Healy (Australia) - 131.253. Richa Ghosh (India) - 128.674. Ash Gardner (Australia) - 128.015. Jemimah Rodrigues (India) - 119.49",
        "Most wickets=1. Annabel Sutherland (Australia), Deepti Sharma (India) - 153. Alana King (Australia) - 13=5. Sophie Ecclestone, Linsey Smith (both England) - 12Economy 1. Malki Madara (Sri Lanka) - 2.912. Georgia Wareham (Australia) - 3.363. Sanjida Akter (Bangladesh) - 3.424. Alana King (Australia) - 3.575. Linsey Smith (England) - 3.60Best figures1. Alana King (Australia) - 7-182. Annabel Sutherland (Australia) - 5-403. Sophie Ecclestone (England v Sri Lanka) - 4-174. Fatima Sana (Pakistan v England) - 4-275. Nonkululeko Mlaba (South Africa v New Zealand) - 4-40 Average1. Nondumiso Shangase (South Africa) - 9.52. Radha Yadav (India) - 103. Georgia Wareham (Australia) - 12.334. Pratika Rawal (India) - 12.505. Alana King (Australia) - 12.92",
        "India's Smriti Mandhana and Australia's Annabel Sutherland are the leading run-scorer and wicket taker at the Women's World Cup",
        "The World Cup in India and Sri Lanka has entered the knockout stage.",
        "But which players are topping the run-scoring and wicket-taking charts?",
        "BBC Sport digs out all of the important numbers.",
        "*top four qualify for the semi-finals with first playing fourth and second facing third.",
        "Teams on the same points are separated by number of wins initially and then net run-rate.",
        "This video can not be played",
        "Best shots from Mandhana's innings against New Zealand",
        "1. Smriti Mandhana (India) - 365",
        "2. Pratika Rawal (India) - 308",
        "3. Laura Wolvaardt (South Africa) - 301",
        "4. Alyssa Healy (Australia) - 294",
        "5. Sophie Devine (New Zealand) - 289",
        "1. Alyssa Healy (Australia v India) - 142",
        "2.  Pratika Rawal (India v New Zealand) - 122",
        "3. Nat Sciver-Brunt (England v Sri Lanka) - 117",
        "4. Ash Gardner (Australia v New Zealand) - 115",
        "5. Alyssa Healy (Australia v Bangladesh) - 113*",
        "1. Alyssa Healy (Australia) - 98",
        "2. Ash Gardner (Australia) - 88.33",
        "3. Smriti Mandhana (India) - 60.83",
        "4. Nadine de Klerk (South Africa) - 59.66",
        "5. Sophie Devine (New Zealand) - 57.80",
        "1. Nadine de Klerk (South Africa) - 134.58",
        "2. Alyssa Healy (Australia) - 131.25",
        "3. Richa Ghosh (India) - 128.67",
        "4. Ash Gardner (Australia) - 128.01",
        "5. Jemimah Rodrigues (India) - 119.49",
        "This video can not be played",
        "'What a performance!' - King takes seven wickets to break record",
        "=1. Annabel Sutherland (Australia), Deepti Sharma (India) - 15",
        "3. Alana King (Australia) - 13",
        "=5. Sophie Ecclestone, Linsey Smith (both England) - 12",
        "1. Malki Madara (Sri Lanka) - 2.91",
        "2. Georgia Wareham (Australia) - 3.36",
        "3. Sanjida Akter (Bangladesh) - 3.42",
        "4. Alana King (Australia) - 3.57",
        "5. Linsey Smith (England) - 3.60",
        "1. Alana King (Australia) - 7-18",
        "2. Annabel Sutherland (Australia) - 5-40",
        "3. Sophie Ecclestone (England v Sri Lanka) - 4-17",
        "4. Fatima Sana (Pakistan v England) - 4-27",
        "5. Nonkululeko Mlaba (South Africa v New Zealand) - 4-40",
        "1. Nondumiso Shangase (South Africa) - 9.5",
        "2. Radha Yadav (India) - 10",
        "3. Georgia Wareham (Australia) - 12.33",
        "4. Pratika Rawal (India) - 12.50",
        "5. Alana King (Australia) - 12.92",
        "Get cricket news sent straight to your phone"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/cricket/articles/cn4jg4zy9wzo",
      "main_category": "sport",
      "detailed_category": "cricket",
      "topic": "Rain thwarts India and Bangladesh in Navi Mumbai",
      "content": [
        "ICC Women's World Cup, Navi MumbaiBangladesh 119-9 (27 overs): Sharmin 36 (53); Yadav 3-30 India 57-0 (8.4 overs): Mandhana 34* (27), Amanjot 15* (25)No resultScorecard; Table",
        "Rain prevented a result between Bangladesh and co-hosts India in the final group stage game of the Women's World Cup as persistent rain had the final say in Navi Mumbai.Chasing an adjusted target of 126 under the Duckworth-Lewis-Stern method after the game was reduced to 27 overs per side, India were 57-0 when the match officials were forced to call off the dead rubber.Smriti Mandhana, the tournament's highest run scorer, hit an unbeaten 34 to keep her purple patch going but an injury to her opening partner Pratika Rawal while fielding will be a major cause of concern for India. Captain Harmanpreet Kaur's side, already assured of their semi-final place, will now face defending champions Australia in the last four at the same venue on Thursday as they look to secure their maiden title. India had made early inroads after bowling first in a game that was initially reduced to 43 overs per side, as Renuka Singh Thakur struck in the first over to dismiss Bangladesh opener Sumaiya Akter.Off-spinner Deepti Sharma then claimed the wicket of Rubya Haider Jhelik in the 10th over before rain returned with greater intensity to interrupt the proceedings.After a delay of more than two hours, the players returned with the game further truncated to 27 overs per side.Sobhana Mostary, who struck an unbeaten 66 against Australia last week, tried to keep the runs flowing, partnering Sharmin Akter Supta (36), with the duo hitting eight of the nine boundaries in the Bangladesh innings between them. But once Mostary fell for 26 from 21 balls at 91-4 in the 22nd over, India picked up a wicket in every over as Bangladesh struggled to up the run rate.India made a strong reply with Mandhana hitting six boundaries to reach 34 off 27 balls, but the weather had other plans as it forced an abrupt end to the contest.",
        "Though India dominated most of the action, there was a worrying setback. Opener Rawal, the second highest scorer in the tournament with 309, twisted her ankle while attempting to stop a boundary on the slippery outfield at the DY Patil Stadium and had to be helped off the field by medical staff. Rawal was in visible pain and it will be an anxious wait for India to find out the extent of her injury. She has the experience of standing up to the formidable Australian bowling attack already in this tournament, hitting 75 in an opening partnership of 155 with Smriti Mandhana in the group stage while the pair also added 212 against New Zealand as both hit centuries.The washout also served as a reminder to both India and Australia that weather, not form, could prove decisive in their last-four tie.Both semi-finals and the final have reserve days in place to guard against further weather interruptions.If there is no result in the semi-finals, the team that finished higher in the group stage will progress to the final where the trophy will be shared if no result is possible.",
        "India had already booked their Women's World Cup semi-final against Australia",
        "ICC Women's World Cup, Navi Mumbai",
        "Bangladesh 119-9 (27 overs): Sharmin 36 (53); Yadav 3-30",
        "India 57-0 (8.4 overs): Mandhana 34* (27), Amanjot 15* (25)",
        "Rain prevented a result between Bangladesh and co-hosts India in the final group stage game of the Women's World Cup as persistent rain had the final say in Navi Mumbai.",
        "Chasing an adjusted target of 126 under the Duckworth-Lewis-Stern method after the game was reduced to 27 overs per side, India were 57-0 when the match officials were forced to call off the dead rubber.",
        "Smriti Mandhana, the tournament's highest run scorer, hit an unbeaten 34 to keep her purple patch going but an injury to her opening partner Pratika Rawal while fielding will be a major cause of concern for India.",
        "Captain Harmanpreet Kaur's side, already assured of their semi-final place, will now face defending champions Australia in the last four at the same venue on Thursday as they look to secure their maiden title.",
        "India had made early inroads after bowling first in a game that was initially reduced to 43 overs per side, as Renuka Singh Thakur struck in the first over to dismiss Bangladesh opener Sumaiya Akter.",
        "Off-spinner Deepti Sharma then claimed the wicket of Rubya Haider Jhelik in the 10th over before rain returned with greater intensity to interrupt the proceedings.",
        "After a delay of more than two hours, the players returned with the game further truncated to 27 overs per side.",
        "Sobhana Mostary, who struck an unbeaten 66 against Australia last week, tried to keep the runs flowing, partnering Sharmin Akter Supta (36), with the duo hitting eight of the nine boundaries in the Bangladesh innings between them.",
        "But once Mostary fell for 26 from 21 balls at 91-4 in the 22nd over, India picked up a wicket in every over as Bangladesh struggled to up the run rate.",
        "India made a strong reply with Mandhana hitting six boundaries to reach 34 off 27 balls, but the weather had other plans as it forced an abrupt end to the contest.",
        "Psychology and cricket - meet India's latest batting star",
        "Women's World Cup semi-finals - schedule & how to follow",
        "Women's World Cup table, top run-scorers & wicket-takers",
        "Though India dominated most of the action, there was a worrying setback.",
        "Opener Rawal, the second highest scorer in the tournament with 309, twisted her ankle while attempting to stop a boundary on the slippery outfield at the DY Patil Stadium and had to be helped off the field by medical staff.",
        "Rawal was in visible pain and it will be an anxious wait for India to find out the extent of her injury.",
        "She has the experience of standing up to the formidable Australian bowling attack already in this tournament, hitting 75 in an opening partnership of 155 with Smriti Mandhana in the group stage while the pair also added 212 against New Zealand as both hit centuries.",
        "The washout also served as a reminder to both India and Australia that weather, not form, could prove decisive in their last-four tie.",
        "Both semi-finals and the final have reserve days in place to guard against further weather interruptions.",
        "If there is no result in the semi-finals, the team that finished higher in the group stage will progress to the final where the trophy will be shared if no result is possible.",
        "Notifications, social media and more with BBC Sport"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/cricket/articles/ce9dvx8dk1xo",
      "main_category": "sport",
      "detailed_category": "cricket",
      "topic": "Brisbane Test 'realistic' for Cummins return - Lyon",
      "content": [
        "Australia spinner Nathan Lyon believes captain Pat Cummins will struggle to be fit for the Ashes opener in Perth but could \"realistically\" return for the second Test in Brisbane.Cummins, 32, is recovering from a back injury that had threatened to rule him out of the highly anticipated series against England.Australia's chair of selectors George Bailey expects the fast bowler to play a \"major part\" in the five-match contest but Lyon thinks the first Test, which starts on 21 November, will come too soon.\"Perth might be pretty difficult, if I'm being honest,\" he told ABC Sport.\"But realistically, I think there's still a big goal to potentially play Brisbane [or] Adelaide.\"Should he miss the first Test, Cummins would have another 13 days to prove his fitness before the day-night Test in Brisbane on 4 December and a further 13 beyond that until the Adelaide Test starts on 17 December.",
        "Cummins was ruled out of Australia's limited-overs series against New Zealand and India last month after scans revealed a lumbar bone stress injury in his back.He has a history of back issues, with flare-ups in 2012-13, 2013-14 and 2015-16 causing him to miss three Australian summers in four years.\"I personally think we'll see him involved in the series at some stage,\" Lyon added.\"He's doing everything that he possibly can. That's one where you're really proud of him as a mate but also as a team-mate and your captain, he's really leading the way by setting the example. He's training his backside off.\"I've seen him doing the work and you know the class of the player, but also the professionalism of Pat. He's giving himself the best chance and that's all we can ask.\"",
        "Pat Cummins (left) has taken 91 wickets at 24.10 in 19 Ashes Tests",
        "Australia spinner Nathan Lyon believes captain Pat Cummins will struggle to be fit for the Ashes opener in Perth but could \"realistically\" return for the second Test in Brisbane.",
        "Cummins, 32, is recovering from a back injury that had threatened to rule him out of the highly anticipated series against England.",
        "Australia's chair of selectors George Bailey expects the fast bowler to play a \"major part\" in the five-match contest but Lyon thinks the first Test, which starts on 21 November, will come too soon.",
        "\"Perth might be pretty difficult, if I'm being honest,\" he told ABC Sport.",
        "\"But realistically, I think there's still a big goal to potentially play Brisbane [or] Adelaide.\"",
        "Should he miss the first Test, Cummins would have another 13 days to prove his fitness before the day-night Test in Brisbane on 4 December and a further 13 beyond that until the Adelaide Test starts on 17 December.",
        "Root or Smith, Starc or Wood - Vaughan & McGrath pick combined Ashes XI",
        "Cummins will play 'major part' in Ashes",
        "Archer to miss England's first ODI in New Zealand",
        "Cummins was ruled out of Australia's limited-overs series against New Zealand and India last month after scans revealed a lumbar bone stress injury in his back.",
        "He has a history of back issues, with flare-ups in 2012-13, 2013-14 and 2015-16 causing him to miss three Australian summers in four years.",
        "\"I personally think we'll see him involved in the series at some stage,\" Lyon added.",
        "\"He's doing everything that he possibly can. That's one where you're really proud of him as a mate but also as a team-mate and your captain, he's really leading the way by setting the example. He's training his backside off.",
        "\"I've seen him doing the work and you know the class of the player, but also the professionalism of Pat. He's giving himself the best chance and that's all we can ask.\"",
        "The Ashes: Australia v England",
        "21 November 2025 - 7 January 2026",
        "Ball-by-ball commentary on BBC Sounds, BBC Radio 5 Sports Extra and the BBC Sport website and app, which will also have live text commentary and daily features and analysis",
        "Get cricket news sent straight to your phone"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/cricket/articles/c993prjzp1no",
      "main_category": "sport",
      "detailed_category": "cricket",
      "topic": "T20 series 'worthwhile' despite washouts - Brook",
      "content": [
        "Third T20, AucklandNew Zealand 38-1 (3.4 overs): Seifert 23* (11); Carse 1-25 England: Did not batMatch abandoned; England win series 1-0Scorecard",
        "Captain Harry Brook says England's T20 series in New Zealand has still been \"very worthwhile\" despite two of the three matches being abandoned because of the rain.Just 3.4 overs were possible in the third T20 in Auckland on Thursday and only 20 were bowled in the first match in Christchurch.England won the series 1-0 courtesy of a dominant 65-run victory in the second match and Brook insisted the time they have been able to spend off the field has been of benefit as they build towards February's T20 World Cup.\"The other night was a class game to be a part of,\" Brook said.\"It was entertaining for sure and we had a lot of fun out there. \"That is something we have really tried to do this series to make sure we are having fun on and off the pitch.\"",
        "Severe weather has impacted flights and left thousands of people without power in New Zealand, though most of the disruption has come south of Auckland.This series, which was always likely to be overshadowed by England's build-up to the Ashes series starting next month, has been scheduled unusually early in New Zealand's season.Some may roll their eyes at the idea of Brook talking up time spent together off the field. England's tendency to talk about playing golf frustrates some fans but Brook's comments do come with merit. Defeats and disappointing performances at the 2023 World Cup, the T20 World Cup in 2024 and the Champions Trophy earlier this year often left the mood around England's white-ball squads downbeat under the latter part of Jos Buttler's captaincy.Some players opted to skip bilateral series for franchise opportunities, all while coach Brendon McCullum revitalised the Test side with their exciting 'Bazball' approach.McCullum, who combined the role of white-ball coach with his Test duties at the start of the year, has regularly promoted a relaxed and fun environment among the Test group.Before this tour England traveled to Queenstown, New Zealand's adventure sports capital, for a team bonding trip with golf, of course, high on the agenda.\"We had a team bonding few days and spent a lot of time together, which the white-ball squad has never had,\" added Brook.\"To be able to spend time together, trying to be good mates. We have had a lot of fun and having a lot of fun off the field can help you on the field as well.\"It has been very worthwhile.\"The win is a first overseas series victory for Brook as England's white-ball captain. They have won seven of their eight completed T20s since he took charge of England's white-ball sides in April in an encouraging start.They will ultimately be judged at the T20 World Cup in February, however, and now have just three more matches - against co-hosts Sri Lanka from 30 January - before their campaign begins. On Sunday (02:00 BST) they begin a three-match one-day international series against the Black Caps when Ashes players Joe Root, Ben Duckett, Jofra Archer and Jamie Smith join the squad, with Archer sitting out the first ODI to manage his workload before traveling to Australia.The Ashes continues to loom large.",
        "England won the second T20, with the other two matches washed out",
        "New Zealand 38-1 (3.4 overs): Seifert 23* (11); Carse 1-25",
        "Match abandoned; England win series 1-0",
        "Captain Harry Brook says England's T20 series in New Zealand has still been \"very worthwhile\" despite two of the three matches being abandoned because of the rain.",
        "Just 3.4 overs were possible in the third T20 in Auckland on Thursday and only 20 were bowled in the first match in Christchurch.",
        "England won the series 1-0 courtesy of a dominant 65-run victory in the second match and Brook insisted the time they have been able to spend off the field has been of benefit as they build towards February's T20 World Cup.",
        "\"The other night was a class game to be a part of,\" Brook said.",
        "\"It was entertaining for sure and we had a lot of fun out there.",
        "\"That is something we have really tried to do this series to make sure we are having fun on and off the pitch.\"",
        "Root & Bell win 2025 Cricket Media Club awards",
        "Notifications, social media and more with BBC Sport",
        "This video can not be played",
        "Harry Brook talks about the fun the team had despite the rain",
        "Severe weather has impacted flights and left thousands of people without power in New Zealand, though most of the disruption has come south of Auckland.",
        "This series, which was always likely to be overshadowed by England's build-up to the Ashes series starting next month, has been scheduled unusually early in New Zealand's season.",
        "Some may roll their eyes at the idea of Brook talking up time spent together off the field. England's tendency to talk about playing golf frustrates some fans but Brook's comments do come with merit.",
        "Defeats and disappointing performances at the 2023 World Cup, the T20 World Cup in 2024 and the Champions Trophy earlier this year often left the mood around England's white-ball squads downbeat under the latter part of Jos Buttler's captaincy.",
        "Some players opted to skip bilateral series for franchise opportunities, all while coach Brendon McCullum revitalised the Test side with their exciting 'Bazball' approach.",
        "McCullum, who combined the role of white-ball coach with his Test duties at the start of the year, has regularly promoted a relaxed and fun environment among the Test group.",
        "Before this tour England traveled to Queenstown, New Zealand's adventure sports capital, for a team bonding trip with golf, of course, high on the agenda.",
        "\"We had a team bonding few days and spent a lot of time together, which the white-ball squad has never had,\" added Brook.",
        "\"To be able to spend time together, trying to be good mates. We have had a lot of fun and having a lot of fun off the field can help you on the field as well.",
        "\"It has been very worthwhile.\"",
        "The win is a first overseas series victory for Brook as England's white-ball captain. They have won seven of their eight completed T20s since he took charge of England's white-ball sides in April in an encouraging start.",
        "They will ultimately be judged at the T20 World Cup in February, however, and now have just three more matches - against co-hosts Sri Lanka from 30 January - before their campaign begins.",
        "On Sunday (02:00 BST) they begin a three-match one-day international series against the Black Caps when Ashes players Joe Root, Ben Duckett, Jofra Archer and Jamie Smith join the squad, with Archer sitting out the first ODI to manage his workload before traveling to Australia.",
        "The Ashes continues to loom large."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/cricket/articles/cn7exx5d02lo",
      "main_category": "sport",
      "detailed_category": "cricket",
      "topic": "India beat New Zealand to take last semi-final spot",
      "content": [
        "ICC Women's World Cup, Navi MumbaiIndia 340-3 (49 overs): Rawal 122 (134) Mandhana 109 (95); Bates 1-40New Zealand 271-8 (44 overs): Halliday 81 (84); Renuka 2-25India won by 53 runs  (DLS method)Scorecard; Table",
        "India secured the final spot in the World Cup semi-finals and eliminated New Zealand and Sri Lanka with a 53-run victory (DLS) over the White Ferns in Navi Mumbai.The co-hosts had been in danger of missing out on the last four of the 50-over competition for the third time in four editions, heading into their penultimate group match on a run of three consecutive defeats.New Zealand, meanwhile, level with India on four points, had seen their campaign disrupted by the weather, with their past two matches abandoned due to rain after winning one of their opening three.More wet weather briefly threatened to frustrate both sides, with a 90-minute delay at the backend of India's innings reducing the game to 49 overs per side before a second delay saw New Zealand's chase adjusted to 325 from 44 overs.However, India comfortably secured the required two points to join Australia, South Africa, and England in the knockout stages, with centuries from Pratika Rawal – whose 122 (134) is the second-highest score of the tournament – and Smriti Mandhana (109 off 95) helping India post 340-3. New Zealand could only make 271-8 in reply. Although New Zealand and Sri Lanka could join them on six points if they win their final group matches and India lose to Bangladesh, neither side can match India's three wins, which is the first criteria used to separate sides.Mandhana and Rawal were rarely troubled by New Zealand's bowlers, effortlessly piling on 212 for the first wicket, while Jemimah Rodrigues contributed a quickfire 76 (55) as India compiled the highest total of the tournament.In reply, New Zealand lost experienced duo Suzie Bates and captain Sophie Devine for single-figure scores as they slipped to 59-3. However, Brooke Halliday and Izzy Gaze scored half-centuries from the middle order, the latter from an eye-catching 39 balls, as the White Ferns went down fighting.",
        "This was must-win territory for both teams, but the bulk of the pressure was on India. Searching for their maiden Women's World Cup crown, they headed into this tournament, on home soil, as title favourites alongside Australia and England.Comfortable victories over Sri Lanka and Pakistan gave them the ideal start but then they faltered, suffering consecutive defeats to South Africa, Australia, and England – and on all three occasions, they were left to rue what might have been.They reduced South Africa to 81-5 chasing 252 before being blown away by Nadine de Klerk. They failed to defend 330 against Australia, having earlier lost 36-6 at the back end of their innings. Against England, they failed to chase 289 despite needing a manageable 62 runs from the final 10 overs – they lost by four runs.But they returned to winning ways with a ruthless batting display against New Zealand.At the top of the order, Mandhana passed 50 for the third consecutive innings while Rawal now has a hundred to go with her half-century against Australia. Both players showed good patience as they weathered the swing of Rosemary Mair and Jess Kerr early in the powerplay before settling into serene partnership against a toothless New Zealand attack.Rodrigues, meanwhile, seized her opportunity after being promoted up the order, scoring freely around the ground as she became the seventh India player to pass 50 at the tournament.Combined, India's batters hit 42 boundaries and scored at just under seven an over.However, the same ruthlessness was not on display during New Zealand's chase. They dropped several catches, gave up boundaries with ease, and never looked like bowling New Zealand out despite removing three of their top four inside 12 overs.While Gaze's onslaught came too late to put the hosts in any danger of losing, India failed to deliver the statement performance which would reaffirm their status as serious title contenders.",
        "New Zealand captain Sophie Devine: \"We are incredibly disappointed. It has been a frustrating tournament and we wanted more opportunities.\"Credit to India today. I am so proud of how the girls continued to fight. With a full 50 overs, could we have got closer? Maybe. Absolutely gutted.\"We are playing nations that have 1.4 billion people and we have 5 million. We have to remember that.\"India captain Harmanpreet Kaur: \"It wasn't easy. Credit goes to the entire team, the way we fought today, we knew how important this game was.\"We were getting starts, now it's time to make it big. Credit goes to Pratika and Smriti. The team stood up, we lifted each other after the last three games didn't go well.\"Whenever you play at home, everyone expects a lot from you. We are always discussing as a team that this is our home, the crowd is cheering for you, this a time to enjoy.\"",
        "This video can not be played",
        "ICC Women's Cricket World Cup highlights: India v New Zealand",
        "ICC Women's World Cup, Navi Mumbai",
        "India 340-3 (49 overs): Rawal 122 (134) Mandhana 109 (95); Bates 1-40",
        "New Zealand 271-8 (44 overs): Halliday 81 (84); Renuka 2-25",
        "India won by 53 runs  (DLS method)",
        "India secured the final spot in the World Cup semi-finals and eliminated New Zealand and Sri Lanka with a 53-run victory (DLS) over the White Ferns in Navi Mumbai.",
        "The co-hosts had been in danger of missing out on the last four of the 50-over competition for the third time in four editions, heading into their penultimate group match on a run of three consecutive defeats.",
        "New Zealand, meanwhile, level with India on four points, had seen their campaign disrupted by the weather, with their past two matches abandoned due to rain after winning one of their opening three.",
        "More wet weather briefly threatened to frustrate both sides, with a 90-minute delay at the backend of India's innings reducing the game to 49 overs per side before a second delay saw New Zealand's chase adjusted to 325 from 44 overs.",
        "However, India comfortably secured the required two points to join Australia, South Africa, and England in the knockout stages, with centuries from Pratika Rawal – whose 122 (134) is the second-highest score of the tournament – and Smriti Mandhana (109 off 95) helping India post 340-3. New Zealand could only make 271-8 in reply.",
        "Although New Zealand and Sri Lanka could join them on six points if they win their final group matches and India lose to Bangladesh, neither side can match India's three wins, which is the first criteria used to separate sides.",
        "Mandhana and Rawal were rarely troubled by New Zealand's bowlers, effortlessly piling on 212 for the first wicket, while Jemimah Rodrigues contributed a quickfire 76 (55) as India compiled the highest total of the tournament.",
        "In reply, New Zealand lost experienced duo Suzie Bates and captain Sophie Devine for single-figure scores as they slipped to 59-3.",
        "However, Brooke Halliday and Izzy Gaze scored half-centuries from the middle order, the latter from an eye-catching 39 balls, as the White Ferns went down fighting.",
        "Psychology and cricket - meet India's latest batting star",
        "Women's World Cup table, top run-scorers & wicket-takers",
        "England in semi-finals - but who will they play?",
        "This video can not be played",
        "Best shots from Rawal's 'marvellous' innings against New Zealand",
        "This was must-win territory for both teams, but the bulk of the pressure was on India. Searching for their maiden Women's World Cup crown, they headed into this tournament, on home soil, as title favourites alongside Australia and England.",
        "Comfortable victories over Sri Lanka and Pakistan gave them the ideal start but then they faltered, suffering consecutive defeats to South Africa, Australia, and England – and on all three occasions, they were left to rue what might have been.",
        "They reduced South Africa to 81-5 chasing 252 before being blown away by Nadine de Klerk. They failed to defend 330 against Australia, having earlier lost 36-6 at the back end of their innings. Against England, they failed to chase 289 despite needing a manageable 62 runs from the final 10 overs – they lost by four runs.",
        "But they returned to winning ways with a ruthless batting display against New Zealand.",
        "At the top of the order, Mandhana passed 50 for the third consecutive innings while Rawal now has a hundred to go with her half-century against Australia. Both players showed good patience as they weathered the swing of Rosemary Mair and Jess Kerr early in the powerplay before settling into serene partnership against a toothless New Zealand attack.",
        "Rodrigues, meanwhile, seized her opportunity after being promoted up the order, scoring freely around the ground as she became the seventh India player to pass 50 at the tournament.",
        "Combined, India's batters hit 42 boundaries and scored at just under seven an over.",
        "However, the same ruthlessness was not on display during New Zealand's chase.",
        "They dropped several catches, gave up boundaries with ease, and never looked like bowling New Zealand out despite removing three of their top four inside 12 overs.",
        "While Gaze's onslaught came too late to put the hosts in any danger of losing, India failed to deliver the statement performance which would reaffirm their status as serious title contenders.",
        "This video can not be played",
        "Best shots from Mandhana's innings against New Zealand",
        "New Zealand captain Sophie Devine: \"We are incredibly disappointed. It has been a frustrating tournament and we wanted more opportunities.",
        "\"Credit to India today. I am so proud of how the girls continued to fight. With a full 50 overs, could we have got closer? Maybe. Absolutely gutted.",
        "\"We are playing nations that have 1.4 billion people and we have 5 million. We have to remember that.\"",
        "India captain Harmanpreet Kaur: \"It wasn't easy. Credit goes to the entire team, the way we fought today, we knew how important this game was.",
        "\"We were getting starts, now it's time to make it big. Credit goes to Pratika and Smriti. The team stood up, we lifted each other after the last three games didn't go well.",
        "\"Whenever you play at home, everyone expects a lot from you. We are always discussing as a team that this is our home, the crowd is cheering for you, this a time to enjoy.\"",
        "Notifications, social media and more with BBC Sport"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/cricket/articles/cpvgry25z77o",
      "main_category": "sport",
      "detailed_category": "cricket",
      "topic": "Future tour dates",
      "content": [
        "West Indies men in New Zealand (November-December 2025)Ireland men in Bangladesh (November-December 2025)Sri Lanka & Afghanistan men in Pakistan (November 2025)Men's Ashes: England in Australia (November 2025-January 2026)South Africa men in India (November-December 2025)Ireland women in South Africa (December 2025)England men in Sri Lanka (January-February 2026)West Indies men in South Africa (January-February 2026)South Africa men in New Zealand (March 2026)",
        "New Zealand women in England (May 2026)India women in England (May-July 2026)New Zealand men in England (June 2026)ICC Women's T20 World Cup (June-July 2026)India men in England (July 2026)Pakistan men in England (August-September 2026)Ireland women in England (September 2026)Sri Lanka men in England (September 2026)",
        "Women's Future Tours Programme 2025-29, external (ICC site)",
        "West Indies men in New Zealand (November-December 2025)",
        "Ireland men in Bangladesh (November-December 2025)",
        "Sri Lanka & Afghanistan men in Pakistan (November 2025)",
        "Men's Ashes: England in Australia (November 2025-January 2026)",
        "South Africa men in India (November-December 2025)",
        "Ireland women in South Africa (December 2025)",
        "England men in Sri Lanka (January-February 2026)",
        "West Indies men in South Africa (January-February 2026)",
        "South Africa men in New Zealand (March 2026)",
        "New Zealand women in England (May 2026)",
        "India women in England (May-July 2026)",
        "New Zealand men in England (June 2026)",
        "ICC Women's T20 World Cup (June-July 2026)",
        "India men in England (July 2026)",
        "Pakistan men in England (August-September 2026)",
        "Ireland women in England (September 2026)",
        "Sri Lanka men in England (September 2026)",
        "Women's Future Tours Programme 2025-29, external (ICC site)",
        "Get cricket news sent straight to your phone",
        "ICC Test, ODI and T20 rankings"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/cricket/articles/cq6r4zypg9zo",
      "main_category": "sport",
      "detailed_category": "cricket",
      "topic": "County ins and outs",
      "content": [
        "With the 2025 county season fast approaching, stay up to date with the latest player signings and speculation.Key to abbreviations: REL = released; RET = retired; YTH = from youth teams; UKP = born overseas, but has UK passport.Counties have been permitted to field two overseas players in all competitions since 2021.Players who moved counties or retired during the 2024 season are included on the 2024 list. A list of players who were unavailable for the One-Day Cup as they had been selected for The Hundred can be found here. Not included are players signed on short-term arrangements purely for non-competitive friendly matches.",
        "23 September - Essex batter Nick Browne will retire at the end of the season22 September - Surrey sign India spinner Rahul Chahar as an overseas player for their final County Championship game19 September - Derbyshire batter David Lloyd will retire at the end of the season",
        "Overseas players: Caleb Jewell (Australia), Blair Tickner (New Zealand), Allah Mohammad Ghazanfar (Afghanistan, for T20)In: Martin Andersson (Middlesex), Jack Morley, external (Lancashire), Fynn Hudson-Prentice (Sussex, initial four-match loan for T20 from 8 June), Amrit Basra (South Asian Cricket Academy), Rory Haydon, Joe Hawkins, external (YTH, short-term contract, 28 July-31 August), Matt Montgomery (Nottinghamshire, loan for One-Day Cup)Out: Sam Conners (Durham), Mohammad Amir (Essex), Samit Patel (REL on 19 July)Future signings: Montgomery will sign permanently at the end of the season while Jewell will also return for the 2026 campaign.Future departures: Batter David Lloyd will retire at the end of the season.Other news: Head of cricket Mickey Arthur has taken on an additional role as director of cricket at Hundred franchise Northern Superchargers. David Lloyd has stepped down as captain and has been replaced by former skipper Wayne Madsen in the Championship. Jewell will return to the club for the 2026 season.Latest news from the county",
        "Overseas players: David Bedingham (South Africa), Brendan Doggett (Australia, until 26 May), Zak Foulkes (New Zealand, for T20 Blast group stage), Neil Wagner (New Zealand, from 22 June for Championship), Codi Yusuf (South Africa, 25 April-25 May and from 18 July), Jimmy Neesham (New Zealand, for T20), Shafiqullah Ghafari (Afghanistan, from 8 September)In: Emilio Gay (Northamptonshire), Sam Conners (Derbyshire), Will Rhodes (Warwickshire), Zak Foulkes (Warwickshire), Jake Ball (Somerset, loan from 25 April-5 May), Jack Blatherwick (Lancashire, loan from 25 April-5 May), Jimmy Neesham (Leicestershire), Kasey Aldridge (Somerset, loan from 30 May-20 June), Robbie Bowman, external (YTH, short-term contract for One-Day Cup), Archie Bailey (Gloucestershire, loan from 13 August for One-Day Cup)Out: Michael Jones (Lancashire), Jonathan Bushnell (REL), Brandon Glover (REL), Oliver Gibson (REL), Ben Dwarshuis (Worcestershire), Ashton Turner (Lancashire)Future signings: Seamers Archie Bailey and Kasey Aldridge will join the club at the end of the season from Gloucestershire and Somerset respectively.Future departures: Seamer Mitchell Killeen and all-rounder Paul Coughlin will leave the club and join Essex and Lancashire respectively at the end of the season.Other news: Scott Borthwick has stepped down as club captain and taken up a role as player-coach.Latest news from the county",
        "Overseas players: Simon Harmer (South Africa), Kasun Rajitha (Sri Lanka, 18 April-26 May), Mohammad Amir (Pakistan, for T20 Blast), Khaleel Ahmed (India, 29 June-25 July, for Championship), Curtis Campher (Ireland, 15-24 August, for One-Day Cup), Doug Bracewell (New Zealand, from 8 September)In: Mohammad Amir (Derbyshire), Charlie Bennett, external (YTH), Daniel Gladwell, external (YTH, short term contract, 15-31 August)Out: Ben Allison (Worcestershire), Aaron Beard, external (RET), Feroze Khushi (REL), Daniel Sams (Nottinghamshire), Jamal Richards, external (Kent, loan from 2-12 May)Future signings: All-rounder Zaman Akhter and seamer Mitchell Killeen will join from Gloucestershire and Durham respectively at the end of the season.Future departures: Batter Nick Browne will retire at the end of the season.Other news: Chief executive John Stephenson left at the end of the 2024 season to take up a similar position with Western Australia. Director of cricket Anthony McGrath departed to become head coach of Yorkshire and has been replaced by Chris Silverwood, who led the side from 2016-18. Bowling coach Mick Lewis has joined McGrath at Headingley. Adam Rossington has signed a new deal for T20 cricket only, while Indian all-rounder Shardul Thakur has withdrawn from a deal to play as an overseas player in April and May after taking a deal with Lucknow Super Giants in the Indian Premier League.Latest news from the county",
        "Overseas players: Colin Ingram (South Africa), Asitha Fernando (Sri Lanka, for Championship until 18 May and from 22 July), Marnus Labuschagne (Australia, 16-26 May), Hayden Kerr (Australia, 1-3 June), Matt Kuhnemann (Australia, 23-26 May), Imad Wasim (Pakistan, from 14 June for T20)In: Ned Leonard (Somerset), Callum Nicholls (YTH), Shoaib Bashir (Somerset, loan for April), Romano Franco (YTH, short-term contract for One-Day Cup)Out: Harry Podmore (RET), Prem Sisodya (RET)Future signings: Somerset batter Sean Dickson will join Glamorgan at the end of the season.Future departures: Sam Northeast will re-join Kent at the end of the season.Others news: Glamorgan sacked head coach Grant Bradburn in December following a misconduct charge. He has been replaced on an interim basis by England Lions coach Richard Dawson, who will lead the side this season in the Championship and T20 Blast, with a One-Day Cup coach to be appointed. Mark O'Leary will be assistant coach, while former England coach Matthew Mott returns to the club in a part-time basis to take charge of coach development.Latest news from the county",
        "Overseas players: Cameron Bancroft (Australia, until 28 August), Cameron Green (Australia, April-May), D'Arcy Short (Australia, for T20), Todd Murphy (Australia, 22 June-1 August, for Championship)In: Craig Miles, external (Warwickshire, loan for One-Day Cup)Out: Zafar Gohar (Middlesex), Tom Smith (RET on 18 July), Chris Dent (RET on 31 July), Archie Bailey (Durham, loan from 13 August for One-Day Cup)Future signings: Craig Miles will re-join the club permanently from Warwickshire at the end of the season, while fellow seamer Will Williams will sign from Lancashire and overseas players Bancroft and Short have signed for a further two seasons and year respectively.Future departures: Seamers Archie Bailey (Durham), Ajeet Singh Dale (Lancashire), Dom Goodman (Sussex) and all-rounders Zaman Akhter (Essex) and Tom Price (Sussex) will leave the club at the end of the season.Other news: Graeme van Buuren has stepped down as Championship captain and has been replaced by Cameron Bancroft.Latest news from the county",
        "Overseas players: Kyle Abbott (South Africa), Lhuan-dre Pretorius (South Africa, for T20, from 13 June), Dewald Brevis (South Africa, primarily for T20), Brett Hampton (Australia, April-May), Bjorn Fortuin (South Africa, for T20 from 5-8 June), Tilak Varma (India, for Championship from 22 June-1 August), Chris Lynn (Australia, for T20, 5-17 July), Hilton Cartwright (Australia, for T20, 5-17 July), Washington Sundar (India, for Championship from 15 September)In: Sonny Baker (Somerset), Danny Briggs, external (Warwickshire, loan for Global Super League in Nov/Dec 2024), Mark Stoneman (Middlesex, for Championship), Andrew Neal, external (Hertfordshire, short-term contract for One-Day Cup)Out: Mohammad Abbas (Nottinghamshire), John Turner (Lancashire, loan from 11 April-5 May)Future signings: Abbott will return to the club for the 2026 season.Future departures: Seamer Keith Barker will re-join Warwickshire at the end of the season, while head coach Adrian Birrell will step down.Other news: James Vince has stepped down as County Championship captain and will only play T20 cricket for Hampshire next season. Ben Brown has taken over as red ball skipper. Hampton replaces Australian all-rounder Jack Edwards who had signed to play in April and May but was ruled out by injury. Batting coach Jimmy Adams will lead the side in the One-Day Cup.Latest news from the county",
        "Overseas players: Wes Agar (Australia, from end of May), Tom Rogers (Australia, for T20), Kashif Ali (Pakistan, until 26 May), Keith Dudgeon (South Africa, 4-6 April)In: Chris Benjamin (Warwickshire), Corey Flintoff (Lancashire), Jamal Richards, external (Kent, loan from 2-12 May), Jake Ball (Somerset, loan from 16-26 May), Alfie Ogborne (Somerset, loan from 16-26 May), Ben Dawkins (YTH), Mohammed Rizvi (South Asian Cricket Academy, short-term contract for One-Day Cup)Out: Arafat Bhuiyan, external (REL), Hamidullah Qadri, external (REL), Nathan Gilchrist (Middlesex, loan from 13 August for rest of One-Day Cup)Future signings: Dudgeon will return to the club for all of the 2026 season after his initial overseas stint was ended by injury. He will be joined by Matt Milnes and Sam Northeast, who will return to Kent from Yorkshire and Glamorgan respectively at the end of the current season.Future departures: Seamer Nathan Gilchrist will join Warwickshire at the end of the season.Other news: Head coach Matt Walker stepped down at the end of the 2024 season, subsequently becoming batting coach at Warwickshire, and has been replaced by Adam Hollioake.Latest news from the county",
        "Overseas players: Chris Green (Australia), Anderson Phillip (West Indies, until the end of July), Marcus Harris (Australia, for Championship and One-Day Cup), Ashton Turner (Australia, for T20, 29 May-4 July)In: Michael Jones (Durham), Marcus Harris (Leicestershire), Ashton Turner (Durham), John Turner (Hampshire, loan from 11 April-5 May), Arav Shetty, external (South Asian Cricket Academy, short-term contract for One-Day Cup)Out: Steven Croft (RET), George Lavelle, external (REL), Jack Morley, external (Derbyshire), Corey Flintoff (Kent), Jack Blatherwick (Durham, loan from 25 April-5 May)Future signings: Gloucestershire seamer Ajeet Singh Dale and Durham all-rounder Paul Coughlin will join Lancashire at the end of the season, while Harris will remain at the club for the 2026 and 2027 campaigns.Future departures: Seamer Will Williams will move to Gloucestershire at the end of the campaign.Latest news from the county",
        "Overseas players: Peter Handscomb (Australia, until 26 August), Logan van Beek (Netherlands, for County Championship and T20), Shan Masood (Pakistan, from 30 May)In: Logan van Beek (Worcestershire), Ben Green (Somerset, loan for Championship until 1 August), Shan Masood (Yorkshire), Josh Thomas (Somerset, loan from 10-18 July), Stephen Ezkinazi (Middlesex, loan from 8 September), Jonny Tattersall (Yorkshire, loan from 8 September)Out: Sam Evans, external (REL), Marcus Harris (Lancashire), Jimmy Neesham (Durham), Harry Swindells (RET on 30 July)Future signings: Somerset seamer Josh Davey will join Leicestershire at the end of the season, while Green, Tattersall and Eskinazi's loans will become permanent. South Africa spinner Keshav Maharaj will join as an overseas player for the first four months of the season, while Handscomb will return for a further year.Future departures: Seamer Chris Wright will retire at the end of the season.Other news: Lewis Hill has stepped down as captain for the Championship and One-Day Cup and will be replaced by Handscomb, who led the side in the T20 Blast last season but will hand over that side to Louis Kimber.Latest news from the county",
        "Overseas players: Kane Williamson (New Zealand, for at least 10 T20 matches and five Championship games), Josh Little (Ireland, primarily for T20), Dane Paterson (South Africa, until 26 May)In: Ben Geddes (Surrey), Aaryan Sawant, external (YTH), Naavya Sharma, external (YTH), Sebastian Morgan, external (YTH), Zafar Gohar (Gloucestershire, as non-overseas player), Dane Paterson (Nottinghamshire), Nathan Gilchrist (Kent, loan from 13 August for rest of One-Day Cup), Olly Stone (Nottinghamshire, loan from 8-18 September)Out: Ethan Bamber (Warwickshire), Martin Andersson (Derbyshire), Mark Stoneman (Hampshire), Robbie White (RET), Thilan Walallawita, external (REL), Stephen Ezkinazi (Leicestershire, loan from 8 September)Future departures: Eskinazi's loan to Leicestershire will become permanent at the end of the season.Other news: Former England spinner Ian Salisbury has joined as a full-time coach, external having worked as a consultant with the club since 2023. Head coach Richard Johnson departed on 17 June and was replaced by former Lancashire captain Dane Vilas in an interim capacity until the end of the season. Batting consultant Mark Ramprakash left the club on 3 July. Leus du Plooy was named captain for the Championship and T20 Blast on 9 July, replacing Toby Roland-Jones and Stephen Ezkinazi in the respective competitions, while Ben Geddes is the new skipper for the One-Day Cup., externalLatest news from the county",
        "Overseas players: Matt Breetzke, external (South Africa, for T20), Yuzvendra Chahal (India, from 22 June-26 August, for Championship and One-Day Cup), Harry Conway (Australia, 2-26 May), Lloyd Pope (Australia, for T20 and Championship game 22-25 June), Tim Robinson (New Zealand, 22 June-11 July and from 5 August)In: Dom Leech (Yorkshire), Arush Buchake, external (YTH), Aadi Sharma, external (YTH), Liam Guthrie (UKP), Calvin Harrison (Nottinghamshire, loan for Championship from 11 April-2 July and from 8 September)Out: Emilio Gay (Durham), George Gowler, external (REL), Alex Russell, external (REL), George Weldon, external (REL), Jack White (Yorkshire)Future signings: Breetzke will return to the club as an overseas player for the next two seasons.Other news: Darren Lehmann has become head coach, succeeding John Sadler who left in September 2024. Australia spinner Ashton Agar pulled out of a return as an overseas player for the T20 Blast. Lead bowling coach Rory Kleinveldt will leave the club in mid-July to become head coach of Western Province.Latest news from the county",
        "Overseas players: Kyle Verreynne (South Africa, for Championship), Fergus O'Neill (Australia, until 28 April), Daniel Sams (Australia, for T20), Mohammad Abbas (Pakistan, 9-26 May and 8-27 September), Moises Henriques (Australia, for T20), Ishan Kishan (India, 22 June-2 July)In: Travis Holland, external (YTH), Sam Seecharan, external (YTH), Tom Giles, external (YTH), Conor McKerr (Surrey), Daniel Sams (Essex), Mohammad Abbas (Hampshire), Francis Moore, externalOut: Luke Fletcher (REL), Tom Loten, external (RET), Toby Pettman, external (RET), Fateh Singh (Worcestershire), Jacob Duffy (Worcestershire), Alex Hales (REL), Dane Paterson (Middlesex), Calvin Harrison (Northamptonshire, loan for Championship from 11 April-2 July and from 8 September), James Hayes, external (Sussex, loan from 9-19 May), Matt Montgomery (Derbyshire, loan for One-Day Cup and then permanent move at the end of the season), Will Young (Warwickshire), Olly Stone (Middlesex, loan from 8-18 September)Other news: Assistant coach Paul Franks will lead the side in the One-Day Cup.Latest news from the county",
        "Overseas players: Riley Meredith (Australia, for T20 and possibly other formats), Matt Henry (New Zealand, 16 May-9 July), Migael Pretorius (South Africa)In: Thomas Rew (YTH)Out: Sonny Baker (Hampshire), Ned Leonard (Glamorgan), George Thomas, external (Sussex), Roelof van der Merwe (REL), Ben Green (Leicestershire, loan for Championship until 1 August), Shoaib Bashir (Glamorgan, loan for April), Jake Ball (Durham, loan from 25 April-5 May), Jake Ball (Kent, loan from 16-26 May), Alfie Ogborne (Kent, loan from 16-26 May), Kasey Aldridge (Durham, loan from 30 May-20 June), Josh Thomas (Leicestershire, loan from 10-18 July)Future departures: Kasey Aldridge (Durham), Sean Dickson (Glamorgan), Josh Davey and Ben Green (both Leicestershire) will all move to other clubs at the end of the season, while Andy Umeed, external will also depart.Other news: Will Smeed has switched his white-ball deal to an all-format contract. Latest news from the county",
        "Overseas players: Nathan Smith (New Zealand, until 11 July), Mitchell Santner (New Zealand, for T20, 30 May-20 June), Kemar Roach (West Indies, for April), Kurtis Patterson (Australia, 9-26 May), Adam Zampa (Australia, for T20 from 6-13 July), Sai Kishore (India, 22 July-1 August), Rahul Chahar (India, from 23 September)In: Matthew Fisher (Yorkshire), Nathan Smith (Worcestershire), Nikhil Gorantla (South Asian Cricket Academy)Out: Ben Geddes (Middlesex), Conor McKerr (Nottinghamshire), Amar Virdi (REL), Matt Dunn (RET on 21 August)Other news: Director of cricket Alec Stewart stepped down at the end of the 2024 season and has a part-time role as high performance cricket advisor. Sam Curran has replaced Chris Jordan as T20 captain. On 1 September, Jamie Overton announced he was taking an indefinite break from red-ball cricket.Latest news from the county",
        "Overseas players: Daniel Hughes (Australia), Jayden Seales (West Indies, first block of County Championship games), Nathan McAndrew (Australia, 16 May-1 August), Jaydev Unadkat (India, from 8 September), Gurinder Sandhu (Australia, for June and July)In: Nantes Oosthuizen, external (YTH), George Thomas, external (Somerset), Troy Henry, external, James Hayes, external (Sussex, loan from 9-19 May)Out: Fynn Hudson-Prentice (Derbyshire, initial four-match loan for T20 from 8 June), Bertie Foreman (Worcestershire, loan from 22 July-1 August)Future signings: Spinner Danny Briggs will re-join Sussex from Warwickshire at the end of the season, on a three-year player-coach deal, while seamer Dom Goodman and all-rounder Tom Price will also move to the club from Gloucestershire.Other news: Former head coach Mark Robinson, who recently left Warwickshire, has  on a deal for at least April and May.Latest news from the county",
        "Overseas players: Tom Latham (New Zealand, 9 May-18 July), Beau Webster (Australia, May-July), Hasan Ali (Pakistan, from 29 May), Vishwa Fernando (Sri Lanka, until 21 April), Corey Rocchiccioli (Australia, for Championship from 22 June-1 August), Will Young (New Zealand, for Championship from 8 September)In: Ethan Bamber (Middlesex), Ben Blakemore, external (YTH), Vansh Jani, external (SACA), Adam Sylvester (ex-Derbyshire), Will Young (Nottinghamshire)Out: Will Rhodes (Durham), Chris Benjamin (Kent), Michael Burgess (RET), Danny Briggs, external (Hampshire, loan for Global Super League in Nov/Dec 2024), Amir Khan, external (REL), Zak Foulkes (Durham), Craig Miles, external (Gloucestershire, loan for One-Day Cup)Future signings: All-rounder Jordan Thompson and seamers Nathan Gilchrist and Keith Barker will join from Yorkshire, Kent and Hampshire respectively at the end of the season, while Webster will return for the first half of the 2026 campaign.Future departures: All-rounder Moeen Ali will retire, while spinner Danny Briggs and seamer Craig Miles will re-join Sussex and Gloucestershire respectively at the end of the season.Other news: Head coach Mark Robinson has been replaced by his assistant Ian Westwood, while departing performance director Gavin Larsen has been succeeded by James Thomas from Manchester City. Batting coach Tony Frost has become head of cricket operations and Simon Kerrigan will take charge of the second XI, with ex-Kent head coach Matt Walker becoming batting coach. Chris Rushworth will take up a role as coach alongside his playing contract for next season.Latest news from the county",
        "Overseas players: Jacob Duffy (New Zealand, 11 April-30 June), Ben Dwarshuis (Australia, for T20), Henry Nicholls (New Zealand, for Championship, 25 April-2 July), Khurram Shahzad (Pakistan, from 4 July)In: Ben Allison (Essex), Fateh Singh (Nottinghamshire), Jacob Duffy (Nottinghamshire), Ben Dwarshuis (Durham), Isaac Mohammed, external (ex-Warwickshire academy), Bertie Foreman (Sussex, loan from 22 July-1 August), Daniel Lategan, external (YTH)Out: Joe Leach (RET), Josh Cobb (REL), Olly Cox (REL), Nathan Smith (Surrey), Logan van Beek (Leicestershire)Future signings: Pakistan spinner Usama Mir will return to the club on a three-year deal from next season.Latest news from the county",
        "Overseas players: Will Sutherland (Australia, 30 May-18 July), Will O'Rourke (New Zealand, for T20, 30 May-20 June), Jordan Buckingham (Australia, 2-26 May), Ben Sears (New Zealand, from 11 April), Abdullah Shafique (Pakistan, 22 June-2 July for Championship, 11-18 July for T20), Imam Ul-Haq (Pakistan, 22 July-31 August), Mayank Agarwal (India, from 8 September)In: Alex Wade, external (YTH), Jawad Akhtar, external (YTH), Jack White (Northamptonshire), Will Bennison, external (YTH)Out: Matthew Fisher (Surrey), Dom Leech (Northamptonshire), Mickey Edwards (RET), Shan Masood (Leicestershire), Jonny Tattersall (Leicestershire, loan from 8 September)Future departures: Wicketkeeper Tattersall will join Leicestershire permanently at the end of the season, while all-rounder Jordan Thompson will move to Warwickshire and seamer Matt Milnes will re-join Kent.Other news: First-team coach Ottis Gibson left at the end of the 2024 season, and has been replaced by Essex director of cricket Anthony McGrath. with ex-Northants coach John Sadler joining as batting coach and Mick Lewis leaving Essex to become bowling coach. Former all-rounder Gavin Hamilton, external has rejoined as general manager. Jonny Bairstow replaces the departed Masood as County Championship captain, with Dawid Malan as T20 skipper. India batter Ruturaj Gaikwad has withdrawn from his deal to play for the club from 22 July.Latest news from the county",
        "County ins and outs archive2024 - 2023 - 2022 - 2021 - 2020 - 2019 - 2018 - 2017 - 2016 - 2015 - 2014 - 2013 - 2012",
        "With the 2025 county season fast approaching, stay up to date with the latest player signings and speculation.",
        "Key to abbreviations: REL = released; RET = retired; YTH = from youth teams; UKP = born overseas, but has UK passport.",
        "Counties have been permitted to field two overseas players in all competitions since 2021.",
        "Players who moved counties or retired during the 2024 season are included on the 2024 list. A list of players who were unavailable for the One-Day Cup as they had been selected for The Hundred can be found here. Not included are players signed on short-term arrangements purely for non-competitive friendly matches.",
        "23 September - Essex batter Nick Browne will retire at the end of the season",
        "22 September - Surrey sign India spinner Rahul Chahar as an overseas player for their final County Championship game",
        "19 September - Derbyshire batter David Lloyd will retire at the end of the season",
        "Overseas players: Caleb Jewell (Australia), Blair Tickner (New Zealand), Allah Mohammad Ghazanfar (Afghanistan, for T20)",
        "In: Martin Andersson (Middlesex), Jack Morley, external (Lancashire), Fynn Hudson-Prentice (Sussex, initial four-match loan for T20 from 8 June), Amrit Basra (South Asian Cricket Academy), Rory Haydon, Joe Hawkins, external (YTH, short-term contract, 28 July-31 August), Matt Montgomery (Nottinghamshire, loan for One-Day Cup)",
        "Out: Sam Conners (Durham), Mohammad Amir (Essex), Samit Patel (REL on 19 July)",
        "Future signings: Montgomery will sign permanently at the end of the season while Jewell will also return for the 2026 campaign.",
        "Future departures: Batter David Lloyd will retire at the end of the season.",
        "Other news: Head of cricket Mickey Arthur has taken on an additional role as director of cricket at Hundred franchise Northern Superchargers. David Lloyd has stepped down as captain and has been replaced by former skipper Wayne Madsen in the Championship. Jewell will return to the club for the 2026 season.",
        "Latest news from the county",
        "Overseas players: David Bedingham (South Africa), Brendan Doggett (Australia, until 26 May), Zak Foulkes (New Zealand, for T20 Blast group stage), Neil Wagner (New Zealand, from 22 June for Championship), Codi Yusuf (South Africa, 25 April-25 May and from 18 July), Jimmy Neesham (New Zealand, for T20), Shafiqullah Ghafari (Afghanistan, from 8 September)",
        "In: Emilio Gay (Northamptonshire), Sam Conners (Derbyshire), Will Rhodes (Warwickshire), Zak Foulkes (Warwickshire), Jake Ball (Somerset, loan from 25 April-5 May), Jack Blatherwick (Lancashire, loan from 25 April-5 May), Jimmy Neesham (Leicestershire), Kasey Aldridge (Somerset, loan from 30 May-20 June), Robbie Bowman, external (YTH, short-term contract for One-Day Cup), Archie Bailey (Gloucestershire, loan from 13 August for One-Day Cup)",
        "Out: Michael Jones (Lancashire), Jonathan Bushnell (REL), Brandon Glover (REL), Oliver Gibson (REL), Ben Dwarshuis (Worcestershire), Ashton Turner (Lancashire)",
        "Future signings: Seamers Archie Bailey and Kasey Aldridge will join the club at the end of the season from Gloucestershire and Somerset respectively.",
        "Future departures: Seamer Mitchell Killeen and all-rounder Paul Coughlin will leave the club and join Essex and Lancashire respectively at the end of the season.",
        "Other news: Scott Borthwick has stepped down as club captain and taken up a role as player-coach.",
        "Latest news from the county",
        "Overseas players: Simon Harmer (South Africa), Kasun Rajitha (Sri Lanka, 18 April-26 May), Mohammad Amir (Pakistan, for T20 Blast), Khaleel Ahmed (India, 29 June-25 July, for Championship), Curtis Campher (Ireland, 15-24 August, for One-Day Cup), Doug Bracewell (New Zealand, from 8 September)",
        "In: Mohammad Amir (Derbyshire), Charlie Bennett, external (YTH), Daniel Gladwell, external (YTH, short term contract, 15-31 August)",
        "Out: Ben Allison (Worcestershire), Aaron Beard, external (RET), Feroze Khushi (REL), Daniel Sams (Nottinghamshire), Jamal Richards, external (Kent, loan from 2-12 May)",
        "Future signings: All-rounder Zaman Akhter and seamer Mitchell Killeen will join from Gloucestershire and Durham respectively at the end of the season.",
        "Future departures: Batter Nick Browne will retire at the end of the season.",
        "Other news: Chief executive John Stephenson left at the end of the 2024 season to take up a similar position with Western Australia. Director of cricket Anthony McGrath departed to become head coach of Yorkshire and has been replaced by Chris Silverwood, who led the side from 2016-18. Bowling coach Mick Lewis has joined McGrath at Headingley.",
        "Adam Rossington has signed a new deal for T20 cricket only, while Indian all-rounder Shardul Thakur has withdrawn from a deal to play as an overseas player in April and May after taking a deal with Lucknow Super Giants in the Indian Premier League.",
        "Latest news from the county",
        "Overseas players: Colin Ingram (South Africa), Asitha Fernando (Sri Lanka, for Championship until 18 May and from 22 July), Marnus Labuschagne (Australia, 16-26 May), Hayden Kerr (Australia, 1-3 June), Matt Kuhnemann (Australia, 23-26 May), Imad Wasim (Pakistan, from 14 June for T20)",
        "In: Ned Leonard (Somerset), Callum Nicholls (YTH), Shoaib Bashir (Somerset, loan for April), Romano Franco (YTH, short-term contract for One-Day Cup)",
        "Out: Harry Podmore (RET), Prem Sisodya (RET)",
        "Future signings: Somerset batter Sean Dickson will join Glamorgan at the end of the season.",
        "Future departures: Sam Northeast will re-join Kent at the end of the season.",
        "Others news: Glamorgan sacked head coach Grant Bradburn in December following a misconduct charge. He has been replaced on an interim basis by England Lions coach Richard Dawson, who will lead the side this season in the Championship and T20 Blast, with a One-Day Cup coach to be appointed. Mark O'Leary will be assistant coach, while former England coach Matthew Mott returns to the club in a part-time basis to take charge of coach development.",
        "Latest news from the county",
        "Overseas players: Cameron Bancroft (Australia, until 28 August), Cameron Green (Australia, April-May), D'Arcy Short (Australia, for T20), Todd Murphy (Australia, 22 June-1 August, for Championship)",
        "In: Craig Miles, external (Warwickshire, loan for One-Day Cup)",
        "Out: Zafar Gohar (Middlesex), Tom Smith (RET on 18 July), Chris Dent (RET on 31 July), Archie Bailey (Durham, loan from 13 August for One-Day Cup)",
        "Future signings: Craig Miles will re-join the club permanently from Warwickshire at the end of the season, while fellow seamer Will Williams will sign from Lancashire and overseas players Bancroft and Short have signed for a further two seasons and year respectively.",
        "Future departures: Seamers Archie Bailey (Durham), Ajeet Singh Dale (Lancashire), Dom Goodman (Sussex) and all-rounders Zaman Akhter (Essex) and Tom Price (Sussex) will leave the club at the end of the season.",
        "Other news: Graeme van Buuren has stepped down as Championship captain and has been replaced by Cameron Bancroft.",
        "Latest news from the county",
        "Overseas players: Kyle Abbott (South Africa), Lhuan-dre Pretorius (South Africa, for T20, from 13 June), Dewald Brevis (South Africa, primarily for T20), Brett Hampton (Australia, April-May), Bjorn Fortuin (South Africa, for T20 from 5-8 June), Tilak Varma (India, for Championship from 22 June-1 August), Chris Lynn (Australia, for T20, 5-17 July), Hilton Cartwright (Australia, for T20, 5-17 July), Washington Sundar (India, for Championship from 15 September)",
        "In: Sonny Baker (Somerset), Danny Briggs, external (Warwickshire, loan for Global Super League in Nov/Dec 2024), Mark Stoneman (Middlesex, for Championship), Andrew Neal, external (Hertfordshire, short-term contract for One-Day Cup)",
        "Out: Mohammad Abbas (Nottinghamshire), John Turner (Lancashire, loan from 11 April-5 May)",
        "Future signings: Abbott will return to the club for the 2026 season.",
        "Future departures: Seamer Keith Barker will re-join Warwickshire at the end of the season, while head coach Adrian Birrell will step down.",
        "Other news: James Vince has stepped down as County Championship captain and will only play T20 cricket for Hampshire next season. Ben Brown has taken over as red ball skipper. Hampton replaces Australian all-rounder Jack Edwards who had signed to play in April and May but was ruled out by injury. Batting coach Jimmy Adams will lead the side in the One-Day Cup.",
        "Latest news from the county",
        "Overseas players: Wes Agar (Australia, from end of May), Tom Rogers (Australia, for T20), Kashif Ali (Pakistan, until 26 May), Keith Dudgeon (South Africa, 4-6 April)",
        "In: Chris Benjamin (Warwickshire), Corey Flintoff (Lancashire), Jamal Richards, external (Kent, loan from 2-12 May), Jake Ball (Somerset, loan from 16-26 May), Alfie Ogborne (Somerset, loan from 16-26 May), Ben Dawkins (YTH), Mohammed Rizvi (South Asian Cricket Academy, short-term contract for One-Day Cup)",
        "Out: Arafat Bhuiyan, external (REL), Hamidullah Qadri, external (REL), Nathan Gilchrist (Middlesex, loan from 13 August for rest of One-Day Cup)",
        "Future signings: Dudgeon will return to the club for all of the 2026 season after his initial overseas stint was ended by injury. He will be joined by Matt Milnes and Sam Northeast, who will return to Kent from Yorkshire and Glamorgan respectively at the end of the current season.",
        "Future departures: Seamer Nathan Gilchrist will join Warwickshire at the end of the season.",
        "Other news: Head coach Matt Walker stepped down at the end of the 2024 season, subsequently becoming batting coach at Warwickshire, and has been replaced by Adam Hollioake.",
        "Latest news from the county",
        "Overseas players: Chris Green (Australia), Anderson Phillip (West Indies, until the end of July), Marcus Harris (Australia, for Championship and One-Day Cup), Ashton Turner (Australia, for T20, 29 May-4 July)",
        "In: Michael Jones (Durham), Marcus Harris (Leicestershire), Ashton Turner (Durham), John Turner (Hampshire, loan from 11 April-5 May), Arav Shetty, external (South Asian Cricket Academy, short-term contract for One-Day Cup)",
        "Out: Steven Croft (RET), George Lavelle, external (REL), Jack Morley, external (Derbyshire), Corey Flintoff (Kent), Jack Blatherwick (Durham, loan from 25 April-5 May)",
        "Future signings: Gloucestershire seamer Ajeet Singh Dale and Durham all-rounder Paul Coughlin will join Lancashire at the end of the season, while Harris will remain at the club for the 2026 and 2027 campaigns.",
        "Future departures: Seamer Will Williams will move to Gloucestershire at the end of the campaign.",
        "Latest news from the county",
        "Overseas players: Peter Handscomb (Australia, until 26 August), Logan van Beek (Netherlands, for County Championship and T20), Shan Masood (Pakistan, from 30 May)",
        "In: Logan van Beek (Worcestershire), Ben Green (Somerset, loan for Championship until 1 August), Shan Masood (Yorkshire), Josh Thomas (Somerset, loan from 10-18 July), Stephen Ezkinazi (Middlesex, loan from 8 September), Jonny Tattersall (Yorkshire, loan from 8 September)",
        "Out: Sam Evans, external (REL), Marcus Harris (Lancashire), Jimmy Neesham (Durham), Harry Swindells (RET on 30 July)",
        "Future signings: Somerset seamer Josh Davey will join Leicestershire at the end of the season, while Green, Tattersall and Eskinazi's loans will become permanent. South Africa spinner Keshav Maharaj will join as an overseas player for the first four months of the season, while Handscomb will return for a further year.",
        "Future departures: Seamer Chris Wright will retire at the end of the season.",
        "Other news: Lewis Hill has stepped down as captain for the Championship and One-Day Cup and will be replaced by Handscomb, who led the side in the T20 Blast last season but will hand over that side to Louis Kimber.",
        "Latest news from the county",
        "Overseas players: Kane Williamson (New Zealand, for at least 10 T20 matches and five Championship games), Josh Little (Ireland, primarily for T20), Dane Paterson (South Africa, until 26 May)",
        "In: Ben Geddes (Surrey), Aaryan Sawant, external (YTH), Naavya Sharma, external (YTH), Sebastian Morgan, external (YTH), Zafar Gohar (Gloucestershire, as non-overseas player), Dane Paterson (Nottinghamshire), Nathan Gilchrist (Kent, loan from 13 August for rest of One-Day Cup), Olly Stone (Nottinghamshire, loan from 8-18 September)",
        "Out: Ethan Bamber (Warwickshire), Martin Andersson (Derbyshire), Mark Stoneman (Hampshire), Robbie White (RET), Thilan Walallawita, external (REL), Stephen Ezkinazi (Leicestershire, loan from 8 September)",
        "Future departures: Eskinazi's loan to Leicestershire will become permanent at the end of the season.",
        "Other news: Former England spinner Ian Salisbury has joined as a full-time coach, external having worked as a consultant with the club since 2023.",
        "Head coach Richard Johnson departed on 17 June and was replaced by former Lancashire captain Dane Vilas in an interim capacity until the end of the season. Batting consultant Mark Ramprakash left the club on 3 July. Leus du Plooy was named captain for the Championship and T20 Blast on 9 July, replacing Toby Roland-Jones and Stephen Ezkinazi in the respective competitions, while Ben Geddes is the new skipper for the One-Day Cup., external",
        "Latest news from the county",
        "Overseas players: Matt Breetzke, external (South Africa, for T20), Yuzvendra Chahal (India, from 22 June-26 August, for Championship and One-Day Cup), Harry Conway (Australia, 2-26 May), Lloyd Pope (Australia, for T20 and Championship game 22-25 June), Tim Robinson (New Zealand, 22 June-11 July and from 5 August)",
        "In: Dom Leech (Yorkshire), Arush Buchake, external (YTH), Aadi Sharma, external (YTH), Liam Guthrie (UKP), Calvin Harrison (Nottinghamshire, loan for Championship from 11 April-2 July and from 8 September)",
        "Out: Emilio Gay (Durham), George Gowler, external (REL), Alex Russell, external (REL), George Weldon, external (REL), Jack White (Yorkshire)",
        "Future signings: Breetzke will return to the club as an overseas player for the next two seasons.",
        "Other news: Darren Lehmann has become head coach, succeeding John Sadler who left in September 2024. Australia spinner Ashton Agar pulled out of a return as an overseas player for the T20 Blast. Lead bowling coach Rory Kleinveldt will leave the club in mid-July to become head coach of Western Province.",
        "Latest news from the county",
        "Overseas players: Kyle Verreynne (South Africa, for Championship), Fergus O'Neill (Australia, until 28 April), Daniel Sams (Australia, for T20), Mohammad Abbas (Pakistan, 9-26 May and 8-27 September), Moises Henriques (Australia, for T20), Ishan Kishan (India, 22 June-2 July)",
        "In: Travis Holland, external (YTH), Sam Seecharan, external (YTH), Tom Giles, external (YTH), Conor McKerr (Surrey), Daniel Sams (Essex), Mohammad Abbas (Hampshire), Francis Moore, external",
        "Out: Luke Fletcher (REL), Tom Loten, external (RET), Toby Pettman, external (RET), Fateh Singh (Worcestershire), Jacob Duffy (Worcestershire), Alex Hales (REL), Dane Paterson (Middlesex), Calvin Harrison (Northamptonshire, loan for Championship from 11 April-2 July and from 8 September), James Hayes, external (Sussex, loan from 9-19 May), Matt Montgomery (Derbyshire, loan for One-Day Cup and then permanent move at the end of the season), Will Young (Warwickshire), Olly Stone (Middlesex, loan from 8-18 September)",
        "Other news: Assistant coach Paul Franks will lead the side in the One-Day Cup.",
        "Latest news from the county",
        "Overseas players: Riley Meredith (Australia, for T20 and possibly other formats), Matt Henry (New Zealand, 16 May-9 July), Migael Pretorius (South Africa)",
        "Out: Sonny Baker (Hampshire), Ned Leonard (Glamorgan), George Thomas, external (Sussex), Roelof van der Merwe (REL), Ben Green (Leicestershire, loan for Championship until 1 August), Shoaib Bashir (Glamorgan, loan for April), Jake Ball (Durham, loan from 25 April-5 May), Jake Ball (Kent, loan from 16-26 May), Alfie Ogborne (Kent, loan from 16-26 May), Kasey Aldridge (Durham, loan from 30 May-20 June), Josh Thomas (Leicestershire, loan from 10-18 July)",
        "Future departures: Kasey Aldridge (Durham), Sean Dickson (Glamorgan), Josh Davey and Ben Green (both Leicestershire) will all move to other clubs at the end of the season, while Andy Umeed, external will also depart.",
        "Other news: Will Smeed has switched his white-ball deal to an all-format contract.",
        "Latest news from the county",
        "Overseas players: Nathan Smith (New Zealand, until 11 July), Mitchell Santner (New Zealand, for T20, 30 May-20 June), Kemar Roach (West Indies, for April), Kurtis Patterson (Australia, 9-26 May), Adam Zampa (Australia, for T20 from 6-13 July), Sai Kishore (India, 22 July-1 August), Rahul Chahar (India, from 23 September)",
        "In: Matthew Fisher (Yorkshire), Nathan Smith (Worcestershire), Nikhil Gorantla (South Asian Cricket Academy)",
        "Out: Ben Geddes (Middlesex), Conor McKerr (Nottinghamshire), Amar Virdi (REL), Matt Dunn (RET on 21 August)",
        "Other news: Director of cricket Alec Stewart stepped down at the end of the 2024 season and has a part-time role as high performance cricket advisor. Sam Curran has replaced Chris Jordan as T20 captain. On 1 September, Jamie Overton announced he was taking an indefinite break from red-ball cricket.",
        "Latest news from the county",
        "Overseas players: Daniel Hughes (Australia), Jayden Seales (West Indies, first block of County Championship games), Nathan McAndrew (Australia, 16 May-1 August), Jaydev Unadkat (India, from 8 September), Gurinder Sandhu (Australia, for June and July)",
        "In: Nantes Oosthuizen, external (YTH), George Thomas, external (Somerset), Troy Henry, external, James Hayes, external (Sussex, loan from 9-19 May)",
        "Out: Fynn Hudson-Prentice (Derbyshire, initial four-match loan for T20 from 8 June), Bertie Foreman (Worcestershire, loan from 22 July-1 August)",
        "Future signings: Spinner Danny Briggs will re-join Sussex from Warwickshire at the end of the season, on a three-year player-coach deal, while seamer Dom Goodman and all-rounder Tom Price will also move to the club from Gloucestershire.",
        "Other news: Former head coach Mark Robinson, who recently left Warwickshire, has  on a deal for at least April and May.",
        "Latest news from the county",
        "Overseas players: Tom Latham (New Zealand, 9 May-18 July), Beau Webster (Australia, May-July), Hasan Ali (Pakistan, from 29 May), Vishwa Fernando (Sri Lanka, until 21 April), Corey Rocchiccioli (Australia, for Championship from 22 June-1 August), Will Young (New Zealand, for Championship from 8 September)",
        "In: Ethan Bamber (Middlesex), Ben Blakemore, external (YTH), Vansh Jani, external (SACA), Adam Sylvester (ex-Derbyshire), Will Young (Nottinghamshire)",
        "Out: Will Rhodes (Durham), Chris Benjamin (Kent), Michael Burgess (RET), Danny Briggs, external (Hampshire, loan for Global Super League in Nov/Dec 2024), Amir Khan, external (REL), Zak Foulkes (Durham), Craig Miles, external (Gloucestershire, loan for One-Day Cup)",
        "Future signings: All-rounder Jordan Thompson and seamers Nathan Gilchrist and Keith Barker will join from Yorkshire, Kent and Hampshire respectively at the end of the season, while Webster will return for the first half of the 2026 campaign.",
        "Future departures: All-rounder Moeen Ali will retire, while spinner Danny Briggs and seamer Craig Miles will re-join Sussex and Gloucestershire respectively at the end of the season.",
        "Other news: Head coach Mark Robinson has been replaced by his assistant Ian Westwood, while departing performance director Gavin Larsen has been succeeded by James Thomas from Manchester City.",
        "Batting coach Tony Frost has become head of cricket operations and Simon Kerrigan will take charge of the second XI, with ex-Kent head coach Matt Walker becoming batting coach. Chris Rushworth will take up a role as coach alongside his playing contract for next season.",
        "Latest news from the county",
        "Overseas players: Jacob Duffy (New Zealand, 11 April-30 June), Ben Dwarshuis (Australia, for T20), Henry Nicholls (New Zealand, for Championship, 25 April-2 July), Khurram Shahzad (Pakistan, from 4 July)",
        "In: Ben Allison (Essex), Fateh Singh (Nottinghamshire), Jacob Duffy (Nottinghamshire), Ben Dwarshuis (Durham), Isaac Mohammed, external (ex-Warwickshire academy), Bertie Foreman (Sussex, loan from 22 July-1 August), Daniel Lategan, external (YTH)",
        "Out: Joe Leach (RET), Josh Cobb (REL), Olly Cox (REL), Nathan Smith (Surrey), Logan van Beek (Leicestershire)",
        "Future signings: Pakistan spinner Usama Mir will return to the club on a three-year deal from next season.",
        "Latest news from the county",
        "Overseas players: Will Sutherland (Australia, 30 May-18 July), Will O'Rourke (New Zealand, for T20, 30 May-20 June), Jordan Buckingham (Australia, 2-26 May), Ben Sears (New Zealand, from 11 April), Abdullah Shafique (Pakistan, 22 June-2 July for Championship, 11-18 July for T20), Imam Ul-Haq (Pakistan, 22 July-31 August), Mayank Agarwal (India, from 8 September)",
        "In: Alex Wade, external (YTH), Jawad Akhtar, external (YTH), Jack White (Northamptonshire), Will Bennison, external (YTH)",
        "Out: Matthew Fisher (Surrey), Dom Leech (Northamptonshire), Mickey Edwards (RET), Shan Masood (Leicestershire), Jonny Tattersall (Leicestershire, loan from 8 September)",
        "Future departures: Wicketkeeper Tattersall will join Leicestershire permanently at the end of the season, while all-rounder Jordan Thompson will move to Warwickshire and seamer Matt Milnes will re-join Kent.",
        "Other news: First-team coach Ottis Gibson left at the end of the 2024 season, and has been replaced by Essex director of cricket Anthony McGrath. with ex-Northants coach John Sadler joining as batting coach and Mick Lewis leaving Essex to become bowling coach. Former all-rounder Gavin Hamilton, external has rejoined as general manager.",
        "Jonny Bairstow replaces the departed Masood as County Championship captain, with Dawid Malan as T20 skipper. India batter Ruturaj Gaikwad has withdrawn from his deal to play for the club from 22 July.",
        "Latest news from the county",
        "County ins and outs archive",
        "2024 - 2023 - 2022 - 2021 - 2020 - 2019 - 2018 - 2017 - 2016 - 2015 - 2014 - 2013 - 2012",
        "Get cricket news sent straight to your phone"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/cricket/articles/cg5177enqyzo",
      "main_category": "sport",
      "detailed_category": "cricket",
      "topic": "The ultimate Ashes competitor - Broad on walking, Warner and that final wicket",
      "content": [
        "From the Ashes is a series of features and podcasts which dig deeper into stories from cricket's fiercest and most legendary Test series. Full interviews can be found on BBC Sounds, building up to ball-by-ball coverage of the first Test between Australia and England in Perth on 21 November.",
        "There are plenty of contenders for the most famous first ball of an Ashes series.Michael Slater slashing Phillip DeFreitas for four. Stephen Harmison's wide. Rory Burns bowled by Mitchell Starc. Zak Crawley crunching Pat Cummins through the covers.As for the most iconic final ball, one man has that covered.Stuart Broad's place in Ashes history was already assured before his fairytale finale at The Oval two years ago.The bail-switching, the headband, the edge off Alex Carey and the celebrations etched into English cricketing folklore.\"I feel like extremely lucky it ended the way it did,\" Broad tells BBC Sport. \"My last ever professional ball, taking that favourite wicket you could ever take - last wicket to win a Test, against Australia, crowd going berserk.\"I'll never get bored of talking about it because it takes me back to a feeling and a moment that was so special.\"Broad's final act as an England cricketer was made perfect by everything that had gone before. The 604 Test wickets were more than enough for a hall-of-fame career, but few England players are as synonymous with Ashes cricket as Broad.No England bowler has taken more Ashes wicket than Broad's 153. No fast bowler on either side has played more than Broad's 40 Ashes Tests. Beyond the numbers, few have found themselves at the heart of as many Ashes battles, engineered as many special moments or created as many memories.Broad's life has been entwined with Ashes cricket and his early career was heavily influenced by Australia.When Broad was six months old, his father Chris was scoring three hundreds for England on the successful Ashes tour of 1986-87. The young Broad's cricketing hero was Australia metronome Glenn McGrath, and his development was accelerated by a spell as an 18-year-old with Melbourne club Hoppers Crossing.Broad was playing Test cricket three years after his time with Hoppers. With a baby face and bouncing blond hair, the Draco Malfoy lookalike was a bowler of obvious promise but no clear identity. It was two years into his career, while earning his 22nd cap in the fifth and deciding Ashes Test, that Broad produced a performance to make him feel at home in an England shirt.When he was handed the ball on the second day, his career bowling average stood at an unsatisfactory 37.63. What followed was the first of Broad's trademark spells - Shane Watson, Ricky Ponting, Mike Hussey, Michael Clarke and Brad Haddin removed in the space of nine overs to push the urn towards English hands.\"I walked off the field and felt 'maybe I do belong in this England shirt',\" says Broad.\"After that five-for I walked down the stairs at The Oval and someone asked for my autograph. A picture was on the front page of the paper. I remember looking at it and going 'wow, that's different'.\"",
        "The next time Broad was an Ashes winner, England's famous triumph down under in 2010-11, he played only two Tests before his series was ended by a side injury. He cried as he was hugged by England team doctor Nick Pierce in the dressing room at the Adelaide Oval and spent the third Test in Perth with the Test Match Special team before heading home to watch the rest of the series from his sofa.Broad was two from two in Ashes series, but his role as the Pom the Aussies loved to hate was not forged until 2013.In the tight first Test, Broad's edge off the spin of Ashton Agar deflected off the wicketkeeping gloves of Haddin and into the hands of Clarke at first slip. Broad did not walk, Australia were out of reviews and the runs he went on to add helped England win the match.In Broad's defence, his brass neck looked worse because of Haddin's inability to hang ont o the edge, but that did not stop Australia coach Darren Lehmann labelling him a \"blatant cheat\" whom he hoped \"cries and goes home\" in the return series down under six months later.Broad knew he was going to cop it, not least when the Brisbane Courier Mail refused to print his name and ran a headline calling him a 'smug Pommie cheat'.\"In the warm-up games I walked around the boundary edge with the psychologist or on my own,\" he says. \"If you walk around the Gabba there might be 45,000 people, so you just hear noise. If you walk around at a warm-up where there might only be 100 people, you hear every word.\"I wanted to build a shield around me. I wanted to hear the abuse to strengthen me. I worked with the psychologist, because I knew it was coming, to strengthen my resolve.\"When my name got announced that I was bowling my first ball in the first Test at the Gabba, the boos were unbelievable.\"The day before, I'd done my pre-match mental routine. I stood at the end of my mark, bowled four overs in my mind and I imagined the boos. I could feel it. I felt like I'd been there before. It definitely fazed me. I bowled a no-ball, a short one that got hit for four first ball. It was quite overwhelming.\"Despite that feeling, Broad recovered to take five wickets and, that evening, walked into the news conference with the Courier Mail tucked under his arm. It was England's best day in a series where they were dismantled by Mitchell Johnson and lost 5-0.Eighteen months later Broad was doing some dismantling of his own in a career-defining and Ashes-clinching performance.In the fourth Test on his home ground of Trent Bridge, Broad was bowling England's first over for the first time in the absence of the injured James Anderson. Using his local knowledge, Broad urged captain Alastair Cook to bat first if he won the toss.\"I was marking my run-up out and Shane Warne came over and said 'That's a bowl first, isn't it?',\" says Broad. \"I remember thinking Shane Warne is bat first everywhere. If he thinks it's bowl first...\"I went over to Cookie. 'Chef, it could be a bowl first'. He said 'Don't worry, I've made that call already'.\"Broad's legs were pumping. Australian edges were swallowed by England slip fielders. Figures of 8-15 remain the best in Ashes history by a pace bowler from either side. Australia were torn apart in 18.3 overs and 94 minutes. 60 all out.\"You can't take it in,\" says Broad. \"I got the five-for, it came up on the big screen and I didn't have a clue.\"It took a bit of time - months - to see the scorecard and see 8-15 written. What was so special was Joe Root got a hundred in the same day. If we'd been bowled out for 100, it's a different conversation.\"",
        "That 2015 series was the last time Broad won the Ashes. England were again blown away down under in 2017-18 and the following contest in the UK was drawn 2-2. For many, 2019 is remembered for the exploits of Ben Stokes, but for Broad it was when he took a stranglehold on David Warner. Seven times in five Tests Broad got Warner, part of an overall hoodoo of 17 dismissals. In Test history, only two other bowlers have dismissed the same batter more frequently.\"Technically, I worked him out at the back end,\" says Broad. \"I did loads of strategy and stats work and realised he didn't hit the ball straight through mid-on and didn't hit it through square leg.\"In 2019 I made a complete technical shift to try to hit his leg stump. I didn't mind if it went down the leg side. I said to Jonny Bairstow, the wicketkeeper, just understand I'm going to be bowling leg side so make sure you give yourself some room.\"I got Warner three times in the first three innings and I thought 'I've opened something up here'.\"",
        "Even with Broad knocking over Warner twice more in the three Tests he played in Australia in 2021-22, England were once again hammered 4-0. Broad would later wind up the Aussies once more by suggesting the series should be \"void\" because of the Covid restrictions placed on the England squad.Broad was left out in the aftermath of that tour, only to be recalled when Stokes and Brendon McCullum were installed as captain and coach respectively.In what turned out to be the final year of Broad's career, no other pace bowler took more Test wickets and, even with his old mate Anderson hunting a 700th scalp, it was Broad who assumed the role of England's attack leader.In the epic 2023 Ashes series, when England were denied the greatest comeback of all time by the Manchester rain, Broad was the only home seamer to play all five Tests.\"Deep down, I always knew I wanted my last ball in professional cricket to be in an England shirt,\" says Broad.\"I wanted to finish at the top. To do that, you need to make the call. You don't want to go on too long. I had a bit of a fear of a 21-year-old playing against me and going 'I thought he was supposed to be good'. I definitely could have played another couple of years.\"Before the denouement came one more opportunity to chastise the Australians, one more chance to be at the centre of a red-hot Ashes tussle.When Bairstow was controversially stumped by Carey at a baying Lord's, Broad was next in to join Stokes. If ever a situation was made for Broad, it was this - giving a piece of his mind to Carey and Australia captain Pat Cummins, antagonising and goading the tourists as a furious Stokes flayed the ball to all parts.\"It was red mist to start,\" says Broad. \"Not necessarily my opinion over the dismissal - it was walking over that line and feeling the energy of Lord's.\"Something triggered inside me that anyone in a green hat was getting it. The ultra-competitive side of me rose. After about 20 minute I started working with Stokesy and quite deliberately twisted the situation our way. How I was behaving maybe took the Australians off their plan to Stokesy, so we looked to carry that on.\"I remember getting home, sitting with my partner Mollie and we were watching a compilation BBC Sport had put together of the nonsense I'd done. I was filled with embarrassment. 'Oh my goodness me. What on earth was I doing?' I was 36 years old. How did I let myself get to that stage?\"Despite the Broad-Stokes assault, England were well beaten, 2-0 down and staring into the abyss.\"If an incident hadn't happened that day there would have been the narrative of 'England have thrown this away', because we had situations where we put ourselves on the back foot,\" says Broad.The fightback began at Headingley, where a \"petrified\" Broad was due in next as England completed a nerve-shredding run-chase. Broad took his 600th Test wicket at Old Trafford but the washout, which ended the chance of winning the urn, was \"the worst feeling in sport\".",
        "To The Oval, with a series to draw and, as it turned out, a career to end. On the second evening of the final Test Broad went to Stokes' hotel room.\"I knocked on Stokesy's door, wandered in, held out my hand out and said 'that's me, mate',\" says Broad. \"Stokesy just gave me a massive hug.\"I said to him as I left the room 'don't tell anyone', because I needed to see how I would feel the next morning.\"I woke up, opened the curtains and it felt right. The first person I called was my dad, then my mum, then (England managing director) Rob Key. I told the changing room when I got in that morning, then I told the press that night.\"What followed was a joyous celebration of all things Broad, scripted to the very last ball.As a batter, he swiped the last delivery he faced for six. In a legendary moment of sporting theatre, Broad had Carey caught behind to win the Test and square the series. The instant the ball nestled into the gloves of Bairstow, Broad was an England player no more.\"It was the best. Incredible,\" says Broad. \"That saying to 'play like it's your last game'. Well, it was. Go and have some fun and some freedom - be a bit silly.\"Even if I bowl another 5,000 balls, I'm never going to get that feeling again. I feel so content with how it ended.\"Now, with the next Ashes on the horizon, the first in almost two decades without Broad in the England team, he has no urge to \"lace the boots up\" and confront Australia once more.\"It's everything you wish for as a player,\" Broad says. \"It tests everything about you. It brings out emotion, character, mental strength, technical ability and physical hardship.\"If just one fan out there will link me to Ashes cricket, it gives me great pride. I wanted to play and wanted to win.\"",
        "The ultimate Ashes competitor - Broad on walking, Warner and that final wicket",
        "From the Ashes is a series of features and podcasts which dig deeper into stories from cricket's fiercest and most legendary Test series. Full interviews can be found on BBC Sounds, building up to ball-by-ball coverage of the first Test between Australia and England in Perth on 21 November.",
        "There are plenty of contenders for the most famous first ball of an Ashes series.",
        "Michael Slater slashing Phillip DeFreitas for four. Stephen Harmison's wide. Rory Burns bowled by Mitchell Starc. Zak Crawley crunching Pat Cummins through the covers.",
        "As for the most iconic final ball, one man has that covered.",
        "Stuart Broad's place in Ashes history was already assured before his fairytale finale at The Oval two years ago.",
        "The bail-switching, the headband, the edge off Alex Carey and the celebrations etched into English cricketing folklore.",
        "\"I feel like extremely lucky it ended the way it did,\" Broad tells BBC Sport. \"My last ever professional ball, taking that favourite wicket you could ever take - last wicket to win a Test, against Australia, crowd going berserk.",
        "\"I'll never get bored of talking about it because it takes me back to a feeling and a moment that was so special.\"",
        "Broad's final act as an England cricketer was made perfect by everything that had gone before. The 604 Test wickets were more than enough for a hall-of-fame career, but few England players are as synonymous with Ashes cricket as Broad.",
        "No England bowler has taken more Ashes wicket than Broad's 153. No fast bowler on either side has played more than Broad's 40 Ashes Tests. Beyond the numbers, few have found themselves at the heart of as many Ashes battles, engineered as many special moments or created as many memories.",
        "Broad's life has been entwined with Ashes cricket and his early career was heavily influenced by Australia.",
        "When Broad was six months old, his father Chris was scoring three hundreds for England on the successful Ashes tour of 1986-87. The young Broad's cricketing hero was Australia metronome Glenn McGrath, and his development was accelerated by a spell as an 18-year-old with Melbourne club Hoppers Crossing.",
        "Broad was playing Test cricket three years after his time with Hoppers. With a baby face and bouncing blond hair, the Draco Malfoy lookalike was a bowler of obvious promise but no clear identity. It was two years into his career, while earning his 22nd cap in the fifth and deciding Ashes Test, that Broad produced a performance to make him feel at home in an England shirt.",
        "When he was handed the ball on the second day, his career bowling average stood at an unsatisfactory 37.63. What followed was the first of Broad's trademark spells - Shane Watson, Ricky Ponting, Mike Hussey, Michael Clarke and Brad Haddin removed in the space of nine overs to push the urn towards English hands.",
        "\"I walked off the field and felt 'maybe I do belong in this England shirt',\" says Broad.",
        "\"After that five-for I walked down the stairs at The Oval and someone asked for my autograph. A picture was on the front page of the paper. I remember looking at it and going 'wow, that's different'.\"",
        "Listen to From The Ashes: Stuart Broad on Test Match Special podcast",
        "For The Love of Cricket podcast with Stuart Broad and Jos Buttler",
        "Stuart Broad's five-wicket haul helped England defeat Australia in 2009 and made him an Ashes winner for the first time",
        "The next time Broad was an Ashes winner, England's famous triumph down under in 2010-11, he played only two Tests before his series was ended by a side injury. He cried as he was hugged by England team doctor Nick Pierce in the dressing room at the Adelaide Oval and spent the third Test in Perth with the Test Match Special team before heading home to watch the rest of the series from his sofa.",
        "Broad was two from two in Ashes series, but his role as the Pom the Aussies loved to hate was not forged until 2013.",
        "In the tight first Test, Broad's edge off the spin of Ashton Agar deflected off the wicketkeeping gloves of Haddin and into the hands of Clarke at first slip. Broad did not walk, Australia were out of reviews and the runs he went on to add helped England win the match.",
        "In Broad's defence, his brass neck looked worse because of Haddin's inability to hang ont o the edge, but that did not stop Australia coach Darren Lehmann labelling him a \"blatant cheat\" whom he hoped \"cries and goes home\" in the return series down under six months later.",
        "Broad knew he was going to cop it, not least when the Brisbane Courier Mail refused to print his name and ran a headline calling him a 'smug Pommie cheat'.",
        "\"In the warm-up games I walked around the boundary edge with the psychologist or on my own,\" he says. \"If you walk around the Gabba there might be 45,000 people, so you just hear noise. If you walk around at a warm-up where there might only be 100 people, you hear every word.",
        "\"I wanted to build a shield around me. I wanted to hear the abuse to strengthen me. I worked with the psychologist, because I knew it was coming, to strengthen my resolve.",
        "\"When my name got announced that I was bowling my first ball in the first Test at the Gabba, the boos were unbelievable.",
        "\"The day before, I'd done my pre-match mental routine. I stood at the end of my mark, bowled four overs in my mind and I imagined the boos. I could feel it. I felt like I'd been there before. It definitely fazed me. I bowled a no-ball, a short one that got hit for four first ball. It was quite overwhelming.\"",
        "Despite that feeling, Broad recovered to take five wickets and, that evening, walked into the news conference with the Courier Mail tucked under his arm. It was England's best day in a series where they were dismantled by Mitchell Johnson and lost 5-0.",
        "Eighteen months later Broad was doing some dismantling of his own in a career-defining and Ashes-clinching performance.",
        "In the fourth Test on his home ground of Trent Bridge, Broad was bowling England's first over for the first time in the absence of the injured James Anderson. Using his local knowledge, Broad urged captain Alastair Cook to bat first if he won the toss.",
        "\"I was marking my run-up out and Shane Warne came over and said 'That's a bowl first, isn't it?',\" says Broad. \"I remember thinking Shane Warne is bat first everywhere. If he thinks it's bowl first...",
        "\"I went over to Cookie. 'Chef, it could be a bowl first'. He said 'Don't worry, I've made that call already'.\"",
        "Broad's legs were pumping. Australian edges were swallowed by England slip fielders. Figures of 8-15 remain the best in Ashes history by a pace bowler from either side. Australia were torn apart in 18.3 overs and 94 minutes. 60 all out.",
        "\"You can't take it in,\" says Broad. \"I got the five-for, it came up on the big screen and I didn't have a clue.",
        "\"It took a bit of time - months - to see the scorecard and see 8-15 written. What was so special was Joe Root got a hundred in the same day. If we'd been bowled out for 100, it's a different conversation.\"",
        "Broad's 8-15 remain the best figures by a pace bowler in an Ashes Test",
        "That 2015 series was the last time Broad won the Ashes. England were again blown away down under in 2017-18 and the following contest in the UK was drawn 2-2.",
        "For many, 2019 is remembered for the exploits of Ben Stokes, but for Broad it was when he took a stranglehold on David Warner. Seven times in five Tests Broad got Warner, part of an overall hoodoo of 17 dismissals. In Test history, only two other bowlers have dismissed the same batter more frequently.",
        "\"Technically, I worked him out at the back end,\" says Broad. \"I did loads of strategy and stats work and realised he didn't hit the ball straight through mid-on and didn't hit it through square leg.",
        "\"In 2019 I made a complete technical shift to try to hit his leg stump. I didn't mind if it went down the leg side. I said to Jonny Bairstow, the wicketkeeper, just understand I'm going to be bowling leg side so make sure you give yourself some room.",
        "\"I got Warner three times in the first three innings and I thought 'I've opened something up here'.\"",
        "Broad dismissed Australia opener David Warner 17 times in Ashes Tests",
        "Even with Broad knocking over Warner twice more in the three Tests he played in Australia in 2021-22, England were once again hammered 4-0. Broad would later wind up the Aussies once more by suggesting the series should be \"void\" because of the Covid restrictions placed on the England squad.",
        "Broad was left out in the aftermath of that tour, only to be recalled when Stokes and Brendon McCullum were installed as captain and coach respectively.",
        "In what turned out to be the final year of Broad's career, no other pace bowler took more Test wickets and, even with his old mate Anderson hunting a 700th scalp, it was Broad who assumed the role of England's attack leader.",
        "In the epic 2023 Ashes series, when England were denied the greatest comeback of all time by the Manchester rain, Broad was the only home seamer to play all five Tests.",
        "\"Deep down, I always knew I wanted my last ball in professional cricket to be in an England shirt,\" says Broad.",
        "\"I wanted to finish at the top. To do that, you need to make the call. You don't want to go on too long. I had a bit of a fear of a 21-year-old playing against me and going 'I thought he was supposed to be good'. I definitely could have played another couple of years.\"",
        "Before the denouement came one more opportunity to chastise the Australians, one more chance to be at the centre of a red-hot Ashes tussle.",
        "When Bairstow was controversially stumped by Carey at a baying Lord's, Broad was next in to join Stokes. If ever a situation was made for Broad, it was this - giving a piece of his mind to Carey and Australia captain Pat Cummins, antagonising and goading the tourists as a furious Stokes flayed the ball to all parts.",
        "\"It was red mist to start,\" says Broad. \"Not necessarily my opinion over the dismissal - it was walking over that line and feeling the energy of Lord's.",
        "\"Something triggered inside me that anyone in a green hat was getting it. The ultra-competitive side of me rose. After about 20 minute I started working with Stokesy and quite deliberately twisted the situation our way. How I was behaving maybe took the Australians off their plan to Stokesy, so we looked to carry that on.",
        "\"I remember getting home, sitting with my partner Mollie and we were watching a compilation BBC Sport had put together of the nonsense I'd done. I was filled with embarrassment. 'Oh my goodness me. What on earth was I doing?' I was 36 years old. How did I let myself get to that stage?\"",
        "Despite the Broad-Stokes assault, England were well beaten, 2-0 down and staring into the abyss.",
        "\"If an incident hadn't happened that day there would have been the narrative of 'England have thrown this away', because we had situations where we put ourselves on the back foot,\" says Broad.",
        "The fightback began at Headingley, where a \"petrified\" Broad was due in next as England completed a nerve-shredding run-chase. Broad took his 600th Test wicket at Old Trafford but the washout, which ended the chance of winning the urn, was \"the worst feeling in sport\".",
        "Broad had Alex Carey caught behind to end the 2023 Ashes and his playing career",
        "To The Oval, with a series to draw and, as it turned out, a career to end. On the second evening of the final Test Broad went to Stokes' hotel room.",
        "\"I knocked on Stokesy's door, wandered in, held out my hand out and said 'that's me, mate',\" says Broad. \"Stokesy just gave me a massive hug.",
        "\"I said to him as I left the room 'don't tell anyone', because I needed to see how I would feel the next morning.",
        "\"I woke up, opened the curtains and it felt right. The first person I called was my dad, then my mum, then (England managing director) Rob Key. I told the changing room when I got in that morning, then I told the press that night.\"",
        "What followed was a joyous celebration of all things Broad, scripted to the very last ball.",
        "As a batter, he swiped the last delivery he faced for six. In a legendary moment of sporting theatre, Broad had Carey caught behind to win the Test and square the series. The instant the ball nestled into the gloves of Bairstow, Broad was an England player no more.",
        "\"It was the best. Incredible,\" says Broad. \"That saying to 'play like it's your last game'. Well, it was. Go and have some fun and some freedom - be a bit silly.",
        "\"Even if I bowl another 5,000 balls, I'm never going to get that feeling again. I feel so content with how it ended.\"",
        "Now, with the next Ashes on the horizon, the first in almost two decades without Broad in the England team, he has no urge to \"lace the boots up\" and confront Australia once more.",
        "\"It's everything you wish for as a player,\" Broad says. \"It tests everything about you. It brings out emotion, character, mental strength, technical ability and physical hardship.",
        "\"If just one fan out there will link me to Ashes cricket, it gives me great pride. I wanted to play and wanted to win.\"",
        "The Ashes: Australia v England",
        "21 November 2025 - 7 January 2026",
        "In-play clips and highlights on iPlayer, BBC Sport website and app. Ball-by-ball commentary on BBC Sounds, BBC Radio 5 Sports Extra and the BBC Sport website and app, which will also have live text commentary and daily features and analysis"
      ]
    }
  ]
}