{
  "scraped_at": "2025-10-27T18:56:59.775546",
  "total_articles": 22,
  "category": "darts",
  "articles_per_category": 100,
  "articles": [
    {
      "url": "https://www.bbc.com/sport/darts/articles/c986jyg7gj1o",
      "main_category": "sport",
      "detailed_category": "darts",
      "topic": "Van Veen stuns Humphries to win first major PDC title",
      "content": [
        "Dutchman Gian van Veen shocked world number one Luke Humphries to win his first major PDC title at the European Championship in Dortmund.The 23-year-old beat countryman and four-time champion Michael van Gerwen 11-9 in the semi-finals before holding his nerve to come through a tense match with Humphries 11-10.\"I said it to my girlfriend when I walked on stage, whenever I win my first TV title I wouldn't cry - and here I am crying,\" Van Veen told ITV Sport.\"I will never forget this moment or even this crowd. It is phenomenal to win my first major in Germany.\"I said to Luke after the game, when he hit the bull to go 10-10, that is why he is world number one. That's how amazing person Luke is. It is definitely a night to never forget.\"",
        "Van Veen injured his thumb during his semi-final triumph and still appeared to be in pain throughout the final.Humphries started well and raced into a 4-1 lead in the 21-leg match, but his rival refused to let the game run away from him.A back-and-forth encounter ensued with the pair trading legs into the latter stages.Van Veen, known as 'The Giant', passed up the opportunity to seal victory by missing double 20 when leading 10-9 but made no mistake with a 100 checkout in the decider.He came through matches against Damon Heta, Ryan Searle and Ryan Joyce earlier in the week and goes home with £120,000.",
        "Gian van Veen won the PDC World Youth Championship in 2024",
        "Dutchman Gian van Veen shocked world number one Luke Humphries to win his first major PDC title at the European Championship in Dortmund.",
        "The 23-year-old beat countryman and four-time champion Michael van Gerwen 11-9 in the semi-finals before holding his nerve to come through a tense match with Humphries 11-10.",
        "\"I said it to my girlfriend when I walked on stage, whenever I win my first TV title I wouldn't cry - and here I am crying,\" Van Veen told ITV Sport.",
        "\"I will never forget this moment or even this crowd. It is phenomenal to win my first major in Germany.",
        "\"I said to Luke after the game, when he hit the bull to go 10-10, that is why he is world number one. That's how amazing person Luke is. It is definitely a night to never forget.\"",
        "Van Veen injured his thumb during his semi-final triumph and still appeared to be in pain throughout the final.",
        "Humphries started well and raced into a 4-1 lead in the 21-leg match, but his rival refused to let the game run away from him.",
        "A back-and-forth encounter ensued with the pair trading legs into the latter stages.",
        "Van Veen, known as 'The Giant', passed up the opportunity to seal victory by missing double 20 when leading 10-9 but made no mistake with a 100 checkout in the decider.",
        "He came through matches against Damon Heta, Ryan Searle and Ryan Joyce earlier in the week and goes home with £120,000."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/darts/articles/cjw9qzlppyxo",
      "main_category": "sport",
      "detailed_category": "darts",
      "topic": "Littler loses to Wade as world No 1 wait continues",
      "content": [
        "Luke Littler's hunt to become world number one continues after he was knocked out of the European Championship in a thrilling 10-7 second-round defeat by James Wade. Luke Humphries, meanwhile, narrowly avoided a shock as he came from behind before winning a deciding leg to beat Cameron Menzies 10-9.The tournament's winner will be decided on Sunday, with the four quarter-finals taking place in the afternoon session before the semis and final in the evening.Littler, 18, could potentially have snatched top spot of the PDC Order of Merit from fellow Englishman Humphries at the tournament in Dortmund and would definitely have done so had he won the title. But in a tight last-16 encounter, Wade went 2-0 up before Littler pulled it back to 3-2.Wade went two legs up again to make it 6-4 but Littler responded again, drawing the game at 6-6.After exchanging legs once more it was Wade who pulled ahead, making the most of Littler failing to check out double 10 to make it 8-7, then finishing on 73 before an expert finish on 108 to seal victory.Wade, who peaked at world number two in 2010 and is an 11-time PDC major winner, told ITV that he did not think Littler \"played very well\" compared to his usual standard.\"I think I should have run away with it a little more before I did,\" said Wade. \"I think everyone in darts knows I can play.\"While Littler and Wade both averaged 97.75 - and Littler managed eight 180s to Wade's three - throwing 11 more 100+ scores and having a checkout rate of 45.45% to Littler's 33.33% proved the difference.Littler has not fared well recently in Germany, where he has skipped some tournaments after facing a hostile reception from spectators. He was booed alongside Humphries when the pair lost to Germany at the World Cup of Darts in Frankfurt in June.After the European Championship there are two big tournaments before the World Championship starts on 11 December - the Grand Slam of Darts (8-16 November) and Players Championship Finals (21-23 November).",
        "Humphries found himself 5-7 and 5-8 behind against Scotland's Menzies, but he won three straight legs to go 9-8 up and made held his throw after Menzies took it to a decider.Humphries had a lower checkout rate, but a higher average and more 100+ and 140+ throws helped him edge past Menzies.The world number one's win means he will face compatriot Wade in the last eight.Humphries said he \"really had to work hard\" to get past Menzies. \"I'm proud of the way I held myself in moments where I felt very frustrated,\" he said. \"I was trying to hold myself together. I did and the way I've come back - I'm quite proud of that. \"When you're winning in games where you're under the cosh, it's quite pleasing.\"",
        "Ryan Searle 2-10 Gian van VeenDaryl Gurney  10-6 Ross SmithMartin Schindler 7-10 Ryan JoyceChris Dobey 5-10 Michael van GerwenRicardo Pietreczko 10-6 Jermaine WattimenaNathan Aspinall 7-10 Danny NoppertLuke Littler 7-10 James WadeLuke Humphries 10-9 Cameron Menzies",
        "Ryan Joyce v Gian van VeenMichael van Gerwen v Daryl GurneyJames Wade v Luke HumphriesDanny Noppert v Ricardo Pietreczko",
        "Luke Littler is second in the PDC Order of Merit",
        "Luke Littler's hunt to become world number one continues after he was knocked out of the European Championship in a thrilling 10-7 second-round defeat by James Wade.",
        "Luke Humphries, meanwhile, narrowly avoided a shock as he came from behind before winning a deciding leg to beat Cameron Menzies 10-9.",
        "The tournament's winner will be decided on Sunday, with the four quarter-finals taking place in the afternoon session before the semis and final in the evening.",
        "Littler, 18, could potentially have snatched top spot of the PDC Order of Merit from fellow Englishman Humphries at the tournament in Dortmund and would definitely have done so had he won the title.",
        "But in a tight last-16 encounter, Wade went 2-0 up before Littler pulled it back to 3-2.",
        "Wade went two legs up again to make it 6-4 but Littler responded again, drawing the game at 6-6.",
        "After exchanging legs once more it was Wade who pulled ahead, making the most of Littler failing to check out double 10 to make it 8-7, then finishing on 73 before an expert finish on 108 to seal victory.",
        "Wade, who peaked at world number two in 2010 and is an 11-time PDC major winner, told ITV that he did not think Littler \"played very well\" compared to his usual standard.",
        "\"I think I should have run away with it a little more before I did,\" said Wade.",
        "\"I think everyone in darts knows I can play.\"",
        "While Littler and Wade both averaged 97.75 - and Littler managed eight 180s to Wade's three - throwing 11 more 100+ scores and having a checkout rate of 45.45% to Littler's 33.33% proved the difference.",
        "Littler has not fared well recently in Germany, where he has skipped some tournaments after facing a hostile reception from spectators.",
        "He was booed alongside Humphries when the pair lost to Germany at the World Cup of Darts in Frankfurt in June.",
        "After the European Championship there are two big tournaments before the World Championship starts on 11 December - the Grand Slam of Darts (8-16 November) and Players Championship Finals (21-23 November).",
        "Humphries found himself 5-7 and 5-8 behind against Scotland's Menzies, but he won three straight legs to go 9-8 up and made held his throw after Menzies took it to a decider.",
        "Humphries had a lower checkout rate, but a higher average and more 100+ and 140+ throws helped him edge past Menzies.",
        "The world number one's win means he will face compatriot Wade in the last eight.",
        "Humphries said he \"really had to work hard\" to get past Menzies.",
        "\"I'm proud of the way I held myself in moments where I felt very frustrated,\" he said. \"I was trying to hold myself together. I did and the way I've come back - I'm quite proud of that.",
        "\"When you're winning in games where you're under the cosh, it's quite pleasing.\"",
        "Ryan Searle 2-10 Gian van Veen",
        "Daryl Gurney  10-6 Ross Smith",
        "Martin Schindler 7-10 Ryan Joyce",
        "Chris Dobey 5-10 Michael van Gerwen",
        "Ricardo Pietreczko 10-6 Jermaine Wattimena",
        "Nathan Aspinall 7-10 Danny Noppert",
        "Luke Littler 7-10 James Wade",
        "Luke Humphries 10-9 Cameron Menzies",
        "Ryan Joyce v Gian van Veen",
        "Michael van Gerwen v Daryl Gurney",
        "James Wade v Luke Humphries",
        "Danny Noppert v Ricardo Pietreczko"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/darts/articles/crklxy8kypno",
      "main_category": "sport",
      "detailed_category": "darts",
      "topic": "Littler & Humphries dominant at European Championship",
      "content": [
        "Luke Littler and Luke Humphries both breezed into the second round of the European Championship in Germany with emphatic victories.World champion Littler claimed a 6-1 win over his childhood hero Dutchman Raymond van Barneveld.The 18-year-old finished with an average of 98.97 and a checkout success of 46.2% as the five-time world champion was overwhelmed.Humphries was even more emphatic at Dortmund's Westfalenhalle as he thrashed Poland's Krzysztof Ratajski 6-0.The current world number one averaged 109.98  as he threw five 180s, sealing victory with a 161 checkout.Littler, who faces James Wade next, will become world number one for the first time in his career should he win the tournament.Wade cruised to a 6-1 win over Mike de Decker, while Cameron Menzies claimed a 6-3 win over fellow Scot Gary Anderson and Ricardo Pietreczko edged a 6-4 win over Josh Rock.Nathan Aspinall continued his recent good form with a 6-1 win over Rob Cross, while Danny Noppert beat Dirk van Duijvenbode 6-3.",
        "Niko Springer 3-6 Jermaine WattimenaGary Anderson 3-6 Cameron MenziesJames Wade 6-1 Mike de DeckerJosh Rock 4-6 Ricardo PietreczkoLuke Humphries 6-0 Krzysztof RatajskiLuke Littler 6-1 Raymond van BarneveldNathan Aspinall 6-1 Rob CrossDirk van Duijvenbode 3-6 Danny Noppert",
        "Luke Littler and Luke Humphries are the top two ranked players in the world",
        "Luke Littler and Luke Humphries both breezed into the second round of the European Championship in Germany with emphatic victories.",
        "World champion Littler claimed a 6-1 win over his childhood hero Dutchman Raymond van Barneveld.",
        "The 18-year-old finished with an average of 98.97 and a checkout success of 46.2% as the five-time world champion was overwhelmed.",
        "Humphries was even more emphatic at Dortmund's Westfalenhalle as he thrashed Poland's Krzysztof Ratajski 6-0.",
        "The current world number one averaged 109.98  as he threw five 180s, sealing victory with a 161 checkout.",
        "Littler, who faces James Wade next, will become world number one for the first time in his career should he win the tournament.",
        "Wade cruised to a 6-1 win over Mike de Decker, while Cameron Menzies claimed a 6-3 win over fellow Scot Gary Anderson and Ricardo Pietreczko edged a 6-4 win over Josh Rock.",
        "Nathan Aspinall continued his recent good form with a 6-1 win over Rob Cross, while Danny Noppert beat Dirk van Duijvenbode 6-3.",
        "Littler seeks world number one spot this weekend",
        "Van Gerwen survives scare at European Championship",
        "Aspinall wins third European event of season",
        "Niko Springer 3-6 Jermaine Wattimena",
        "Gary Anderson 3-6 Cameron Menzies",
        "James Wade 6-1 Mike de Decker",
        "Josh Rock 4-6 Ricardo Pietreczko",
        "Luke Humphries 6-0 Krzysztof Ratajski",
        "Luke Littler 6-1 Raymond van Barneveld",
        "Nathan Aspinall 6-1 Rob Cross",
        "Dirk van Duijvenbode 3-6 Danny Noppert"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/darts/articles/cm2lednj4e7o",
      "main_category": "sport",
      "detailed_category": "darts",
      "topic": "Van Gerwen survives scare at European Championship",
      "content": [
        "Michael van Gerwen survived a scare as he came back from 4-2 down to beat fellow Dutchman Wessel Nijman 6-5 in the first round of the European Championship.Nijman failed to take seven match darts in the 11th leg before Van Gerwen eventually punished him by finishing with a 70 in a 21-dart leg in Germany.\"It was a really good match until the last leg,\" said Van Gerwen.\"Wessel was playing well but at the end he showed some nerves.\"It was a tough game but I got the win. I should have beaten him 6-4 and when you put yourself in that position it's going to be tough.\"Three-time world champion Van Gerwen recently announced he would miss the Players Championship Finals in November to focus on his family, having revealed in May that he and his wife, with whom he has two children, were getting divorced.   He missed two darts at a double as he lost the sixth leg against Nijman to go 4-2 down but two 14-dart legs brought him level.Nijman, who is 36th in the darts rankings, missed two doubles to take the ninth leg as world number three Van Gerwen went 5-4 up.Van Gerwen failed to take three match darts in the next leg, with Nijman taking out 71 to level at 5-5 and set up a decider.Nijman could not take seven chances to win and Van Gerwen, aiming for a record fifth European Championship title, took advantage to go through. The European Championship is between the top 32 players from this season's European Tour rankings and is taking place in Dortmund, with the final on Sunday.",
        "In the last of Thursday's matches, Chris Dobey beat Stephen Bunting 6-3 and will play Van Gerwen next.Welshman Gerwyn Price was knocked out with a defeat by Northern Ireland's Daryl Gurney. The pair were involved in a fiery encounter in Blackpool in July and, while Price was the winner on that occasion, Gurney won this time around as he secured a 6-3 victory.Price's compatriot Jonny Clayton was also beaten, finding himself on the end of a 6-3 defeat by England's Ryan Searle.  Ross Smith and Peter Wright are both former winners of the title and faced each other in the first round. England's Smith, who won in 2022, emerged the winner as he beat his Scottish rival - the 2020 and 2023 champion - 6-2.World Youth champion Gian van Veen also progressed as he beat Australia's Damon Heta 6-3.Home favourite Martin Schindler came back from 3-0 down to level at 3-3 against England's Dave Chisnall, eventually taking a dramatic 6-5 win with double top.Teenager Luke Littler, who is number two in the rankings, will start his campaign on Friday with a match against five-time world champion Raymond van Barneveld, while world number one Luke Humphries will play Krzysztof Ratajski.Nathan Aspinall, who has won three European Tour events this year, will face Rob Cross and Gary Anderson will also be in action against Cameron Menzies.",
        "Van Gerwen won world titles in 2014, 2017 and 2019",
        "Michael van Gerwen survived a scare as he came back from 4-2 down to beat fellow Dutchman Wessel Nijman 6-5 in the first round of the European Championship.",
        "Nijman failed to take seven match darts in the 11th leg before Van Gerwen eventually punished him by finishing with a 70 in a 21-dart leg in Germany.",
        "\"It was a really good match until the last leg,\" said Van Gerwen.",
        "\"Wessel was playing well but at the end he showed some nerves.",
        "\"It was a tough game but I got the win. I should have beaten him 6-4 and when you put yourself in that position it's going to be tough.\"",
        "Three-time world champion Van Gerwen recently announced he would miss the Players Championship Finals in November to focus on his family, having revealed in May that he and his wife, with whom he has two children, were getting divorced.",
        "He missed two darts at a double as he lost the sixth leg against Nijman to go 4-2 down but two 14-dart legs brought him level.",
        "Nijman, who is 36th in the darts rankings, missed two doubles to take the ninth leg as world number three Van Gerwen went 5-4 up.",
        "Van Gerwen failed to take three match darts in the next leg, with Nijman taking out 71 to level at 5-5 and set up a decider.",
        "Nijman could not take seven chances to win and Van Gerwen, aiming for a record fifth European Championship title, took advantage to go through.",
        "The European Championship is between the top 32 players from this season's European Tour rankings and is taking place in Dortmund, with the final on Sunday.",
        "Littler seeks world number one spot this weekend",
        "Aspinall wins third European event of season",
        "'Family my priority' - Van Gerwen out of Finals",
        "In the last of Thursday's matches, Chris Dobey beat Stephen Bunting 6-3 and will play Van Gerwen next.",
        "Welshman Gerwyn Price was knocked out with a defeat by Northern Ireland's Daryl Gurney.",
        "The pair were involved in a fiery encounter in Blackpool in July and, while Price was the winner on that occasion, Gurney won this time around as he secured a 6-3 victory.",
        "Price's compatriot Jonny Clayton was also beaten, finding himself on the end of a 6-3 defeat by England's Ryan Searle.",
        "Ross Smith and Peter Wright are both former winners of the title and faced each other in the first round.",
        "England's Smith, who won in 2022, emerged the winner as he beat his Scottish rival - the 2020 and 2023 champion - 6-2.",
        "World Youth champion Gian van Veen also progressed as he beat Australia's Damon Heta 6-3.",
        "Home favourite Martin Schindler came back from 3-0 down to level at 3-3 against England's Dave Chisnall, eventually taking a dramatic 6-5 win with double top.",
        "Teenager Luke Littler, who is number two in the rankings, will start his campaign on Friday with a match against five-time world champion Raymond van Barneveld, while world number one Luke Humphries will play Krzysztof Ratajski.",
        "Nathan Aspinall, who has won three European Tour events this year, will face Rob Cross and Gary Anderson will also be in action against Cameron Menzies."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/darts/articles/crexq84jr1no",
      "main_category": "sport",
      "detailed_category": "darts",
      "topic": "Littler seeks world number one spot this weekend",
      "content": [
        "Teenager Luke Littler will become world number one for the first time if he wins the European Championship, which starts on Thursday.The 18-year-old has been on the professional tour for less than two years but is looking to replace Luke Humphries as the top-ranked player.Littler, currently number two in the rankings, has stated his ambition to claim the top spot before beginning his PDC World Championship title defence at Alexandra Palace in December.Victory at the European Championship in Germany, which concludes on Sunday, would make him the youngest PDC world number one, surpassing Michael van Gerwen who achieved the feat aged 24 in 2014.Depending on results, Littler could also overtake fellow Englishman Humphries if he does not win the title in Dortmund, but progresses further than his rival.Humphries, the 2024 world champion, would extend his lead - which currently stands at £52,500 - if he takes the £120,000 first prize.The rankings are based on prize money earned over a two-year period, with Littler winning seven major titles and earning nearly £1.7m.",
        "Littler closed the gap on Humphries when he won the World Grand Prix earlier this month, saying afterwards: \"Obviously, until I get that world number one spot, I will never call myself the best in the world.\"I don't want to think about it too much, but I could be world number one before that World Championship.\"I've just got to keep chucking away and put as much pressure as I can on Luke.\"Littler begins his European Championship campaign against five-time world champion Raymond van Barneveld, 58, on Friday.Humphries, 30, faces Pole Krzysztof Ratajski in the first round and could potentially meet Littler in the quarter-finals.A day after his Grand Prix victory, Littler was beaten in the World Youth Championship semi-finals by Beau Greaves, before he then won the Players Championship 32 event.He has also announced a new management deal with Target Darts after splitting with Martin Foulds of ZXF Sports Management, who had managed him for five years.Littler will hope to improve his recent record in Germany, where he has skipped some tournaments after facing a hostile reception from spectators. He was booed alongside Humphries when the pair lost to Germany at the World Cup of Darts in Frankfurt in June.After the European Championship, there are two big tournaments before the World Championship starts on 11 December - the Grand Slam of Darts (8-16 November) and Players Championship Finals (21-23 November).",
        "If Humphries is beaten in the first round in Dortmund, Littler becomes number one if he makes the semi-finalsIf Humphries loses in round two, Littler will top the rankings if he makes the finalIf Humphries loses to Littler in the quarter-finals, then Littler will become number one if he makes the finalIf Littler loses in the quarter-finals or earlier, Humphries remains world number one.If Littler wins the title in Dortmund, he will lead the rankingsIf Humphries wins the European Championship, he will remain world number one",
        "Littler became the youngest world darts champion in January aged 17",
        "Teenager Luke Littler will become world number one for the first time if he wins the European Championship, which starts on Thursday.",
        "The 18-year-old has been on the professional tour for less than two years but is looking to replace Luke Humphries as the top-ranked player.",
        "Littler, currently number two in the rankings, has stated his ambition to claim the top spot before beginning his PDC World Championship title defence at Alexandra Palace in December.",
        "Victory at the European Championship in Germany, which concludes on Sunday, would make him the youngest PDC world number one, surpassing Michael van Gerwen who achieved the feat aged 24 in 2014.",
        "Depending on results, Littler could also overtake fellow Englishman Humphries if he does not win the title in Dortmund, but progresses further than his rival.",
        "Humphries, the 2024 world champion, would extend his lead - which currently stands at £52,500 - if he takes the £120,000 first prize.",
        "The rankings are based on prize money earned over a two-year period, with Littler winning seven major titles and earning nearly £1.7m.",
        "Littler closed the gap on Humphries when he won the World Grand Prix earlier this month, saying afterwards: \"Obviously, until I get that world number one spot, I will never call myself the best in the world.",
        "\"I don't want to think about it too much, but I could be world number one before that World Championship.",
        "\"I've just got to keep chucking away and put as much pressure as I can on Luke.\"",
        "Littler begins his European Championship campaign against five-time world champion Raymond van Barneveld, 58, on Friday.",
        "Humphries, 30, faces Pole Krzysztof Ratajski in the first round and could potentially meet Littler in the quarter-finals.",
        "A day after his Grand Prix victory, Littler was beaten in the World Youth Championship semi-finals by Beau Greaves, before he then won the Players Championship 32 event.",
        "He has also announced a new management deal with Target Darts after splitting with Martin Foulds of ZXF Sports Management, who had managed him for five years.",
        "Littler will hope to improve his recent record in Germany, where he has skipped some tournaments after facing a hostile reception from spectators. He was booed alongside Humphries when the pair lost to Germany at the World Cup of Darts in Frankfurt in June.",
        "After the European Championship, there are two big tournaments before the World Championship starts on 11 December - the Grand Slam of Darts (8-16 November) and Players Championship Finals (21-23 November).",
        "If Humphries is beaten in the first round in Dortmund, Littler becomes number one if he makes the semi-finals",
        "If Humphries loses in round two, Littler will top the rankings if he makes the final",
        "If Humphries loses to Littler in the quarter-finals, then Littler will become number one if he makes the final",
        "If Littler loses in the quarter-finals or earlier, Humphries remains world number one.",
        "If Littler wins the title in Dortmund, he will lead the rankings",
        "If Humphries wins the European Championship, he will remain world number one"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/darts/articles/ckgky1zx8dko",
      "main_category": "sport",
      "detailed_category": "darts",
      "topic": "Aspinall wins third European event of season",
      "content": [
        "Nathan Aspinall won his third European Tour event of the year with victory in the German Darts Championship.The 34-year-old English player defeated Dutchman Dirk van Duijvenbode 8-6 in the final in Hildesheim.Aspinall had not won on the European Tour before this year but adds the title to victories in the European Darts Open and European Darts Trophy.An average of 97.05 was enough to seal victory in Sunday's final for Aspinall, who will be top seed for the European Championship in Dortmund next weekend.'The Asp' raced into a 6-2 lead in the final but Van Duijvenbode levelled before Aspinall went clear to collect the £30,000 first prize.On finals day, Aspinall produced a magnificent 110 average to dispatch Steve Lennon, before overcoming Dutch duo Jermaine Wattimena and Gian van Veen.The Stockport thrower then reeled off four straight legs to edge out world youth champion Van Veen 7-6 in the semi-finals.Aspinall joins Michael van Gerwen, Peter Wright, Luke Humphries and Dave Chisnall as only the fifth player to win three European Tour titles in the same calendar year.\"I'm in very good company,\" said Aspinall, who will take on Rob Cross at the European Championship.\"These are very, very tough days. It took me 10 years to win my first one, but I've found the formula now.\"The world's three top-ranked players - Humphries, Luke Littler and Van Gerwen - opted to miss the event in Germany.",
        "Aspinall is ranked 23rd in the world",
        "Nathan Aspinall won his third European Tour event of the year with victory in the German Darts Championship.",
        "The 34-year-old English player defeated Dutchman Dirk van Duijvenbode 8-6 in the final in Hildesheim.",
        "Aspinall had not won on the European Tour before this year but adds the title to victories in the European Darts Open and European Darts Trophy.",
        "An average of 97.05 was enough to seal victory in Sunday's final for Aspinall, who will be top seed for the European Championship in Dortmund next weekend.",
        "'The Asp' raced into a 6-2 lead in the final but Van Duijvenbode levelled before Aspinall went clear to collect the £30,000 first prize.",
        "On finals day, Aspinall produced a magnificent 110 average to dispatch Steve Lennon, before overcoming Dutch duo Jermaine Wattimena and Gian van Veen.",
        "The Stockport thrower then reeled off four straight legs to edge out world youth champion Van Veen 7-6 in the semi-finals.",
        "Aspinall joins Michael van Gerwen, Peter Wright, Luke Humphries and Dave Chisnall as only the fifth player to win three European Tour titles in the same calendar year.",
        "\"I'm in very good company,\" said Aspinall, who will take on Rob Cross at the European Championship.",
        "\"These are very, very tough days. It took me 10 years to win my first one, but I've found the formula now.\"",
        "The world's three top-ranked players - Humphries, Luke Littler and Van Gerwen - opted to miss the event in Germany."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/darts/articles/ce3xl5q3gqeo",
      "main_category": "sport",
      "detailed_category": "darts",
      "topic": "Greaves wins 86th successive Women's Series match",
      "content": [
        "Darts sensation Beau Greaves extended her remarkable winning run in the PDC Women's Series to 86 matches with victory in the final four tournaments of the season.The 21-year-old from Doncaster announced on Friday that she would compete in the PDC World Championship, days after beating world number two Luke Littler in the World Youth Championship semi-finals.Her focus switched back to the women's game this weekend and a run of four tournaments in Wigan over two days - two on Saturday and two on Sunday - to bring the PDC Women's Series to a close.Greaves won all 28 of her matches over the weekend, beating Fallon Sherrock 5-4 in both of Saturday's finals before defeating Gemma Hayter 5-0 and the Netherlands' Noa-Lynn van Leuven 5-3 in Sunday's finals. Her latest victories took her tally to 18 tournament wins out of the 24 on offer, including the past 13 in a row.She will be one of five players from the Women's Series to compete at the PDC World Championship, which starts at London's Alexandra Palace on 11 December  Sherrock, Hayter and Van Leuven qualify via their Women's Series ranking points, while top-ranked Greaves made it courtesy of her performances on the Development Tour and Lisa Ashton as Women's World Matchplay champion.Greaves, Sherrock, Ashton and Van Leuven have all played at the World Championship before, with Van Leuven becoming the first transgender player to compete last year, losing 3-1 to Kevin Doets.Before then, Greaves will compete in the PDC's Grand Slam in Wolverhampton in early November, before facing defending champion Gian van Veen of the Netherlands in the youth final at Minehead later next month.",
        "Beau Greaves has won £37,600 in prize money in this year's PDC Women's Series",
        "Darts sensation Beau Greaves extended her remarkable winning run in the PDC Women's Series to 86 matches with victory in the final four tournaments of the season.",
        "The 21-year-old from Doncaster announced on Friday that she would compete in the PDC World Championship, days after beating world number two Luke Littler in the World Youth Championship semi-finals.",
        "Her focus switched back to the women's game this weekend and a run of four tournaments in Wigan over two days - two on Saturday and two on Sunday - to bring the PDC Women's Series to a close.",
        "Greaves won all 28 of her matches over the weekend, beating Fallon Sherrock 5-4 in both of Saturday's finals before defeating Gemma Hayter 5-0 and the Netherlands' Noa-Lynn van Leuven 5-3 in Sunday's finals.",
        "Her latest victories took her tally to 18 tournament wins out of the 24 on offer, including the past 13 in a row.",
        "She will be one of five players from the Women's Series to compete at the PDC World Championship, which starts at London's Alexandra Palace on 11 December",
        "Sherrock, Hayter and Van Leuven qualify via their Women's Series ranking points, while top-ranked Greaves made it courtesy of her performances on the Development Tour and Lisa Ashton as Women's World Matchplay champion.",
        "Greaves, Sherrock, Ashton and Van Leuven have all played at the World Championship before, with Van Leuven becoming the first transgender player to compete last year, losing 3-1 to Kevin Doets.",
        "Before then, Greaves will compete in the PDC's Grand Slam in Wolverhampton in early November, before facing defending champion Gian van Veen of the Netherlands in the youth final at Minehead later next month."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/darts/articles/ced69pvy365o",
      "main_category": "sport",
      "detailed_category": "darts",
      "topic": "Greaves to play at worlds and on pro tour",
      "content": [
        "Beau Greaves has confirmed she will play in the PDC World Darts Championship and take her place on the professional tour.The 21-year-old from Doncaster beat reigning world champion Luke Littler on Monday to reach the world youth championship final.Greaves had declined to take part in the main worlds at Alexandra Palace since losing on her debut in 2022.She is a three-time WDF women's world champion, and the rules prevent her playing in both, plus she previously questioned her ability to compete against the top men.A statement released by Greaves' management company, Opus Sports Management, said: \"After securing her tour card for 2026/2027, we are excited to announce that Beau will be competing in the PDC World Championship 2025/26.\"After an incredible year on the various PDC circuits, and with next year becoming a huge one , it was the decision that made the most sense for Beau.\"We cannot wait to see her back on the famous Ally Pally stage.\"Greaves finished runner-up on the development tour to become only the second woman, after Lisa Ashton, to earn a professional two-year tour card.",
        "She has informed the WDF she will not be playing in the women's championship, which starts on 28 NovemberA WDF statement said: \"Although Beau will no longer be competing on the Lakeside stage, we wish her all the best in the next stage of her darting career. \"She has been a fantastic ambassador for our system since we returned from the pandemic in 2021, winning every major WDF title on the way. \"It's been fantastic to see how her game has gone from strength to strength playing in WDF events and we know that she'll continue to make even more history on the PDC circuit.\"Five women will compete at the PDC World Championship after a new qualifying structure was announced.This year's event will have an expanded field of 128 players, up from 96 in 2024-25, with the winner taking home £1m of a £5m prize pot.Women's Matchplay winner Ashton and Fallon Sherrock - the only woman to have won matches in the world championship, in 2019 - are the other female players to have qualified so far, with two more places confirmed after this weekend's Women's Series finale.With seeded players entering the tournament in the first round, rather than the second, Greaves and Sherrock could meet one of the top men.",
        "Greaves is a three-time women's world darts champion",
        "Beau Greaves has confirmed she will play in the PDC World Darts Championship and take her place on the professional tour.",
        "The 21-year-old from Doncaster beat reigning world champion Luke Littler on Monday to reach the world youth championship final.",
        "Greaves had declined to take part in the main worlds at Alexandra Palace since losing on her debut in 2022.",
        "She is a three-time WDF women's world champion, and the rules prevent her playing in both, plus she previously questioned her ability to compete against the top men.",
        "A statement released by Greaves' management company, Opus Sports Management, said: \"After securing her tour card for 2026/2027, we are excited to announce that Beau will be competing in the PDC World Championship 2025/26.",
        "\"After an incredible year on the various PDC circuits, and with next year becoming a huge one , it was the decision that made the most sense for Beau.",
        "\"We cannot wait to see her back on the famous Ally Pally stage.\"",
        "Greaves finished runner-up on the development tour to become only the second woman, after Lisa Ashton, to earn a professional two-year tour card.",
        "Beau Greaves - the 'very special' talent who beat Littler",
        "Greaves stuns Littler a day after Grand Prix win",
        "She has informed the WDF she will not be playing in the women's championship, which starts on 28 November",
        "A WDF statement said: \"Although Beau will no longer be competing on the Lakeside stage, we wish her all the best in the next stage of her darting career.",
        "\"She has been a fantastic ambassador for our system since we returned from the pandemic in 2021, winning every major WDF title on the way.",
        "\"It's been fantastic to see how her game has gone from strength to strength playing in WDF events and we know that she'll continue to make even more history on the PDC circuit.\"",
        "Five women will compete at the PDC World Championship after a new qualifying structure was announced.",
        "This year's event will have an expanded field of 128 players, up from 96 in 2024-25, with the winner taking home £1m of a £5m prize pot.",
        "Women's Matchplay winner Ashton and Fallon Sherrock - the only woman to have won matches in the world championship, in 2019 - are the other female players to have qualified so far, with two more places confirmed after this weekend's Women's Series finale.",
        "With seeded players entering the tournament in the first round, rather than the second, Greaves and Sherrock could meet one of the top men."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/articles/cj0e410zzleo",
      "main_category": "sport",
      "detailed_category": "darts",
      "topic": "Weekly sports quiz: Which nation qualified for their first World Cup?",
      "content": [
        "So much has happened over the past seven days, including World Cup qualifiers, the Super League Grand Final and a headline-grabbing Lionesses squad announcement.About 11% of quizzers got full marks in last week's edition. Will you make the grade this week?",
        "Fancy testing your memory? Play last week's quiz or go to our dedicated football quizzes page and sign up for notifications to get the latest quizzes sent straight to your device.",
        "Let us know your score and thoughts in the comments below - and be wary, it might contain spoilers!",
        "So much has happened over the past seven days, including World Cup qualifiers, the Super League Grand Final and a headline-grabbing Lionesses squad announcement.",
        "About 11% of quizzers got full marks in last week's edition. Will you make the grade this week?",
        "Which nations have qualified for 2026 World Cup?",
        "Guess the Footballers - play the quiz",
        "Can you name the teams from England 2-1 Wales at Euro 2016?",
        "Fancy testing your memory? Play last week's quiz or go to our dedicated football quizzes page and sign up for notifications to get the latest quizzes sent straight to your device.",
        "Let us know your score and thoughts in the comments below - and be wary, it might contain spoilers!"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/darts/articles/cp3x9pg5l06o",
      "main_category": "sport",
      "detailed_category": "darts",
      "topic": "Littler secures spot at Players Championship Finals",
      "content": [
        "Reigning world champion Luke Littler has won the Players Championship 32 event to secure his place at next month's Players Championship Finals.The 18-year-old was in superb form, hitting 10 180s and producing an average of 110.73 as he defeated Dutchman Dennie Olde Kalter 8-2 in the final at Robin Park Leisure Centre in Wigan.\"I'm really happy to come away with a win,\" said Littler, who averaged 102 across his seven matches on Wednesday.\"At the start of the day it was just about getting through the early stages, and you need to believe in yourself.\"On his way to the final, Littler beat Dylan Slevin 6-4, Jeffrey de Graaf 6-4, Adam Lipscombe 6-0, Adam Hunt 6-4 and Rhys Griffin 6-3, before averaging more than 109 in a 7-4 semi-final victory over world number four Stephen Bunting.Olde Kalter, 33, is in his first season on the PDC Tour after winning a spot via Q School and is ranked 140th in the world.He defeated Marvin van Velzen 6-3, Niels Zonneveld 6-1, Dirk van Duijvenbode 6-5, Scott Waites 6-1, Nathan Aspinall 6-4 and Jermaine Wattimena 7-3 to reach his first PDC final.Wattimena had won Players Championship 31 on Tuesday, beating Aspinall in the final.There are 34 Players Championship events across the year, with the competition's finals held in Minehead, Somerset from 21-23 November, featuring the 64 best-performing players.Littler began Wednesday 67th in the Players Championship standings, but has now done enough to reach the finals.\"I know I've got the capabilities to come from behind in matches and that's what I did yet again,\" added the teenager, speaking to the PDC website.\"Trying to qualify for Minehead was at the back of my mind. I had seen some people on social media say I wasn't going to make it, but I'm very happy with the way I played.\"However, three-time world champion Michael van Gerwen, 36, will miss the finals for the first time. He is outside the top 64, withdrew from Wednesday's competition and will not be playing in the final two events in Wigan on 29 and 30 October.",
        "Luke Littler won the World Grand Prix event on Sunday",
        "Reigning world champion Luke Littler has won the Players Championship 32 event to secure his place at next month's Players Championship Finals.",
        "The 18-year-old was in superb form, hitting 10 180s and producing an average of 110.73 as he defeated Dutchman Dennie Olde Kalter 8-2 in the final at Robin Park Leisure Centre in Wigan.",
        "\"I'm really happy to come away with a win,\" said Littler, who averaged 102 across his seven matches on Wednesday.",
        "\"At the start of the day it was just about getting through the early stages, and you need to believe in yourself.\"",
        "On his way to the final, Littler beat Dylan Slevin 6-4, Jeffrey de Graaf 6-4, Adam Lipscombe 6-0, Adam Hunt 6-4 and Rhys Griffin 6-3, before averaging more than 109 in a 7-4 semi-final victory over world number four Stephen Bunting.",
        "Olde Kalter, 33, is in his first season on the PDC Tour after winning a spot via Q School and is ranked 140th in the world.",
        "He defeated Marvin van Velzen 6-3, Niels Zonneveld 6-1, Dirk van Duijvenbode 6-5, Scott Waites 6-1, Nathan Aspinall 6-4 and Jermaine Wattimena 7-3 to reach his first PDC final.",
        "Wattimena had won Players Championship 31 on Tuesday, beating Aspinall in the final.",
        "There are 34 Players Championship events across the year, with the competition's finals held in Minehead, Somerset from 21-23 November, featuring the 64 best-performing players.",
        "Littler began Wednesday 67th in the Players Championship standings, but has now done enough to reach the finals.",
        "\"I know I've got the capabilities to come from behind in matches and that's what I did yet again,\" added the teenager, speaking to the PDC website.",
        "\"Trying to qualify for Minehead was at the back of my mind. I had seen some people on social media say I wasn't going to make it, but I'm very happy with the way I played.\"",
        "However, three-time world champion Michael van Gerwen, 36, will miss the finals for the first time.",
        "He is outside the top 64, withdrew from Wednesday's competition and will not be playing in the final two events in Wigan on 29 and 30 October."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/darts/articles/cpq1zydx8r9o",
      "main_category": "sport",
      "detailed_category": "darts",
      "topic": "'Family my priority' - Van Gerwen out of Finals",
      "content": [
        "Three-time world champion Michael van Gerwen will miss the Players Championship Finals in November after deciding to focus on his family.Van Gerwen announced, external in May that he and his wife, with whom he has two children, were getting divorced.\"Everyone knows what has happened and right now, my focus is solely on my children,\" Van Gerwen told Darts World., external\"The news about myself and their mother affects them enormously, and it's vital we both continue to provide love and attention no matter what.\"This is a decision that was already in place. I know my fans would like to see me in Minehead, but I assure them I will be back very soon.\"The seven-time champion, who was already in danger of failing to qualify for the Finals - he is 92nd in the rankings with the top 64 playing in Minehead - has pulled out of the remaining three counting tournaments.This will be the first time the Dutchman has missed the Finals since making his debut in 2009.",
        "There are 34 Players Championship events across the year, with the competition's finals held in Minehead, Somerset, from 21-23 November.Van Gerwen was beaten by Dom Taylor in the first round of Players Championship 31 on Tuesday. He then pulled out of Wednesday's Players Championship 32 and this weekend's European Tour event in Hildesheim. He was already skipping the final two events - Players Championship 33 and 34 - because of a pre-booked holiday.\"This has been a tough year and I now need to recharge the batteries before the World Championships,\" added Van Gerwen.\"I owe it to myself, my management, sponsors and also the fans to only perform when I'm fully focused and can give 100% to the game I love. \"My family are what matter most and they will always be the priority, regardless of anything else.\"",
        "Van Gerwen won world titles in 2014, 2017 and 2019",
        "Three-time world champion Michael van Gerwen will miss the Players Championship Finals in November after deciding to focus on his family.",
        "Van Gerwen announced, external in May that he and his wife, with whom he has two children, were getting divorced.",
        "\"Everyone knows what has happened and right now, my focus is solely on my children,\" Van Gerwen told Darts World., external",
        "\"The news about myself and their mother affects them enormously, and it's vital we both continue to provide love and attention no matter what.",
        "\"This is a decision that was already in place. I know my fans would like to see me in Minehead, but I assure them I will be back very soon.\"",
        "The seven-time champion, who was already in danger of failing to qualify for the Finals - he is 92nd in the rankings with the top 64 playing in Minehead - has pulled out of the remaining three counting tournaments.",
        "This will be the first time the Dutchman has missed the Finals since making his debut in 2009.",
        "There are 34 Players Championship events across the year, with the competition's finals held in Minehead, Somerset, from 21-23 November.",
        "Van Gerwen was beaten by Dom Taylor in the first round of Players Championship 31 on Tuesday.",
        "He then pulled out of Wednesday's Players Championship 32 and this weekend's European Tour event in Hildesheim. He was already skipping the final two events - Players Championship 33 and 34 - because of a pre-booked holiday.",
        "\"This has been a tough year and I now need to recharge the batteries before the World Championships,\" added Van Gerwen.",
        "\"I owe it to myself, my management, sponsors and also the fans to only perform when I'm fully focused and can give 100% to the game I love.",
        "\"My family are what matter most and they will always be the priority, regardless of anything else.\"",
        "Aspinall hits two nine-darters but Littler exits early",
        "Beau Greaves - the 'very special' talent who beat Littler"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/darts/articles/c4gp5l7vr70o",
      "main_category": "sport",
      "detailed_category": "darts",
      "topic": "Aspinall hits two nine-darters but Littler exits early",
      "content": [
        "Nathan Aspinall threw two nine-dart finishes during the Players Championship 31 only to be blown away in the final - as Luke Littler suffered an early exit.Aspinall, 34, produced perfect darts in a 6-4 victory over Irishman Steve Lennon in the second round, then repeated the feat in a 6-5 win over Germany's Lukas Wenig in the last 16.Englishman Aspinall had taken a 2-0 lead against Jermaine Wattimena of the Netherlands in the final in Wigan.However, Wattimena reeled off eight legs on the bounce to clinically see off Aspinall and seal his second ranking title of the season.Luke Littler, on the back of a semi-final defeat by Beau Greaves in the World Youth Championship on Monday, suffered a first-round exit as he lost 6-4 to fellow Englishman Ritchie Edhouse.The 18-year-old world champion is currently 67th in the Players Championship standings, external and has three events to secure his place in the top 64 to qualify for the finals.Michael van Gerwen is also in danger of not qualifying after he was knocked out at the same stage with a 6-4 loss to Dom Taylor.The Dutchman is 92nd in table and must now make the final in the Players Championship 32 on Wednesday to secure his spot because he is skipping the final two events because of a pre-booked holiday.  There are 34 Players Championship events across the year, with the competition's finals held in Minehead from 21-23 November.",
        "Quarter-finalsStephen Bunting 6-4 Wessel NijmanNathan Aspinall 6-5 James WadeNiels Zonneveld 6-2 Joe HuntJermaine Wattimena 6-1 Chris LandmanSemi-finalsNathan Aspinall 7-3 Stephen BuntingJermaine Wattimena 7-0 Niels ZonneveldFinalJermaine Wattimena 8-2 Nathan Aspinall",
        "Nathan Aspinall is currently ranked 23rd in the world",
        "Nathan Aspinall threw two nine-dart finishes during the Players Championship 31 only to be blown away in the final - as Luke Littler suffered an early exit.",
        "Aspinall, 34, produced perfect darts in a 6-4 victory over Irishman Steve Lennon in the second round, then repeated the feat in a 6-5 win over Germany's Lukas Wenig in the last 16.",
        "Englishman Aspinall had taken a 2-0 lead against Jermaine Wattimena of the Netherlands in the final in Wigan.",
        "However, Wattimena reeled off eight legs on the bounce to clinically see off Aspinall and seal his second ranking title of the season.",
        "Luke Littler, on the back of a semi-final defeat by Beau Greaves in the World Youth Championship on Monday, suffered a first-round exit as he lost 6-4 to fellow Englishman Ritchie Edhouse.",
        "The 18-year-old world champion is currently 67th in the Players Championship standings, external and has three events to secure his place in the top 64 to qualify for the finals.",
        "Michael van Gerwen is also in danger of not qualifying after he was knocked out at the same stage with a 6-4 loss to Dom Taylor.",
        "The Dutchman is 92nd in table and must now make the final in the Players Championship 32 on Wednesday to secure his spot because he is skipping the final two events because of a pre-booked holiday.",
        "There are 34 Players Championship events across the year, with the competition's finals held in Minehead from 21-23 November.",
        "Greaves stuns Littler a day after Grand Prix win",
        "Beau Greaves - the 'very special' talent who beat Littler",
        "How do darts world rankings work?",
        "Stephen Bunting 6-4 Wessel Nijman",
        "Nathan Aspinall 6-5 James Wade",
        "Niels Zonneveld 6-2 Joe Hunt",
        "Jermaine Wattimena 6-1 Chris Landman",
        "Nathan Aspinall 7-3 Stephen Bunting",
        "Jermaine Wattimena 7-0 Niels Zonneveld",
        "Jermaine Wattimena 8-2 Nathan Aspinall"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/darts/articles/cy5qy49d04yo",
      "main_category": "sport",
      "detailed_category": "darts",
      "topic": "Beau Greaves - the 'very special' talent who beat Littler",
      "content": [
        "Not content with having one major young prodigy, darts has hit the bullseye again – as Beau Greaves' win over Luke Littler demonstrates.Greaves may be a new name to some but has been recognised for years within the sport as an outstanding prospect.Appropriately nicknamed 'Beau 'n' Arrow' the 21-year-old from Doncaster beat PDC world champion Littler in a thrilling decider on Monday to become the first woman to reach the final of the World Youth Championship.The venue was a leisure centre in Wigan, but bigger stages await for Greaves, with the Grand Slam, PDC World Championship and a professional tour card on the horizon.Victory over Littler came a day after the 18-year-old had won the World Grand Prix, his seventh major title in under two years.\"It was no surprise to me,\" says Deta Hedman, a three-time women's world championship-runner up who has played darts with Greaves since she was aged 10.\"Once in a while you have a talent that comes through like you had Luke, and Beau is now showing what she can do.\"I've not seen another woman who can play darts like Beau can - she's such a natural. If Beau is in a competition with the rest of the women, normally we are playing for second place.\"Nothing seems to faze her at all and she just does her thing, that's what I love. When she is on that oche, she is just another being.\"It was no fluke, with Littler - who averaged 107.4 to Greaves' 105 – calling her \"some talent\".A talent illustrated by the fact she has won 58 matches in a row and nine successive events in the PDC Women's Series.",
        "The double irony of her win over the teenager is some thought his participation was unfair on other players, and Greaves had previously questioned her ability to compete against the top men in the World Championship at Alexandra Palace.\"Men's and ladies darts should be separate. I don't think any lady will ever go to Ally Pally and win that. If you think that, you're being silly,\" said Greaves last July.\"I just don't think we will ever be good enough to play against the likes of Luke Humphries, Michael van Gerwen or Littler.\"When I go to the Grand Slam I don't look forward to it because I know I have got to play men. I don't fancy my chances at all - I am just realistic.\"That was part of the reason the three-time WDF women's world champion had declined to take part in the PDC's main event  – plus rules prevented her playing in both – since her debut defeat in 2022.But with more experience under her belt, and a runner-up spot on the development tour, she has qualified again and seems likely to appear at Alexandra Palace in December.",
        "Greaves started playing with her older brother Taylor, who had a dartboard in his bedroom, and quickly showed her aptitude for the game.\"When she was 11 she went to Jersey with her mum and I remember her beating top women's player Lisa Ashton and me,\" Hedman told BBC Sport.\"Even then, I knew she was someone very special.\"Hedman was the first woman to beat a man in a televised major when she defeated Aaron Turner in the 2005 UK Open and says Greaves can compete at the highest level.\"I do believe Beau will do some damage. Some men do not like playing women even in this day and age as there's more pressure,\" she said.\"Whether she will ever win one of the big majors remains to be seen. She has the game to beat them.\"And she's such a sweet down-to-earth lady from a lovely family. You couldn't find a nicer young person.\"Within darts there is always going to be back-biting, jealousies but what you see from Beau is what you get and she has time for everyone, whoever you are.\"World number one Humphries has been among those to praise Greaves, who made history in February as the first woman to reach the fourth round of the UK Open where she led him 7-5 before eventually losing 10-7.\"I think she's an amazing player and she deserves it,\" Humphries said during his run to Sunday's World Grand Prix final. \"I predict that she'll flourish playing in it [PDC Pro Tour].\"She's been a really great player on the secondary tours this year. She's good on the challenge tour, good on the development tour and she'll be a real threat going forward for all the players. Not just for me but for everyone.\"I think she'll do really well. If she's relaxed and she's got no pressure on her shoulders yes, I believe she will be top 64 within the two years for sure.\"Greaves will face defending champion Gian van Veen of the Netherlands in the youth final at Minehead in November.The next instalment of Greaves v Littler could potentially come as early as next month too at the Grand Slam in Wolverhampton.And then who knows? She could become the second woman after Fallon Sherrock, in 2019, to win matches in the big one at the Ally Pally.",
        "Beau Greaves is a three-time women's world champion and has won the world matchplay twice",
        "Not content with having one major young prodigy, darts has hit the bullseye again – as Beau Greaves' win over Luke Littler demonstrates.",
        "Greaves may be a new name to some but has been recognised for years within the sport as an outstanding prospect.",
        "Appropriately nicknamed 'Beau 'n' Arrow' the 21-year-old from Doncaster beat PDC world champion Littler in a thrilling decider on Monday to become the first woman to reach the final of the World Youth Championship.",
        "The venue was a leisure centre in Wigan, but bigger stages await for Greaves, with the Grand Slam, PDC World Championship and a professional tour card on the horizon.",
        "Victory over Littler came a day after the 18-year-old had won the World Grand Prix, his seventh major title in under two years.",
        "\"It was no surprise to me,\" says Deta Hedman, a three-time women's world championship-runner up who has played darts with Greaves since she was aged 10.",
        "\"Once in a while you have a talent that comes through like you had Luke, and Beau is now showing what she can do.",
        "\"I've not seen another woman who can play darts like Beau can - she's such a natural. If Beau is in a competition with the rest of the women, normally we are playing for second place.",
        "\"Nothing seems to faze her at all and she just does her thing, that's what I love. When she is on that oche, she is just another being.\"",
        "It was no fluke, with Littler - who averaged 107.4 to Greaves' 105 – calling her \"some talent\".",
        "A talent illustrated by the fact she has won 58 matches in a row and nine successive events in the PDC Women's Series.",
        "This video can not be played",
        "Archive: Meet the 12-year-old darts sensation",
        "Greaves stuns Littler a day after Grand Prix win",
        "Greaves seals world title hat-trick at Lakeside",
        "The double irony of her win over the teenager is some thought his participation was unfair on other players, and Greaves had previously questioned her ability to compete against the top men in the World Championship at Alexandra Palace.",
        "\"Men's and ladies darts should be separate. I don't think any lady will ever go to Ally Pally and win that. If you think that, you're being silly,\" said Greaves last July.",
        "\"I just don't think we will ever be good enough to play against the likes of Luke Humphries, Michael van Gerwen or Littler.",
        "\"When I go to the Grand Slam I don't look forward to it because I know I have got to play men. I don't fancy my chances at all - I am just realistic.\"",
        "That was part of the reason the three-time WDF women's world champion had declined to take part in the PDC's main event  – plus rules prevented her playing in both – since her debut defeat in 2022.",
        "But with more experience under her belt, and a runner-up spot on the development tour, she has qualified again and seems likely to appear at Alexandra Palace in December.",
        "Luke Littler beat Luke Humphries to win the World Grand Prix trophy on Sunday",
        "Greaves started playing with her older brother Taylor, who had a dartboard in his bedroom, and quickly showed her aptitude for the game.",
        "\"When she was 11 she went to Jersey with her mum and I remember her beating top women's player Lisa Ashton and me,\" Hedman told BBC Sport.",
        "\"Even then, I knew she was someone very special.\"",
        "Hedman was the first woman to beat a man in a televised major when she defeated Aaron Turner in the 2005 UK Open and says Greaves can compete at the highest level.",
        "\"I do believe Beau will do some damage. Some men do not like playing women even in this day and age as there's more pressure,\" she said.",
        "\"Whether she will ever win one of the big majors remains to be seen. She has the game to beat them.",
        "\"And she's such a sweet down-to-earth lady from a lovely family. You couldn't find a nicer young person.",
        "\"Within darts there is always going to be back-biting, jealousies but what you see from Beau is what you get and she has time for everyone, whoever you are.\"",
        "World number one Humphries has been among those to praise Greaves, who made history in February as the first woman to reach the fourth round of the UK Open where she led him 7-5 before eventually losing 10-7.",
        "\"I think she's an amazing player and she deserves it,\" Humphries said during his run to Sunday's World Grand Prix final. \"I predict that she'll flourish playing in it [PDC Pro Tour].",
        "\"She's been a really great player on the secondary tours this year. She's good on the challenge tour, good on the development tour and she'll be a real threat going forward for all the players. Not just for me but for everyone.",
        "\"I think she'll do really well. If she's relaxed and she's got no pressure on her shoulders yes, I believe she will be top 64 within the two years for sure.\"",
        "Greaves will face defending champion Gian van Veen of the Netherlands in the youth final at Minehead in November.",
        "The next instalment of Greaves v Littler could potentially come as early as next month too at the Grand Slam in Wolverhampton.",
        "And then who knows? She could become the second woman after Fallon Sherrock, in 2019, to win matches in the big one at the Ally Pally."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/darts/articles/c0jdp9dplg7o",
      "main_category": "sport",
      "detailed_category": "darts",
      "topic": "Greaves stuns Littler a day after Grand Prix win",
      "content": [
        "Beau Greaves emerged victorious from a 6-5 thriller against Luke Littler as she became the first woman to reach the final of the World Youth Championship.Littler came into the tournament in Wigan on the back of his 6-1 demolition of world number one Luke Humphries in the World Grand Prix final on Sunday.The 18-year-old had breezed through his three matches in the round-robin phase of the event, with wins over Dutchman Jeffrey Keen, Iceland's Alexander Thorvaldsson and Belgium's Matthias Moors.However, the world champion nearly exited the tournament at the hands of fellow Englishman Charlie Manby in the last 16.Littler was on the brink of defeat at 5-3 down to the 20-year-old, before fighting back to clinch a gritty victory.Warrington teenager Littler found himself 2-1 down in the semi-final against Greaves and responded by winning three consecutive legs to seize the upper hand.But three-time WDF women's world champion Greaves - who is set to accept a PDC Tour card for 2026-27 - rallied to level the match at 4-4 and 5-5.Greaves then blew Littler away in the decider as she threw an 11-dart leg - the 21-year-old from Doncaster sealing victory with a checkout of 84.She will meet defending champion Gian van Veen in next month's final after the Dutchman, 23, clinched a 6-4 win over Sebastian Bialecki of Poland in the other semi-final.The World Youth Championship final will be played on 23 November in Minehead, before the Players Championship final on the same day.Littler, who averaged 107.4 to Greaves' 105, posted on Instagram after his defeat: \"Fair play to Beau. All the best in Minehead. Some talent.\"Players aged between 16 and 24 are eligible to compete in the World Youth Championship.Littler won the youth title in 2023 aged 16, a few weeks before he burst into the spotlight by finishing runner-up at the 2024 World Championship.",
        "Last 16Luke Littler 6-5 Charlie ManbyJamai van den Herik 6-3 Lok Yin LeeBeau Greaves 6-4 Tyler ThorpeLiam Maendl-Lawrance 6-2 Lewis GurneyGian van Veen 6-5 Aidan O'HaraCam Crabtree 6-5 Nunjo DewaeleKeane Barry 6-3 Adam GawlasSebastian Bialecki 6-5 Roy RietbergenQuarter-finalsLuke Littler 6-1 Jamai van den HerikBeau Greaves 6-2 Liam Maendl-LawranceGian van Veen 6-2 Cam CrabtreeSebastian Bialecki 6-5 Keane BarrySemi-finalsBeau Greaves 6-5 Luke LittlerGian van Veen 6-4 Sebastian Bialecki",
        "Beau Greaves is top of the PDC women's series rankings",
        "Beau Greaves emerged victorious from a 6-5 thriller against Luke Littler as she became the first woman to reach the final of the World Youth Championship.",
        "Littler came into the tournament in Wigan on the back of his 6-1 demolition of world number one Luke Humphries in the World Grand Prix final on Sunday.",
        "The 18-year-old had breezed through his three matches in the round-robin phase of the event, with wins over Dutchman Jeffrey Keen, Iceland's Alexander Thorvaldsson and Belgium's Matthias Moors.",
        "However, the world champion nearly exited the tournament at the hands of fellow Englishman Charlie Manby in the last 16.",
        "Littler was on the brink of defeat at 5-3 down to the 20-year-old, before fighting back to clinch a gritty victory.",
        "Warrington teenager Littler found himself 2-1 down in the semi-final against Greaves and responded by winning three consecutive legs to seize the upper hand.",
        "But three-time WDF women's world champion Greaves - who is set to accept a PDC Tour card for 2026-27 - rallied to level the match at 4-4 and 5-5.",
        "Greaves then blew Littler away in the decider as she threw an 11-dart leg - the 21-year-old from Doncaster sealing victory with a checkout of 84.",
        "She will meet defending champion Gian van Veen in next month's final after the Dutchman, 23, clinched a 6-4 win over Sebastian Bialecki of Poland in the other semi-final.",
        "The World Youth Championship final will be played on 23 November in Minehead, before the Players Championship final on the same day.",
        "Littler, who averaged 107.4 to Greaves' 105, posted on Instagram after his defeat: \"Fair play to Beau. All the best in Minehead. Some talent.\"",
        "Players aged between 16 and 24 are eligible to compete in the World Youth Championship.",
        "Littler won the youth title in 2023 aged 16, a few weeks before he burst into the spotlight by finishing runner-up at the 2024 World Championship.",
        "'A natural, nothing fazes her' - rise of Greaves",
        "Why is Littler playing in World Youth Championship?",
        "Littler demolishes Humphries to win World Grand Prix",
        "Luke Littler 6-5 Charlie Manby",
        "Jamai van den Herik 6-3 Lok Yin Lee",
        "Beau Greaves 6-4 Tyler Thorpe",
        "Liam Maendl-Lawrance 6-2 Lewis Gurney",
        "Gian van Veen 6-5 Aidan O'Hara",
        "Cam Crabtree 6-5 Nunjo Dewaele",
        "Keane Barry 6-3 Adam Gawlas",
        "Sebastian Bialecki 6-5 Roy Rietbergen",
        "Luke Littler 6-1 Jamai van den Herik",
        "Beau Greaves 6-2 Liam Maendl-Lawrance",
        "Gian van Veen 6-2 Cam Crabtree",
        "Sebastian Bialecki 6-5 Keane Barry",
        "Beau Greaves 6-5 Luke Littler",
        "Gian van Veen 6-4 Sebastian Bialecki"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/darts/articles/cpv1ykpe1dwo",
      "main_category": "sport",
      "detailed_category": "darts",
      "topic": "Why did Littler play in World Youth Championship?",
      "content": [
        "Luke Littler competed at the World Youth Championship after winning his first World Grand Prix title on Sunday.He was beaten in the semi-final by Beau Greaves, the first woman to reach the final of the World Youth Championship.Despite playing in senior competitions, 18-year-old Littler could still participate in the youth tournament as it is open to players aged between 16 and 24.The prize money for winning the tournament is £12,000.\"I'll go to the World Youth and just have a bit of fun, see everyone,\" said Littler on Sunday ahead of the tournament.\"I don't think anyone is going to be my friend tomorrow, but it's only 20 minutes up the road, so I'll try my best.\"Defending champion Gian van Veen, from the Netherlands, has also reached the final.Littler won the 2023 edition by beating Van Veen to the title but opted against playing in 2024 after his breakthrough at the senior PDC World Championship, where he finished as runner-up.The event is played in a group-stage format initially, before knockouts are introduced from the last-64 stage.'The Nuke' won all three group games - averaging an impressive 108.59 in a win against Iceland's Alexander-Veigar Thorvaldsson.Greaves will face Van Veen in the final on 23 November in Minehead, played before the Players Championship final on the same day.Therefore Van Veen, could in theory end up playing the World Youth final in between the semi-finals and final of the Players Championship.This article is the latest from BBC Sport's Ask Me Anything team.",
        "Ask Me Anything is a service dedicated to answering your questions.We want to reward your time by telling you things you do not know and reminding you of things you do.The team will find out everything you need to know and be able to call upon a network of contacts including our experts and pundits.We will be answering your questions from the heart of the BBC Sport newsroom, and going behind the scenes at some of the world's biggest sporting events.Our coverage will span the BBC Sport website, app, social media and YouTube accounts, plus BBC TV and radio.",
        "How do darts world rankings work?Why did Luke Littler post a spoof 'retirement' video?How does Premier League Darts affect PDC's Order of Merit?",
        "Luke Littler competed at the World Youth Championship after winning his first World Grand Prix title on Sunday.",
        "He was beaten in the semi-final by Beau Greaves, the first woman to reach the final of the World Youth Championship.",
        "Despite playing in senior competitions, 18-year-old Littler could still participate in the youth tournament as it is open to players aged between 16 and 24.",
        "The prize money for winning the tournament is £12,000.",
        "\"I'll go to the World Youth and just have a bit of fun, see everyone,\" said Littler on Sunday ahead of the tournament.",
        "\"I don't think anyone is going to be my friend tomorrow, but it's only 20 minutes up the road, so I'll try my best.\"",
        "Defending champion Gian van Veen, from the Netherlands, has also reached the final.",
        "Littler won the 2023 edition by beating Van Veen to the title but opted against playing in 2024 after his breakthrough at the senior PDC World Championship, where he finished as runner-up.",
        "The event is played in a group-stage format initially, before knockouts are introduced from the last-64 stage.",
        "'The Nuke' won all three group games - averaging an impressive 108.59 in a win against Iceland's Alexander-Veigar Thorvaldsson.",
        "Greaves will face Van Veen in the final on 23 November in Minehead, played before the Players Championship final on the same day.",
        "Therefore Van Veen, could in theory end up playing the World Youth final in between the semi-finals and final of the Players Championship.",
        "This article is the latest from BBC Sport's Ask Me Anything team.",
        "Send us your questions",
        "Ask Me Anything is a service dedicated to answering your questions.",
        "We want to reward your time by telling you things you do not know and reminding you of things you do.",
        "The team will find out everything you need to know and be able to call upon a network of contacts including our experts and pundits.",
        "We will be answering your questions from the heart of the BBC Sport newsroom, and going behind the scenes at some of the world's biggest sporting events.",
        "Our coverage will span the BBC Sport website, app, social media and YouTube accounts, plus BBC TV and radio.",
        "How do darts world rankings work?",
        "Why did Luke Littler post a spoof 'retirement' video?",
        "How does Premier League Darts affect PDC's Order of Merit?"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/darts/articles/cy7p7l5zpx0o",
      "main_category": "sport",
      "detailed_category": "darts",
      "topic": "Littler demolishes Humphries to win World Grand Prix",
      "content": [
        "Luke Littler said \"this is my time\" after clinically beating Luke Humphries 6-1 to win his first World Grand Prix title and move closer to becoming world number one.World champion Littler, 18, was knocked out in the first round of the 'double-in and double-out' tournament on debut last year, but was more impressive throughout this campaign.His average was lower than Humphries' in the final in Leicester but he was ruthless throughout, winning five of his six sets in final-leg deciders to claim the £120,000 prize money.It gave Littler his seventh PDC major televised title - the joint seventh-most  in history.He has closed the gap between himself and leader Humphries to just over £70,000 at the top of the PDC world rankings, as the two battle to arrive at December's World Championships as world number one.",
        "\"This is my time and I've just got to keep going,\" said Littler at a news conference after his victory.\"Obviously, until I get that world number one spot, I will never call myself the best in the world.\"Whoever's number one, they're the best. But knowing I'm only £70,000 in prize money behind Luke, and then he's got to defend all of his prize money from the Grand Prix, the Players Championships and the World Championship.\"I don't want to think about it too much, but I could be world number one before that World Championship.\"I've just got to keep chucking away and put as much pressure as I can on Luke.\"Humphries told Sky Sports he needs to \"dedicate everything\" to being able to match Littler. \"I have to just get better, practise harder,\" he said. \"If I don't, he will just run away with everything. \"I have to dedicate everything to being a dart player and work even harder than I ever have. I want to match him.\"",
        "2024 World Championship: Humphries 7-4 Littler2024 Premier League: Humphries 7-11 Littler2024 Players Championship: Humphries 11-7 Littler2025 Premier League: Humphries 11-8 Littler2025 Grand Prix: Humphries 1-6 Littler",
        "The first set was shaky with Littler taking 13 darts in the second leg to get in, before the pair exchanged breaks in leg three and four. Littler, who beat four previous winners of the event on his way to winning it, held to claim the early advantage. From there he clicked into gear, with Humphries, who had become just the third person to reach three successive Grand Prix finals, failing to create opportunities to snatch any initiative.Littler took set two with a 64 checkout after a brilliant 177 set-up in leg five and he then got eight darts into a nine-darter in the opening leg of set three, before winning it after Humphries missed four darts at double. Set four was won by Littler in another final-leg decider before Humphries got on the board by sensationally taking out 154 to pick up set five.That could have been the spark for the 2023 winner but Littler was not willing to open the door and won the next two sets to seal the victory.Humphries will walk away wondering exactly what happened. He averaged 93.61 to Littler's 92.15, while the 2024 world champion also hit more 100-plus scores and 180s. Two years ago, Humphries won this event for his first major and Littler did not even have a tour card yet, but, remarkably, the pair have taken 15 of the past 21 major trophies between them.",
        "Littler won the 2023 World Youth Championship but opted against playing in 2024 after his breakthrough at the senior World Championship, where he finished runner-up.\"I'll go to the World Youth tomorrow and just have a bit of fun, see everyone,\" Littler said on Sky Sports. \"I don't think anyone is going to be my friend tomorrow, but it's only 20 minutes up the road, so I'll try my best!\"Littler beat the Netherlands' Gian van Veen to win the 2023 tournament, before the Dutchman beat compatriot Jurjen van der Velde in 2024. He will also be in Wigan looking to defend his crown.The World Youth event is played in a group-stage format initially, before knockouts are introduced from the last-64 stage. The final takes place on 23 November in Minehead, alongside the final day of the Players Championship. Therefore Littler, or Van Veen, could in theory end up playing the World Youth final in between the semi-finals and final.",
        "Luke Littler was playing in his first World Grand Prix final",
        "Luke Littler said \"this is my time\" after clinically beating Luke Humphries 6-1 to win his first World Grand Prix title and move closer to becoming world number one.",
        "World champion Littler, 18, was knocked out in the first round of the 'double-in and double-out' tournament on debut last year, but was more impressive throughout this campaign.",
        "His average was lower than Humphries' in the final in Leicester but he was ruthless throughout, winning five of his six sets in final-leg deciders to claim the £120,000 prize money.",
        "It gave Littler his seventh PDC major televised title - the joint seventh-most  in history.",
        "He has closed the gap between himself and leader Humphries to just over £70,000 at the top of the PDC world rankings, as the two battle to arrive at December's World Championships as world number one.",
        "\"This is my time and I've just got to keep going,\" said Littler at a news conference after his victory.",
        "\"Obviously, until I get that world number one spot, I will never call myself the best in the world.",
        "\"Whoever's number one, they're the best. But knowing I'm only £70,000 in prize money behind Luke, and then he's got to defend all of his prize money from the Grand Prix, the Players Championships and the World Championship.",
        "\"I don't want to think about it too much, but I could be world number one before that World Championship.",
        "\"I've just got to keep chucking away and put as much pressure as I can on Luke.\"",
        "Humphries told Sky Sports he needs to \"dedicate everything\" to being able to match Littler.",
        "\"I have to just get better, practise harder,\" he said. \"If I don't, he will just run away with everything.",
        "\"I have to dedicate everything to being a dart player and work even harder than I ever have. I want to match him.\"",
        "The Rise of Luke Littler",
        "2024 World Championship: Humphries 7-4 Littler",
        "2024 Premier League: Humphries 7-11 Littler",
        "2024 Players Championship: Humphries 11-7 Littler",
        "2025 Premier League: Humphries 11-8 Littler",
        "2025 Grand Prix: Humphries 1-6 Littler",
        "The first set was shaky with Littler taking 13 darts in the second leg to get in, before the pair exchanged breaks in leg three and four.",
        "Littler, who beat four previous winners of the event on his way to winning it, held to claim the early advantage.",
        "From there he clicked into gear, with Humphries, who had become just the third person to reach three successive Grand Prix finals, failing to create opportunities to snatch any initiative.",
        "Littler took set two with a 64 checkout after a brilliant 177 set-up in leg five and he then got eight darts into a nine-darter in the opening leg of set three, before winning it after Humphries missed four darts at double.",
        "Set four was won by Littler in another final-leg decider before Humphries got on the board by sensationally taking out 154 to pick up set five.",
        "That could have been the spark for the 2023 winner but Littler was not willing to open the door and won the next two sets to seal the victory.",
        "Humphries will walk away wondering exactly what happened. He averaged 93.61 to Littler's 92.15, while the 2024 world champion also hit more 100-plus scores and 180s.",
        "Two years ago, Humphries won this event for his first major and Littler did not even have a tour card yet, but, remarkably, the pair have taken 15 of the past 21 major trophies between them.",
        "Why is Littler playing in World Youth Championship?",
        "Littler won the 2023 World Youth Championship but opted against playing in 2024 after his breakthrough at the senior World Championship, where he finished runner-up.",
        "\"I'll go to the World Youth tomorrow and just have a bit of fun, see everyone,\" Littler said on Sky Sports.",
        "\"I don't think anyone is going to be my friend tomorrow, but it's only 20 minutes up the road, so I'll try my best!\"",
        "Littler beat the Netherlands' Gian van Veen to win the 2023 tournament, before the Dutchman beat compatriot Jurjen van der Velde in 2024. He will also be in Wigan looking to defend his crown.",
        "The World Youth event is played in a group-stage format initially, before knockouts are introduced from the last-64 stage.",
        "The final takes place on 23 November in Minehead, alongside the final day of the Players Championship. Therefore Littler, or Van Veen, could in theory end up playing the World Youth final in between the semi-finals and final."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/darts/articles/c749d12ze7wo",
      "main_category": "sport",
      "detailed_category": "darts",
      "topic": "Darts' World Grand Prix: Format, results and prize money",
      "content": [
        "The 2025 Darts World Grand Prix starts on Monday, 6 October and is one of the Professional Darts Corporation's major titles.Unlike the rest of the sport's majors, the tournament uses a 'double in, double out' format.The 32 players featuring are made up of the 16 best-ranked players from the PDC's Order of Merit, and the best 16 from the last 12 months via the Order of Merit who had not already qualified.A total prize fund of £600,000 is up for grabs, with the winner earning £120,000.Mike De Decker was the surprise winner in 2024, having previously not reached the last four or better at a major championship.",
        "Unlike most darts tournaments, the World Grand Prix uses a 'double in, double out' format, presenting a big twist to the gameplay.This means that a player must start all legs on a double, rather than on any scoring zone on the board.The use of 'double in, double out' has been in use in the World Grand Prix since its inaugural year in 1998.",
        "The format is in set play, with each set being the best of five legs.The first round is a best-of-three-sets match, increasing to five sets in the second round.The quarter-finals stay at the best of five sets, before an increase to nine sets in the semi-finals.The final is a best-of-11 match, also described as a race to six sets.",
        "Final (1) Luke Humphries 1-6 Luke Littler (2)Semi-finals(1) Luke Humphries 5-3 Danny Noppert (13)(2) Luke Littler 5-1 Jonny Clayton (6)Quarter-finals(13) Danny Noppert 3-1 Gary Anderson (12)Dirk Van Duijvenbode 0-3 Jonny Clayton (6)(2) Luke Littler 3-2 Gerwyn Price (7)(1) Luke Humphries 3-1 Cameron MenziesSecond roundCameron Menzies 3-1 Rob Cross (9)(4) Stephen Bunting 1-3 Danny Noppert (13)(1) Luke Humphries 3-1 Krzysztof RatajskiJoe Cullen 0-3 Gary Anderson (12)Dirk van Duijvenbode 3-0 Daryl Gurney(6) Jonny Clayton 3-1 Luke Woodhouse (2) Luke Littler 3-0 Mike De Decker(7) Gerwyn Price 3-0 Josh Rock (10)First round (9) Rob Cross 2-1 Wessel Nijman(16) Martin Schindler 0-2 Krzysztof Ratajski(8) Chris Dobey 0-2 Cameron Menzies(5) James Wade 0-2 Joe Cullen(13) Danny Noppert 2-1 Jermaine Wattimena(1) Luke Humphries 2-0 Nathan Aspinall(12) Gary Anderson 2-1 Raymond van Barneveld(4) Stephen Bunting 2-0 Niko Springer(11) Damon Heta 1-2 Luke Woodhouse(14) Ross Smith 0-2 Daryl Gurney(6) Jonny Clayton 2-0 Andrew Gilding(7) Gerwyn Price 2-1 Ryan Searle(2) Luke Littler 2-0 Gian van Veen(3) Michael van Gerwen 0-2 Dirk van Duijvenbode(15) Peter Wright 1-2 Mike De Decker(10) Josh Rock 2-1 Ryan Joyce",
        "Winner - £120,000Runner-up - £60,000Semi-final loser - £40,000Quarter-final loser - £25,000Second round loser - £15,000First round loser - £7,500",
        "Phil Taylor is the most successful player in World Grand Prix history, winning the tournament 11 times.Michael van Gerwen is the next most successful player with six titles, with James Wade (twice) being the only other player to win it multiple times.2024 – Mike De Decker2023 – Luke Humphries2022 – Michael van Gerwen2021 – Jonny Clayton2020 – Gerwyn Price2019 – Michael van Gerwen2018 - Michael van Gerwen2017 - Daryl Gurney2016 - Michael van Gerwen2015 – Robert Thornton2014 - Michael van Gerwen2013 – Phil Taylor2012 - Michael van Gerwen2011 – Phil Taylor2010 – James Wade2009 - Phil Taylor2008 - Phil Taylor2007 – James Wade2006 - Phil Taylor2005 - Phil Taylor2004 – Colin Lloyd2003 - Phil Taylor2002 - Phil Taylor2001 – Alan Warriner2000 – Phil Taylor1999 - Phil Taylor1998 - Phil TaylorThis article is the latest from BBC Sport's Ask Me Anything team.",
        "Ask Me Anything is a service dedicated to answering your questions.We want to reward your time by telling you things you do not know and reminding you of things you do.The team will find out everything you need to know and be able to call upon a network of contacts including our experts and pundits.We will be answering your questions from the heart of the BBC Sport newsroom, and going behind the scenes at some of the world's biggest sporting events.Our coverage will span the BBC Sport website, app, social media and YouTube accounts, plus BBC TV and radio.",
        "Why are Kazakhstan part of Uefa?What is the Ryder Cup envelope rule and how does it work?Can Verstappen still win 2025 F1 title?Do NFL players watch the Super Bowl half-time show?",
        "The 2025 Darts World Grand Prix starts on Monday, 6 October and is one of the Professional Darts Corporation's major titles.",
        "Unlike the rest of the sport's majors, the tournament uses a 'double in, double out' format.",
        "The 32 players featuring are made up of the 16 best-ranked players from the PDC's Order of Merit, and the best 16 from the last 12 months via the Order of Merit who had not already qualified.",
        "A total prize fund of £600,000 is up for grabs, with the winner earning £120,000.",
        "Mike De Decker was the surprise winner in 2024, having previously not reached the last four or better at a major championship.",
        "Send us your questions",
        "Mike De Decker beat Luke Humphries in 2024's World Grand Prix final to win his first major title",
        "Unlike most darts tournaments, the World Grand Prix uses a 'double in, double out' format, presenting a big twist to the gameplay.",
        "This means that a player must start all legs on a double, rather than on any scoring zone on the board.",
        "The use of 'double in, double out' has been in use in the World Grand Prix since its inaugural year in 1998.",
        "The format is in set play, with each set being the best of five legs.",
        "The first round is a best-of-three-sets match, increasing to five sets in the second round.",
        "The quarter-finals stay at the best of five sets, before an increase to nine sets in the semi-finals.",
        "The final is a best-of-11 match, also described as a race to six sets.",
        "(1) Luke Humphries 1-6 Luke Littler (2)",
        "(1) Luke Humphries 5-3 Danny Noppert (13)",
        "(2) Luke Littler 5-1 Jonny Clayton (6)",
        "(13) Danny Noppert 3-1 Gary Anderson (12)",
        "Dirk Van Duijvenbode 0-3 Jonny Clayton (6)",
        "(2) Luke Littler 3-2 Gerwyn Price (7)",
        "(1) Luke Humphries 3-1 Cameron Menzies",
        "Cameron Menzies 3-1 Rob Cross (9)",
        "(4) Stephen Bunting 1-3 Danny Noppert (13)",
        "(1) Luke Humphries 3-1 Krzysztof Ratajski",
        "Joe Cullen 0-3 Gary Anderson (12)",
        "Dirk van Duijvenbode 3-0 Daryl Gurney",
        "(6) Jonny Clayton 3-1 Luke Woodhouse",
        "(2) Luke Littler 3-0 Mike De Decker",
        "(7) Gerwyn Price 3-0 Josh Rock (10)",
        "(9) Rob Cross 2-1 Wessel Nijman",
        "(16) Martin Schindler 0-2 Krzysztof Ratajski",
        "(8) Chris Dobey 0-2 Cameron Menzies",
        "(5) James Wade 0-2 Joe Cullen",
        "(13) Danny Noppert 2-1 Jermaine Wattimena",
        "(1) Luke Humphries 2-0 Nathan Aspinall",
        "(12) Gary Anderson 2-1 Raymond van Barneveld",
        "(4) Stephen Bunting 2-0 Niko Springer",
        "(11) Damon Heta 1-2 Luke Woodhouse",
        "(14) Ross Smith 0-2 Daryl Gurney",
        "(6) Jonny Clayton 2-0 Andrew Gilding",
        "(7) Gerwyn Price 2-1 Ryan Searle",
        "(2) Luke Littler 2-0 Gian van Veen",
        "(3) Michael van Gerwen 0-2 Dirk van Duijvenbode",
        "(15) Peter Wright 1-2 Mike De Decker",
        "(10) Josh Rock 2-1 Ryan Joyce",
        "Luke Littler will be making his second appearance at a World Grand Prix, after losing in last year's first round to Rob Cross",
        "Semi-final loser - £40,000",
        "Quarter-final loser - £25,000",
        "Second round loser - £15,000",
        "First round loser - £7,500",
        "Phil Taylor is the most successful player in World Grand Prix history, winning the tournament 11 times.",
        "Michael van Gerwen is the next most successful player with six titles, with James Wade (twice) being the only other player to win it multiple times.",
        "2024 – Mike De Decker",
        "2023 – Luke Humphries",
        "2022 – Michael van Gerwen",
        "2019 – Michael van Gerwen",
        "2018 - Michael van Gerwen",
        "2016 - Michael van Gerwen",
        "2015 – Robert Thornton",
        "2014 - Michael van Gerwen",
        "2012 - Michael van Gerwen",
        "This article is the latest from BBC Sport's Ask Me Anything team.",
        "Ask Me Anything is a service dedicated to answering your questions.",
        "We want to reward your time by telling you things you do not know and reminding you of things you do.",
        "The team will find out everything you need to know and be able to call upon a network of contacts including our experts and pundits.",
        "We will be answering your questions from the heart of the BBC Sport newsroom, and going behind the scenes at some of the world's biggest sporting events.",
        "Our coverage will span the BBC Sport website, app, social media and YouTube accounts, plus BBC TV and radio.",
        "Why are Kazakhstan part of Uefa?",
        "What is the Ryder Cup envelope rule and how does it work?",
        "Can Verstappen still win 2025 F1 title?",
        "Do NFL players watch the Super Bowl half-time show?"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/darts/articles/cpvlv0rw0vno",
      "main_category": "sport",
      "detailed_category": "darts",
      "topic": "Littler to face Humphries in World Grand Prix final",
      "content": [
        "World champion Luke Littler will face world number one Luke Humphries in the World Grand Prix final on Sunday.The English pair set up their showdown after overcoming Jonny Clayton and Danny Noppert in the last four in Leicester.Littler, 18, reached the final after a comfortable 5-1 win over Clayton in which he hit 10 180s.Humphries survived a fightback from 2022 UK Open champion Noppert to prevail 5-3 and book his spot in a third straight Grand Prix final.A 161 checkout for a break of throw from Littler in the second game of his tie with Clayton set the tone for a devastating performance.Welshman Clayton - who won the tournament in 2021 - took the second set, but a 140 checkout in the fourth set swung momentum back in favour of the teenager.",
        "Littler averaged 97.26 and ended the match with a 13-dart leg to set up a sixth meeting in a final between himself and Humphries.\"I owe him one for the Premier League [final defeat],\" Littler told Sky Sports when asked about facing his 30-year-old rival.\"Last year I lost in the first round but now I am in the final.\"We are ranked one and two [in the world] and hopefully I can get the win [on Sunday] and be on his back for that world number one spot.\"Earlier, Humphries had raced in to a three-set lead over Noppert, but the Dutchman dug in to take three of the next four.A 135 checkout from Humphries to break his opponent's throw at the start of the eighth set put the 2023 champion back on top and a total of 14 maximums helped him over the line.\"I felt tired and it was a struggle,\" he told Sky Sports.\"I know a lot of people think my mentality at times is not great, but I can bounce back from it. I knew I was going to be in a battle and I'm proud of my resilience.\"Follow live coverage of Sunday's final on the BBC Sport website and app from 20:00 BST.",
        "Luke Littler (left) and Luke Humphries (right) are the top two in the PDC rankings",
        "World champion Luke Littler will face world number one Luke Humphries in the World Grand Prix final on Sunday.",
        "The English pair set up their showdown after overcoming Jonny Clayton and Danny Noppert in the last four in Leicester.",
        "Littler, 18, reached the final after a comfortable 5-1 win over Clayton in which he hit 10 180s.",
        "Humphries survived a fightback from 2022 UK Open champion Noppert to prevail 5-3 and book his spot in a third straight Grand Prix final.",
        "A 161 checkout for a break of throw from Littler in the second game of his tie with Clayton set the tone for a devastating performance.",
        "Welshman Clayton - who won the tournament in 2021 - took the second set, but a 140 checkout in the fourth set swung momentum back in favour of the teenager.",
        "Littler averaged 97.26 and ended the match with a 13-dart leg to set up a sixth meeting in a final between himself and Humphries.",
        "\"I owe him one for the Premier League [final defeat],\" Littler told Sky Sports when asked about facing his 30-year-old rival.",
        "\"Last year I lost in the first round but now I am in the final.",
        "\"We are ranked one and two [in the world] and hopefully I can get the win [on Sunday] and be on his back for that world number one spot.\"",
        "Earlier, Humphries had raced in to a three-set lead over Noppert, but the Dutchman dug in to take three of the next four.",
        "A 135 checkout from Humphries to break his opponent's throw at the start of the eighth set put the 2023 champion back on top and a total of 14 maximums helped him over the line.",
        "\"I felt tired and it was a struggle,\" he told Sky Sports.",
        "\"I know a lot of people think my mentality at times is not great, but I can bounce back from it. I knew I was going to be in a battle and I'm proud of my resilience.\"",
        "Follow live coverage of Sunday's final on the BBC Sport website and app from 20:00 BST."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/darts/articles/cvgq2zp61p7o",
      "main_category": "sport",
      "detailed_category": "darts",
      "topic": "'Now or never' - Littler fightback seals semi spot",
      "content": [
        "World champion Luke Littler hit a sensational 152 checkout in the deciding leg of a thrilling World Grand Prix quarter-final against Gerwyn Price to reach the last four in Leicester.That wonderful finish capped the 18-year-old's fightback from two sets down against 2020 World Grand Prix winner Price, who missed three match darts at doubles in the fourth set.Littler had seemed poised for victory in the final set before Price took out an incredible 156 finish to send the match into a sudden-death leg, in which the Welshman had the advantage of throwing first.Both players struggled to find an opening double in the decider and neither scored heavily, until the English teenager's moment of magic finished the match.After Littler found double 16 to complete his memorable win, former world champion Price smiled and applauded from the back of the stage before the pair shared a warm embrace.",
        "Asked how he felt after falling 2-0 behind in sets, Littler told Sky Sports: \"I just said that it's now or never - you have to switch on, find those trebles and not stay on the wire for the entire match.\"I switched up, started going for double 16s and it worked in parts. Double 16 is the one that got me the World Championship and it's always there to be hit.\"Littler will play Wales' Jonny Clayton in his semi-final on Saturday.",
        "Clayton, the 2021 champion, lost the first leg of his quarter-final against Dirk van Duijvenbode but then won nine in succession to take a convincing 3-0 victory.Saturday's other match in the best-of-nine semi-finals will be contested by England's world number one Luke Humphries and Dutchman Danny Noppert.Humphries, who won the title in 2023 and was runner-up last year, was a 3-1 victor against Scotland's Cameron Menzies.World number 13 Noppert beat another Scot, two-time world champion Gary Anderson, by the same score to reach the last four of the World Grand Prix for the second time in his career.",
        "Quarter-final resultsDanny Noppert 3-1 Gary AndersonDirk van Duijvenbode 0-3 Jonny ClaytonLuke Littler 3-2 Gerwyn PriceLuke Humphries 3-1 Cameron Menzies",
        "Semi-finalsSaturday, 11 October (20:00 BST - matches are best of nine sets)Luke Humphries v Danny NoppertLuke Littler v Jonny Clayton",
        "Luke Littler is second in the PDC world rankings behind Luke Humphries",
        "World champion Luke Littler hit a sensational 152 checkout in the deciding leg of a thrilling World Grand Prix quarter-final against Gerwyn Price to reach the last four in Leicester.",
        "That wonderful finish capped the 18-year-old's fightback from two sets down against 2020 World Grand Prix winner Price, who missed three match darts at doubles in the fourth set.",
        "Littler had seemed poised for victory in the final set before Price took out an incredible 156 finish to send the match into a sudden-death leg, in which the Welshman had the advantage of throwing first.",
        "Both players struggled to find an opening double in the decider and neither scored heavily, until the English teenager's moment of magic finished the match.",
        "After Littler found double 16 to complete his memorable win, former world champion Price smiled and applauded from the back of the stage before the pair shared a warm embrace.",
        "Asked how he felt after falling 2-0 behind in sets, Littler told Sky Sports: \"I just said that it's now or never - you have to switch on, find those trebles and not stay on the wire for the entire match.",
        "\"I switched up, started going for double 16s and it worked in parts. Double 16 is the one that got me the World Championship and it's always there to be hit.\"",
        "Littler will play Wales' Jonny Clayton in his semi-final on Saturday.",
        "Gerwyn Price (right) has twice been a World Grand Prix runner-up since winning the title in 2020",
        "Clayton, the 2021 champion, lost the first leg of his quarter-final against Dirk van Duijvenbode but then won nine in succession to take a convincing 3-0 victory.",
        "Saturday's other match in the best-of-nine semi-finals will be contested by England's world number one Luke Humphries and Dutchman Danny Noppert.",
        "Humphries, who won the title in 2023 and was runner-up last year, was a 3-1 victor against Scotland's Cameron Menzies.",
        "World number 13 Noppert beat another Scot, two-time world champion Gary Anderson, by the same score to reach the last four of the World Grand Prix for the second time in his career.",
        "Quarter-final results",
        "Danny Noppert 3-1 Gary Anderson",
        "Dirk van Duijvenbode 0-3 Jonny Clayton",
        "Luke Littler 3-2 Gerwyn Price",
        "Luke Humphries 3-1 Cameron Menzies",
        "Saturday, 11 October (20:00 BST - matches are best of nine sets)",
        "Luke Humphries v Danny Noppert",
        "Luke Littler v Jonny Clayton",
        "Darts' World Grand Prix: Format, results and prize money"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/darts/articles/cvg92q27n42o",
      "main_category": "sport",
      "detailed_category": "darts",
      "topic": "Littler beats De Decker at 'brutal' World Grand Prix",
      "content": [
        "Luke Littler fired a 170 checkout to clinch victory over defending champion Mike de Decker and reach the quarter-finals of the \"brutal\" World Grand Prix. Littler, 18, averaged 98.95 to win the opening set before capitalising on the Belgian's double-start struggles to take a 2-0 lead. And world champion Littler cruised through the third set without dropping a leg - finishing with a flourish by taking out 170 - to wrap up a comfortable win.The Englishman will now face Wales' Gerwyn Price for a place in the semi-finals at the Mattioli Arena.\"I said to myself 'let's leave with a big one',\" Littler told Sky Sports.\"Mike definitely didn't play his best, so I had to jump on it and lead early. \"I am hitting the double 20 and as a player you can feel that nine-darter coming. Hopefully, we can have a go next round.\"This tournament is brutal. We have seen some shocks this year but I had to do my job.\"Price, the 2020 winner and seventh seed, got the better of Josh Rock 3-0 while averaging 92.46 and hitting four 180s. Jonny Clayton, the winner in 2021, overcame Luke Woodhouse 3-1 and will face Dirk van Duijvenbode in the last eight after the Dutchman posted a 3-0 win against Daryl Gurney.",
        "Thursday's World Grand Prix results:Dirk van Duijvenbode 3-0 Daryl GurneyJonny Clayton 3-1 Luke WoodhouseLuke Littler 3-0 Mike de DeckerGerwyn Price 3-0 Josh RockFriday's matches:Danny Noppert v Gary AndersonDirk van Duijvenbode v Jonny ClaytonLuke Humphries v Cameron MenziesLuke Littler v Gerwyn Price",
        "Luke Littler, 18, has already won six major titles",
        "Luke Littler fired a 170 checkout to clinch victory over defending champion Mike de Decker and reach the quarter-finals of the \"brutal\" World Grand Prix.",
        "Littler, 18, averaged 98.95 to win the opening set before capitalising on the Belgian's double-start struggles to take a 2-0 lead.",
        "And world champion Littler cruised through the third set without dropping a leg - finishing with a flourish by taking out 170 - to wrap up a comfortable win.",
        "The Englishman will now face Wales' Gerwyn Price for a place in the semi-finals at the Mattioli Arena.",
        "\"I said to myself 'let's leave with a big one',\" Littler told Sky Sports.",
        "\"Mike definitely didn't play his best, so I had to jump on it and lead early.",
        "\"I am hitting the double 20 and as a player you can feel that nine-darter coming. Hopefully, we can have a go next round.",
        "\"This tournament is brutal. We have seen some shocks this year but I had to do my job.\"",
        "Price, the 2020 winner and seventh seed, got the better of Josh Rock 3-0 while averaging 92.46 and hitting four 180s.",
        "Jonny Clayton, the winner in 2021, overcame Luke Woodhouse 3-1 and will face Dirk van Duijvenbode in the last eight after the Dutchman posted a 3-0 win against Daryl Gurney.",
        "Thursday's World Grand Prix results:",
        "Dirk van Duijvenbode 3-0 Daryl Gurney",
        "Jonny Clayton 3-1 Luke Woodhouse",
        "Luke Littler 3-0 Mike de Decker",
        "Gerwyn Price 3-0 Josh Rock",
        "Danny Noppert v Gary Anderson",
        "Dirk van Duijvenbode v Jonny Clayton",
        "Luke Humphries v Cameron Menzies",
        "Luke Littler v Gerwyn Price",
        "Darts' World Grand Prix: Format, results and prize money"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/darts/articles/c3w5v2ggdg6o",
      "main_category": "sport",
      "detailed_category": "darts",
      "topic": "Humphries & Anderson into World Grand Prix quarters",
      "content": [
        "World number one Luke Humphries moved into the quarter-finals of the World Grand Prix in Leicester with a comfortable 3-1 win over Krzysztof Ratajski.Humphries, 30, was champion in 2023 and runner-up last year, and reached the last eight after a half-time adjustment - hitting six 180s and averaging 95.58 at the 'double in, double out' tournament.He said: \"I went off at the break and said to myself 'you must be doing something different because you don't play like this usually'.\"So I slowed my throw down and I started hitting the trebles. On the practice board I am hitting everything and then I am going out there and not, so I needed to change something.\"Fourth seed Stephen Bunting was dumped out by 2021 semi-finalist Danny Noppert, while two-time world champion Gary Anderson breezed past Joe Cullen.Cullen only averaged 68.05 and won just one leg.Anderson told Sky Sports: \"Joe was miles off tonight, his starting off is what cost him.\"My scoring came on at the end. It's been a while since I went far in this tournament, it's getting harder and harder for me.\"Darts is a joy but I still want to win.\"Reigning champion Mike de Decker is in action on Thursday against Luke Littler.Wednesday's World Grand Prix results:Cameron Menzies 3-1 Rob CrossDanny Noppert 3-1 Stephen BuntingLuke Humphries 3-1 Krzysztof Ratajski Joe Cullen 0-3 Gary AndersonThursday's matches:Dirk van Duijvenbode v Daryl GurneyJonny Clayton v Luke WoodhouseLuke Littler v Mike de DeckerGerwyn Price v Josh Rock",
        "Luke Humphries was runner-up in last year's tournament",
        "World number one Luke Humphries moved into the quarter-finals of the World Grand Prix in Leicester with a comfortable 3-1 win over Krzysztof Ratajski.",
        "Humphries, 30, was champion in 2023 and runner-up last year, and reached the last eight after a half-time adjustment - hitting six 180s and averaging 95.58 at the 'double in, double out' tournament.",
        "He said: \"I went off at the break and said to myself 'you must be doing something different because you don't play like this usually'.",
        "\"So I slowed my throw down and I started hitting the trebles. On the practice board I am hitting everything and then I am going out there and not, so I needed to change something.\"",
        "Fourth seed Stephen Bunting was dumped out by 2021 semi-finalist Danny Noppert, while two-time world champion Gary Anderson breezed past Joe Cullen.",
        "Cullen only averaged 68.05 and won just one leg.",
        "Anderson told Sky Sports: \"Joe was miles off tonight, his starting off is what cost him.",
        "\"My scoring came on at the end. It's been a while since I went far in this tournament, it's getting harder and harder for me.",
        "\"Darts is a joy but I still want to win.\"",
        "Reigning champion Mike de Decker is in action on Thursday against Luke Littler.",
        "Wednesday's World Grand Prix results:",
        "Cameron Menzies 3-1 Rob Cross",
        "Danny Noppert 3-1 Stephen Bunting",
        "Luke Humphries 3-1 Krzysztof Ratajski",
        "Joe Cullen 0-3 Gary Anderson",
        "Dirk van Duijvenbode v Daryl Gurney",
        "Jonny Clayton v Luke Woodhouse",
        "Luke Littler v Mike de Decker",
        "Gerwyn Price v Josh Rock",
        "Darts' World Grand Prix: Format, results and prize money"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/darts/articles/c33rxdn6xkeo",
      "main_category": "sport",
      "detailed_category": "darts",
      "topic": "Littler wins but Van Gerwen out of World Grand Prix",
      "content": [
        "Six-time champion Michael van Gerwen was beaten by a fellow Dutchman in the first round of the World Grand Prix, but Luke Littler came through a high-quality opener.Van Gerwen won a top-level tournament for the first time in two years by beating Littler in the World Series Finals in September, but on Tuesday he produced an error-strewn performance to lose 2-0 against Dirk van Duijvenbode.Although world number three Van Gerwen threw a stunning 171 in the first leg, he otherwise struggled and suffered first-round elimination for the second year running.Littler, however, stormed into the second round in Leicester with an 11-minute straight-set win against another Dutchman, Gian van Veen.Both players averaged over 100 in a superb first set as Littler came from behind to take it 3-2.Despite Van Veen finishing with a 106.47 average - the highest average in tournament history - and Littler 105.58, it was the Briton who won through to continue his quest for a first World Grand Prix title.\"I am very happy. I don't think I could have done a lot better there. I certainly played better than last year,\" Littler told Sky Sports.\"I said I would be fiery in my pre-match interview and I showed a bit of that. Hopefully this is my next major.\"Gerwyn Price defeated Ryan Searle 2-1, before Peter Wright lost to defending champion Mike de Decker by the same scoreline.Tuesday's World Grand Prix results:Dirk van Duijvenbode 2-0 Michael van GerwenLuke Woodhouse 2-1 Damon Heta Daryl Gurney 2-0 Ross SmithJonny Clayton 2-0 Andrew Gilding  Gerwyn Price 2-1 Ryan Searle  Luke Littler 2-0 Gian van Veen  Mike de Decker 2-1 Peter WrightJosh Rock 2-1 Ryan JoyceWednesday's matches:Cameron Menzies v Rob CrossStephen Bunting v Danny NoppertLuke Humphries v Krzysztof RatajskiJoe Cullen v Gary Anderson",
        "Michael van Gerwen is a three-time world champion",
        "Six-time champion Michael van Gerwen was beaten by a fellow Dutchman in the first round of the World Grand Prix, but Luke Littler came through a high-quality opener.",
        "Van Gerwen won a top-level tournament for the first time in two years by beating Littler in the World Series Finals in September, but on Tuesday he produced an error-strewn performance to lose 2-0 against Dirk van Duijvenbode.",
        "Although world number three Van Gerwen threw a stunning 171 in the first leg, he otherwise struggled and suffered first-round elimination for the second year running.",
        "Littler, however, stormed into the second round in Leicester with an 11-minute straight-set win against another Dutchman, Gian van Veen.",
        "Both players averaged over 100 in a superb first set as Littler came from behind to take it 3-2.",
        "Despite Van Veen finishing with a 106.47 average - the highest average in tournament history - and Littler 105.58, it was the Briton who won through to continue his quest for a first World Grand Prix title.",
        "\"I am very happy. I don't think I could have done a lot better there. I certainly played better than last year,\" Littler told Sky Sports.",
        "\"I said I would be fiery in my pre-match interview and I showed a bit of that. Hopefully this is my next major.\"",
        "Gerwyn Price defeated Ryan Searle 2-1, before Peter Wright lost to defending champion Mike de Decker by the same scoreline.",
        "Tuesday's World Grand Prix results:",
        "Dirk van Duijvenbode 2-0 Michael van Gerwen",
        "Luke Woodhouse 2-1 Damon Heta",
        "Daryl Gurney 2-0 Ross Smith",
        "Jonny Clayton 2-0 Andrew Gilding",
        "Gerwyn Price 2-1 Ryan Searle",
        "Luke Littler 2-0 Gian van Veen",
        "Mike de Decker 2-1 Peter Wright",
        "Josh Rock 2-1 Ryan Joyce",
        "Cameron Menzies v Rob Cross",
        "Stephen Bunting v Danny Noppert",
        "Luke Humphries v Krzysztof Ratajski",
        "Joe Cullen v Gary Anderson",
        "Darts' World Grand Prix: Format, results and prize money",
        "Humphries beats Aspinall in World Grand Prix opener",
        "No alcohol allowed - darts heads to Saudi Arabia"
      ]
    }
  ]
}