{
  "scraped_at": "2025-10-27T18:56:59.812546",
  "total_articles": 12,
  "category": "snooker",
  "articles_per_category": 100,
  "articles": [
    {
      "url": "https://www.bbc.com/sport/snooker/articles/cy7enep1y6go",
      "main_category": "sport",
      "detailed_category": "snooker",
      "topic": "'An emotional wreck' - Lisowski ends 15-year wait",
      "content": [
        "\"I've never felt like this or really celebrated like this. It's not really me but everything just came out after 28 years of playing snooker.\"When Jack Lisowski clinched the deciding frame in the final of the Northern Ireland Open, he put his hands to his mouth and the emotion started to come. As he embraced his opponent and best friend, Judd Trump, he couldn't hold back the tears.It was a first ranking title at the seventh time of asking for the 34-year-old, who turned professional in 2010.Tipped by many to be one of the stars of the sport, Lisowski had to bide his time for the success that is long overdue. In the deciding frame to a gripping final in Belfast, it was worth the wait.\"It's surreal. I can't believe it. I'm exhausted and I'm an emotional wreck,\" Lisowski told BBC Sport NI's Jana McCabe.\"I felt like I was going to pass out. It's bizarre, it doesn't feel real and like it's a dream.\"I feel like I'm going to wake up and I'm just floating at the moment.\"",
        "It has been a difficult year for Lisowski in 2025, both on and off the table.The English player has struggled for form, not progressed past the quarter-finals of a tournament and he even failed to qualify for the World Championships in April.But, in the bigger picture, his father passed away in March and, speaking to World Snooker, Lisowski dedicated the win to his parents. \"Judd has been my best friend since I was 14 and he was there with me in a restaurant in Hong Kong eight months ago when I got the message about my dad. \"He has been the best friend I could ask for, the closest thing I could have to a brother. \"When my dad died I said to my friend that he would never see me win a title. But my friend said I could still do it for my mum. This is for him and for my mum.\"",
        "For his part, Trump also felt bittersweet after losing to his friend.The 36-year-old had inflicted three of the previous six final defeats on Lisowski but fell short at the final hurdle on Sunday.\"It's tough to play Jack and I'm happy for him. I think it means a lot more to Jack than it would to me,\" Trump told BBC Sport NI.\"I've been in this situation before and it's not really going to change anything for me. \"But for him it's a massive deal and hopefully now this is the catalyst for him to go on in his career.\"When asked if the win in Belfast would be the first of many titles, Lisowksi, with a smile on his face said: \"I think so. \"Everyone is telling me it's going to be so I hope so.\"After a 15-year wait, Lisowski said clinching a deciding frame is the \"best and worst way\" to win a tournament.\"I want to win all the time and I always believe. But since my dad passed away I feel like it is more serious now. \"Before it was a bit of a game, a bit of fun. Now I feel like I have to win for him. \"I've been digging really deep in practice, I've been practising really hard to try and get my game in good shape, and it was just good enough.\"",
        "The 1435-strong crowd in Belfast - a record for a UK event outside of the Masters - recognised the achievement in front of them and responded accordingly as they shouted and cheered every Lisowski shot in the closing stages of the final frame. They had perhaps descended on the Waterfront Hall with hopes that home favourite Mark Allen would have been in the decider, but sport in Northern Ireland is littered with underdog stories and Lisowski's feat was not lost of them. \"It was incredible, it was better than the Masters at the Ally Pally and that's an amazing venue,\" added Lisowski, who knocked out Mark Selby and Kyren Wilson on his way to the final.\"It's the best crowd ever that I've seen at a snooker game. It makes it quite hard because they are shouting so loud and I'm trying my best. It can be quite off putting and it was quite hard at the end, but they dragged me on today.\"They love an underdog and today that was me, and I feel like they pulled me over the line.\"",
        "After losing his previous six finals, Jack Lisowski claimed the first ranking title of his 15-year professional career",
        "\"I've never felt like this or really celebrated like this. It's not really me but everything just came out after 28 years of playing snooker.\"",
        "When Jack Lisowski clinched the deciding frame in the final of the Northern Ireland Open, he put his hands to his mouth and the emotion started to come.",
        "As he embraced his opponent and best friend, Judd Trump, he couldn't hold back the tears.",
        "It was a first ranking title at the seventh time of asking for the 34-year-old, who turned professional in 2010.",
        "Tipped by many to be one of the stars of the sport, Lisowski had to bide his time for the success that is long overdue.",
        "In the deciding frame to a gripping final in Belfast, it was worth the wait.",
        "\"It's surreal. I can't believe it. I'm exhausted and I'm an emotional wreck,\" Lisowski told BBC Sport NI's Jana McCabe.",
        "\"I felt like I was going to pass out. It's bizarre, it doesn't feel real and like it's a dream.",
        "\"I feel like I'm going to wake up and I'm just floating at the moment.\"",
        "Lisowski beats Trump to win first title at NI Open",
        "It has been a difficult year for Lisowski in 2025, both on and off the table.",
        "The English player has struggled for form, not progressed past the quarter-finals of a tournament and he even failed to qualify for the World Championships in April.",
        "But, in the bigger picture, his father passed away in March and, speaking to World Snooker, Lisowski dedicated the win to his parents.",
        "\"Judd has been my best friend since I was 14 and he was there with me in a restaurant in Hong Kong eight months ago when I got the message about my dad.",
        "\"He has been the best friend I could ask for, the closest thing I could have to a brother.",
        "\"When my dad died I said to my friend that he would never see me win a title. But my friend said I could still do it for my mum. This is for him and for my mum.\"",
        "For his part, Trump also felt bittersweet after losing to his friend.",
        "The 36-year-old had inflicted three of the previous six final defeats on Lisowski but fell short at the final hurdle on Sunday.",
        "\"It's tough to play Jack and I'm happy for him. I think it means a lot more to Jack than it would to me,\" Trump told BBC Sport NI.",
        "\"I've been in this situation before and it's not really going to change anything for me.",
        "\"But for him it's a massive deal and hopefully now this is the catalyst for him to go on in his career.\"",
        "When asked if the win in Belfast would be the first of many titles, Lisowksi, with a smile on his face said: \"I think so.",
        "\"Everyone is telling me it's going to be so I hope so.\"",
        "After a 15-year wait, Lisowski said clinching a deciding frame is the \"best and worst way\" to win a tournament.",
        "\"I want to win all the time and I always believe. But since my dad passed away I feel like it is more serious now.",
        "\"Before it was a bit of a game, a bit of fun. Now I feel like I have to win for him.",
        "\"I've been digging really deep in practice, I've been practising really hard to try and get my game in good shape, and it was just good enough.\"",
        "Judd Trump and Jack Lisowski have been friends since their days playing junior snooker",
        "The 1435-strong crowd in Belfast - a record for a UK event outside of the Masters - recognised the achievement in front of them and responded accordingly as they shouted and cheered every Lisowski shot in the closing stages of the final frame.",
        "They had perhaps descended on the Waterfront Hall with hopes that home favourite Mark Allen would have been in the decider, but sport in Northern Ireland is littered with underdog stories and Lisowski's feat was not lost of them.",
        "\"It was incredible, it was better than the Masters at the Ally Pally and that's an amazing venue,\" added Lisowski, who knocked out Mark Selby and Kyren Wilson on his way to the final.",
        "\"It's the best crowd ever that I've seen at a snooker game. It makes it quite hard because they are shouting so loud and I'm trying my best. It can be quite off putting and it was quite hard at the end, but they dragged me on today.",
        "\"They love an underdog and today that was me, and I feel like they pulled me over the line.\""
      ]
    },
    {
      "url": "https://www.bbc.com/sport/snooker/articles/c4gp8rxly5jo",
      "main_category": "sport",
      "detailed_category": "snooker",
      "topic": "Lisowski beats Trump to win first title at NI Open",
      "content": [
        "Jack Lisowski claimed his first-ever ranking event title by overcoming world number one Judd Trump 9-8 in the Northern Ireland Open final.The final was the 34-year-old's seventh ranking event decider and means that Trump's wait for his first title since December 2024 continues.Lisowski now not only secures the Alex Higgins Trophy for the first time, but also the £100,000 winner's prize money.It was an exciting and tense final with the 29th in the world winning the final frame 73-7 to seal the trophy.",
        "During a nervy opening in Belfast, Lisowski won the first frame on his sixth attempt with Trump responding with a break of 97 in the second before also winning the third.After Lisowski won the fourth and Trump restored his one frame lead once again in the fifth, a century from Lisowski tied the match.The 34-year-old was in a good position to move 4-3 clear, but called a foul on himself with Trump taking advantage and going ahead.Lisowski then won the final frame before the interval to set up an exciting second session. It continued to be a tight match after the break with Trump winning the opening frame, helped by a run of 82, and Lisowski levelling once again in the 10th.The two friends continued to exchange frames until the 17th when, after both had chances to win, the Gloucestershire native won the frame to secure his first ranking event title.",
        "Lisowski defeated defending champion Kyren Wilson on his route to the final",
        "Jack Lisowski claimed his first-ever ranking event title by overcoming world number one Judd Trump 9-8 in the Northern Ireland Open final.",
        "The final was the 34-year-old's seventh ranking event decider and means that Trump's wait for his first title since December 2024 continues.",
        "Lisowski now not only secures the Alex Higgins Trophy for the first time, but also the £100,000 winner's prize money.",
        "It was an exciting and tense final with the 29th in the world winning the final frame 73-7 to seal the trophy.",
        "During a nervy opening in Belfast, Lisowski won the first frame on his sixth attempt with Trump responding with a break of 97 in the second before also winning the third.",
        "After Lisowski won the fourth and Trump restored his one frame lead once again in the fifth, a century from Lisowski tied the match.",
        "The 34-year-old was in a good position to move 4-3 clear, but called a foul on himself with Trump taking advantage and going ahead.",
        "Lisowski then won the final frame before the interval to set up an exciting second session.",
        "It continued to be a tight match after the break with Trump winning the opening frame, helped by a run of 82, and Lisowski levelling once again in the 10th.",
        "The two friends continued to exchange frames until the 17th when, after both had chances to win, the Gloucestershire native won the frame to secure his first ranking event title."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/snooker/articles/cqx3e2en3ejo",
      "main_category": "sport",
      "detailed_category": "snooker",
      "topic": "Trump beats Allen to set up Lisowski NI Open final",
      "content": [
        "Judd Trump beat Mark Allen 6-3 to stay on track for a fifth Northern Ireland Open title and set up a final against fellow Englishman and close friend Jack Lisowski on Sunday.Trump had yet to reach the semi-final stage of a ranking event this season before making the last four in Belfast but is now on target for a first tournament success since winning the UK Championship last December.The world number one stole the opening frame of the night after needing snookers and although Allen won the next to level, a break of 73 helped Trump move ahead.The Northern Ireland player took the next with the help of a run of 68 and went 3-2 in front after the mid-session interval when he compiled a 135 break.Trump fought back to take the next four frames to secure victory and reach a 50th career ranking final, with his best break of the night being an 82 in frame seven.Allen's defeat denied him a shot at a third NI Open title, the Antrim player having previously lifted the trophy in 2021 and 2022.\"It was a tough game but Mark never makes it easy nowadays,\" said Trump after defeating the world number eight.\"It was difficult to get into a rhythm at the start and I missed a few easy balls but when it went to 3-3 I found a bit of form and got some momentum.\"I played a more attacking style and the balls seemed to run a bit nicer for me.\"",
        "Earlier in the day, Jack Lisowski scored three centuries as he comprehensively defeated Zhou Yuelong 6-1 at the Waterfront Hall to book his place in the decider.Lisowski took the first frame and added the next two with a 125 clearance and break of 124.He moved 4-0 in front before the interval and although his Chinese opponent pulled one back, another run of 125 restored the 34-year-old's four-frame advantage before he wrapped up a comfortable win in the seventh frame.The world-ranked 29 player is chasing a first ranking event success, having been beaten six times in finals.He will be taking part in a ranking event decider for the first time since March 2021, when he lost to Trump in the Gibraltar Open final.Lisowski's progress to the final has also included wins over four-time world champion Mark Selby in the last 32, Thailand's Thepchaiya Un-Nooh in the last 16 and Kyren Wilson at the quarter-final stage.\"It's been a great week so far but now it's all about the final,\" said Lisowski.\"I feel like I can pot any shot, I'm more surprised when I miss.\"I've been putting the work in and practicing hard so it's nice when you work hard and it pays dividends. I'm full of confidence.\"Sunday's final will be played over the best-of-17 with a first prize of £100,000 and the Alex Higgins Trophy awaiting the winner.",
        "Judd Trump and Jack Lisowski will contest the Northern Ireland Open final",
        "Judd Trump beat Mark Allen 6-3 to stay on track for a fifth Northern Ireland Open title and set up a final against fellow Englishman and close friend Jack Lisowski on Sunday.",
        "Trump had yet to reach the semi-final stage of a ranking event this season before making the last four in Belfast but is now on target for a first tournament success since winning the UK Championship last December.",
        "The world number one stole the opening frame of the night after needing snookers and although Allen won the next to level, a break of 73 helped Trump move ahead.",
        "The Northern Ireland player took the next with the help of a run of 68 and went 3-2 in front after the mid-session interval when he compiled a 135 break.",
        "Trump fought back to take the next four frames to secure victory and reach a 50th career ranking final, with his best break of the night being an 82 in frame seven.",
        "Allen's defeat denied him a shot at a third NI Open title, the Antrim player having previously lifted the trophy in 2021 and 2022.",
        "\"It was a tough game but Mark never makes it easy nowadays,\" said Trump after defeating the world number eight.",
        "\"It was difficult to get into a rhythm at the start and I missed a few easy balls but when it went to 3-3 I found a bit of form and got some momentum.",
        "\"I played a more attacking style and the balls seemed to run a bit nicer for me.\"",
        "Earlier in the day, Jack Lisowski scored three centuries as he comprehensively defeated Zhou Yuelong 6-1 at the Waterfront Hall to book his place in the decider.",
        "Lisowski took the first frame and added the next two with a 125 clearance and break of 124.",
        "He moved 4-0 in front before the interval and although his Chinese opponent pulled one back, another run of 125 restored the 34-year-old's four-frame advantage before he wrapped up a comfortable win in the seventh frame.",
        "The world-ranked 29 player is chasing a first ranking event success, having been beaten six times in finals.",
        "He will be taking part in a ranking event decider for the first time since March 2021, when he lost to Trump in the Gibraltar Open final.",
        "Lisowski's progress to the final has also included wins over four-time world champion Mark Selby in the last 32, Thailand's Thepchaiya Un-Nooh in the last 16 and Kyren Wilson at the quarter-final stage.",
        "\"It's been a great week so far but now it's all about the final,\" said Lisowski.",
        "\"I feel like I can pot any shot, I'm more surprised when I miss.",
        "\"I've been putting the work in and practicing hard so it's nice when you work hard and it pays dividends. I'm full of confidence.\"",
        "Sunday's final will be played over the best-of-17 with a first prize of £100,000 and the Alex Higgins Trophy awaiting the winner."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/snooker/articles/c0qpgdegq37o",
      "main_category": "sport",
      "detailed_category": "snooker",
      "topic": "Allen defeats Brown in Antrim derby at NI Open",
      "content": [
        "Mark Allen overcame fellow Antrim man Jordan Brown 5-2 in the quarter-final of the Northern Ireland Open at Belfast's Waterfront Hall.The world number eight was asked questions in the match, but found the answers to advance into a semi-final against England's Judd Trump on Saturday (19:00 BST).Allen began well with a break of 101 taking the first frame, but Brown responded in fine style with a break of 131 in the second levelling the match.The third turned into a tactical battle on the colours, but Allen saw the frame out and stretched his lead in the fourth.Brown again hit back, this time with a break of 120 to pull a frame back, but Allen produced the goods in the following frames to advance.\"I was relieved to get over the line. It was not a lot of fun playing Jordan,\" Allen told TNT Sports. \"It may have been a great occasion for the neutral as we had a lot of support, but it was a strange atmosphere because they want us both to do well. I don't get much enjoyment out of beating Jordan because I always support him otherwise.\"He played a lot of good stuff, made two good centuries, he just missed one or two balls at key moments. If it had gone 4-3 he would have been confident. \"This is where he belongs. I have practised with him for 25 years and I know what he is capable of. I said to him at the end that he has had three good wins this week and he needs to take the positives forward because he is a class act.\"Trump was also a 5-2 winner in his quarter-final, defeating John Higgins for a 13th straight time in a ranking event.The world number one was behind after the first frame, but won the next two with breaks of 93 and 82 before Higgins drew level.However, Trump took over from there with a pair of 72 breaks and closed out his win with 121 to reach his first semi-final of the season.",
        "Saturday's first semi-final will see England's Jack Lisowski face Zhou Yuelong (13:00 BST) as both came through their quarter-finals on Friday.Lisowski was a 5-3 winner over defending champion Kyren Wilson, making breaks of 63 and 68 to take a two-frame lead into the interval.Wilson pulled one back before Lisowski responded with 104 to leave him one frame away and although Wilson again replied, a 76 helped him to the fifth frame he required for victory.Yuelong fought back from the brink against Tom Ford to secure his place in the last four with a 5-4 win.Ford won the opening two frames with a break of 90 in the first before Yuelong hit back to level.It seemed Ford was well placed when claiming the next two to move within one of victory, but Yuelong rallied to level once again and in the decider, he fought back from 53 down with a break of 76 to take the win.",
        "Allen will face Judd Trump in Saturday's semi-final",
        "Mark Allen overcame fellow Antrim man Jordan Brown 5-2 in the quarter-final of the Northern Ireland Open at Belfast's Waterfront Hall.",
        "The world number eight was asked questions in the match, but found the answers to advance into a semi-final against England's Judd Trump on Saturday (19:00 BST).",
        "Allen began well with a break of 101 taking the first frame, but Brown responded in fine style with a break of 131 in the second levelling the match.",
        "The third turned into a tactical battle on the colours, but Allen saw the frame out and stretched his lead in the fourth.",
        "Brown again hit back, this time with a break of 120 to pull a frame back, but Allen produced the goods in the following frames to advance.",
        "\"I was relieved to get over the line. It was not a lot of fun playing Jordan,\" Allen told TNT Sports.",
        "\"It may have been a great occasion for the neutral as we had a lot of support, but it was a strange atmosphere because they want us both to do well. I don't get much enjoyment out of beating Jordan because I always support him otherwise.",
        "\"He played a lot of good stuff, made two good centuries, he just missed one or two balls at key moments. If it had gone 4-3 he would have been confident.",
        "\"This is where he belongs. I have practised with him for 25 years and I know what he is capable of. I said to him at the end that he has had three good wins this week and he needs to take the positives forward because he is a class act.\"",
        "Trump was also a 5-2 winner in his quarter-final, defeating John Higgins for a 13th straight time in a ranking event.",
        "The world number one was behind after the first frame, but won the next two with breaks of 93 and 82 before Higgins drew level.",
        "However, Trump took over from there with a pair of 72 breaks and closed out his win with 121 to reach his first semi-final of the season.",
        "Saturday's first semi-final will see England's Jack Lisowski face Zhou Yuelong (13:00 BST) as both came through their quarter-finals on Friday.",
        "Lisowski was a 5-3 winner over defending champion Kyren Wilson, making breaks of 63 and 68 to take a two-frame lead into the interval.",
        "Wilson pulled one back before Lisowski responded with 104 to leave him one frame away and although Wilson again replied, a 76 helped him to the fifth frame he required for victory.",
        "Yuelong fought back from the brink against Tom Ford to secure his place in the last four with a 5-4 win.",
        "Ford won the opening two frames with a break of 90 in the first before Yuelong hit back to level.",
        "It seemed Ford was well placed when claiming the next two to move within one of victory, but Yuelong rallied to level once again and in the decider, he fought back from 53 down with a break of 76 to take the win."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/snooker/articles/cr43nwxer7lo",
      "main_category": "sport",
      "detailed_category": "snooker",
      "topic": "Brown to face Allen at NI Open after Murphy win",
      "content": [
        "Mark Allen will face fellow home favourite Jordan Brown in the quarter-finals of the Northern Ireland Open after a 4-1 win over Aaron Hill in Thursday's third round in Belfast.Allen punished a mistake from Republic of Ireland player Hill in the first frame at the Waterfront Hall, before knocking in a break of 137.Hill, a three-time ranking event quarter-finalist, responded with breaks of 24 and 65 to level in the second frame, before Allen won the next three frames to ease into the last eight.The world number eight will come up against fellow Antrim man Brown, who defeated the in-form Shaun Murphy 4-2 in their last-16 encounter, in the next round. Brown raced into a three-frame lead but Murphy fought back with two frames in a row, which included a break of 135.However, the home favourite came out on top in a tense sixth frame to book his place in the last eight.Elsewhere, Judd Trump and Tom Ford booked their spots in the quarter-finals with victories over Gary Wilson and Yuan Sijun.World number one Trump, who is seeking his fifth Northern Ireland Open title, secured a 4-1 win over Wilson while Ford beat Yuan 4-2.In the evening session, defending champion Kyren Wilson beat He Guoqiang 4-2 and Jack Lisowski beat Thepchaiya Uh-Noo 4-2. Ali Carter withdrew from the event for personal reasons and Yuelong Zhou progressed to the next round.",
        "Judd Trump 4-1 Gary WilsonYuan Sijun 2-4 Tom FordSi Jiahui 1-4 John HigginsMark Allen 4-1 Aaron HillShaun Murphy 2-4 Jordan BrownKyren Wilson 4-2 He GuoqiangThepchaiya 2-4 Jack LisowskiYuelong Zhou received a bye after Ali Carter withdrew from the tournament",
        "Judd Trump v John HigginsKyren Wilson v Jack LisowskiMark Allen v Jordan BrownTom Ford v Yuelong Zhou",
        "Mark Allen's English Open success last month was his 12th triumph in a ranking event",
        "Mark Allen will face fellow home favourite Jordan Brown in the quarter-finals of the Northern Ireland Open after a 4-1 win over Aaron Hill in Thursday's third round in Belfast.",
        "Allen punished a mistake from Republic of Ireland player Hill in the first frame at the Waterfront Hall, before knocking in a break of 137.",
        "Hill, a three-time ranking event quarter-finalist, responded with breaks of 24 and 65 to level in the second frame, before Allen won the next three frames to ease into the last eight.",
        "The world number eight will come up against fellow Antrim man Brown, who defeated the in-form Shaun Murphy 4-2 in their last-16 encounter, in the next round.",
        "Brown raced into a three-frame lead but Murphy fought back with two frames in a row, which included a break of 135.",
        "However, the home favourite came out on top in a tense sixth frame to book his place in the last eight.",
        "Elsewhere, Judd Trump and Tom Ford booked their spots in the quarter-finals with victories over Gary Wilson and Yuan Sijun.",
        "World number one Trump, who is seeking his fifth Northern Ireland Open title, secured a 4-1 win over Wilson while Ford beat Yuan 4-2.",
        "In the evening session, defending champion Kyren Wilson beat He Guoqiang 4-2 and Jack Lisowski beat Thepchaiya Uh-Noo 4-2.",
        "Ali Carter withdrew from the event for personal reasons and Yuelong Zhou progressed to the next round.",
        "Judd Trump 4-1 Gary Wilson",
        "Yuan Sijun 2-4 Tom Ford",
        "Si Jiahui 1-4 John Higgins",
        "Mark Allen 4-1 Aaron Hill",
        "Shaun Murphy 2-4 Jordan Brown",
        "Kyren Wilson 4-2 He Guoqiang",
        "Thepchaiya 2-4 Jack Lisowski",
        "Yuelong Zhou received a bye after Ali Carter withdrew from the tournament",
        "Judd Trump v John Higgins",
        "Kyren Wilson v Jack Lisowski",
        "Mark Allen v Jordan Brown",
        "Tom Ford v Yuelong Zhou"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/snooker/articles/c5ypx81dy7jo",
      "main_category": "sport",
      "detailed_category": "snooker",
      "topic": "'Pathetic, just not good enough' - Selby exits NI Open",
      "content": [
        "Mark Selby says he was struggling to feel comfortable at the table as he exited the Northern Ireland Open with a 4-2 second-round defeat by fellow Englishman Jack Lisowski.The four-time world champion has reached the semi-finals of the Shanghai Masters, English Open and British Open this season.But Selby has yet to hit the heights of previous campaigns which have seen him accumulate 24 ranking titles and win other invitational tournaments, including the Masters three times.The 42-year-old was unable to capitalise on several scoring opportunities in Wednesday's loss to Lisowski at the Waterfront Hall in Belfast, which denied him the chance of adding the NI Open to previous success in the English, Scottish and Welsh Opens.\"Pathetic, just not good enough. Apart from the last frame I could have won every single frame,\" he told BBC Sport NI afterwards.",
        "\"I mean, I don't feel great out there at the moment - I'm working hard on the practice table but just lacking a bit of confidence I suppose.\"Results-wise it's been OK, but feeling-wise on the table the way I've been playing I've not really been feeling comfortable in what I'm doing. Sometimes you go through patches like that, you just have to ride the waves and come out the other side.\"You just keep going and hopefully it'll turn around.\"The world number 10's last tournament victory came in the Welsh Open in February, a success which saw him join Neil Robertson and Mark Allen in having won three of the four Home Nations events since their inception in 2016.\"I love the venue,\" added Selby, whose best performance in Belfast was a semi-final appearance in 2018.\"It's one of the best venues we play in so it's just unfortunate I never seem to do well here. Some of the venues we've played at, they've not been great, which obviously affects the conditions, but they were OK out there today, just a little bouncy off the cushions.\"",
        "The Northern Ireland Open is sandwiched between two Chinese tournaments on the schedule, the Xi'an Grand Prix and the International Championship - a scenario which Selby thinks should be avoided.\"It's quite poor really,\" he said. \"We went to China just before this and if you get to the final you you only have one or two days before you fly out to China again.\"You've got to put your health first because it does take its toll. Travelling is tiring.\"When you go to tournaments you want to go there fresh and give yourself the best chance. Sometimes you can't always do that with the schedule.\"The opening months of the 2025-26 season have yielded different winners of each of the six ranking tournaments and a huge variety of different finalists, plus a remarkable 13 maximum 147 breaks, including two each for Ronnie O'Sullivan, Thailand's Thepchaiya Un-Nooh and Aaron Hill of Ireland.A record 15 maximum breaks were achieved throughout the whole of last season, while the previous two seasons saw 13 compiled and the total did not reach double digits before that.Selby put the increase down to the depth of talent on the professional circuit these days.\"I just think the standard is so tough nowadays,\" he added. \"There are no easy games any more.\"I don't think it's much better at the top but further down the ladder the standard is very, very tough.\"Having so many different winners just shows where the tour is at.\"",
        "Mark Selby was aiming to complete a full set of Home Nations titles with an NI Open victory",
        "Mark Selby says he was struggling to feel comfortable at the table as he exited the Northern Ireland Open with a 4-2 second-round defeat by fellow Englishman Jack Lisowski.",
        "The four-time world champion has reached the semi-finals of the Shanghai Masters, English Open and British Open this season.",
        "But Selby has yet to hit the heights of previous campaigns which have seen him accumulate 24 ranking titles and win other invitational tournaments, including the Masters three times.",
        "The 42-year-old was unable to capitalise on several scoring opportunities in Wednesday's loss to Lisowski at the Waterfront Hall in Belfast, which denied him the chance of adding the NI Open to previous success in the English, Scottish and Welsh Opens.",
        "\"Pathetic, just not good enough. Apart from the last frame I could have won every single frame,\" he told BBC Sport NI afterwards.",
        "\"I mean, I don't feel great out there at the moment - I'm working hard on the practice table but just lacking a bit of confidence I suppose.",
        "\"Results-wise it's been OK, but feeling-wise on the table the way I've been playing I've not really been feeling comfortable in what I'm doing. Sometimes you go through patches like that, you just have to ride the waves and come out the other side.",
        "\"You just keep going and hopefully it'll turn around.\"",
        "The world number 10's last tournament victory came in the Welsh Open in February, a success which saw him join Neil Robertson and Mark Allen in having won three of the four Home Nations events since their inception in 2016.",
        "\"I love the venue,\" added Selby, whose best performance in Belfast was a semi-final appearance in 2018.",
        "\"It's one of the best venues we play in so it's just unfortunate I never seem to do well here. Some of the venues we've played at, they've not been great, which obviously affects the conditions, but they were OK out there today, just a little bouncy off the cushions.\"",
        "Allen & Brown progress to last 16 in Belfast",
        "Trump and Wilson win at Northern Ireland Open",
        "Allen survives scare to beat Milkins in NI Open",
        "The Northern Ireland Open is sandwiched between two Chinese tournaments on the schedule, the Xi'an Grand Prix and the International Championship - a scenario which Selby thinks should be avoided.",
        "\"It's quite poor really,\" he said. \"We went to China just before this and if you get to the final you you only have one or two days before you fly out to China again.",
        "\"You've got to put your health first because it does take its toll. Travelling is tiring.",
        "\"When you go to tournaments you want to go there fresh and give yourself the best chance. Sometimes you can't always do that with the schedule.\"",
        "The opening months of the 2025-26 season have yielded different winners of each of the six ranking tournaments and a huge variety of different finalists, plus a remarkable 13 maximum 147 breaks, including two each for Ronnie O'Sullivan, Thailand's Thepchaiya Un-Nooh and Aaron Hill of Ireland.",
        "A record 15 maximum breaks were achieved throughout the whole of last season, while the previous two seasons saw 13 compiled and the total did not reach double digits before that.",
        "Selby put the increase down to the depth of talent on the professional circuit these days.",
        "\"I just think the standard is so tough nowadays,\" he added. \"There are no easy games any more.",
        "\"I don't think it's much better at the top but further down the ladder the standard is very, very tough.",
        "\"Having so many different winners just shows where the tour is at.\""
      ]
    },
    {
      "url": "https://www.bbc.com/sport/snooker/articles/cn97vpx12wgo",
      "main_category": "sport",
      "detailed_category": "snooker",
      "topic": "Allen & Brown progress to last 16 in Belfast",
      "content": [
        "Home favourite Mark Allen edged out Ben Woollaston 4-3 in a tense second-round match on Wednesday to progress at the Northern Ireland Open.In a scrappy start to the encounter at the Waterfront Hall in Belfast, Allen won the first frame but Woollaston fought back to make it 2-1, before the Antrim player bounced back with breaks of 100 and 135 to lead 3-2.An 80 clearance saw the English player draw level, but the world number eight prevailed in a nervy decider to secure victory and a meeting with Aaron Hill from the Republic of Ireland in round three.Hill is a three-time ranking event quarter-finalist and has compiled maximum 147 breaks at both the English Open and Xi'an Grand Prix in recent weeks.\"Aaron is a great kid and he's had a really good start to the season. He is starting to show what I have seen for a number of years,\" Allen told BBC Sport NI. \"His confidence is high and I'm sure he'll be wanting to put me in my place in Belfast.\"It's up to me to me to go out there and stop him.  I think he is destined for big things in the game, so I need to go out there and play well.\"If it's not this week for Aaron, I still think he will do really big things soon.\"",
        "Another Northern Ireland player, Jordan Brown, followed up his opening-round 4-0 win over world champion Zhao Xintong by beating Ashley Hugill by the same scoreline.The 2021 Welsh Open champion, who has struggled for form in recent years, faces in-form Shaun Murphy in the next round. \"It's just nice to feel that I'm playing somewhere near the way I can, show people what I can do. I'm feeling comfortable out there,\" said Brown.\"I've needed to reflect on those memories of winning the Welsh Open as I've been struggling with confidence.\"Reflecting on those good times reminds me that I'm a good player and what I'm capable of.\"If Allen and Brown prevail in their respective quarter-finals they will face off in an all-Northern Ireland quarter-final match. Defending champion Kyren Wilson will face China's He Guoqiang in the last 16 after a 4-1 win over Ryan Day in the final match on Wednesday.",
        "Earlier in the day, this season's British Open winner and Xi'an Grand Prix finalist Murphy progressed to round three with a 4-2 win over Elliot Slessor.\"While there were no big centuries I was pleased that when I did get my chance I was able to take it,\" said Murphy.\"I'm chasing some of my own personal goals, working hard between matches and between tournaments. There's plenty left in the tank so as long as I'm in the tournament I'll keep punching.\"It's a long time since I played in a one-table set-up here, it's not been a happy hunting ground for me for nearly two decades but it's not been for the want of trying.\"I can't wait to try to go further in the tournament. It's one of my favourites, I love it here in Belfast, the people, the crowd, the venue.\"World number 15 Gary Wilson booked a last-16 meeting with world number one and four-time NI Open winner Judd Trump by beating Martin O'Donnell 4-2 and China's Si Jiahui whitewashed Stephen Maguire 4-0.Trump is aiming for a first title since winning the UK Championship last December and a first semi-final appearance in a ranking event this season.Jack Lisowski, ranked 29, upset four-time world champion Mark SeIby 4-2 and will play Thepchaiya Un-Nooh next, after the Thailand cueist defeated Mark Davis 4-1.He Guoqiang was a 4-2 victor over fellow Chinese player Wu Yize, with defending champion Kyren Wilson or Ryan Day his next opponent.Zhou Yuelong emerged a 4-2 winner over David Grace to secure his berth in round three.",
        "Mark Allen's English Open success was his 12th triumph in a ranking event",
        "Home favourite Mark Allen edged out Ben Woollaston 4-3 in a tense second-round match on Wednesday to progress at the Northern Ireland Open.",
        "In a scrappy start to the encounter at the Waterfront Hall in Belfast, Allen won the first frame but Woollaston fought back to make it 2-1, before the Antrim player bounced back with breaks of 100 and 135 to lead 3-2.",
        "An 80 clearance saw the English player draw level, but the world number eight prevailed in a nervy decider to secure victory and a meeting with Aaron Hill from the Republic of Ireland in round three.",
        "Hill is a three-time ranking event quarter-finalist and has compiled maximum 147 breaks at both the English Open and Xi'an Grand Prix in recent weeks.",
        "\"Aaron is a great kid and he's had a really good start to the season. He is starting to show what I have seen for a number of years,\" Allen told BBC Sport NI.",
        "\"His confidence is high and I'm sure he'll be wanting to put me in my place in Belfast.",
        "\"It's up to me to me to go out there and stop him.  I think he is destined for big things in the game, so I need to go out there and play well.",
        "\"If it's not this week for Aaron, I still think he will do really big things soon.\"",
        "'Pathetic, just not good enough' - Selby exits NI Open",
        "Trump and Wilson win at Northern Ireland Open",
        "Allen survives scare to beat Milkins in NI Open",
        "Another Northern Ireland player, Jordan Brown, followed up his opening-round 4-0 win over world champion Zhao Xintong by beating Ashley Hugill by the same scoreline.",
        "The 2021 Welsh Open champion, who has struggled for form in recent years, faces in-form Shaun Murphy in the next round.",
        "\"It's just nice to feel that I'm playing somewhere near the way I can, show people what I can do. I'm feeling comfortable out there,\" said Brown.",
        "\"I've needed to reflect on those memories of winning the Welsh Open as I've been struggling with confidence.",
        "\"Reflecting on those good times reminds me that I'm a good player and what I'm capable of.\"",
        "If Allen and Brown prevail in their respective quarter-finals they will face off in an all-Northern Ireland quarter-final match.",
        "Defending champion Kyren Wilson will face China's He Guoqiang in the last 16 after a 4-1 win over Ryan Day in the final match on Wednesday.",
        "Earlier in the day, this season's British Open winner and Xi'an Grand Prix finalist Murphy progressed to round three with a 4-2 win over Elliot Slessor.",
        "\"While there were no big centuries I was pleased that when I did get my chance I was able to take it,\" said Murphy.",
        "\"I'm chasing some of my own personal goals, working hard between matches and between tournaments. There's plenty left in the tank so as long as I'm in the tournament I'll keep punching.",
        "\"It's a long time since I played in a one-table set-up here, it's not been a happy hunting ground for me for nearly two decades but it's not been for the want of trying.",
        "\"I can't wait to try to go further in the tournament. It's one of my favourites, I love it here in Belfast, the people, the crowd, the venue.\"",
        "World number 15 Gary Wilson booked a last-16 meeting with world number one and four-time NI Open winner Judd Trump by beating Martin O'Donnell 4-2 and China's Si Jiahui whitewashed Stephen Maguire 4-0.",
        "Trump is aiming for a first title since winning the UK Championship last December and a first semi-final appearance in a ranking event this season.",
        "Jack Lisowski, ranked 29, upset four-time world champion Mark SeIby 4-2 and will play Thepchaiya Un-Nooh next, after the Thailand cueist defeated Mark Davis 4-1.",
        "He Guoqiang was a 4-2 victor over fellow Chinese player Wu Yize, with defending champion Kyren Wilson or Ryan Day his next opponent.",
        "Zhou Yuelong emerged a 4-2 winner over David Grace to secure his berth in round three."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/snooker/articles/cjw9245j65no",
      "main_category": "sport",
      "detailed_category": "snooker",
      "topic": "Trump and Wilson win at Northern Ireland Open",
      "content": [
        "Judd Trump and reigning champion Kyren Wilson were among the winners at the Northern Ireland Open on Tuesday.Trump battled past Jackson Page from Wales 4-2 at the Waterfront Hall to reach the third round.The four-time NI Open champion will face the winner of Gary Wilson and Martin O'Donnell, who meet on Wednesday, for a place in the quarter-finals.Ireland's Aaron Hill held off a Barry Hawkins comeback to win 4-3 with a superb break of 92 in the deciding frame, while Scotland's four-time world champion John Higgins won a late-night nail-biter by the same margin against China's Pang Junxu.Earlier on Tuesday, Kyren Wilson, who defeated Trump in last year's final, booked his spot in the second round by edging through 4-3 against fellow Englishman Oliver Lines.Despite making a break of 133 in the third frame, Wilson found himself 3-2 down against Lines but the 2024 world champion won the final two frames to progress.\"A very difficult first round game for me as Oliver has been in good form. The standard is so high nowadays,\" said Wilson after his victory.\"He made it difficult for me but I'm proud of the way I dug in from 3-2 down. I won a good frame to go three all and then a good decider, but at one point it could have run away from me.\"I think it's a fantastic venue. The crowds turn out in their numbers throughout the day.\"In the other first-round matches on Tuesday in Belfast, Stephen Maguire defeated 2023 world champion Luca Brecel 4-1, while there were also victories for Ali Carter, Mark Davis, Si Jiahui and Ryan Day.Tom Ford progressed with a 4-1 win over Chris Wakelin, while Yuan Sijun defeated fellow Chinese player Long Zehuang 4-2.Home favourites Mark Allen and Jordan Brown are in second-round action on Wednesday.Two-time winner Allen faces Ben Woollaston, while Brown, who stunned world champion Zhao Xintong in the opening round, faces Ashley Hugill. Both matches start at 19:00 BST.",
        "First roundStephen Maguire 4-1 Luca BrecelZhang Anda 1-4 Mark DavisKyren Wilson 4-3 Oliver LinesSi Jiahui 4-0 Cheung Ka WaiMatthew Selt 2-4 Ryan DayAli Carter 4-3 Stan MoodySecond round Chris Wakelin 1-4 Tom FordJudd Trump 4-2 Jackson PageLong Zehuang  2-4 Yuan Sijun Barry Hawkins 3-4 Aaron HillPang Junxu 3-4 John Higgins",
        "Judd Trump is a four-time winner of the Northern Ireland Open",
        "Judd Trump and reigning champion Kyren Wilson were among the winners at the Northern Ireland Open on Tuesday.",
        "Trump battled past Jackson Page from Wales 4-2 at the Waterfront Hall to reach the third round.",
        "The four-time NI Open champion will face the winner of Gary Wilson and Martin O'Donnell, who meet on Wednesday, for a place in the quarter-finals.",
        "Ireland's Aaron Hill held off a Barry Hawkins comeback to win 4-3 with a superb break of 92 in the deciding frame, while Scotland's four-time world champion John Higgins won a late-night nail-biter by the same margin against China's Pang Junxu.",
        "Earlier on Tuesday, Kyren Wilson, who defeated Trump in last year's final, booked his spot in the second round by edging through 4-3 against fellow Englishman Oliver Lines.",
        "Despite making a break of 133 in the third frame, Wilson found himself 3-2 down against Lines but the 2024 world champion won the final two frames to progress.",
        "\"A very difficult first round game for me as Oliver has been in good form. The standard is so high nowadays,\" said Wilson after his victory.",
        "\"He made it difficult for me but I'm proud of the way I dug in from 3-2 down. I won a good frame to go three all and then a good decider, but at one point it could have run away from me.",
        "\"I think it's a fantastic venue. The crowds turn out in their numbers throughout the day.\"",
        "In the other first-round matches on Tuesday in Belfast, Stephen Maguire defeated 2023 world champion Luca Brecel 4-1, while there were also victories for Ali Carter, Mark Davis, Si Jiahui and Ryan Day.",
        "Tom Ford progressed with a 4-1 win over Chris Wakelin, while Yuan Sijun defeated fellow Chinese player Long Zehuang 4-2.",
        "Home favourites Mark Allen and Jordan Brown are in second-round action on Wednesday.",
        "Two-time winner Allen faces Ben Woollaston, while Brown, who stunned world champion Zhao Xintong in the opening round, faces Ashley Hugill. Both matches start at 19:00 BST.",
        "Stephen Maguire 4-1 Luca Brecel",
        "Zhang Anda 1-4 Mark Davis",
        "Kyren Wilson 4-3 Oliver Lines",
        "Si Jiahui 4-0 Cheung Ka Wai",
        "Matthew Selt 2-4 Ryan Day",
        "Ali Carter 4-3 Stan Moody",
        "Chris Wakelin 1-4 Tom Ford",
        "Judd Trump 4-2 Jackson Page",
        "Long Zehuang  2-4 Yuan Sijun",
        "Barry Hawkins 3-4 Aaron Hill",
        "Pang Junxu 3-4 John Higgins"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/snooker/articles/cq6zgz3mpp2o",
      "main_category": "sport",
      "detailed_category": "snooker",
      "topic": "Players have 'long' list of possible changes - Murphy",
      "content": [
        "Shaun Murphy says professional snooker players have \"a list as long as your arm\" of potential changes they would like to see after the establishment of a new body to represent their interests.The formation of the independent Professional Snooker Players' Association (PSPA) was announced in August, with the stated intention of giving players \"a stronger voice\" to \"champion the sport\".Four-time world champion John Higgins is the PSPA's chairman, with a number of leading players - including world number one Judd Trump, Kyren Wilson, Murphy, Mark Allen and Mark Selby - on the players' board.The association claims the governance of snooker \"should factor in more of the views of the players\".It vowed to foster a \"collaborative relationship\" with the sport's authorities, including the World Professional Billiards and Snooker Association (WPBSA), the existing WPBSA Players' Board, and World Snooker Tour (WST) \"to enhance the sport's future, while safeguarding player welfare and commercial interests\".The WPBSA's own players' body was formed in 2020, and the governing body says it has \"a specific mandate to act in the collective best interest of members in relation to welfare and issues affecting the professional game\".Former world champion Murphy resigned from his role as WPBSA Players chairman in February to focus more on his playing career and other interests off the table.The 43-year-old now believes the PSPA represents the best way forward for players to have input into decisions affecting the sport.\"The new body has a long way to go but one of the big things it has... is that it's totally independent,\" Murphy told BBC Sport after beating David Lilley 4-0 in the first round of the Northern Ireland Open at the Waterfront Hall in Belfast.\"The way the game is funded - and the way the WPBSA earns its money and the way that funnels into WPBSA Players - it can never be truly independent of the people it's trying to negotiate with and make the game better for the players.\"Murphy previously served on the main WPBSA Board - the governing body which works in tandem with the commercial WST - from 2017-19 and was elected to the WPBSA Players Board in December 2023, becoming chairman in May 2024. He also joined the WPBSA Board in February 2024 as a non-executive player director.",
        "Murphy believes transparency is important in the relationship between governance and players.\"I think if you ask the players in [the PSPA] they've got a list as long as your arm of things to see changed, done better, done differently, looked at, considered, but the WST guard their secrets very closely and there's often a lack of information as to why certain decisions are taken.\"I think once the players have that information they'll understand why certain things are done the way they are - like the calendar of events.\"There are very good reasons for those things and the fact that [the PSPA] is independent allows it to ask questions that staff members of WPBSA don't want to ask.\"The reigning Masters champion believes there is a high degree of solidarity among players about the potential impact of the PSPA.\"In my time as a professional snooker player there has been high political drama in snooker, it hasn't been without its problems, but at the minute I think the players are very close to [being] united, probably as close as ever in terms of seeing what this new association is about.\"I think they are positive that something is being done.\"John Higgins is leading it and if it's serious enough for John to throw his hat in the ring then I think everyone should take it seriously.\"A statement released by WST in response said: \"We have been ready to speak to the PSPA since we first heard about it at the start of August and our door remains open, be that for the PSPA or for any individual player.\"",
        "Murphy is part of an elite group of players who have won all three of snooker's 'Triple Crown' events - the World Championship, the Masters and the UK Championship.Among the changes he would like to see is a return to a points-based system to determine ranking, as opposed to the current standings which are based on prize money accumulated in ranking events.Murphy won the recent British Open and finished runner-up in the Xi'an Grand Prix to rise to ninth in the world rankings and third on the one-year list, which reflects more recent form.Neil Robertson enjoys a substantial lead in the one-year list after picking up a cheque of £500,000 for winning the Saudi Arabia Masters in August.\"I don't think the Saudi Masters is five times more difficult to win than the British Open, but it is worth five times the amount of points and prize money. It's a skewed system in my opinion,\" Murphy said.\"I think it would be good to have a money list for whatever the WST want to use it for - but in terms of the rankings I think we need to return to a points-based system where you can have that equality a little bit more.\"",
        "Shaun Murphy won the recent British Open and was a losing finalist at the Xi'an Grand Prix",
        "Shaun Murphy says professional snooker players have \"a list as long as your arm\" of potential changes they would like to see after the establishment of a new body to represent their interests.",
        "The formation of the independent Professional Snooker Players' Association (PSPA) was announced in August, with the stated intention of giving players \"a stronger voice\" to \"champion the sport\".",
        "Four-time world champion John Higgins is the PSPA's chairman, with a number of leading players - including world number one Judd Trump, Kyren Wilson, Murphy, Mark Allen and Mark Selby - on the players' board.",
        "The association claims the governance of snooker \"should factor in more of the views of the players\".",
        "It vowed to foster a \"collaborative relationship\" with the sport's authorities, including the World Professional Billiards and Snooker Association (WPBSA), the existing WPBSA Players' Board, and World Snooker Tour (WST) \"to enhance the sport's future, while safeguarding player welfare and commercial interests\".",
        "The WPBSA's own players' body was formed in 2020, and the governing body says it has \"a specific mandate to act in the collective best interest of members in relation to welfare and issues affecting the professional game\".",
        "Former world champion Murphy resigned from his role as WPBSA Players chairman in February to focus more on his playing career and other interests off the table.",
        "The 43-year-old now believes the PSPA represents the best way forward for players to have input into decisions affecting the sport.",
        "\"The new body has a long way to go but one of the big things it has... is that it's totally independent,\" Murphy told BBC Sport after beating David Lilley 4-0 in the first round of the Northern Ireland Open at the Waterfront Hall in Belfast.",
        "\"The way the game is funded - and the way the WPBSA earns its money and the way that funnels into WPBSA Players - it can never be truly independent of the people it's trying to negotiate with and make the game better for the players.\"",
        "Murphy previously served on the main WPBSA Board - the governing body which works in tandem with the commercial WST - from 2017-19 and was elected to the WPBSA Players Board in December 2023, becoming chairman in May 2024.",
        "He also joined the WPBSA Board in February 2024 as a non-executive player director.",
        "New association gives players 'stronger voice' - Higgins",
        "Brown stuns world champion Zhao at NI Open",
        "Northern Ireland Open 2025 - all you need to know",
        "Murphy believes transparency is important in the relationship between governance and players.",
        "\"I think if you ask the players in [the PSPA] they've got a list as long as your arm of things to see changed, done better, done differently, looked at, considered, but the WST guard their secrets very closely and there's often a lack of information as to why certain decisions are taken.",
        "\"I think once the players have that information they'll understand why certain things are done the way they are - like the calendar of events.",
        "\"There are very good reasons for those things and the fact that [the PSPA] is independent allows it to ask questions that staff members of WPBSA don't want to ask.\"",
        "The reigning Masters champion believes there is a high degree of solidarity among players about the potential impact of the PSPA.",
        "\"In my time as a professional snooker player there has been high political drama in snooker, it hasn't been without its problems, but at the minute I think the players are very close to [being] united, probably as close as ever in terms of seeing what this new association is about.",
        "\"I think they are positive that something is being done.",
        "\"John Higgins is leading it and if it's serious enough for John to throw his hat in the ring then I think everyone should take it seriously.\"",
        "A statement released by WST in response said: \"We have been ready to speak to the PSPA since we first heard about it at the start of August and our door remains open, be that for the PSPA or for any individual player.\"",
        "Neil Robertson won £500,000 for winning the Saudi Arabia Masters in August",
        "Murphy is part of an elite group of players who have won all three of snooker's 'Triple Crown' events - the World Championship, the Masters and the UK Championship.",
        "Among the changes he would like to see is a return to a points-based system to determine ranking, as opposed to the current standings which are based on prize money accumulated in ranking events.",
        "Murphy won the recent British Open and finished runner-up in the Xi'an Grand Prix to rise to ninth in the world rankings and third on the one-year list, which reflects more recent form.",
        "Neil Robertson enjoys a substantial lead in the one-year list after picking up a cheque of £500,000 for winning the Saudi Arabia Masters in August.",
        "\"I don't think the Saudi Masters is five times more difficult to win than the British Open, but it is worth five times the amount of points and prize money. It's a skewed system in my opinion,\" Murphy said.",
        "\"I think it would be good to have a money list for whatever the WST want to use it for - but in terms of the rankings I think we need to return to a points-based system where you can have that equality a little bit more.\""
      ]
    },
    {
      "url": "https://www.bbc.com/sport/snooker/articles/cwynvny0v5yo",
      "main_category": "sport",
      "detailed_category": "snooker",
      "topic": "Wilson buoyed by 'fantastic' news on wife's health",
      "content": [
        "Kyren Wilson says he believes positive news regarding the health of his wife Sophie can help him recapture his best form as he prepares to defend his Northern Ireland Open title in Belfast next week.The world number two's wife has been battling a health issue in recent months and had surgery as a result of the illness.Test results received this week have put the family \"on a brighter path now\", according to the 2024 world champion, who has two young sons.\"We're about seven weeks in, my wife has had some surgery recently and we've been waiting on some results which thankfully have come back all good this week,\" said Wilson.\"It's been quite tough to be honest, there's been a lot of strain on the family.\"My wife has had a tough time of it but we've had some fantastic news which is certainly going to free up the mind for not just me, but all of us.\"After winning the World Championship for the first time in May 2024, the 33-year-old won four ranking titles in the 2024-25 season to take his career tally to 10.He won the Xi'an Grand Prix, NI Open, German Masters and Players Championship and also reached the final of The Masters and the semi-final stage of the UK Championship, before suffering a disappointing first-round exit as he defended his world crown at the Crucible Theatre in Sheffield.Wilson started this season promisingly by winning the Shanghai Masters in August but has since suffered a downturn in form during the period of his wife's illness.He reached the quarter-finals of the Saudi Arabia Masters but lost in the first round of the Wuhan Open, English Open and British Open, then was whitewashed 5-0 by Shaun Murphy in the last eight of the Xi'an Grand Prix without potting a ball.\"It's going to make travelling and playing snooker a lot easier again,\" said Wilson of his wife's encouraging health news.\"I've tried my best. I've kept going to tournaments when I would probably have been warranted to stay at home.\"But that's the ambassador I want to be for the sport and that's how much I want to succeed and do well in the sport, to make those sacrifices.\"",
        "The NI Open is sandwiched between the Xi'an Grand Prix and another tournament in China, the International Championship, and the Kettering player says he finds the travelling and time spent away from family difficult. \"From a personal point of view for someone trying to bring up a young family it's very difficult. It's something I've struggled with mentally and emotionally for some time now.\"But in the end, the overwhelming desire to want to be a champion, wanting to win and climb the rankings, always takes over for me. I want to be as successful as possible.\"The travelling part is the hardest part but once we're there and once we're at the venues in different countries and cities and you see all the fans, it kind of gets rid of all of that. But it does take it out of you.\"This week, Mark Williams became the oldest player ever to win a ranking event, aged 50 years and 206 days, and Wilson believes the continued success of the Welshman, as well as other long-established champions such as Ronnie O'Sullivan, John Higgins, Neil Robertson and Mark Selby remains good for the game.\"I think it's fantastic. It certainly gives the rest of us hope that we can play for potentially as long as you want to keep going for.\"You can take inspiration from the likes of Mark, who is still winning tournaments and still very competitive.\"I think Mark is a different animal to a lot of players with that relaxed type of attitude but when you get him on the table he's kind of so crafty, so streetwise. He's almost like a warrior on the table.\"So no surprise from me that he's gone on to win again. I think after all those years of experience, he's always going to be a handful for anyone and I take my hat off to him.\"Wilson will begin the defence of his Northern Ireland Open title against Oliver Lines at the tournament which runs from 19-26 October.",
        "Kyren Wilson pictured with his family after winning the 2024 Northern Ireland Open final",
        "Kyren Wilson says he believes positive news regarding the health of his wife Sophie can help him recapture his best form as he prepares to defend his Northern Ireland Open title in Belfast next week.",
        "The world number two's wife has been battling a health issue in recent months and had surgery as a result of the illness.",
        "Test results received this week have put the family \"on a brighter path now\", according to the 2024 world champion, who has two young sons.",
        "\"We're about seven weeks in, my wife has had some surgery recently and we've been waiting on some results which thankfully have come back all good this week,\" said Wilson.",
        "\"It's been quite tough to be honest, there's been a lot of strain on the family.",
        "\"My wife has had a tough time of it but we've had some fantastic news which is certainly going to free up the mind for not just me, but all of us.\"",
        "After winning the World Championship for the first time in May 2024, the 33-year-old won four ranking titles in the 2024-25 season to take his career tally to 10.",
        "He won the Xi'an Grand Prix, NI Open, German Masters and Players Championship and also reached the final of The Masters and the semi-final stage of the UK Championship, before suffering a disappointing first-round exit as he defended his world crown at the Crucible Theatre in Sheffield.",
        "Wilson started this season promisingly by winning the Shanghai Masters in August but has since suffered a downturn in form during the period of his wife's illness.",
        "He reached the quarter-finals of the Saudi Arabia Masters but lost in the first round of the Wuhan Open, English Open and British Open, then was whitewashed 5-0 by Shaun Murphy in the last eight of the Xi'an Grand Prix without potting a ball.",
        "\"It's going to make travelling and playing snooker a lot easier again,\" said Wilson of his wife's encouraging health news.",
        "\"I've tried my best. I've kept going to tournaments when I would probably have been warranted to stay at home.",
        "\"But that's the ambassador I want to be for the sport and that's how much I want to succeed and do well in the sport, to make those sacrifices.\"",
        "Kyren Wilson won the early-season Shanghai Masters to get his 2025-26 campaign off to a positive start",
        "The NI Open is sandwiched between the Xi'an Grand Prix and another tournament in China, the International Championship, and the Kettering player says he finds the travelling and time spent away from family difficult.",
        "\"From a personal point of view for someone trying to bring up a young family it's very difficult. It's something I've struggled with mentally and emotionally for some time now.",
        "\"But in the end, the overwhelming desire to want to be a champion, wanting to win and climb the rankings, always takes over for me. I want to be as successful as possible.",
        "\"The travelling part is the hardest part but once we're there and once we're at the venues in different countries and cities and you see all the fans, it kind of gets rid of all of that. But it does take it out of you.\"",
        "This week, Mark Williams became the oldest player ever to win a ranking event, aged 50 years and 206 days, and Wilson believes the continued success of the Welshman, as well as other long-established champions such as Ronnie O'Sullivan, John Higgins, Neil Robertson and Mark Selby remains good for the game.",
        "\"I think it's fantastic. It certainly gives the rest of us hope that we can play for potentially as long as you want to keep going for.",
        "\"You can take inspiration from the likes of Mark, who is still winning tournaments and still very competitive.",
        "\"I think Mark is a different animal to a lot of players with that relaxed type of attitude but when you get him on the table he's kind of so crafty, so streetwise. He's almost like a warrior on the table.",
        "\"So no surprise from me that he's gone on to win again. I think after all those years of experience, he's always going to be a handful for anyone and I take my hat off to him.\"",
        "Wilson will begin the defence of his Northern Ireland Open title against Oliver Lines at the tournament which runs from 19-26 October."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/snooker/articles/cze65163222o",
      "main_category": "sport",
      "detailed_category": "snooker",
      "topic": "Williams, 50, becomes oldest ranking event winner",
      "content": [
        "Mark Williams beat Shaun Murphy 10-3 in the Xi'an Grand Prix final to become the oldest winner of a ranking event.Aged 50 years and 206 days, three-time world champion Williams eclipsed the record previously held by fellow Welshman Ray Reardon, who was 50 years and 14 days old when he won the Professional Players Tournament in 1982.The left-hander's 27th ranking title puts him one behind fifth-placed Steve Davis (28) in the all-time list, with Ronnie O'Sullivan leading the way on 41 ranking event wins.Williams is also the first player to win a tour event in his teens, 20s, 30s, 40s and 50s.",
        "Reigning Masters champion Murphy, 43, was aiming for back-to-back ranking tournament victories after winning last month's British Open in Cheltenham.The Englishman continued his excellent form in China to reach another final, but was punished for any errors he made during an opening session which his opponent dominated with ruthless efficiency.Williams seized control by winning the first four frames, pinching the third and fourth frames with contributions of 56 and 68 respectively after Murphy had held significant leads in both.A superb 127 break in frame eight, to go with his six earlier half-centuries, ensured Williams went into the concluding session 7-1 ahead.He compiled a 122 break in the ninth frame to extend his advantage further and although Murphy won two frames in a row to reduce his deficit to 8-3, Williams took the next two either side of the mid-session interval to create snooker history.",
        "Mark Williams turned 50 in March and reached the World Championship final a few weeks later, losing 18-12 to China's Zhao Xintong in May",
        "Mark Williams beat Shaun Murphy 10-3 in the Xi'an Grand Prix final to become the oldest winner of a ranking event.",
        "Aged 50 years and 206 days, three-time world champion Williams eclipsed the record previously held by fellow Welshman Ray Reardon, who was 50 years and 14 days old when he won the Professional Players Tournament in 1982.",
        "The left-hander's 27th ranking title puts him one behind fifth-placed Steve Davis (28) in the all-time list, with Ronnie O'Sullivan leading the way on 41 ranking event wins.",
        "Williams is also the first player to win a tour event in his teens, 20s, 30s, 40s and 50s.",
        "Williams seals spot as all-time Welsh sporting great",
        "Reigning Masters champion Murphy, 43, was aiming for back-to-back ranking tournament victories after winning last month's British Open in Cheltenham.",
        "The Englishman continued his excellent form in China to reach another final, but was punished for any errors he made during an opening session which his opponent dominated with ruthless efficiency.",
        "Williams seized control by winning the first four frames, pinching the third and fourth frames with contributions of 56 and 68 respectively after Murphy had held significant leads in both.",
        "A superb 127 break in frame eight, to go with his six earlier half-centuries, ensured Williams went into the concluding session 7-1 ahead.",
        "He compiled a 122 break in the ninth frame to extend his advantage further and although Murphy won two frames in a row to reduce his deficit to 8-3, Williams took the next two either side of the mid-session interval to create snooker history."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/snooker/articles/cly16wz7zlgo",
      "main_category": "sport",
      "detailed_category": "snooker",
      "topic": "Keeping up with the Woollastons - snooker's family affair",
      "content": [
        "Ben Woollaston shot into the snooker spotlight with his surprising first-round win against Mark Selby at the World Championship.It was a match between friends and practice partners from Leicester, and one that Selby said before the draw he hoped to avoid.While Selby coughed up what he described as a \"pathetic\" performance to lose 10-8, Woollaston celebrated arguably the best result of his career in what became a post-midnight finish.A first win at the famous Crucible theatre has been a long time coming for Woollaston, who is now 37.He has suffered with chronic fatigue in recent years and said he was so sickly he was \"green\" before the final session against Selby.But if the surname rings a bell, then that might not be entirely down to Ben's snooker achievements alone.Wife Tatiana is one of the sport's leading referees.She is not allowed to take charge of Ben's matches to avoid any possible accusations of a conflict of interest, but has officiated on many of the sport's big occasions and first appeared at the World Championship in 2020.",
        "Ben Woollaston turned professional at the age of 17, and, as might be expected, found it tough initially to get the wins to stay on tour.He flitted between professional and amateur ranks, but since 2009 has been a fixture on the main tour.It was while in Germany for the Paul Hunter Classic in 2010 that Tatiana, making her way in the game as a European Billiards and Snooker Association referee, first encountered Ben.They married in 2011.Tatiana later told BBC Sport: \"I had never heard of him. When we met he was 70 or 80 in the world.\"I think it improved him a lot and has given him motivation. Maybe it inspired him.\"Woollaston is 44th for now with 2024-25 season earnings of £139,900... and counting. He has been as high as 25th.",
        "Ben Woollaston won a first minor ranking title in a Players Tour Championship event in Sheffield in 2011, and was one of a number of players with serious promise to emerge at about that time, others including Judd Trump, Jack Lisowski and Anthony McGill.He qualified for the World Championship in 2013, and despite losing in round one to Ali Carter might well have expected to become a Crucible regular.He also reached the 2015 Welsh Open final, where he was beaten by John Higgins.Losing in qualifying for the Worlds became a frustrating and difficult habit to break, and returning to the sport's most famous stage this year could be considered overdue.The Woollastons have two sons, and their eldest, 12-year-old Edward, joined Tatiana in the Crucible crowd to see Ben crawl over the line at the end of two gruelling sessions against Selby.\"It's amazing for Edward. I don't know how he did it - to watch five hours one night and five hours the next night,\" said Ben Woollaston.\"He didn't miss one shot [and] stayed in there during the interval. It's amazing that he did it.\"Ben's win might have cost Edward some bonus pocket money, however, as he had drawn Selby in a World Championship sweepstake at their snooker club with a £100 prize up for grabs.\"He thought he had a good chance,\" Woollaston said.Tatiana also works at the head office of clothes retailer Next, with snooker a part-time occupation, but is one of the most respected refs around.She refereed the UK Championship final between Judd Trump and Barry Hawkins at the York Barbican in December. That was her first final of a Triple Crown event, a possible step towards a Crucible title match for the 38-year-old, who hails from Belarus.",
        "World Snooker Tour says this is confidential and would not offer any guidance.For some, though, it is a full-time role and involves extensive world travel.As well as matches on the regular tour, officials might top up their earnings by running the rule over exhibition matches.This has been a lucrative sideline since the sport's boom years in the 1980s, when the likes of Len Ganley were almost as popular as the top players.As Mike Ganley - World Snooker Tour tournament director and Len's son - has said: \"Len made good money from the exhibitions because for whatever reason he did have a profile, and an ego and a personality that went with it.\"That helps. It is understood that a referee's basic pay is generally rather modest, certainly compared to the top players.We can confidently say that Ben Woollaston's World Championship earnings this year will top any referee's income from the 17 days.Reaching the second round means he is assured of at least £30,000. The champion collects £500,000.Ben's plan for Friday was to sleep as much as possible so that he feels fresh to go again when he plays China's Si Jiahui in round two, in a match that begins on Saturday.He was seen with Tatiana and Edward heading back to their hotel at about 01:00 BST, and while Ben and Edward possibly had a lie-in, there was no such comfort for Tatiana.She was straight back to work, refereeing the second session of the round two match between Mark Allen and Chris Wakelin.That began at 10:00 BST, and it contained what might go down as another career highlight - picking the black ball out of the pocket as Allen became the 11th man to make a 147 maximum break at the World Championship.So far, Sheffield is treating the Woollastons well.",
        "Ben and Tatiana Woollaston have forged separate careers in snooker",
        "Ben Woollaston shot into the snooker spotlight with his surprising first-round win against Mark Selby at the World Championship.",
        "It was a match between friends and practice partners from Leicester, and one that Selby said before the draw he hoped to avoid.",
        "While Selby coughed up what he described as a \"pathetic\" performance to lose 10-8, Woollaston celebrated arguably the best result of his career in what became a post-midnight finish.",
        "A first win at the famous Crucible theatre has been a long time coming for Woollaston, who is now 37.",
        "He has suffered with chronic fatigue in recent years and said he was so sickly he was \"green\" before the final session against Selby.",
        "But if the surname rings a bell, then that might not be entirely down to Ben's snooker achievements alone.",
        "Wife Tatiana is one of the sport's leading referees.",
        "She is not allowed to take charge of Ben's matches to avoid any possible accusations of a conflict of interest, but has officiated on many of the sport's big occasions and first appeared at the World Championship in 2020.",
        "Tatiana Woollaston is regarded as one of snooker's top referees",
        "Ben Woollaston turned professional at the age of 17, and, as might be expected, found it tough initially to get the wins to stay on tour.",
        "He flitted between professional and amateur ranks, but since 2009 has been a fixture on the main tour.",
        "It was while in Germany for the Paul Hunter Classic in 2010 that Tatiana, making her way in the game as a European Billiards and Snooker Association referee, first encountered Ben.",
        "They married in 2011.",
        "Tatiana later told BBC Sport: \"I had never heard of him. When we met he was 70 or 80 in the world.",
        "\"I think it improved him a lot and has given him motivation. Maybe it inspired him.\"",
        "Woollaston is 44th for now with 2024-25 season earnings of £139,900... and counting. He has been as high as 25th.",
        "World Championship: Schedule, results & BBC coverage",
        "Quiz: What happened in round one at the Crucible?",
        "Ben Woollaston won a first minor ranking title in a Players Tour Championship event in Sheffield in 2011, and was one of a number of players with serious promise to emerge at about that time, others including Judd Trump, Jack Lisowski and Anthony McGill.",
        "He qualified for the World Championship in 2013, and despite losing in round one to Ali Carter might well have expected to become a Crucible regular.",
        "He also reached the 2015 Welsh Open final, where he was beaten by John Higgins.",
        "Losing in qualifying for the Worlds became a frustrating and difficult habit to break, and returning to the sport's most famous stage this year could be considered overdue.",
        "The Woollastons have two sons, and their eldest, 12-year-old Edward, joined Tatiana in the Crucible crowd to see Ben crawl over the line at the end of two gruelling sessions against Selby.",
        "\"It's amazing for Edward. I don't know how he did it - to watch five hours one night and five hours the next night,\" said Ben Woollaston.",
        "\"He didn't miss one shot [and] stayed in there during the interval. It's amazing that he did it.\"",
        "Ben's win might have cost Edward some bonus pocket money, however, as he had drawn Selby in a World Championship sweepstake at their snooker club with a £100 prize up for grabs.",
        "\"He thought he had a good chance,\" Woollaston said.",
        "Tatiana also works at the head office of clothes retailer Next, with snooker a part-time occupation, but is one of the most respected refs around.",
        "She refereed the UK Championship final between Judd Trump and Barry Hawkins at the York Barbican in December. That was her first final of a Triple Crown event, a possible step towards a Crucible title match for the 38-year-old, who hails from Belarus.",
        "Snooker referees spend much of the year away from home",
        "World Snooker Tour says this is confidential and would not offer any guidance.",
        "For some, though, it is a full-time role and involves extensive world travel.",
        "As well as matches on the regular tour, officials might top up their earnings by running the rule over exhibition matches.",
        "This has been a lucrative sideline since the sport's boom years in the 1980s, when the likes of Len Ganley were almost as popular as the top players.",
        "As Mike Ganley - World Snooker Tour tournament director and Len's son - has said: \"Len made good money from the exhibitions because for whatever reason he did have a profile, and an ego and a personality that went with it.\"",
        "That helps. It is understood that a referee's basic pay is generally rather modest, certainly compared to the top players.",
        "We can confidently say that Ben Woollaston's World Championship earnings this year will top any referee's income from the 17 days.",
        "Reaching the second round means he is assured of at least £30,000. The champion collects £500,000.",
        "Ben's plan for Friday was to sleep as much as possible so that he feels fresh to go again when he plays China's Si Jiahui in round two, in a match that begins on Saturday.",
        "He was seen with Tatiana and Edward heading back to their hotel at about 01:00 BST, and while Ben and Edward possibly had a lie-in, there was no such comfort for Tatiana.",
        "She was straight back to work, refereeing the second session of the round two match between Mark Allen and Chris Wakelin.",
        "That began at 10:00 BST, and it contained what might go down as another career highlight - picking the black ball out of the pocket as Allen became the 11th man to make a 147 maximum break at the World Championship.",
        "So far, Sheffield is treating the Woollastons well.",
        "Hearn ready for snooker to leave Crucible after 2027",
        "'National hero' - China's pursuit of an elusive world title"
      ]
    }
  ]
}