{
  "scraped_at": "2025-10-27T18:56:59.811546",
  "total_articles": 1,
  "category": "sailing",
  "articles_per_category": 100,
  "articles": [
    {
      "url": "https://www.bbc.com/sport/sailing/articles/cy7ypgd7lyno",
      "main_category": "sport",
      "detailed_category": "sailing",
      "topic": "All aboard! America's Cup boats can carry celebrities",
      "content": [
        "America's Cup teams have agreed to carry a \"guest\" crew member, which could be a VIP, celebrity or influencer, in the 2027 edition of the world's oldest international sports competition.Each crew will have an additional sixth member on board in the 38th America's Cup, with a media representative or sponsor also among the options agreed in the new rules for the event.Every crew will also have to contain at least one woman, and a minimum of two crew members - including a female sailor - must be nationals of the team's country of origin.Sir Ben Ainslie, team principal of Great Britain's Athena Racing, said it is a \"seismic moment\" for the event.\"The teams and yacht clubs share a vision to make the America's Cup more inclusive, compelling, and financially sustainable,\" Ainslie said.\"This new model marks a unified commitment to that vision. I am excited for the future of the sport.\"The competition started in 1851 and the 38th edition takes place in Naples, Italy in 2027, with entries for the regatta to open on 19 August.There are also changes to the format, with all competitors taking part in both match racing - when two crews go head to head - as well as fleet racing - when all the yachts race together. The top four challengers will then feature in a knockout match semi-final.Teams will be limited to a maximum spend of 75m euros, with refinements scheduled for the 39th edition.The new rules also say existing teams must use the same AC75 hulls which were raced in 2024, with increased function of the boat powered by battery.",
        "New Zealand won the America's Cup for the third time in a row in 2024",
        "America's Cup teams have agreed to carry a \"guest\" crew member, which could be a VIP, celebrity or influencer, in the 2027 edition of the world's oldest international sports competition.",
        "Each crew will have an additional sixth member on board in the 38th America's Cup, with a media representative or sponsor also among the options agreed in the new rules for the event.",
        "Every crew will also have to contain at least one woman, and a minimum of two crew members - including a female sailor - must be nationals of the team's country of origin.",
        "Sir Ben Ainslie, team principal of Great Britain's Athena Racing, said it is a \"seismic moment\" for the event.",
        "\"The teams and yacht clubs share a vision to make the America's Cup more inclusive, compelling, and financially sustainable,\" Ainslie said.",
        "\"This new model marks a unified commitment to that vision. I am excited for the future of the sport.\"",
        "The competition started in 1851 and the 38th edition takes place in Naples, Italy in 2027, with entries for the regatta to open on 19 August.",
        "There are also changes to the format, with all competitors taking part in both match racing - when two crews go head to head - as well as fleet racing - when all the yachts race together.",
        "The top four challengers will then feature in a knockout match semi-final.",
        "Teams will be limited to a maximum spend of 75m euros, with refinements scheduled for the 39th edition.",
        "The new rules also say existing teams must use the same AC75 hulls which were raced in 2024, with increased function of the boat powered by battery."
      ]
    }
  ]
}