{
  "scraped_at": "2025-10-27T18:56:59.805547",
  "total_articles": 13,
  "category": "rowing",
  "articles_per_category": 100,
  "articles": [
    {
      "url": "https://www.bbc.com/sport/olympics/articles/cjek2lj9g04o",
      "main_category": "sport",
      "detailed_category": "rowing",
      "topic": "Scott donates Olympic medallist fund to Bann Rowing Club",
      "content": [
        "Olympic champion Hannah Scott has launched a new boat named after herself at the Bann Rowing Club in Coleraine.The 26-year-old won gold in the women's quadruple sculls for Team GB in Paris and donated her £20,000 award from the Olympic Medallist Fund, which was set up following the Games last year, to her home club who used the money to buy two single scull boats and a safety boat.\"It was my dream to reach the Olympics and not only have I lived my dream, I fulfilled it thanks to the grassroots support of Bann Rowing Club, the amazing volunteers and coaches,\" Scott told BBC Sport NI.\"The amount of athletes that have come out of the club is extraordinary and it deserves this investment because of how much it has given to rowing but taken so little back.\"There is a brilliant cross community relationship within rowing. We have a very successful Rowing Ireland and GB Rowing teams which both benefit from Bann Rowing Club and this money will ensure more people can access the sport for those two teams to be represented by NI athletes.\"",
        "The club, which is situated under a Chinese restaurant near the town centre of Coleraine, has a history of producing international rowers.In the past 25 years, four Olympians - Alan Campbell, Richard and Peter Chambers and Hannah Scott - have come from the club with all four winning world medals and going on to stand on the Olympic podium.The Chambers brothers and Alan Campbell won medals at London 2012 before Scott's success in Paris last year.The future looks bright with Scott committed to the next Olympics in Los Angeles in 2028 with another Bann member - Ellie-Kate Hutchinson - already a gold medallist at under-23 level.The 21-year-old is currently in her final year at Syracuse University and likely to join Scott in the GB squad next year.",
        "This video can not be played",
        "Watch: Olympic champion Scott reveals new boat at home club",
        "Olympic champion Hannah Scott has launched a new boat named after herself at the Bann Rowing Club in Coleraine.",
        "The 26-year-old won gold in the women's quadruple sculls for Team GB in Paris and donated her £20,000 award from the Olympic Medallist Fund, which was set up following the Games last year, to her home club who used the money to buy two single scull boats and a safety boat.",
        "\"It was my dream to reach the Olympics and not only have I lived my dream, I fulfilled it thanks to the grassroots support of Bann Rowing Club, the amazing volunteers and coaches,\" Scott told BBC Sport NI.",
        "\"The amount of athletes that have come out of the club is extraordinary and it deserves this investment because of how much it has given to rowing but taken so little back.",
        "\"There is a brilliant cross community relationship within rowing. We have a very successful Rowing Ireland and GB Rowing teams which both benefit from Bann Rowing Club and this money will ensure more people can access the sport for those two teams to be represented by NI athletes.\"",
        "Communities Minister Gordon Lyons (third from left) joined Hannah Scott on the River Bann",
        "The club, which is situated under a Chinese restaurant near the town centre of Coleraine, has a history of producing international rowers.",
        "In the past 25 years, four Olympians - Alan Campbell, Richard and Peter Chambers and Hannah Scott - have come from the club with all four winning world medals and going on to stand on the Olympic podium.",
        "The Chambers brothers and Alan Campbell won medals at London 2012 before Scott's success in Paris last year.",
        "The future looks bright with Scott committed to the next Olympics in Los Angeles in 2028 with another Bann member - Ellie-Kate Hutchinson - already a gold medallist at under-23 level.",
        "The 21-year-old is currently in her final year at Syracuse University and likely to join Scott in the GB squad next year."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/rowing/articles/c30691emd1zo",
      "main_category": "sport",
      "detailed_category": "rowing",
      "topic": "GB win most medals at Worlds as Henry takes silver",
      "content": [
        "Lauren Henry said she was \"sad\" to miss out on a first ever women's single sculls gold for Great Britain after being edged out by Ireland's Fiona Murtagh in a photo finish on the final day of the World Rowing Championships in Shanghai.Henry's silver medal was Britain's eighth of the championships, the most of any competing nation, with a total of three golds, four silver and one bronze. Only the Netherlands finished with more gold medals - with four.Henry, 23, had won a medal in every international race she competed in this year, while 30-year-old Murtagh had never before won a major regatta.But after opening a big lead with a blistering start, Murtagh hung on as Henry reeled her in in the final 500m, with the Briton eventually losing by just 0.03 seconds.\"Obviously, I'm really pleased to come away with a medal, but it is disappointing,\" said Henry. \"I said I was coming here for the gold and it's sad to miss out by less than a centimetre.\"I'm going to use this during the winter and come back better and stronger next season. Hopefully I can win that elusive women's single sculling gold for Great Britain at a World Championships.\"",
        "Murtagh paid tribute to \"phenomenal athlete\" Henry, saying she was in shock after her name came up as the winner. She told World Rowing: \"I dug deep and crossed the line and we were right beside each other, I really didn't know who'd won it until I looked at the screen and saw my name. I've never won a major regatta. This is huge and I'm in shock.\"Louise Kingsley, the British team's director of performance, said that the championships marked a successful \"start to the LA cycle\", as GB's rowers target the next Olympic Games in Los Angeles in 2028. \"Of the 37 athletes who made the podium, we have 21 athletes who are bringing home medals from their first ever World Championships,\" said Kingsley, \"showing that the pathway is strong and I'm excited to see how they all build on this as we work through the cycle.\"",
        "Lauren Henry claimed Great Britain's eighth medal of the World Rowing Championships",
        "Lauren Henry said she was \"sad\" to miss out on a first ever women's single sculls gold for Great Britain after being edged out by Ireland's Fiona Murtagh in a photo finish on the final day of the World Rowing Championships in Shanghai.",
        "Henry's silver medal was Britain's eighth of the championships, the most of any competing nation, with a total of three golds, four silver and one bronze.",
        "Only the Netherlands finished with more gold medals - with four.",
        "Henry, 23, had won a medal in every international race she competed in this year, while 30-year-old Murtagh had never before won a major regatta.",
        "But after opening a big lead with a blistering start, Murtagh hung on as Henry reeled her in in the final 500m, with the Briton eventually losing by just 0.03 seconds.",
        "\"Obviously, I'm really pleased to come away with a medal, but it is disappointing,\" said Henry.",
        "\"I said I was coming here for the gold and it's sad to miss out by less than a centimetre.",
        "\"I'm going to use this during the winter and come back better and stronger next season. Hopefully I can win that elusive women's single sculling gold for Great Britain at a World Championships.\"",
        "GB claim world gold, silver and bronze in Shanghai",
        "Great Britain add two golds to World Championships haul",
        "Double silver for GB quads at World Championships",
        "Murtagh paid tribute to \"phenomenal athlete\" Henry, saying she was in shock after her name came up as the winner.",
        "She told World Rowing: \"I dug deep and crossed the line and we were right beside each other, I really didn't know who'd won it until I looked at the screen and saw my name. I've never won a major regatta. This is huge and I'm in shock.\"",
        "Louise Kingsley, the British team's director of performance, said that the championships marked a successful \"start to the LA cycle\", as GB's rowers target the next Olympic Games in Los Angeles in 2028.",
        "\"Of the 37 athletes who made the podium, we have 21 athletes who are bringing home medals from their first ever World Championships,\" said Kingsley, \"showing that the pathway is strong and I'm excited to see how they all build on this as we work through the cycle.\""
      ]
    },
    {
      "url": "https://www.bbc.com/sport/rowing/articles/czew052g281o",
      "main_category": "sport",
      "detailed_category": "rowing",
      "topic": "GB claim world gold, silver and bronze in Shanghai",
      "content": [
        "Great Britain continued their dominance in the PR3 mixed coxed four by claiming their 14th consecutive international gold medal at the World Rowing Championships in Shanghai, as the men's and women's eights also made it on to the podium. The PR3 mixed coxed four of Frankie Allen, Giedre Rakauskaite, Ed Fuller and Josh O'Brien, along with newly selected cox Tom Bryce, were competing together for the first time since they won Paralympic gold in the Paris Games in 2024.Rakauskaite took her career tally to six world golds in PR3 - five in the mixed coxed four and one in the women's pair - to become the joint most decorated woman in the category.The men's eights were unable to defend their crown, claiming silver behind the Netherlands, while the Dutch also won the women's eights, with the GB crew finishing third.A gold, silver and bronze on Saturday took the British team's tally for the championships to seven, following two golds on Friday and two silvers on Thursday.",
        "\"This means so much because I now have a record. I'm so proud of that - it's a big one for me,\" said 34-year-old Rakauskaite, who also has two Paralympic gold medals in the PR3 mixed coxed four.She shares the mark of six world titles in PR3 with fellow Briton Naomi Riches, Birgit Skarstein, of Norway, and the Netherlands' Corne de Koning.The British team finished seven seconds ahead of hosts China, while Germany were third. Allen said: \"Although we're unbeaten the nerves stay the same on the start line. I think the more you win, the more you have a target on your back. So it pushes us to keep going as fast as we can and push the limits as well.\"The British men's eight crew of Will Stewart, Archie Drummond, David Bewicke-Copley, Fergus Woolnough, Miles Beeson, Sam Nunn, Matt Aldridge, Matt Rowe and cox Will Denegri battled through in the closing stages to finish ahead of the United States by just 0.16 seconds to claim silver. A much-changed boat showed calm heads to keep their form after the race had to be re-started because of a technical problem.Aldridge said: \"We put up a good fight - we could have rolled over. It's a young crew with not much international experience so I'm really happy for these guys and looking forward to what happens next.\"The women's eight of Eleanor Brinkhoff, Juliette Perry, Amelia Standing, Martha Birtles, Lauren Irwin, Eve Stewart, Heidi Long and Megan Slabbert and cox Jack Tottem also produced a strong finish to claim a first world medal in the discipline since 2011.They were fastest in the second half of the race to pip Germany to bronze by 0.17 seconds, while Romania claimed silver behind the Netherlands.",
        "Great Britain's last defeat in the PR3 mixed coxed four in any major event was at the  2010 World Rowing Championships",
        "Great Britain continued their dominance in the PR3 mixed coxed four by claiming their 14th consecutive international gold medal at the World Rowing Championships in Shanghai, as the men's and women's eights also made it on to the podium.",
        "The PR3 mixed coxed four of Frankie Allen, Giedre Rakauskaite, Ed Fuller and Josh O'Brien, along with newly selected cox Tom Bryce, were competing together for the first time since they won Paralympic gold in the Paris Games in 2024.",
        "Rakauskaite took her career tally to six world golds in PR3 - five in the mixed coxed four and one in the women's pair - to become the joint most decorated woman in the category.",
        "The men's eights were unable to defend their crown, claiming silver behind the Netherlands, while the Dutch also won the women's eights, with the GB crew finishing third.",
        "A gold, silver and bronze on Saturday took the British team's tally for the championships to seven, following two golds on Friday and two silvers on Thursday.",
        "Great Britain add two golds to World Championships haul",
        "Double silver for GB quads at World Championships",
        "World Championships bronze for Doyle and McCarthy",
        "\"This means so much because I now have a record. I'm so proud of that - it's a big one for me,\" said 34-year-old Rakauskaite, who also has two Paralympic gold medals in the PR3 mixed coxed four.",
        "She shares the mark of six world titles in PR3 with fellow Briton Naomi Riches, Birgit Skarstein, of Norway, and the Netherlands' Corne de Koning.",
        "The British team finished seven seconds ahead of hosts China, while Germany were third.",
        "Allen said: \"Although we're unbeaten the nerves stay the same on the start line. I think the more you win, the more you have a target on your back. So it pushes us to keep going as fast as we can and push the limits as well.\"",
        "The British men's eight crew of Will Stewart, Archie Drummond, David Bewicke-Copley, Fergus Woolnough, Miles Beeson, Sam Nunn, Matt Aldridge, Matt Rowe and cox Will Denegri battled through in the closing stages to finish ahead of the United States by just 0.16 seconds to claim silver.",
        "A much-changed boat showed calm heads to keep their form after the race had to be re-started because of a technical problem.",
        "Aldridge said: \"We put up a good fight - we could have rolled over. It's a young crew with not much international experience so I'm really happy for these guys and looking forward to what happens next.\"",
        "The women's eight of Eleanor Brinkhoff, Juliette Perry, Amelia Standing, Martha Birtles, Lauren Irwin, Eve Stewart, Heidi Long and Megan Slabbert and cox Jack Tottem also produced a strong finish to claim a first world medal in the discipline since 2011.",
        "They were fastest in the second half of the race to pip Germany to bronze by 0.17 seconds, while Romania claimed silver behind the Netherlands."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/rowing/articles/ce3yey4n0q5o",
      "main_category": "sport",
      "detailed_category": "rowing",
      "topic": "Great Britain add two golds to World Championships haul",
      "content": [
        "Great Britain won two gold medals at the 2025 World Rowing Championships in Shanghai, with victory in the men's four and PR1 men's single sculls.Competing as a combination for the first time at this regatta, the impressive form of Daniel Graham, James Robson, Douwe de Graaf and George Bourne continued as the new-look quartet beat Romania and the Netherlands to top the men's four podium.Benjamin Pritchard's dominance continued as the Paralympic and European champion led the PR1 single sculls field from start to finish, adding another gold to his collection. The awards come a day after Great Britain claimed silver in both the men's and women's quadruple sculls on the first day of the finals on Thursday.",
        "\"We came here thinking we could do it, but we wanted to focus on progressing through the regatta and to get better each time we hit the water,\" Robson said after the race. \"We had a great row in that final. It was quite a battle and we're just really happy to have got that over the line and get it done!\"Pritchard set a new Paralympic record at Paris 2024, before becoming a European Champion for the first time in Plovdiv earlier this year. Of his form, the Welshman said: \"This project is an undisputed success.\"\"I'm a Paralympic, European and world champion. I've broken European records, Paralympic records and world championship records. I'll take it all to be honest! \"I wanted to get off quick and hold the lead, and towards the end I was holding on for dear life. I was dying in those last five strokes, that's for sure.\"The temperature here is wild. It's genuinely like rowing in an inferno! I've done a lot of heat preparation back home in the UK with our support staff, who have been fantastic. But it just doesn't prepare you for these conditions. This is something else!\"Elsewhere, Lauren Henry is through to the women's single sculls final after winning her semi-final.In the PR3 mixed double sculls, Sam Murray and Annie Caddick also progressed to the final with a first-place finish.",
        "Dan Graham (right), 26, takes home gold at his first senior World Championships.",
        "Great Britain won two gold medals at the 2025 World Rowing Championships in Shanghai, with victory in the men's four and PR1 men's single sculls.",
        "Competing as a combination for the first time at this regatta, the impressive form of Daniel Graham, James Robson, Douwe de Graaf and George Bourne continued as the new-look quartet beat Romania and the Netherlands to top the men's four podium.",
        "Benjamin Pritchard's dominance continued as the Paralympic and European champion led the PR1 single sculls field from start to finish, adding another gold to his collection.",
        "The awards come a day after Great Britain claimed silver in both the men's and women's quadruple sculls on the first day of the finals on Thursday.",
        "Double silver for GB quads at World Championships",
        "\"We came here thinking we could do it, but we wanted to focus on progressing through the regatta and to get better each time we hit the water,\" Robson said after the race.",
        "\"We had a great row in that final. It was quite a battle and we're just really happy to have got that over the line and get it done!\"",
        "Pritchard set a new Paralympic record at Paris 2024, before becoming a European Champion for the first time in Plovdiv earlier this year.",
        "Of his form, the Welshman said: \"This project is an undisputed success.\"",
        "\"I'm a Paralympic, European and world champion. I've broken European records, Paralympic records and world championship records. I'll take it all to be honest!",
        "\"I wanted to get off quick and hold the lead, and towards the end I was holding on for dear life. I was dying in those last five strokes, that's for sure.",
        "\"The temperature here is wild. It's genuinely like rowing in an inferno! I've done a lot of heat preparation back home in the UK with our support staff, who have been fantastic. But it just doesn't prepare you for these conditions. This is something else!\"",
        "Elsewhere, Lauren Henry is through to the women's single sculls final after winning her semi-final.",
        "In the PR3 mixed double sculls, Sam Murray and Annie Caddick also progressed to the final with a first-place finish.",
        "Benjamin Pritchard crossed the line in 8 minutes and 55 seconds"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/olympics/articles/clyd1zeze17o",
      "main_category": "sport",
      "detailed_category": "rowing",
      "topic": "World Championships bronze for Doyle and McCarthy",
      "content": [
        "Olympic medallists Philip Doyle and Fintan McCarthy won bronze in the men’s double sculls final at the World Championships in Shanghai.The Irish combination from Banbridge and Skibbereen, sculling together in competition for the first time, were in the mix for the medals from the start of the race.However, Miroslaw Zietarski and Mateusz Biskup from Poland eased away to take gold, followed by the Serbian duo, Martin Mackovic and Nikolaj Pimenov.Doyle and McCarthy held on to take a comfortable third place.\"It's our fourth race together; we enjoyed it,\" Doyle said.\"I think every race we go we're learning, we have very different styles so we're trying to mesh that in, but some step up against the big boys. \"Every time we go out we feel better - the legs feel better, the boat feels better, everything feels better. So, delighted today.\"",
        "The final did not develop as expected. From the start the Olympic champions, Romania, were left trailing at the back of the field and never recovered while Poland took an early lead, chased by Ireland, Serbia and Switzerland.As the race passed halfway at 1000m, the Polish crew began to move away to a clear water advantage, leaving the rest to compete for the minor medals.Doyle and McCarthy were eventually overhauled by Serbia in the final 500m but were worthy bronze medallists.",
        "It’s the third world medal for Doyle following a silver in 2019 in Linz and bronze two years ago in Belgrade before he went on to claim a superb bronze at the Paris Olympics.With no lightweight rowing at the next Games in Los Angeles, it meant McCarthy, a three-time world gold medallist and twice an Olympic champion with Paul O’Donovan, has had to become a heavyweight.The two men only came together as a partnership a couple of months ago so as the next Olympic cycle begins, third place is an excellent result.However, with decisions on the future yet to be taken by O’Donovan and Doyle’s partner from Paris last year, Daire Lynch, as to whether they are continuing to LA there is likely to be a reset over the winter by Rowing Ireland as they plan ahead for the next three years.",
        "Philip Doyle and Fintan McCarthy won bronze in the men’s double sculls",
        "Olympic medallists Philip Doyle and Fintan McCarthy won bronze in the men’s double sculls final at the World Championships in Shanghai.",
        "The Irish combination from Banbridge and Skibbereen, sculling together in competition for the first time, were in the mix for the medals from the start of the race.",
        "However, Miroslaw Zietarski and Mateusz Biskup from Poland eased away to take gold, followed by the Serbian duo, Martin Mackovic and Nikolaj Pimenov.",
        "Doyle and McCarthy held on to take a comfortable third place.",
        "\"It's our fourth race together; we enjoyed it,\" Doyle said.",
        "\"I think every race we go we're learning, we have very different styles so we're trying to mesh that in, but some step up against the big boys.",
        "\"Every time we go out we feel better - the legs feel better, the boat feels better, everything feels better. So, delighted today.\"",
        "The final did not develop as expected. From the start the Olympic champions, Romania, were left trailing at the back of the field and never recovered while Poland took an early lead, chased by Ireland, Serbia and Switzerland.",
        "As the race passed halfway at 1000m, the Polish crew began to move away to a clear water advantage, leaving the rest to compete for the minor medals.",
        "Doyle and McCarthy were eventually overhauled by Serbia in the final 500m but were worthy bronze medallists.",
        "It’s the third world medal for Doyle following a silver in 2019 in Linz and bronze two years ago in Belgrade before he went on to claim a superb bronze at the Paris Olympics.",
        "With no lightweight rowing at the next Games in Los Angeles, it meant McCarthy, a three-time world gold medallist and twice an Olympic champion with Paul O’Donovan, has had to become a heavyweight.",
        "The two men only came together as a partnership a couple of months ago so as the next Olympic cycle begins, third place is an excellent result.",
        "However, with decisions on the future yet to be taken by O’Donovan and Doyle’s partner from Paris last year, Daire Lynch, as to whether they are continuing to LA there is likely to be a reset over the winter by Rowing Ireland as they plan ahead for the next three years."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/olympics/articles/cp8jz7lmr47o",
      "main_category": "sport",
      "detailed_category": "rowing",
      "topic": "Double silver for GB quads at World Championships",
      "content": [
        "Great Britain won silver medals in the women's and men's quadruple sculls on the first day of finals at the World Rowing Championships in Shanghai.The women's quartet of Becky Wilde, Hannah Scott, Lola Anderson and Sarah McKay could not quite find the sprint finish to overhaul the Netherlands.In the men's final a similar scenario played out with the GB foursome of Cedol Dafydd, Callum Dixon, Matthew Haywood and Rory Harris leaving themselves too much to do in the final stages to catch Italy.\"We're obviously a little disappointed with silver but it's a solid result. As a crew we've only had eight weeks together and to do that in eight weeks is no small feat,\" Scott told BBC Sport NI after the race.\"We'll certainly look at tactics and ratings over the winter training, which I'm very excited about.\"We didn't really have the time to do that this year, we just had to go for it but to start the year after the Olympics with a silver medal at the Worlds is a solid start to the road to LA.\"",
        "At the Olympics in Paris last year, Great Britain and the Netherlands battled to the finish line when the gold medal was settled in GB’s favour on the final stroke.Both countries had different line-ups this year but the world final played out along similar lines but with the result reversed.Scott and Anderson returned to the GB boat but this was the first regatta they were able to scull alongside Wilde and McKay after a season hit by illness and injury.As happened in Paris, the Netherlands roared off the blocks and established a length lead by the halfway point.In a contrast in styles the GB boat, rating almost five strokes per minute less, gradually reeled them back in as the Dutch held on to their lead.This time, however, there was no final sprint from GB although they were still closing the gap at the finish.Although they will be disappointed not to win, the long goal is the LA 2028 Olympics and this was a good first step.",
        "In contrast, the GB men's quad have had a superb season, becoming European champions and winning the World Cup in Lucerne, and they were favourites to add the world title but ultimately, the final was very similar to the women's race.The Italy boat of Luca Chiumento, Luca Rambaldi, Andrea Panizza and Giacomo Gentili took the race on with a flying start and they had clear water by 500m, ahead of Great Britain. Employing similar tactics to the GB women, the men began to move in the second 1,000m but Italy had done enough early on and were able to cross the line well ahead of the pack.Great Britain took silver, their first medal in this boat class since 2022.\"We came in wanting to win and we knew we could,\" said Dafydd.\"Everything went well and we raced our best and unfortunately our best today just wasn’t quite food enough.\"You have to give credit to Italy, they were better than us today and we raced that race again who knows but we did everything we could today.\"",
        "Great Britain’s other finalists were the new combination in the women‘s pair.Rowing in an outside lane, Lizzie Witt and Jade Lindo acquitted themselves well in the regatta overall but were sixth, with Romania taking gold. Great Britain celebrated heat wins in both the men's and women's eights with the finals scheduled for Saturday.In the PR3 mixed doubles sculls, Annabel Caddick and Samuel Murray won their heat to move into Friday’s semi-finals.After Wednesday's postponement the men's double sculls semi-finals finally took place.Olympic champions Romania, Andrei Cornea and Marian Enache led from the start and held off the Irish boat of Philip Doyle and double Olympic champion Fintan McCarthy who has moved up from lightweight rowing into the heavyweight class for this Olympic cycle. The final will take place on Friday.",
        "The quartet of Sarah McKay, Hannah Scott, Lola Anderson and Becky Wilde picked up silver for Great Britain",
        "Great Britain won silver medals in the women's and men's quadruple sculls on the first day of finals at the World Rowing Championships in Shanghai.",
        "The women's quartet of Becky Wilde, Hannah Scott, Lola Anderson and Sarah McKay could not quite find the sprint finish to overhaul the Netherlands.",
        "In the men's final a similar scenario played out with the GB foursome of Cedol Dafydd, Callum Dixon, Matthew Haywood and Rory Harris leaving themselves too much to do in the final stages to catch Italy.",
        "\"We're obviously a little disappointed with silver but it's a solid result. As a crew we've only had eight weeks together and to do that in eight weeks is no small feat,\" Scott told BBC Sport NI after the race.",
        "\"We'll certainly look at tactics and ratings over the winter training, which I'm very excited about.",
        "\"We didn't really have the time to do that this year, we just had to go for it but to start the year after the Olympics with a silver medal at the Worlds is a solid start to the road to LA.\"",
        "Scott 'struggled to get out of bed' with health issue",
        "At the Olympics in Paris last year, Great Britain and the Netherlands battled to the finish line when the gold medal was settled in GB’s favour on the final stroke.",
        "Both countries had different line-ups this year but the world final played out along similar lines but with the result reversed.",
        "Scott and Anderson returned to the GB boat but this was the first regatta they were able to scull alongside Wilde and McKay after a season hit by illness and injury.",
        "As happened in Paris, the Netherlands roared off the blocks and established a length lead by the halfway point.",
        "In a contrast in styles the GB boat, rating almost five strokes per minute less, gradually reeled them back in as the Dutch held on to their lead.",
        "This time, however, there was no final sprint from GB although they were still closing the gap at the finish.",
        "Although they will be disappointed not to win, the long goal is the LA 2028 Olympics and this was a good first step.",
        "Cedol Dafydd, Callum Dixon, Matthew Haywood and Rory Harris won the silver medal",
        "In contrast, the GB men's quad have had a superb season, becoming European champions and winning the World Cup in Lucerne, and they were favourites to add the world title but ultimately, the final was very similar to the women's race.",
        "The Italy boat of Luca Chiumento, Luca Rambaldi, Andrea Panizza and Giacomo Gentili took the race on with a flying start and they had clear water by 500m, ahead of Great Britain.",
        "Employing similar tactics to the GB women, the men began to move in the second 1,000m but Italy had done enough early on and were able to cross the line well ahead of the pack.",
        "Great Britain took silver, their first medal in this boat class since 2022.",
        "\"We came in wanting to win and we knew we could,\" said Dafydd.",
        "\"Everything went well and we raced our best and unfortunately our best today just wasn’t quite food enough.",
        "\"You have to give credit to Italy, they were better than us today and we raced that race again who knows but we did everything we could today.\"",
        "Great Britain’s other finalists were the new combination in the women‘s pair.",
        "Rowing in an outside lane, Lizzie Witt and Jade Lindo acquitted themselves well in the regatta overall but were sixth, with Romania taking gold.",
        "Great Britain celebrated heat wins in both the men's and women's eights with the finals scheduled for Saturday.",
        "In the PR3 mixed doubles sculls, Annabel Caddick and Samuel Murray won their heat to move into Friday’s semi-finals.",
        "After Wednesday's postponement the men's double sculls semi-finals finally took place.",
        "Olympic champions Romania, Andrei Cornea and Marian Enache led from the start and held off the Irish boat of Philip Doyle and double Olympic champion Fintan McCarthy who has moved up from lightweight rowing into the heavyweight class for this Olympic cycle.",
        "The final will take place on Friday."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/rowing/articles/cddmrgp5yvpo",
      "main_category": "sport",
      "detailed_category": "rowing",
      "topic": "Wales win Rowing Beach Sprint Championships",
      "content": [
        "Wales have won the Home International Rowing Beach Sprint Championships in Ireland.It is the second time in three years that Welsh rowers have won the trophy.The scores in the fourth running of the event at Narin beach, Donegal were Wales 24, England 18, Scotland 15 and hosts Ireland 13.\"It was a great day for Wales in wild, wet and very windy conditions,\" said Welsh Rowing senior coach James Walker.The sport requires rowers to take a short sprint along the beach to then jump into their boat which is being held in the surf by two team boat handlers.After launching from the beach to race 250m around slalom buoys, crews then do a 180 degree turn before surfing the boat back to the beach with a final running sprint to hit a buzzer at the finish line.Rowing beach sprints will be included in the Olympic Games for the first time at Los Angeles in 2028.",
        "The Wales team was made up of rowers from Fishguard and Goodwick Jemima RC, Mumbles RC, Warrington RC, Sunderland RC, Hexham RC, Marlow RC and Hartpury College.There were seven categories in all - three senior, three junior and one under-23 - with three of the categories involving mixed-sex crews.Wales' three gold medals came in the senior men's single, the junior women's single and the under-23 mixed double.\"There were some great races in challenging conditions at times but that's what beach sprints is all about,\" said Walker.\"We managed to get to every final, winning three of them with four second places.\"Wales will next be competing in the Commonwealth Beach Sprint Championships in Barbados in November.\"This will be a great opportunity for them to row against top international opposition from across the world,\" added Walker.\"It will also hopefully be a stepping stone for future potential Olympians with the sport showcasing for the first time at the Los Angeles Games in 2028.\"",
        "Wales were also winners of the Home International Rowing Beach Sprint Championships in 2023",
        "Wales have won the Home International Rowing Beach Sprint Championships in Ireland.",
        "It is the second time in three years that Welsh rowers have won the trophy.",
        "The scores in the fourth running of the event at Narin beach, Donegal were Wales 24, England 18, Scotland 15 and hosts Ireland 13.",
        "\"It was a great day for Wales in wild, wet and very windy conditions,\" said Welsh Rowing senior coach James Walker.",
        "The sport requires rowers to take a short sprint along the beach to then jump into their boat which is being held in the surf by two team boat handlers.",
        "After launching from the beach to race 250m around slalom buoys, crews then do a 180 degree turn before surfing the boat back to the beach with a final running sprint to hit a buzzer at the finish line.",
        "Rowing beach sprints will be included in the Olympic Games for the first time at Los Angeles in 2028.",
        "Pritchard aims to complete gold medal set at World Champs",
        "From university fresher to World Championships",
        "The Wales team was made up of rowers from Fishguard and Goodwick Jemima RC, Mumbles RC, Warrington RC, Sunderland RC, Hexham RC, Marlow RC and Hartpury College.",
        "There were seven categories in all - three senior, three junior and one under-23 - with three of the categories involving mixed-sex crews.",
        "Wales' three gold medals came in the senior men's single, the junior women's single and the under-23 mixed double.",
        "\"There were some great races in challenging conditions at times but that's what beach sprints is all about,\" said Walker.",
        "\"We managed to get to every final, winning three of them with four second places.\"",
        "Wales will next be competing in the Commonwealth Beach Sprint Championships in Barbados in November.",
        "\"This will be a great opportunity for them to row against top international opposition from across the world,\" added Walker.",
        "\"It will also hopefully be a stepping stone for future potential Olympians with the sport showcasing for the first time at the Los Angeles Games in 2028.\""
      ]
    },
    {
      "url": "https://www.bbc.com/sport/rowing/articles/cn4wleq080do",
      "main_category": "sport",
      "detailed_category": "rowing",
      "topic": "Pritchard aims to complete gold medal set at World Champs",
      "content": [
        "Paralympic champion Benjamin Pritchard says victory at the World Rowing Championships in Shanghai would complete the \"top trump card\" of major titles after a record-breaking season.The 33-year-old Welshman became European champion for the first time in May, setting world records twice in three days in the PR1 men's single sculls in Plovdiv, Bulgaria.Pritchard posted 8min 47.88sec in his heat before lowering that to 8:40.38 in the final to secure gold.\"I'd have the European Championships, the Paralympic championships, and hopefully the World Championships, but it's never a done deal,\" he told BBC Sport Wales.\"I missed a lot of mid-season racing due to illness and injury, and I've watched my competitors go fast. It's always daunting when you don't know whether you've fallen behind or whether you're still there.\"Pritchard begins his campaign in the heats at 03:25 BST on Monday, with the event running from 21 to 28 September.",
        "Changes to the World Championships schedule mean fewer opportunities to find form.\"It's pretty ruthless,\" Pritchard admitted. \"I'll only have a heat and a final, so you've got to get it right on the first race of the day, and then hopefully you can learn from that and put it right in the final.\"He added: \"The PR1 field has really moved on. Six of us now have gone sub-nine minutes, that's a whole 'A' final, and four of those have gone sub-8:50. To be in with the medals you're going to have to be there or thereabouts.\"Pritchard believes the level of competition is raising the bar for everyone.\"If you're being pushed from behind, then hopefully you can break barriers and set new world records and move the sport on again,\" he said. \"That's what I find fascinating about the PR1 field – it's continually moving. It's pretty special to see how fast the competitors are going, and I'm glad to play a small part in driving those standards forward.\"",
        "With Paris 2024 already behind him, thoughts inevitably turn to the Los Angeles Paralympics in 2028.\"It's still the million dollar question,\" said Pritchard. \"Let's get Shanghai out of the way and then have a proper discussion with British Rowing.\"This year has seen a different approach for the Welshman, who has been based much closer to home.\"British Rowing and UK Sport have allowed me the flexibility to train from Wales, so I've been doing a lot of my training on the River Tawe and in Swansea. Being at home, speaking Welsh with my daughter, speaking Welsh with the family – that's been really important.\"Pritchard admits that support network could be a decisive factor in whether he continues.\"If I can continue to train this way then, yeah, definitely LA can be on the cards. But if it's something I can't continue, then I'm happy with finishing after China,\" he explained.\"Having that balance has been huge for me. It's not just about medals – it's about being able to live life at home, with family, and still perform at the highest level. If that's possible for another cycle, then it makes the decision a lot easier.\"",
        "Benjamin Pritchard won gold at the 2024 Paris Paralympics and became European champion in May 2025",
        "Paralympic champion Benjamin Pritchard says victory at the World Rowing Championships in Shanghai would complete the \"top trump card\" of major titles after a record-breaking season.",
        "The 33-year-old Welshman became European champion for the first time in May, setting world records twice in three days in the PR1 men's single sculls in Plovdiv, Bulgaria.",
        "Pritchard posted 8min 47.88sec in his heat before lowering that to 8:40.38 in the final to secure gold.",
        "\"I'd have the European Championships, the Paralympic championships, and hopefully the World Championships, but it's never a done deal,\" he told BBC Sport Wales.",
        "\"I missed a lot of mid-season racing due to illness and injury, and I've watched my competitors go fast. It's always daunting when you don't know whether you've fallen behind or whether you're still there.\"",
        "Pritchard begins his campaign in the heats at 03:25 BST on Monday, with the event running from 21 to 28 September.",
        "Changes to the World Championships schedule mean fewer opportunities to find form.",
        "\"It's pretty ruthless,\" Pritchard admitted. \"I'll only have a heat and a final, so you've got to get it right on the first race of the day, and then hopefully you can learn from that and put it right in the final.\"",
        "He added: \"The PR1 field has really moved on. Six of us now have gone sub-nine minutes, that's a whole 'A' final, and four of those have gone sub-8:50. To be in with the medals you're going to have to be there or thereabouts.\"",
        "Pritchard believes the level of competition is raising the bar for everyone.",
        "\"If you're being pushed from behind, then hopefully you can break barriers and set new world records and move the sport on again,\" he said.",
        "\"That's what I find fascinating about the PR1 field – it's continually moving. It's pretty special to see how fast the competitors are going, and I'm glad to play a small part in driving those standards forward.\"",
        "World record 'pretty surreal' for Pritchard",
        "Pritchard wins Euros gold with another world record",
        "With Paris 2024 already behind him, thoughts inevitably turn to the Los Angeles Paralympics in 2028.",
        "\"It's still the million dollar question,\" said Pritchard. \"Let's get Shanghai out of the way and then have a proper discussion with British Rowing.\"",
        "This year has seen a different approach for the Welshman, who has been based much closer to home.",
        "\"British Rowing and UK Sport have allowed me the flexibility to train from Wales, so I've been doing a lot of my training on the River Tawe and in Swansea. Being at home, speaking Welsh with my daughter, speaking Welsh with the family – that's been really important.\"",
        "Pritchard admits that support network could be a decisive factor in whether he continues.",
        "\"If I can continue to train this way then, yeah, definitely LA can be on the cards. But if it's something I can't continue, then I'm happy with finishing after China,\" he explained.",
        "\"Having that balance has been huge for me. It's not just about medals – it's about being able to live life at home, with family, and still perform at the highest level. If that's possible for another cycle, then it makes the decision a lot easier.\""
      ]
    },
    {
      "url": "https://www.bbc.com/sport/rowing/articles/cy8rrnlgdrdo",
      "main_category": "sport",
      "detailed_category": "rowing",
      "topic": "Women’s quad lead way as GB boats progress at Worlds",
      "content": [
        "Defending champions Great Britain eased into the final of the women’s quadruple sculls at the World Championships by winning their heat on the first day of competition in Shanghai.Hannah Scott and Lola Anderson returned to the boat that took gold in Belgrade two years ago and then went on to win the Olympic title in Paris last year.They’ve been joined by Becky Wilde and Sarah McKay.It was a good start to the competition for Great Britain with the men’s quad sculls and men‘s and women’s pair also progressing to the next stage of their respective boat classes.",
        "Illness and injury this season meant the heat was the first time this new GB quartet had sculled together in competition.However, despite the new combination, it looked like training had gone extremely well as Scott, Anderson, Wilde and McKay edged ahead at the halfway point, along with Romania.Wilde, who won bronze at the Olympics in the double sculls, has moved into the stroke seat in the quad, while McKay is a newcomer to the GB squad and with the experience of Scott and Anderson in the middle of the boat, they moved away from Romania in the final quarter of the race to win by half a length.",
        "“It was a little bit like business as usual,” said Scott.“But it’s only the heat and you just want to get through the rounds and that’s what we did.“We executed the race plan we wanted to and looking ahead we have a very exciting platform to keep developing.“This was Scott’s first race since the Olympic final almost 14 months ago.“I feel very free at the moment with just rowing and racing because I’m having such a short season, this being my first race, and in a weird way I’m just seeing what happens and going with it.“Actually I watched all of Kate O’Connor‘s heptathlon last night at the world athletics and it was very nice to see a fellow Northern Irish woman doing so well on the world stage and just enjoying herself and setting personal bests which is really cool.“I took that into the heat today, I was just like well there’s no pressure, it’s just about enjoying it.”At the Olympics in Paris the final was a race for the ages with GB overcoming the Netherlands on the very final stroke to win gold.Thursday‘s final could see a repeat battle for the world title as the Dutch won the second heat.",
        "The GB men’s quad - Cedol Dafydd, Callum Dixon, Matthew Haywood and Rory Harris - have had a superb season becoming European champions and winning the World Cup in Lucerne and they continued that form, dominating the second half of their heat to take their place in Tuesday’s semi-finals.Ireland’s Ronan Byrne, Brian Colsh, Adam Murphy and Andrew Sheehan failed to qualify.It is a new combination in the women‘s pair for Great Britain and Lizzie Witt and Jade Lindo acquitted themselves well, coming third in their heat behind Serbia and Chile but fast enough to claim one of the six fastest-loser places in the semi-finals.Lindo was introduced to rowing through the Discover Your Gold talent ID programme and soon joined the GB Start pathway at Twickenham Boat Club. Witt was inspired to take up the sport when she went to see the 2012 Olympics at Eton Dorney. This is her first season of full-time rowing.Ireland’s Emily Hegarty and Aoife Casey failed to progress.In the men’s pair, James Vogel and Harry Geffen stormed off the start and were leading with 250m to go.The Leander club duo were then caught by the experienced Spanish pair of Jaime Canalejo and Javier Garcia, along with Sweden.Third place meant an anxious wait but they too progressed into Tuesday’s semi-finals as one of the quickest non-automatic qualifiers.The County Fermanagh pair of Ross Corrigan and Nathan Timoney, representing Ireland, made it through as an automatic qualifier after finishing second behind Romania in their heat.This was their first race since the Olympic final in Paris where they finished sixth but they are the defending bronze medallists from the World Championships two years ago.",
        "Becky Wilder, Lola Anderson, Hannah Scott and Sarah McKay won their heat to progress to the World Championships final",
        "Defending champions Great Britain eased into the final of the women’s quadruple sculls at the World Championships by winning their heat on the first day of competition in Shanghai.",
        "Hannah Scott and Lola Anderson returned to the boat that took gold in Belgrade two years ago and then went on to win the Olympic title in Paris last year.",
        "They’ve been joined by Becky Wilde and Sarah McKay.",
        "It was a good start to the competition for Great Britain with the men’s quad sculls and men‘s and women’s pair also progressing to the next stage of their respective boat classes.",
        "Illness and injury this season meant the heat was the first time this new GB quartet had sculled together in competition.",
        "However, despite the new combination, it looked like training had gone extremely well as Scott, Anderson, Wilde and McKay edged ahead at the halfway point, along with Romania.",
        "Wilde, who won bronze at the Olympics in the double sculls, has moved into the stroke seat in the quad, while McKay is a newcomer to the GB squad and with the experience of Scott and Anderson in the middle of the boat, they moved away from Romania in the final quarter of the race to win by half a length.",
        "“It was a little bit like business as usual,” said Scott.",
        "“But it’s only the heat and you just want to get through the rounds and that’s what we did.",
        "“We executed the race plan we wanted to and looking ahead we have a very exciting platform to keep developing.“",
        "This was Scott’s first race since the Olympic final almost 14 months ago.",
        "“I feel very free at the moment with just rowing and racing because I’m having such a short season, this being my first race, and in a weird way I’m just seeing what happens and going with it.",
        "“Actually I watched all of Kate O’Connor‘s heptathlon last night at the world athletics and it was very nice to see a fellow Northern Irish woman doing so well on the world stage and just enjoying herself and setting personal bests which is really cool.",
        "“I took that into the heat today, I was just like well there’s no pressure, it’s just about enjoying it.”",
        "At the Olympics in Paris the final was a race for the ages with GB overcoming the Netherlands on the very final stroke to win gold.",
        "Thursday‘s final could see a repeat battle for the world title as the Dutch won the second heat.",
        "Scott 'struggled to get out of bed' with health issue",
        "The GB men’s quad - Cedol Dafydd, Callum Dixon, Matthew Haywood and Rory Harris - have had a superb season becoming European champions and winning the World Cup in Lucerne and they continued that form, dominating the second half of their heat to take their place in Tuesday’s semi-finals.",
        "Ireland’s Ronan Byrne, Brian Colsh, Adam Murphy and Andrew Sheehan failed to qualify.",
        "It is a new combination in the women‘s pair for Great Britain and Lizzie Witt and Jade Lindo acquitted themselves well, coming third in their heat behind Serbia and Chile but fast enough to claim one of the six fastest-loser places in the semi-finals.",
        "Lindo was introduced to rowing through the Discover Your Gold talent ID programme and soon joined the GB Start pathway at Twickenham Boat Club. Witt was inspired to take up the sport when she went to see the 2012 Olympics at Eton Dorney. This is her first season of full-time rowing.",
        "Ireland’s Emily Hegarty and Aoife Casey failed to progress.",
        "In the men’s pair, James Vogel and Harry Geffen stormed off the start and were leading with 250m to go.",
        "The Leander club duo were then caught by the experienced Spanish pair of Jaime Canalejo and Javier Garcia, along with Sweden.",
        "Third place meant an anxious wait but they too progressed into Tuesday’s semi-finals as one of the quickest non-automatic qualifiers.",
        "The County Fermanagh pair of Ross Corrigan and Nathan Timoney, representing Ireland, made it through as an automatic qualifier after finishing second behind Romania in their heat.",
        "This was their first race since the Olympic final in Paris where they finished sixth but they are the defending bronze medallists from the World Championships two years ago."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/olympics/articles/c3rv82927q8o",
      "main_category": "sport",
      "detailed_category": "rowing",
      "topic": "NHS rejection leads Doyle back to World Championships",
      "content": [
        "Olympic medallists Philip Doyle and Fintan McCarthy have joined forces to form an exciting men's double scull for Ireland that will make its debut at the World Championships in Shanghai on Sunday.With no lightweight rowing in the Olympic programme for Los Angeles, McCarthy, who won gold in Tokyo with Paul O'Donovan and then defended the title in Paris last year, has had to put on a few pounds in order to continue his career.After re-committing himself to the sport after taking bronze in the double sculls final in Paris with Daire Lynch, Doyle had to prove himself all over again to claim the seat behind McCarthy.\"I applied to go into the training programme with the NHS, to work and to push forward towards my consultancy in emergency medicine, which I've been working for this year,\" explained Doyle, who has alternated between training to be a doctor and his rowing for several years.\"When I heard that I wasn't accepted into the training programme, that's when the decision to go back to rowing was made abundantly clear.\"I'm just doing some local emergency contract work in the hospital as much as I can and then trying to get ready for Shanghai.\"",
        "While Doyle was deciding on his immediate future, McCarthy and Belfast's Konan Pazzaia were racing and winning bronze together at the European Championships.However, for the World Championships which take place from 21-28 September, everyone, Olympic medallist or not, had to trial for the seats in the top Irish boat.\"I think the reason I'm back is because I think the motivation is still there,\" Doyle added.\"I thought if I go and do this trial and it doesn't really matter where I am, then that's a sign to go and I found I was as competitive as ever.\"It mattered more than ever because you were an Olympic medallist coming in to try and establish where you were among the ranking of athletes.\"So it actually mattered more this year and the motivation is still there, which sort of helped me with that decision making process.\"Doing well at the world championships it's important for a number of reasons, none more so than it secures continued funding from Sport Ireland which is performance based.So, there was much at stake at the Irish trials.\"It was a formidable field to come back into. I was at the back of the pack at the start, and I had to slowly crawl my way towards that top end,\" Doyle explained.\"Konan was part of the mix and along with Fintan and myself, the three of us were going at it for three days in a row.\"It was nail biting stuff towards the end, really pushing hard. It was grit and determination, and I think just a little bit of experience in the boat class of the double that sort of won out the day for Fintan and myself.\"Now there is a real opportunity for Doyle and McCarthy to become world champions.Doyle has two world medals, but neither is gold.\"I think the potential in the boat is huge going forward now. The day of the trial, it was our second time in a boat together ever, but it seemed to go very well.\"Gold medals are very hard to come by, especially in heavyweight men's rowing but I think now we can confidently say that our target is a medal.\"Gold would be the dream.\"Pazzaia will row in the men's single sculls while Paris Olympic finalists from County Fermanagh, Ross Corrigan and Nathan Timoney, reunite in the men's pair.",
        "Fintan McCarthy and Philip Doyle will represent Ireland at the World Championships",
        "Olympic medallists Philip Doyle and Fintan McCarthy have joined forces to form an exciting men's double scull for Ireland that will make its debut at the World Championships in Shanghai on Sunday.",
        "With no lightweight rowing in the Olympic programme for Los Angeles, McCarthy, who won gold in Tokyo with Paul O'Donovan and then defended the title in Paris last year, has had to put on a few pounds in order to continue his career.",
        "After re-committing himself to the sport after taking bronze in the double sculls final in Paris with Daire Lynch, Doyle had to prove himself all over again to claim the seat behind McCarthy.",
        "\"I applied to go into the training programme with the NHS, to work and to push forward towards my consultancy in emergency medicine, which I've been working for this year,\" explained Doyle, who has alternated between training to be a doctor and his rowing for several years.",
        "\"When I heard that I wasn't accepted into the training programme, that's when the decision to go back to rowing was made abundantly clear.",
        "\"I'm just doing some local emergency contract work in the hospital as much as I can and then trying to get ready for Shanghai.\"",
        "While Doyle was deciding on his immediate future, McCarthy and Belfast's Konan Pazzaia were racing and winning bronze together at the European Championships.",
        "However, for the World Championships which take place from 21-28 September, everyone, Olympic medallist or not, had to trial for the seats in the top Irish boat.",
        "\"I think the reason I'm back is because I think the motivation is still there,\" Doyle added.",
        "\"I thought if I go and do this trial and it doesn't really matter where I am, then that's a sign to go and I found I was as competitive as ever.",
        "\"It mattered more than ever because you were an Olympic medallist coming in to try and establish where you were among the ranking of athletes.",
        "\"So it actually mattered more this year and the motivation is still there, which sort of helped me with that decision making process.\"",
        "Doing well at the world championships it's important for a number of reasons, none more so than it secures continued funding from Sport Ireland which is performance based.",
        "So, there was much at stake at the Irish trials.",
        "\"It was a formidable field to come back into. I was at the back of the pack at the start, and I had to slowly crawl my way towards that top end,\" Doyle explained.",
        "\"Konan was part of the mix and along with Fintan and myself, the three of us were going at it for three days in a row.",
        "\"It was nail biting stuff towards the end, really pushing hard. It was grit and determination, and I think just a little bit of experience in the boat class of the double that sort of won out the day for Fintan and myself.\"",
        "Now there is a real opportunity for Doyle and McCarthy to become world champions.",
        "Doyle has two world medals, but neither is gold.",
        "\"I think the potential in the boat is huge going forward now. The day of the trial, it was our second time in a boat together ever, but it seemed to go very well.",
        "\"Gold medals are very hard to come by, especially in heavyweight men's rowing but I think now we can confidently say that our target is a medal.",
        "\"Gold would be the dream.\"",
        "Pazzaia will row in the men's single sculls while Paris Olympic finalists from County Fermanagh, Ross Corrigan and Nathan Timoney, reunite in the men's pair."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/rowing/articles/c2dn03lk2wko",
      "main_category": "sport",
      "detailed_category": "rowing",
      "topic": "From university fresher to World Championships",
      "content": [
        "Cedol Dafydd had never come across rowing while growing up in north Wales. But after first picking up an oar as a university fresher, the 24-year-old is now preparing to represent Great Britain in the men's quadruple sculls at the World Rowing Championships in Shanghai (21-28 September).His journey began almost by accident. Arriving at the University of Bath as a first-year student, Dafydd wandered past the rowing club stand at a freshers' fair and decided to give it a try.\"It was a complete chance decision,\" said Dafydd. \"The people were welcoming, and it looked like something different. Before I knew it, I'd fallen in love with the sport.\"Growing up in north Wales, Dafydd played rugby for Bangor RFC and tried his hand at a variety of sports. He was a talented runner and competed internationally at World Youth Cups and home internationals in long-distance events. Rowing, however, was never on the radar.\"I'd always been sporty,\" he said. \"I swam, I ran, I played rugby – I pretty much had a go at anything going. \"But I'd never dreamed of rowing internationally. There just wasn't really the opportunity in north Wales.\"",
        "Within just a few years, Dafydd had gone from novice to international. He pulled on a GB vest at development level in Germany and the Netherlands before making the step up to the senior squad.\"Looking back, it feels like a whirlwind,\" he added. \"I never expected things to happen this fast.\"\"By the end of my first year at Bath, I'd had an international vest at development level,\" he explained. \"That was my first taste of international rowing before stepping into senior selection the following year.\"He admits his path into the sport was anything but planned. \"To say that I'd dreamt of this since I was a kid would actually be a lie,\" said Dafydd. \"It kind of came out of nowhere – I just happened to be in the gym at the same time as my coach, Dan Harris, and met him by chance.\"The lifestyle change was immediate. \"My housemates were getting home from nights out just as I was getting up to go to training,\" Dafydd laughed. \"We were living completely different lives under the same roof. To see it paying off now, I think they're probably happy for me – even if they won't admit it.\"",
        "Dafydd now sits in the bow seat of the men's quadruple sculls, responsible for steering as well as rhythm and balance. He will line up alongside Callum Dixon, Matthew Haywood and Rory Harris as the British crew aim to challenge for medals.The heats get under way in Shanghai on Sunday, 21 September at 04:15 BST, with Britain hoping to lay down an early marker.\"We've probably put a bit of a target on our backs with the results we've had this year,\" he said. \"But that's the motivation. Shanghai will be the biggest test yet – and we're ready for it.\"And he makes no secret of his ambition. \"I'd be lying if I said I'd be happy with anything but a win,\" said Dafydd.\"Obviously I'm proud just to be there, my first Worlds and all that, but a win is definitely within reach – and it's what we're going there for.\"",
        "With just two more World Championships between now and the next Olympic Games, Dafydd sees Shanghai as a vital stepping stone.\"LA feels far away, but in racing terms it's not,\" he said. \"After this World Champs we'll have two more, and then it's an Olympic year. If we can set a marker now, it will give us the standard to build on over the next four years.\"",
        "This video can not be played",
        "From Bangor rugby fields to World Championships",
        "Cedol Dafydd had never come across rowing while growing up in north Wales.",
        "But after first picking up an oar as a university fresher, the 24-year-old is now preparing to represent Great Britain in the men's quadruple sculls at the World Rowing Championships in Shanghai (21-28 September).",
        "His journey began almost by accident. Arriving at the University of Bath as a first-year student, Dafydd wandered past the rowing club stand at a freshers' fair and decided to give it a try.",
        "\"It was a complete chance decision,\" said Dafydd. \"The people were welcoming, and it looked like something different. Before I knew it, I'd fallen in love with the sport.\"",
        "Growing up in north Wales, Dafydd played rugby for Bangor RFC and tried his hand at a variety of sports. He was a talented runner and competed internationally at World Youth Cups and home internationals in long-distance events. Rowing, however, was never on the radar.",
        "\"I'd always been sporty,\" he said. \"I swam, I ran, I played rugby – I pretty much had a go at anything going.",
        "\"But I'd never dreamed of rowing internationally. There just wasn't really the opportunity in north Wales.\"",
        "Within just a few years, Dafydd had gone from novice to international. He pulled on a GB vest at development level in Germany and the Netherlands before making the step up to the senior squad.",
        "\"Looking back, it feels like a whirlwind,\" he added. \"I never expected things to happen this fast.\"",
        "\"By the end of my first year at Bath, I'd had an international vest at development level,\" he explained. \"That was my first taste of international rowing before stepping into senior selection the following year.\"",
        "He admits his path into the sport was anything but planned. \"To say that I'd dreamt of this since I was a kid would actually be a lie,\" said Dafydd.",
        "\"It kind of came out of nowhere – I just happened to be in the gym at the same time as my coach, Dan Harris, and met him by chance.\"",
        "The lifestyle change was immediate. \"My housemates were getting home from nights out just as I was getting up to go to training,\" Dafydd laughed.",
        "\"We were living completely different lives under the same roof. To see it paying off now, I think they're probably happy for me – even if they won't admit it.\"",
        "Cedol Dafydd helped Great Britain secure the 2025 World Rowing Cup overall title after winning gold with the men's quadruple sculls in Lucerne, Switzerland.",
        "Dafydd now sits in the bow seat of the men's quadruple sculls, responsible for steering as well as rhythm and balance.",
        "He will line up alongside Callum Dixon, Matthew Haywood and Rory Harris as the British crew aim to challenge for medals.",
        "The heats get under way in Shanghai on Sunday, 21 September at 04:15 BST, with Britain hoping to lay down an early marker.",
        "\"We've probably put a bit of a target on our backs with the results we've had this year,\" he said. \"But that's the motivation. Shanghai will be the biggest test yet – and we're ready for it.\"",
        "And he makes no secret of his ambition. \"I'd be lying if I said I'd be happy with anything but a win,\" said Dafydd.",
        "\"Obviously I'm proud just to be there, my first Worlds and all that, but a win is definitely within reach – and it's what we're going there for.\"",
        "With just two more World Championships between now and the next Olympic Games, Dafydd sees Shanghai as a vital stepping stone.",
        "\"LA feels far away, but in racing terms it's not,\" he said.",
        "\"After this World Champs we'll have two more, and then it's an Olympic year. If we can set a marker now, it will give us the standard to build on over the next four years.\""
      ]
    },
    {
      "url": "https://www.bbc.com/sport/olympics/articles/c931g712wkvo",
      "main_category": "sport",
      "detailed_category": "rowing",
      "topic": "Scott 'struggled to get out of bed' with health issue",
      "content": [
        "Olympic champion Hannah Scott says she is targeting a gold medal at this week's World Rowing Championships after health issues delayed her return to the boat.Scott, who has not competed since winning quadruple sculls gold for Great Britain at last year's Paris Games, returns in Sunday's Worlds heats (04:03 BST) in Shanghai alongside Becky Wilde, Lola Anderson and Sarah McKay.While the Coleraine native had planned to return to racing earlier this year, she was forced to take more time out because of PoTS (postural tachycardia syndrome), which she was diagnosed with in the build-up to the Olympics. PoTS is a condition that causes quick heart rate increases after getting up from sitting or lying down, with symptoms including dizziness or light-headedness, fainting, noticeable heartbeats, chest pain and shortness of breath.\"I got it in Olympic year which people don't know, and I kept that very quiet because it was incredibly stressful at the time,\" said 26-year-old Scott.\"They [the doctors] think it is post-Covid related and basically when I'd stand up, blood flow wouldn't go to my head. It just wouldn't go upward through my body.\"",
        "Scott added: \"It attacks my immune system and my nervous system and I can't pump blood around my body. It took us a while to figure out what was wrong with me, I had to go to numerous doctors and found one that said 'you've got PoTS'.\"From that, I had to do a lot of lying down exercise, a lot of lying on the floor on a bike, which looked crazy, and slowly getting my body to work for me again and get blood flowing around my body and it took a couple of months to come out of that.\"I got out of it and went on to Paris, it took me until March that year. I look back and I'm quite proud of myself for it because a lot of people maybe would have bottled it under that and thought 'I'm so ill, I can't do this', but that was part of me compartmentalising and blocking out the parts I needed to block out. Having achieved a lifelong dream by becoming an Olympic champion, Scott struggled with PoTS again earlier this year.\"It makes you feel like your body doesn't work for you. Your health is your main concern, not rowing a boat,\" added Scott. \"I was wondering if I could do my day-to-day because I was struggling to get out of bed with fatigue and that's a really concerning place to be.\"But a lot of it I think is also part of female health and PoTS is a very common problem now post-Covid for women, and I've been learning this along the way.\"",
        "In Scott's words, she climbed her \"Everest\" at last year's Olympics. After taking time away to celebrate and recuperate, she made the decision to return to the sport with the target of the Los Angeles Olympics in 2028.Finding the reason and willpower to go again proved challenging at first, but now Scott believes she is ready to tackle another Olympic cycle. \"Bringing it back to base camp again, that's maybe the thing I was dealing with earlier in the year of just trying to find that motivation again and where's that coming from?\"I actually do feel like I have found it, and I found it through the love of the sport again.\"This time, when I'm climbing the mountain the second time, I have a bit more of a guide of where I want to go and how to get there and that's one of the reasons that did bring me back because I think I learned so much through that cycle from Tokyo to Paris that I could make fewer mistakes again and it didn't turn out badly in Paris.\"I just want to enjoy it and see what happens this time because I still feel like there's a little bit more to come from me.\"",
        "Scott won the quad sculls world title when it was last held in Belgrade two years ago alongside Lola Anderson, Georgie Brayshaw and Lauren Henry - and that quartet stayed together for last year's Olympic win.Only Anderson returns to the boat alongside Scott for these championships with Olympic double sculls bronze medallist Becky Wilde and newcomer Sarah McKay forming a new look quad.While Scott admits she will be \"nervous\" on the start line with a new look line-up, the targets don't change.\"I think we're trying to target to win it I think to make the final would be kind of beneath where we've been,\" she added.\"Obviously, you don't know what happens but just because it's a new crew doesn't mean that we're not ready to go after it at Worlds.\"I have the experience, Lola has the experience and so does Becky and then Sarah as well, we have the capability to do it.\"",
        "Hannah Scott will defend her title at the World Rowing Championships in Shanghai",
        "Olympic champion Hannah Scott says she is targeting a gold medal at this week's World Rowing Championships after health issues delayed her return to the boat.",
        "Scott, who has not competed since winning quadruple sculls gold for Great Britain at last year's Paris Games, returns in Sunday's Worlds heats (04:03 BST) in Shanghai alongside Becky Wilde, Lola Anderson and Sarah McKay.",
        "While the Coleraine native had planned to return to racing earlier this year, she was forced to take more time out because of PoTS (postural tachycardia syndrome), which she was diagnosed with in the build-up to the Olympics.",
        "PoTS is a condition that causes quick heart rate increases after getting up from sitting or lying down, with symptoms including dizziness or light-headedness, fainting, noticeable heartbeats, chest pain and shortness of breath.",
        "\"I got it in Olympic year which people don't know, and I kept that very quiet because it was incredibly stressful at the time,\" said 26-year-old Scott.",
        "\"They [the doctors] think it is post-Covid related and basically when I'd stand up, blood flow wouldn't go to my head. It just wouldn't go upward through my body.\"",
        "One year on - what's it like being an Olympic champion?",
        "Scott targets Olympic gold again in Los Angeles",
        "Scott added: \"It attacks my immune system and my nervous system and I can't pump blood around my body. It took us a while to figure out what was wrong with me, I had to go to numerous doctors and found one that said 'you've got PoTS'.",
        "\"From that, I had to do a lot of lying down exercise, a lot of lying on the floor on a bike, which looked crazy, and slowly getting my body to work for me again and get blood flowing around my body and it took a couple of months to come out of that.",
        "\"I got out of it and went on to Paris, it took me until March that year. I look back and I'm quite proud of myself for it because a lot of people maybe would have bottled it under that and thought 'I'm so ill, I can't do this', but that was part of me compartmentalising and blocking out the parts I needed to block out.",
        "Having achieved a lifelong dream by becoming an Olympic champion, Scott struggled with PoTS again earlier this year.",
        "\"It makes you feel like your body doesn't work for you. Your health is your main concern, not rowing a boat,\" added Scott.",
        "\"I was wondering if I could do my day-to-day because I was struggling to get out of bed with fatigue and that's a really concerning place to be.",
        "\"But a lot of it I think is also part of female health and PoTS is a very common problem now post-Covid for women, and I've been learning this along the way.\"",
        "In Scott's words, she climbed her \"Everest\" at last year's Olympics.",
        "After taking time away to celebrate and recuperate, she made the decision to return to the sport with the target of the Los Angeles Olympics in 2028.",
        "Finding the reason and willpower to go again proved challenging at first, but now Scott believes she is ready to tackle another Olympic cycle.",
        "\"Bringing it back to base camp again, that's maybe the thing I was dealing with earlier in the year of just trying to find that motivation again and where's that coming from?",
        "\"I actually do feel like I have found it, and I found it through the love of the sport again.",
        "\"This time, when I'm climbing the mountain the second time, I have a bit more of a guide of where I want to go and how to get there and that's one of the reasons that did bring me back because I think I learned so much through that cycle from Tokyo to Paris that I could make fewer mistakes again and it didn't turn out badly in Paris.",
        "\"I just want to enjoy it and see what happens this time because I still feel like there's a little bit more to come from me.\"",
        "Becky Wilde, Lola Anderson, Hannah Scott and Sarah McKay will represent GB at world championships",
        "Scott won the quad sculls world title when it was last held in Belgrade two years ago alongside Lola Anderson, Georgie Brayshaw and Lauren Henry - and that quartet stayed together for last year's Olympic win.",
        "Only Anderson returns to the boat alongside Scott for these championships with Olympic double sculls bronze medallist Becky Wilde and newcomer Sarah McKay forming a new look quad.",
        "While Scott admits she will be \"nervous\" on the start line with a new look line-up, the targets don't change.",
        "\"I think we're trying to target to win it I think to make the final would be kind of beneath where we've been,\" she added.",
        "\"Obviously, you don't know what happens but just because it's a new crew doesn't mean that we're not ready to go after it at Worlds.",
        "\"I have the experience, Lola has the experience and so does Becky and then Sarah as well, we have the capability to do it.\""
      ]
    },
    {
      "url": "https://www.bbc.com/sport/rowing/articles/cx207r2rd3yo",
      "main_category": "sport",
      "detailed_category": "rowing",
      "topic": "Fuller focused on retaining GB's world title",
      "content": [
        "Paralympic champion Ed Fuller says he is relishing the challenge of defending the world PR3 mixed coxed fours world title. The 22-year-old from Exeter was part of the British crew who retained their Paralympic title in Paris last year and won gold at the World Rowing Championships in Belgrade, Serbia, in 2023.Great Britain has won every Paralympic and world gold medal in the event since 2012 and Fuller is confident the crew can extend that run in Shanghai, China, later this month.\"I think everyone's in a good place,\" he told BBC Radio Devon.\"We've got a full team of returning Paralympic medallists from Paris so I think we should hopefully be able to carry on with the momentum that we gathered throughout the last cycle and hit the ground running for this cycle.\"For Fuller, competing in China will be a first having never travelled outside of Europe before.He is looking forward to experiencing a new culture, but says it has involved the crew adding some new features to their training. \"Rowing is basically almost always done on small European rowing lakes with short haul one or two-hour flights,\" he said.\"So a 13-hour flight to China and a massive time difference, and also the climate as well.\"We've been doing quite a lot of heat adaptation and basically just training in a really, really, warm, humid environment to try and get your body ready for the climate over there so that you can perform at your best and be prepared for it.\"And while the world title is the focus right now, Fuller is aware that it is an early test for Great Britain as they start their journey towards the next Paralympic Games in Los Angeles in 2028.\"It builds throughout the cycle, and every year the World Champs is the main one until the Games year,\" said Fuller.\"If you zoom out on the bigger picture, everything is building towards that one race coming up in three years time.\"",
        "Ed Fuller (left) and his teammates Josh O'Brien, Giedre Rakauskaite and Francesca Allen won Paralympic gold in Paris last year",
        "Paralympic champion Ed Fuller says he is relishing the challenge of defending the world PR3 mixed coxed fours world title.",
        "The 22-year-old from Exeter was part of the British crew who retained their Paralympic title in Paris last year and won gold at the World Rowing Championships in Belgrade, Serbia, in 2023.",
        "Great Britain has won every Paralympic and world gold medal in the event since 2012 and Fuller is confident the crew can extend that run in Shanghai, China, later this month.",
        "\"I think everyone's in a good place,\" he told BBC Radio Devon.",
        "\"We've got a full team of returning Paralympic medallists from Paris so I think we should hopefully be able to carry on with the momentum that we gathered throughout the last cycle and hit the ground running for this cycle.\"",
        "For Fuller, competing in China will be a first having never travelled outside of Europe before.",
        "He is looking forward to experiencing a new culture, but says it has involved the crew adding some new features to their training.",
        "\"Rowing is basically almost always done on small European rowing lakes with short haul one or two-hour flights,\" he said.",
        "\"So a 13-hour flight to China and a massive time difference, and also the climate as well.",
        "\"We've been doing quite a lot of heat adaptation and basically just training in a really, really, warm, humid environment to try and get your body ready for the climate over there so that you can perform at your best and be prepared for it.\"",
        "And while the world title is the focus right now, Fuller is aware that it is an early test for Great Britain as they start their journey towards the next Paralympic Games in Los Angeles in 2028.",
        "\"It builds throughout the cycle, and every year the World Champs is the main one until the Games year,\" said Fuller.",
        "\"If you zoom out on the bigger picture, everything is building towards that one race coming up in three years time.\""
      ]
    }
  ]
}