{
  "scraped_at": "2025-10-27T18:56:59.761546",
  "total_articles": 23,
  "category": "athletics",
  "articles_per_category": 100,
  "articles": [
    {
      "url": "https://www.bbc.com/sport/athletics/articles/cx2l8890k78o",
      "main_category": "sport",
      "detailed_category": "athletics",
      "topic": "Marathon record holder Chepngetich given three-year ban",
      "content": [
        "Women's marathon world record-holder Ruth Chepngetich has been banned for three years after the Kenyan admitted to anti-doping rule violations.Chepngetich was provisionally suspended in July following a positive test for Hydrochlorothiazide (HCTZ) - a banned diuretic used commonly as a masking agent - on 14 March.Chepngetich's achievements which pre-date that sample - including her world record time of two hours, nine minutes and 56 seconds in Chicago in October 2024 - will still stand.The Athletics Integrity Unit (AIU) had sought a four-year ban but the 31-year-old's punishment was reduced to three years because she admitted to the violations.However, the AIU will continue to investigate evidence from Chepngetich's phone which it found indicate \"a reasonable suspicion that her positive test may have been intentional\" - including messages dating back to 2022.Brett Clothier, head of the AIU, said: \"The case regarding the positive test for HCTZ has been resolved, but the AIU will continue to investigate the suspicious material recovered from Chepngetich's phone to determine if any other violations have occurred.\"",
        "When interviewed in April by the AIU, Chepngetich, the first woman to run a marathon in under 2:10, could not provide an explanation for the positive test.While HCTZ has a minimum reporting level of 20 nanograms per millilitre (ng/mL) in urine, Chepngetich's sample showed an estimated concentration of 3,800 ng/mL.Traces of HCTZ below the minimal reporting level were also identified in a sample collected from Chepngetich two weeks earlier, on 28 February.At a later interview on 11 July, Chepngetich was presented with the aforementioned suspicious evidence acquired from her phone. In the meantime, contamination had also been disproven by the AIU.Chepngetich changed her explanation on 31 July, claiming that she had taken her housemaid's medication - marked as being HCTZ - after becoming ill two days before the positive test.The AIU had \"serious reservations about the credibility of the new version of events\" and, in the context of the sport's anti-doping rules, such \"recklessness\" is considered \"indirect intent, for which an increased four-year sanction applies\". An automatic one-year reduction was applied after Chepngetich admitted the anti-doping rule violations within the 20 days required.The three-year ban commenced on 19 April - when Chepngetich accepted a voluntary provisional suspension - with the athlete's results, awards, titles, appearance and prize money since 14 March forfeited.AIU chair David Howman said the case underlined that \"nobody is above the rules\".\"While disappointing for those who put their trust in this athlete, this is how the system is supposed to work,\" Howman said.\"The road-running industry should be commended for collectively funding anti-doping efforts capable of uncovering doping violations committed by elite athletes in their events.\"",
        "Ruth Chepngetich surpassed Ethiopian Tigst Assefa's previous women's marathon world record by nearly two minutes at the Chicago Marathon in 2024",
        "Women's marathon world record-holder Ruth Chepngetich has been banned for three years after the Kenyan admitted to anti-doping rule violations.",
        "Chepngetich was provisionally suspended in July following a positive test for Hydrochlorothiazide (HCTZ) - a banned diuretic used commonly as a masking agent - on 14 March.",
        "Chepngetich's achievements which pre-date that sample - including her world record time of two hours, nine minutes and 56 seconds in Chicago in October 2024 - will still stand.",
        "The Athletics Integrity Unit (AIU) had sought a four-year ban but the 31-year-old's punishment was reduced to three years because she admitted to the violations.",
        "However, the AIU will continue to investigate evidence from Chepngetich's phone which it found indicate \"a reasonable suspicion that her positive test may have been intentional\" - including messages dating back to 2022.",
        "Brett Clothier, head of the AIU, said: \"The case regarding the positive test for HCTZ has been resolved, but the AIU will continue to investigate the suspicious material recovered from Chepngetich's phone to determine if any other violations have occurred.\"",
        "When interviewed in April by the AIU, Chepngetich, the first woman to run a marathon in under 2:10, could not provide an explanation for the positive test.",
        "While HCTZ has a minimum reporting level of 20 nanograms per millilitre (ng/mL) in urine, Chepngetich's sample showed an estimated concentration of 3,800 ng/mL.",
        "Traces of HCTZ below the minimal reporting level were also identified in a sample collected from Chepngetich two weeks earlier, on 28 February.",
        "At a later interview on 11 July, Chepngetich was presented with the aforementioned suspicious evidence acquired from her phone. In the meantime, contamination had also been disproven by the AIU.",
        "Chepngetich changed her explanation on 31 July, claiming that she had taken her housemaid's medication - marked as being HCTZ - after becoming ill two days before the positive test.",
        "The AIU had \"serious reservations about the credibility of the new version of events\" and, in the context of the sport's anti-doping rules, such \"recklessness\" is considered \"indirect intent, for which an increased four-year sanction applies\".",
        "An automatic one-year reduction was applied after Chepngetich admitted the anti-doping rule violations within the 20 days required.",
        "The three-year ban commenced on 19 April - when Chepngetich accepted a voluntary provisional suspension - with the athlete's results, awards, titles, appearance and prize money since 14 March forfeited.",
        "AIU chair David Howman said the case underlined that \"nobody is above the rules\".",
        "\"While disappointing for those who put their trust in this athlete, this is how the system is supposed to work,\" Howman said.",
        "\"The road-running industry should be commended for collectively funding anti-doping efforts capable of uncovering doping violations committed by elite athletes in their events.\""
      ]
    },
    {
      "url": "https://www.bbc.com/sport/athletics/articles/cwynevl2wndo",
      "main_category": "sport",
      "detailed_category": "athletics",
      "topic": "UK Athletics in profit for first time in eight years",
      "content": [
        "UK Athletics has reported a surplus for the first time since 2017, two years after facing the threat of bankruptcy.The governing body announced a record annual loss of £3.7m in 2023 but has implemented strict measures to deliver a surplus of £107,588.UK Athletics (UKA) introduced tighter cost controls and restructured internally - reducing staff numbers from 72 to 62 - and \"reducing support for some programmes\".UKA also struck a \"groundbreaking\" deal with the organisers of the London Marathon and Great North Run in 2024 to help it tackle financial crises.\"I am very pleased that we are back in profit - it's an important moment for UK Athletics and a real sign that the steps we have taken over the past two years are working,\" UKA chair Ian Beattie said.\"But I don't underestimate how difficult it has been to get back to this position. It has taken hard decisions, careful management and the commitment of a great many people to turn things around.\"The organisation has gone through a period of real change. We have had to make savings across every area, including redundancies and reduced support for some programmes outside the World Class Performance system.\"Those decisions were extremely tough and never taken lightly, but they were necessary to secure the long-term stability of the sport. We are a leaner organisation now - more streamlined and more focused on the essentials and the right culture - but we are also a stronger one as a result.\"",
        "UK Athletics was awarded £150,000 by UK Sport to host the Diamond League meeting in 2024",
        "UK Athletics has reported a surplus for the first time since 2017, two years after facing the threat of bankruptcy.",
        "The governing body announced a record annual loss of £3.7m in 2023 but has implemented strict measures to deliver a surplus of £107,588.",
        "UK Athletics (UKA) introduced tighter cost controls and restructured internally - reducing staff numbers from 72 to 62 - and \"reducing support for some programmes\".",
        "UKA also struck a \"groundbreaking\" deal with the organisers of the London Marathon and Great North Run in 2024 to help it tackle financial crises.",
        "\"I am very pleased that we are back in profit - it's an important moment for UK Athletics and a real sign that the steps we have taken over the past two years are working,\" UKA chair Ian Beattie said.",
        "\"But I don't underestimate how difficult it has been to get back to this position. It has taken hard decisions, careful management and the commitment of a great many people to turn things around.",
        "\"The organisation has gone through a period of real change. We have had to make savings across every area, including redundancies and reduced support for some programmes outside the World Class Performance system.",
        "\"Those decisions were extremely tough and never taken lightly, but they were necessary to secure the long-term stability of the sport. We are a leaner organisation now - more streamlined and more focused on the essentials and the right culture - but we are also a stronger one as a result.\""
      ]
    },
    {
      "url": "https://www.bbc.com/sport/athletics/articles/cd67qvz8401o",
      "main_category": "sport",
      "detailed_category": "athletics",
      "topic": "Ex-Olympic coach in court over child sex offences",
      "content": [
        "Former British Olympic athletics coach Jose Vicente Leiva-Modahl has appeared in court after being accused of child sex offences. Leiva-Modahl, 65 - who was previously married to former Olympic middle-distance runner Diane Modahl - is facing 19 separate charges including sexual assault of a child, rape and controlling and coercive behaviour.Leiva-Modahl, who is also known as Vicente Modahl, appeared from custody at Manchester Magistrates' Court on Tuesday for a 15-minute hearing in which no pleas were indicated.District judge Richard Jepson sent the case to Manchester Crown Court, telling Leiva-Modahl that some of the allegations were too serious to be dealt with at the magistrates' court.Leiva-Modahl was granted conditional bail ahead of a plea and trial preparation hearing on 18 November.Among his bail conditions were to reside at an address in the Warrington area, to abide by an electronic monitoring curfew from 21:00 to 07:00 and not to contact witnesses in the case.He was also ordered to surrender his Spanish passport and not to have any unsupervised contact with anyone under the age of 18.Leiva-Modahl has been suspended by governing body UK Athletics, the court also heard.",
        "Jose Vicente Leiva-Modahl coached his ex-wife to Commonwealth Games success",
        "Former British Olympic athletics coach Jose Vicente Leiva-Modahl has appeared in court after being accused of child sex offences.",
        "Leiva-Modahl, 65 - who was previously married to former Olympic middle-distance runner Diane Modahl - is facing 19 separate charges including sexual assault of a child, rape and controlling and coercive behaviour.",
        "Leiva-Modahl, who is also known as Vicente Modahl, appeared from custody at Manchester Magistrates' Court on Tuesday for a 15-minute hearing in which no pleas were indicated.",
        "District judge Richard Jepson sent the case to Manchester Crown Court, telling Leiva-Modahl that some of the allegations were too serious to be dealt with at the magistrates' court.",
        "Leiva-Modahl was granted conditional bail ahead of a plea and trial preparation hearing on 18 November.",
        "Among his bail conditions were to reside at an address in the Warrington area, to abide by an electronic monitoring curfew from 21:00 to 07:00 and not to contact witnesses in the case.",
        "He was also ordered to surrender his Spanish passport and not to have any unsupervised contact with anyone under the age of 18.",
        "Leiva-Modahl has been suspended by governing body UK Athletics, the court also heard."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/athletics/articles/cy858nqqxwqo",
      "main_category": "sport",
      "detailed_category": "athletics",
      "topic": "Serena Williams crowns Hodgkinson after 800m win",
      "content": [
        "Keely Hodgkinson ended her 800m season with victory at the all-female Athlos meet in New York on Friday evening.The Olympic champion, who won bronze at the World Championships last month, cruised to an impressive win in one minute 56.53 seconds in what was only her sixth race in a season blighted by a hamstring injury.Fellow Briton and world silver medallist Georgia Hunter Bell was second again in 1:58.33, while St Vincent's Shafiqua Maloney (1:58.57) was third.\"I've barely raced this season so it was probably less of a struggle for me to go out there and want to give it something,\" said Hodgkinson, 23.\"The atmosphere out there is crazy so it was really, really fun.\"The women-only meet packed Icahn Stadium in its second year, bringing a party atmosphere to traditional track, with live music and Tiffany & Co. crowns replacing traditional winners' medals.The 23-times tennis major winner Serena Williams, who is married to Athlos founder Alexis Ohanian, was on hand to present the winners with their crowns.Last year's winners took home $60,000 (£44,603) - one of the largest prize purses in athletics.The event also attracted some of the sport's biggest names, as Kenya's three-time Olympic 1500m champion Faith Kipyegon won the mile, crossing the finish line in four minutes 17.78 seconds.American Brittany Brown, the 200m bronze medallist from last year's Paris Olympics, won the 100m and 200m double.",
        "Hodgkinson ran her personal best time of 1:54.61 in London last year",
        "Keely Hodgkinson ended her 800m season with victory at the all-female Athlos meet in New York on Friday evening.",
        "The Olympic champion, who won bronze at the World Championships last month, cruised to an impressive win in one minute 56.53 seconds in what was only her sixth race in a season blighted by a hamstring injury.",
        "Fellow Briton and world silver medallist Georgia Hunter Bell was second again in 1:58.33, while St Vincent's Shafiqua Maloney (1:58.57) was third.",
        "\"I've barely raced this season so it was probably less of a struggle for me to go out there and want to give it something,\" said Hodgkinson, 23.",
        "\"The atmosphere out there is crazy so it was really, really fun.\"",
        "The women-only meet packed Icahn Stadium in its second year, bringing a party atmosphere to traditional track, with live music and Tiffany & Co. crowns replacing traditional winners' medals.",
        "The 23-times tennis major winner Serena Williams, who is married to Athlos founder Alexis Ohanian, was on hand to present the winners with their crowns.",
        "Last year's winners took home $60,000 (£44,603) - one of the largest prize purses in athletics.",
        "The event also attracted some of the sport's biggest names, as Kenya's three-time Olympic 1500m champion Faith Kipyegon won the mile, crossing the finish line in four minutes 17.78 seconds.",
        "American Brittany Brown, the 200m bronze medallist from last year's Paris Olympics, won the 100m and 200m double.",
        "Bol switches to 800m and Hodgkinson 'can't wait'"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/athletics/articles/cvgj2w488jdo",
      "main_category": "sport",
      "detailed_category": "athletics",
      "topic": "Bol switches to 800m and Hodgkinson 'can't wait'",
      "content": [
        "Two-time 400m hurdles world champion Femke Bol has announced she will switch events and compete in the 800m from next year.Dutch superstar Bol, 25, who successfully defended her world title in Tokyo in September, has also won bronze medals at the past two Olympics in that discipline.She has also been a world indoor champion in the flat 400m and is a renowned relay athlete, a gold medallist anchor leg runner with the Netherlands' 4x400m team at Paris 2024.In 2026, she will move up in distance to an event in which Great Britain's Keely Hodgkinson is the reigning Olympic champion.Bol said in a post on Instagram:, external \"It's a big change, it's uncertain and challenging, but I'm ready to put in the work, surrounded by an amazing team and enjoy this new journey.\"Hodgkinson replied to the post, saying: \"Can't wait to share the start line.\"",
        "Bol and Sydney McLaughlin-Levrone have dominated the women's 400m hurdles in recent years.Between them, they have run the nine fastest times in the history of the event.American McLaughlin-Levrone won Olympic gold ahead of third-placed Bol at Tokyo 2020 and Paris 2024, while Bol has won each of the past five Diamond League annual titles.McLaughlin-Levrone recently switched to a new event herself, winning World Championship gold in the women's 400m in Tokyo.",
        "This video can not be played",
        "Netherlands' Bol takes gold in 400m hurdles",
        "Two-time 400m hurdles world champion Femke Bol has announced she will switch events and compete in the 800m from next year.",
        "Dutch superstar Bol, 25, who successfully defended her world title in Tokyo in September, has also won bronze medals at the past two Olympics in that discipline.",
        "She has also been a world indoor champion in the flat 400m and is a renowned relay athlete, a gold medallist anchor leg runner with the Netherlands' 4x400m team at Paris 2024.",
        "In 2026, she will move up in distance to an event in which Great Britain's Keely Hodgkinson is the reigning Olympic champion.",
        "Bol said in a post on Instagram:, external \"It's a big change, it's uncertain and challenging, but I'm ready to put in the work, surrounded by an amazing team and enjoy this new journey.\"",
        "Hodgkinson replied to the post, saying: \"Can't wait to share the start line.\"",
        "Bol and Sydney McLaughlin-Levrone have dominated the women's 400m hurdles in recent years.",
        "Between them, they have run the nine fastest times in the history of the event.",
        "American McLaughlin-Levrone won Olympic gold ahead of third-placed Bol at Tokyo 2020 and Paris 2024, while Bol has won each of the past five Diamond League annual titles.",
        "McLaughlin-Levrone recently switched to a new event herself, winning World Championship gold in the women's 400m in Tokyo."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/articles/c5yg13j7jmxo",
      "main_category": "sport",
      "detailed_category": "athletics",
      "topic": "How sprinter Levitt turned groceries to gold",
      "content": [
        "A day job as a grocery-slinging speedster helped Victoria Levitt become a world champion sprinter, she says.The 29-year-old Tesco worker, who prides herself on just how quick she is in the click and collect department, won T44 100m gold at the World Para-athletics Championships in New Delhi earlier this month.Her stunning debut on the international stage also saw the Nottinghamshire runner collect silver in the 200m event.Levitt said stepping on to the global stage to race – something she previously thought impossible – was both the \"scariest and most wonderful thing\" to ever happen to her.\"I never went to the championships expecting to win anything. I just wanted to put together two really good runs,\" she told BBC East Midlands Today.\"To come away with medals and to be a world champion was a complete shock.\"To be able to stand on a podium in first place and hear the anthem was just the proudest moment of my life.\"It was just the most beautiful experience. I just couldn't stop crying.\"",
        "Just a week after conquering the world in her sport, Levitt is back home in Mansfield and eager to get back to work - not just on the track with local running club Mansfield Harriers, but also the Christmas rush at Tesco and her other part-time job in administration at a disability charity.Her breakout success in India, plans for the Commonwealth Games next year and the prospect of Los Angeles Paralympic Games in 2028 are no reasons for her to stop doing the other things she \"loves and enjoys\".\"My authentic self on the track is the Vicky that works at Tesco, the Vicky who is the administrator and the Vicky who trains like crazy,\" she said.\"It's because of that work and it's because of that job that I'm able to do what I can do.\"Levitt says she previously \"tried the full-time athlete thing\" but got bored in the process.It was at that point the runner, originally from Dudley, who studied prosthetics and orthotics at university before working in that field, decided to juggle a number of part-time jobs.Tesco was meant to be a \"temp job\" over just one festive period. But she found the job helped fuel her competitive spirit.\"As part of click and collect, you have pickers in store,\" she explained to BBC Radio Nottingham.\"So we have a pick rate that we have to achieve - a target - and it's fair to say that I repeatedly go over that target quite a lot. We did have a league table and my name used to be there quite a lot at the top.\"At the time my colleagues didn't know that I was a sprinter, only the management did. I pulled them to the side and said, 'Look, you know, I have a little bit of an unfair advantage with this because of being a sprinter'. So I asked if it was possible to take me off the league table because it's not fair.\"While she knew she was quick \"on the trolleys\", she \"didn't think much\" of her chances of qualifying for the World Championships.\"When I got the selection through, I was like, 'Oh dear, I probably need to prepare',\" she laughed.\"The heat training was probably harder than the training itself. Being stuck in a sauna at 40C for 70 minutes on a bike doing speed sessions was dreadful.\"It was all just such a surreal experience.\"The world-beating effort that Levitt produced in India was the high point in her meteoric rise as a disability athlete.She only took up sprinting seriously after a run of injuries - which included stretching a nerve in her ankle while competing in martial arts and a suffering a leg cut on a trail run - left her with permanent nerve damage in her leg.At every step of her recovery and transformation into an elite athlete, be it while working at Tesco or on the track, the runner says she has done it the \"Victoria Levitt way\".\"Every person's gold medal is different,\" Levitt said.\"My gold medal is a gold medal but climbing the stairs independently might be someone's gold medal, doing a Couch to 5k could be someone's gold medal - again, it goes back to that message of 'do it your way'.\"Interviews conducted by BBC East Midlands Natalie Jackson and BBC Radio Nottingham's David Jackson.",
        "This video can not be played",
        "Victoria Levitt: British sprinter shocked World Para-athletics Championships success",
        "A day job as a grocery-slinging speedster helped Victoria Levitt become a world champion sprinter, she says.",
        "The 29-year-old Tesco worker, who prides herself on just how quick she is in the click and collect department, won T44 100m gold at the World Para-athletics Championships in New Delhi earlier this month.",
        "Her stunning debut on the international stage also saw the Nottinghamshire runner collect silver in the 200m event.",
        "Levitt said stepping on to the global stage to race – something she previously thought impossible – was both the \"scariest and most wonderful thing\" to ever happen to her.",
        "\"I never went to the championships expecting to win anything. I just wanted to put together two really good runs,\" she told BBC East Midlands Today.",
        "\"To come away with medals and to be a world champion was a complete shock.",
        "\"To be able to stand on a podium in first place and hear the anthem was just the proudest moment of my life.",
        "\"It was just the most beautiful experience. I just couldn't stop crying.\"",
        "Victoria Levitt won her T44 100m gold medal with a time of 13.22secs",
        "Just a week after conquering the world in her sport, Levitt is back home in Mansfield and eager to get back to work - not just on the track with local running club Mansfield Harriers, but also the Christmas rush at Tesco and her other part-time job in administration at a disability charity.",
        "Her breakout success in India, plans for the Commonwealth Games next year and the prospect of Los Angeles Paralympic Games in 2028 are no reasons for her to stop doing the other things she \"loves and enjoys\".",
        "\"My authentic self on the track is the Vicky that works at Tesco, the Vicky who is the administrator and the Vicky who trains like crazy,\" she said.",
        "\"It's because of that work and it's because of that job that I'm able to do what I can do.\"",
        "Levitt says she previously \"tried the full-time athlete thing\" but got bored in the process.",
        "It was at that point the runner, originally from Dudley, who studied prosthetics and orthotics at university before working in that field, decided to juggle a number of part-time jobs.",
        "Tesco was meant to be a \"temp job\" over just one festive period. But she found the job helped fuel her competitive spirit.",
        "\"As part of click and collect, you have pickers in store,\" she explained to BBC Radio Nottingham.",
        "\"So we have a pick rate that we have to achieve - a target - and it's fair to say that I repeatedly go over that target quite a lot. We did have a league table and my name used to be there quite a lot at the top.",
        "\"At the time my colleagues didn't know that I was a sprinter, only the management did. I pulled them to the side and said, 'Look, you know, I have a little bit of an unfair advantage with this because of being a sprinter'. So I asked if it was possible to take me off the league table because it's not fair.\"",
        "While she knew she was quick \"on the trolleys\", she \"didn't think much\" of her chances of qualifying for the World Championships.",
        "\"When I got the selection through, I was like, 'Oh dear, I probably need to prepare',\" she laughed.",
        "\"The heat training was probably harder than the training itself. Being stuck in a sauna at 40C for 70 minutes on a bike doing speed sessions was dreadful.",
        "\"It was all just such a surreal experience.\"",
        "The world-beating effort that Levitt produced in India was the high point in her meteoric rise as a disability athlete.",
        "She only took up sprinting seriously after a run of injuries - which included stretching a nerve in her ankle while competing in martial arts and a suffering a leg cut on a trail run - left her with permanent nerve damage in her leg.",
        "At every step of her recovery and transformation into an elite athlete, be it while working at Tesco or on the track, the runner says she has done it the \"Victoria Levitt way\".",
        "\"Every person's gold medal is different,\" Levitt said.",
        "\"My gold medal is a gold medal but climbing the stairs independently might be someone's gold medal, doing a Couch to 5k could be someone's gold medal - again, it goes back to that message of 'do it your way'.\"",
        "Interviews conducted by BBC East Midlands Natalie Jackson and BBC Radio Nottingham's David Jackson."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/athletics/articles/c4gvyeezd17o",
      "main_category": "sport",
      "detailed_category": "athletics",
      "topic": "Kebinatshipi targets 400m world record after Tokyo gold",
      "content": [
        "Collen Kebinatshipi has set his sights on breaking Wayde van Niekerk's 400m world record after being crowned world champion last month.The 21-year-old from Botswana ran the 10th-fastest time in history when he clocked 43.53 seconds to win gold in Tokyo.South African Van Niekerk's record of 43.03s has stood since he won Olympic gold at the 2016 Games in Rio de Janeiro.\"Records are meant to be broken,\" Kebinatshipi told Newsday on the BBC World Service.\"If I stay focused, if I stay injury free, everything is possible.\"I was very, very happy about the performance. [Running] 43.5 at my age is something else.\"Kebinatshipi's victory saw him become the first man from his country to land a world title, following in the footsteps of Amantle Montsho, who won the women's 400m in Daegu in 2011.However, he says his performance in Japan came as a surprise, having narrowly missed out on the Olympic final at Paris 2024.\"Honestly, my goal was to go there (Tokyo) and reach the final only because [I] missed the final at the Olympics.\"This was my motivation.\"Looking at my age, I didn't have any pressure of competing for a medal.\"I was just planning to start competing for a medal at the 2028 Olympics. So, things came early.\"",
        "Kebinatshipi underlined his talents when he ran a personal best – and a world lead time - of 43.61s in the semi-finals.His compatriots Lee Bhekempilo Eppi and Bayapo Ndori also made it through to the  400m final, but Kebinatshipi was comfortable knowing that the attention would be on him.\"Coming [in] to the final, everyone knew that I was the favourite,\" he said.\"I didn't want to disappoint my coach. I didn't want to change any race plans that I used on the semis.\"I applied the same strategy and I knew if I do the same thing I did on the semis, I'm going to get a gold.\"And, after sealing top spot on the podium, Kebinatshipi celebrated with push-ups inside a soggy National Stadium to pay homage to compatriot Isaac Makwala, who was part of the Botswana relay team which won 4x400m bronze at the delayed Tokyo 2020 Olympics.Makwala famously first performed push-ups on a rainy track to prove his fitness after having to compete solo in the 200m heats at the 2017 World Championships, having controversially been denied his place in the 400m final after a norovirus outbreak in London.\"Honestly, I was really exhausted but I kept my promise to my role model Isaac,\" said Kebinatshipi.\"I told him 'If I win this race, I'm going to dedicate this celebration to you' because he used to do the celebration during his time.\"The little energy that was left, I used it for the push-ups.\"",
        "And it proved to be a doubly memorable trip to Japan for Kebinatshipi, who secured his second gold medal when he ran the anchor leg in Botswana's successful 4x400m relay.The team, which included Eppi, Ndori and 200m Olympic champion Letsile Tebogo, beat the United States and South Africa by just seven hundredths of a second in wet conditions.\"The team was really relying on me at that moment because I was the fastest,\" Kebinatshipi said.\"And after winning the flat race they trusted me so much. I went to that final with a lot of motivation, with the positive vibes.\"The relays have provided rich pickings for Botswana in recent years, with the country's men securing 4x400m gold at the World Athletics Relays last year and then silver at Paris 2024.The team were celebrated on their return to Gaborone, with a public holiday declared to mark their victory.\"It's amazing. Everyone was happy,\" Kebinatshipi said.\"Now, going forward, it shows that my life is changing.\"I still have to focus because this was just a start of what will happen in the next 10 years, looking at my age.\"",
        "Collen Kebinatshipi became the first man from Botswana to win gold at the World Athletics Championships when he triumphed in Tokyo last month",
        "Collen Kebinatshipi has set his sights on breaking Wayde van Niekerk's 400m world record after being crowned world champion last month.",
        "The 21-year-old from Botswana ran the 10th-fastest time in history when he clocked 43.53 seconds to win gold in Tokyo.",
        "South African Van Niekerk's record of 43.03s has stood since he won Olympic gold at the 2016 Games in Rio de Janeiro.",
        "\"Records are meant to be broken,\" Kebinatshipi told Newsday on the BBC World Service.",
        "\"If I stay focused, if I stay injury free, everything is possible.",
        "\"I was very, very happy about the performance. [Running] 43.5 at my age is something else.\"",
        "Kebinatshipi's victory saw him become the first man from his country to land a world title, following in the footsteps of Amantle Montsho, who won the women's 400m in Daegu in 2011.",
        "However, he says his performance in Japan came as a surprise, having narrowly missed out on the Olympic final at Paris 2024.",
        "\"Honestly, my goal was to go there (Tokyo) and reach the final only because [I] missed the final at the Olympics.",
        "\"This was my motivation.",
        "\"Looking at my age, I didn't have any pressure of competing for a medal.",
        "\"I was just planning to start competing for a medal at the 2028 Olympics. So, things came early.\"",
        "Kebinatshipi performed push-ups on the Tokyo track immediately after his 400m victory",
        "Kebinatshipi underlined his talents when he ran a personal best – and a world lead time - of 43.61s in the semi-finals.",
        "His compatriots Lee Bhekempilo Eppi and Bayapo Ndori also made it through to the  400m final, but Kebinatshipi was comfortable knowing that the attention would be on him.",
        "\"Coming [in] to the final, everyone knew that I was the favourite,\" he said.",
        "\"I didn't want to disappoint my coach. I didn't want to change any race plans that I used on the semis.",
        "\"I applied the same strategy and I knew if I do the same thing I did on the semis, I'm going to get a gold.\"",
        "And, after sealing top spot on the podium, Kebinatshipi celebrated with push-ups inside a soggy National Stadium to pay homage to compatriot Isaac Makwala, who was part of the Botswana relay team which won 4x400m bronze at the delayed Tokyo 2020 Olympics.",
        "Makwala famously first performed push-ups on a rainy track to prove his fitness after having to compete solo in the 200m heats at the 2017 World Championships, having controversially been denied his place in the 400m final after a norovirus outbreak in London.",
        "\"Honestly, I was really exhausted but I kept my promise to my role model Isaac,\" said Kebinatshipi.",
        "\"I told him 'If I win this race, I'm going to dedicate this celebration to you' because he used to do the celebration during his time.",
        "\"The little energy that was left, I used it for the push-ups.\"",
        "Kebinatshipi and his 4x400m relay team-mates were celebrated on their return to Botswana with a national holiday declared",
        "And it proved to be a doubly memorable trip to Japan for Kebinatshipi, who secured his second gold medal when he ran the anchor leg in Botswana's successful 4x400m relay.",
        "The team, which included Eppi, Ndori and 200m Olympic champion Letsile Tebogo, beat the United States and South Africa by just seven hundredths of a second in wet conditions.",
        "\"The team was really relying on me at that moment because I was the fastest,\" Kebinatshipi said.",
        "\"And after winning the flat race they trusted me so much. I went to that final with a lot of motivation, with the positive vibes.\"",
        "The relays have provided rich pickings for Botswana in recent years, with the country's men securing 4x400m gold at the World Athletics Relays last year and then silver at Paris 2024.",
        "The team were celebrated on their return to Gaborone, with a public holiday declared to mark their victory.",
        "\"It's amazing. Everyone was happy,\" Kebinatshipi said.",
        "\"Now, going forward, it shows that my life is changing.",
        "\"I still have to focus because this was just a start of what will happen in the next 10 years, looking at my age.\""
      ]
    },
    {
      "url": "https://www.bbc.com/sport/articles/c89dnly2y9ko",
      "main_category": "sport",
      "detailed_category": "athletics",
      "topic": "Cockroft wins third gold as Pembroke defends title",
      "content": [
        "Hannah Cockroft and Dan Pembroke both added to their lengthy list of world titles on a successful day for the Great Britain team at the World Para Athletics Championships in New Delhi. Cockroft, 30, secured her third gold medal at these championships - and her 19th world title overall - as she won the women's T34 800m ahead of British team-mate Kare Adenegan, who won silver.\"On every start line I go 'I don't know how I'm going to get round this' but once I'm going and all in it went to plan,\" Cockroft told BBC Sport.\"I don't know how long this will last, how long I will be able to do this. I am so thankful I can get out there and do what I love.\"I am looking forward to a quieter year now and relaxing a bit because it's been a full-on 18 months.\"Pembroke, 34, claimed a third consecutive world title in the men's F13 javelin with a best throw of 68.51m despite coming into the event under-prepared due to injury.\"Four weeks ago I suffered a hip abductor tear in my right leg, which is not the best thing for a javelin thrower as it basically makes your run-up redundant,\" Pembroke said.\"I haven't thrown for four-and-a-half weeks since coming out here so I've had to rely on trying to visualise it.\"There was also a silver medal for Britain's Jonathan Broom-Edwards in the men's T64 high jump, and bronzess for Michael Jenkins (F38), Anna Nicholson (F35) and Lydia Church (F12) in the shot put. With just one day of the championships remaining, Britain extended their total tally of medals to 23, including six golds.",
        "Nine-time Paralympic champion Cockroft completed a hat-trick of gold medals in New Delhi after following up her victories in the 100m and 400m with a fifth world title at 800m. She won in a championship-record time of one minute 49.88 seconds, while Adenegan, 24, finished in a season's best 2:03.91 to claim her third silver medal of the championships. Paralympic champion and world record holder Pembroke threw more than five metres further than the rest of the field in the F13 javelin - for athletes with a visual impairment - with his best of 68.51m coming on his final attempt. Three-time former world champion Broom-Edwards, 37, had to settle for silver this time behind Uzbekistan's Temurbek Giyazov in the men's T64 high jump, with his final effort of 2.00m just 3cm below the gold-medal jump. Michael Jenkins, 20, completed a hat-trick of bronze medals for the British team in the shot put. The European record holder's throw of 18.84m in the men's F38 final saw him finish behind Colombian Levin Moreno Denis and his compatriot Jose Lemos Rivas, who finished with silver. In the morning session, Nicholson, 30, the team's co-captain, finished third in the women's F35 category - for those with a co-ordination impairment - with a personal best throw of 9.58m. It was the Gateshead Harrier's first medal at the Worlds, having previously finished fourth at the 2019 championships, and followed her bronze at the 2024 Paralympics in Paris.Church, 25, managed a throw of 12.6m in the F12 event - for visually impaired athletes - to clinch her first medal on the world stage, having previously claimed silver at the 2021 European Championships.",
        "Golds for Hannah Cockroft and Dan Pembroke helped move Great Britain up to seventh place in the medal table",
        "Hannah Cockroft and Dan Pembroke both added to their lengthy list of world titles on a successful day for the Great Britain team at the World Para Athletics Championships in New Delhi.",
        "Cockroft, 30, secured her third gold medal at these championships - and her 19th world title overall - as she won the women's T34 800m ahead of British team-mate Kare Adenegan, who won silver.",
        "\"On every start line I go 'I don't know how I'm going to get round this' but once I'm going and all in it went to plan,\" Cockroft told BBC Sport.",
        "\"I don't know how long this will last, how long I will be able to do this. I am so thankful I can get out there and do what I love.",
        "\"I am looking forward to a quieter year now and relaxing a bit because it's been a full-on 18 months.\"",
        "Pembroke, 34, claimed a third consecutive world title in the men's F13 javelin with a best throw of 68.51m despite coming into the event under-prepared due to injury.",
        "\"Four weeks ago I suffered a hip abductor tear in my right leg, which is not the best thing for a javelin thrower as it basically makes your run-up redundant,\" Pembroke said.",
        "\"I haven't thrown for four-and-a-half weeks since coming out here so I've had to rely on trying to visualise it.\"",
        "There was also a silver medal for Britain's Jonathan Broom-Edwards in the men's T64 high jump, and bronzess for Michael Jenkins (F38), Anna Nicholson (F35) and Lydia Church (F12) in the shot put.",
        "With just one day of the championships remaining, Britain extended their total tally of medals to 23, including six golds.",
        "Britain's Cockroft wins second gold at Worlds",
        "The Paralympic champion brewing beer for gold goal",
        "Britain's Oduwaiye & Greaves claim Worlds bronzes",
        "Nine-time Paralympic champion Cockroft completed a hat-trick of gold medals in New Delhi after following up her victories in the 100m and 400m with a fifth world title at 800m.",
        "She won in a championship-record time of one minute 49.88 seconds, while Adenegan, 24, finished in a season's best 2:03.91 to claim her third silver medal of the championships.",
        "Paralympic champion and world record holder Pembroke threw more than five metres further than the rest of the field in the F13 javelin - for athletes with a visual impairment - with his best of 68.51m coming on his final attempt.",
        "Three-time former world champion Broom-Edwards, 37, had to settle for silver this time behind Uzbekistan's Temurbek Giyazov in the men's T64 high jump, with his final effort of 2.00m just 3cm below the gold-medal jump.",
        "Michael Jenkins, 20, completed a hat-trick of bronze medals for the British team in the shot put.",
        "The European record holder's throw of 18.84m in the men's F38 final saw him finish behind Colombian Levin Moreno Denis and his compatriot Jose Lemos Rivas, who finished with silver.",
        "In the morning session, Nicholson, 30, the team's co-captain, finished third in the women's F35 category - for those with a co-ordination impairment - with a personal best throw of 9.58m.",
        "It was the Gateshead Harrier's first medal at the Worlds, having previously finished fourth at the 2019 championships, and followed her bronze at the 2024 Paralympics in Paris.",
        "Church, 25, managed a throw of 12.6m in the F12 event - for visually impaired athletes - to clinch her first medal on the world stage, having previously claimed silver at the 2021 European Championships.",
        "Anna Nicholson and Lydia Church helped take Britain's medal tally for the championships to 23 - including six gold, four silver and 13 bronze"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/articles/czewkk081epo",
      "main_category": "sport",
      "detailed_category": "athletics",
      "topic": "Davies wins seventh straight world shot put title",
      "content": [
        "Great Britain's Aled Sion Davies secured his seventh consecutive F63 shot put title on the final day of the World Para Athletics Championships in New Delhi.The Welshman, 34, threw a distance of 16.44m in his fifth attempt to finish ahead of Kuwait's Faisal Sorour, who won silver with an effort of 16.28m, and clinch the 11th world title of his career. Brazil's Edenilson Floriani took bronze with a throw of 14.07m.\"It's quite surreal to be honest,\" Davies told BBC Sport.\"Faisal is coming along and he has been pushing me. But I haven't been able to respond to him in the last few years. It feels good to be back but I still feel there's so much more to come.\" Davies had missed out on gold at a fourth consecutive Paralympics last year as Sorour threw 15.31m to win in Paris. F63 is a classification for athletes with a single leg amputation above the knee who use a prosthesis.In recent years, Davies has been hampered by a condition called osteitis pubis, which causes pain and swelling in the groin and has needed surgery, but has vowed to break his own world record at the 2028 Games in Los Angeles. \"After last year's heartbreak, the pain of the last four or five years with my injuries, and finally accepting that I needed to have a few repairs,\" Davies said. \"I had to have a reconstruction of my hip and I was told I might not come back to the standards I was at.\"I've done that. I've come back, rebuilt in the silence and I've come here and competed again.\"I'm building towards LA. I'm going to break my world record.\"Meanwhile, Britain's Victoria Levitt won silver in the T44 200m, the Englishwoman clocking a personal best of 27.46secs as the United States' Annie Carey won gold in 27.31secs.Levitt's team-mate Bebe Jackson finished third but was not awarded bronze as the final was competed by only three athletes - with four being the requirement for  one.Great Britain finish the championships seventh in the medal table with seven golds, five silvers and 13 bronzes.\"It has been a positive experience,\" said Katie Jones, head of Paralympic performance at UK Athletics. \"The athletes have all come together, the team spirit has been fantastic and we have come away with 25 medals. We couldn't have asked for more than that.\"We are at the start of the LA cycle. We have had lots of athletes within the top eight, top four and within medals here. \"Moving on to the 2026 Commonwealth Games in Glasgow and the European Championships will give us the chance to allow new athletes to come in and embed what they have achieved here.\"",
        "Great Britain's Aled Sion Davies has three Paralympic gold medals",
        "Great Britain's Aled Sion Davies secured his seventh consecutive F63 shot put title on the final day of the World Para Athletics Championships in New Delhi.",
        "The Welshman, 34, threw a distance of 16.44m in his fifth attempt to finish ahead of Kuwait's Faisal Sorour, who won silver with an effort of 16.28m, and clinch the 11th world title of his career.",
        "Brazil's Edenilson Floriani took bronze with a throw of 14.07m.",
        "\"It's quite surreal to be honest,\" Davies told BBC Sport.",
        "\"Faisal is coming along and he has been pushing me. But I haven't been able to respond to him in the last few years. It feels good to be back but I still feel there's so much more to come.\"",
        "Davies had missed out on gold at a fourth consecutive Paralympics last year as Sorour threw 15.31m to win in Paris.",
        "F63 is a classification for athletes with a single leg amputation above the knee who use a prosthesis.",
        "In recent years, Davies has been hampered by a condition called osteitis pubis, which causes pain and swelling in the groin and has needed surgery, but has vowed to break his own world record at the 2028 Games in Los Angeles.",
        "\"After last year's heartbreak, the pain of the last four or five years with my injuries, and finally accepting that I needed to have a few repairs,\" Davies said.",
        "\"I had to have a reconstruction of my hip and I was told I might not come back to the standards I was at.",
        "\"I've done that. I've come back, rebuilt in the silence and I've come here and competed again.",
        "\"I'm building towards LA. I'm going to break my world record.\"",
        "Meanwhile, Britain's Victoria Levitt won silver in the T44 200m, the Englishwoman clocking a personal best of 27.46secs as the United States' Annie Carey won gold in 27.31secs.",
        "Levitt's team-mate Bebe Jackson finished third but was not awarded bronze as the final was competed by only three athletes - with four being the requirement for  one.",
        "Great Britain finish the championships seventh in the medal table with seven golds, five silvers and 13 bronzes.",
        "\"It has been a positive experience,\" said Katie Jones, head of Paralympic performance at UK Athletics.",
        "\"The athletes have all come together, the team spirit has been fantastic and we have come away with 25 medals. We couldn't have asked for more than that.",
        "\"We are at the start of the LA cycle. We have had lots of athletes within the top eight, top four and within medals here.",
        "\"Moving on to the 2026 Commonwealth Games in Glasgow and the European Championships will give us the chance to allow new athletes to come in and embed what they have achieved here.\"",
        "Cockroft wins third gold as Pembroke defends title",
        "Britain's Oduwaiye & Greaves claim Worlds bronzes"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/athletics/articles/cg7dm3x3401o",
      "main_category": "sport",
      "detailed_category": "athletics",
      "topic": "Dillu dominates Cardiff Half 2025 with new record",
      "content": [
        "Yismaw Dillu set a new men's record in winning the Cardiff Half Marathon 2025.The 20-year-old Ethiopian crossed the tape in a time of 59 minutes 23 seconds, beating the mark set by Kenya's Leonard Langat in 2019 by seven seconds.Last year's women's winner Miriam Chebet defended her title, the Kenyan knocking five seconds off her 2024 time to finish in 1:06:36. Ethiopia's Alem Nigus was second in 1:07:33, with Ethiopian debutant Wudinesh Alemu third (1:08:08).Leeds native Callum Hall - coached by Welsh great Baroness Tanni Grey-Thompson's husband Ian - won the wheelchair race in 53:46, ahead of Poland's Sam Kolek (57:28) and Josh Hickinbottom (59:07).Dillu dominated the 22nd edition of the the 13.1 mile (21km) race across the Welsh capital, with more than 29,000 places allocated.He finished more than 40 seconds ahead of Kenya's Ismael Kiprono, who was runner-up in 1:00:05, with Dillu's compatriot Fikadu Liche third in 1:00:34.",
        "Men's winner Yismaw Dillu knocked seven seconds off the previous Cardiff Half Marathon record",
        "Yismaw Dillu set a new men's record in winning the Cardiff Half Marathon 2025.",
        "The 20-year-old Ethiopian crossed the tape in a time of 59 minutes 23 seconds, beating the mark set by Kenya's Leonard Langat in 2019 by seven seconds.",
        "Last year's women's winner Miriam Chebet defended her title, the Kenyan knocking five seconds off her 2024 time to finish in 1:06:36.",
        "Ethiopia's Alem Nigus was second in 1:07:33, with Ethiopian debutant Wudinesh Alemu third (1:08:08).",
        "Leeds native Callum Hall - coached by Welsh great Baroness Tanni Grey-Thompson's husband Ian - won the wheelchair race in 53:46, ahead of Poland's Sam Kolek (57:28) and Josh Hickinbottom (59:07).",
        "Dillu dominated the 22nd edition of the the 13.1 mile (21km) race across the Welsh capital, with more than 29,000 places allocated.",
        "He finished more than 40 seconds ahead of Kenya's Ismael Kiprono, who was runner-up in 1:00:05, with Dillu's compatriot Fikadu Liche third in 1:00:34.",
        "Cardiff Half Marathon 2025 - stories behind the strides",
        "Record number to take part in Cardiff Half Marathon"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/articles/c78nynkxyjpo",
      "main_category": "sport",
      "detailed_category": "athletics",
      "topic": "Britain's Oduwaiye & Greaves claim Worlds bronzes",
      "content": [
        "Great Britain's Funmi Oduwaiye won bronze in the F44 shot put and and Dan Greaves did the same in the F44 discus at the World Para Athletics Championships in New Delhi. Oduwaiye, 22, threw a personal best effort of 12.11m with her first throw of the competition.Oduwaiye's five remaining efforts were red flagged as she finished behind China's Yao Juan and the United States' Arelle Middleton.\"There is definitely more to come,\" said Oduwaiye.\"I know I can do a lot more. It's nice to get that appreciation of a bronze medal for now.\"There was definitely another big one [throw] out there but unfortunately, that's how the game is.\"Meanwhile, former Paralympic gold medallist Greaves, 42, managed a throw of 52.42m to finish third behind Colombia's Andres Mosquera Neira and Trinidad and Tobago's Akeem Stewart in the F44 discus.The F44 classification is for field athletes with a lower limb deficiency, leg length difference or impaired range of movement in one leg that affects their balance. Fellow Briton Harrison Walsh was fifth with an effort of 51.49m, while Mel Woods also just missed out on a medal, coming home fourth in the women's 400m T54 final.Great Britain have won 15 medals so far in India, including four golds. It leaves them 13th in the rankings, with Brazil leading the way on 12 golds.",
        "Funmi Oduwaiye (left) finished fifth in the shot put at the 2024 Paralympics",
        "Great Britain's Funmi Oduwaiye won bronze in the F44 shot put and and Dan Greaves did the same in the F44 discus at the World Para Athletics Championships in New Delhi.",
        "Oduwaiye, 22, threw a personal best effort of 12.11m with her first throw of the competition.",
        "Oduwaiye's five remaining efforts were red flagged as she finished behind China's Yao Juan and the United States' Arelle Middleton.",
        "\"There is definitely more to come,\" said Oduwaiye.",
        "\"I know I can do a lot more. It's nice to get that appreciation of a bronze medal for now.",
        "\"There was definitely another big one [throw] out there but unfortunately, that's how the game is.\"",
        "Meanwhile, former Paralympic gold medallist Greaves, 42, managed a throw of 52.42m to finish third behind Colombia's Andres Mosquera Neira and Trinidad and Tobago's Akeem Stewart in the F44 discus.",
        "The F44 classification is for field athletes with a lower limb deficiency, leg length difference or impaired range of movement in one leg that affects their balance.",
        "Fellow Briton Harrison Walsh was fifth with an effort of 51.49m, while Mel Woods also just missed out on a medal, coming home fourth in the women's 400m T54 final.",
        "Great Britain have won 15 medals so far in India, including four golds.",
        "It leaves them 13th in the rankings, with Brazil leading the way on 12 golds."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/articles/cpd9pzxnjyzo",
      "main_category": "sport",
      "detailed_category": "athletics",
      "topic": "Britain's Cockroft wins second gold at Worlds",
      "content": [
        "Great Britain's Hannah Cockroft claimed her second gold medal of the World Para Athletics Championships and the 18th world title of her career by winning the women's T34 100m in New Delhi.The nine-time Paralympic champion won in 17.28 seconds in India, her eighth title in a row in the event.British team-mate Kare Adenegan won silver with a season's best time of 18.08 while China's Lan Hanyu took bronze.\"It's nice to come out and get titles, but I'd like to be going a bit quicker if I'm honest,\" said Cockroft.\"I want those world records and I've not hit them in a couple of years.\"Cockroft, 33, had won gold and set a championship record in the T34 400m on Sunday, with Adenegan also taking silver in that event.There were more GB medals on Wednesday, with Victoria Levitt winning T44 100m gold on her international debut with a time of 13.22 and Bebe Jackson taking the bronze medal in 13.63.Levitt, 29, works two jobs to support her athletics career and will return to her role at a Tesco store in Mansfield during the run up to Christmas.\"It was a complete shock to be honest,\" Levitt told BBC Radio 5 Live.\"When I crossed the line and I didn't see anyone else I was like, 'oh, does this mean I'm first?', then the shock hit my face.\"It will take time to sink in. I'm shell-shocked, I can't believe that's what I've walked away with.\"Great Britain's Melanie Woods won her second medal of the championships, claiming bronze in the women's T54 1500m in three minutes 19.75 seconds.The 31-year-old Scot also won bronze in the T54 800m on Monday - the first time she has won medals at a global games.Five-time Paralympic champion Catherine Debrunner of Switzerland took 1500m gold ahead of China's Zhou Zhaoqian.\"It is daunting lining up on the start line with world record holders, including Catherine, who can go out in front and hold such a strong pace,\" said Woods.\"But you have to hype yourself up and give yourself confidence that you deserve to be on the start line.\"I couldn't be happier with that. It was a great start to the week and just to add to that is a bonus.\"Ndidikama Okoh won bronze in the women's 100m T63 final with a time of 14.66 to earn Great Britain a 13th medal of the championships.",
        "Hannah Cockroft (left) won the 30th major title of her career",
        "Great Britain's Hannah Cockroft claimed her second gold medal of the World Para Athletics Championships and the 18th world title of her career by winning the women's T34 100m in New Delhi.",
        "The nine-time Paralympic champion won in 17.28 seconds in India, her eighth title in a row in the event.",
        "British team-mate Kare Adenegan won silver with a season's best time of 18.08 while China's Lan Hanyu took bronze.",
        "\"It's nice to come out and get titles, but I'd like to be going a bit quicker if I'm honest,\" said Cockroft.",
        "\"I want those world records and I've not hit them in a couple of years.\"",
        "Cockroft, 33, had won gold and set a championship record in the T34 400m on Sunday, with Adenegan also taking silver in that event.",
        "There were more GB medals on Wednesday, with Victoria Levitt winning T44 100m gold on her international debut with a time of 13.22 and Bebe Jackson taking the bronze medal in 13.63.",
        "Levitt, 29, works two jobs to support her athletics career and will return to her role at a Tesco store in Mansfield during the run up to Christmas.",
        "\"It was a complete shock to be honest,\" Levitt told BBC Radio 5 Live.",
        "\"When I crossed the line and I didn't see anyone else I was like, 'oh, does this mean I'm first?', then the shock hit my face.",
        "\"It will take time to sink in. I'm shell-shocked, I can't believe that's what I've walked away with.\"",
        "Great Britain's Melanie Woods won her second medal of the championships, claiming bronze in the women's T54 1500m in three minutes 19.75 seconds.",
        "The 31-year-old Scot also won bronze in the T54 800m on Monday - the first time she has won medals at a global games.",
        "Five-time Paralympic champion Catherine Debrunner of Switzerland took 1500m gold ahead of China's Zhou Zhaoqian.",
        "\"It is daunting lining up on the start line with world record holders, including Catherine, who can go out in front and hold such a strong pace,\" said Woods.",
        "\"But you have to hype yourself up and give yourself confidence that you deserve to be on the start line.",
        "\"I couldn't be happier with that. It was a great start to the week and just to add to that is a bonus.\"",
        "Ndidikama Okoh won bronze in the women's 100m T63 final with a time of 14.66 to earn Great Britain a 13th medal of the championships."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/articles/cwyd2ypdn6vo",
      "main_category": "sport",
      "detailed_category": "athletics",
      "topic": "'What I've dreamed of' - Worlds bronze for Maguire",
      "content": [
        "Great Britain's Nathan Maguire thanked his family for helping him achieve his dream after winning T54 1500m bronze at the World Para Athletics Championships in New Delhi.Maguire overtook Switzerland's Marcel Hug on the final bend and finished behind Chinese pair Jin Hua and Luo Xingchuan.The 28-year-old added to the bronze he won in the T54 800m at the 2024 World Championships in Kobe.\"This is what I've dreamed of for my whole career,\" Maguire told BBC Sport.\"It's always special to be able to do this in front of your family.\"I've never been to a race without my parents with me and I know how much they put into me when I was growing up to get me to this point, so it's a team effort.\"Maguire finished fourth in the T54 400m on Tuesday but has the opportunity to pick up another medal in the 800m event this weekend.Britain's Hannah Taunton missed out on a medal in the women's T20 1500m final as she finished fourth in four minutes 42.95 seconds, seven seconds behind Australia's Annabelle Colman who took bronze.Brazil's Antonia Keyla Da Silva Barros set a world record of 4:19.22 to take gold.Sophie Hahn, a two-time Paralympic champion over 100m, finished eighth for Great Britain in the women's T38 200m final in 27.11, with Colombia's Karen Palomeque taking gold with a world record of 24.98.",
        "Nathan Maguire won silver in the mixed 4x100m relay at the Tokyo 2020 Paralympic Games",
        "Great Britain's Nathan Maguire thanked his family for helping him achieve his dream after winning T54 1500m bronze at the World Para Athletics Championships in New Delhi.",
        "Maguire overtook Switzerland's Marcel Hug on the final bend and finished behind Chinese pair Jin Hua and Luo Xingchuan.",
        "The 28-year-old added to the bronze he won in the T54 800m at the 2024 World Championships in Kobe.",
        "\"This is what I've dreamed of for my whole career,\" Maguire told BBC Sport.",
        "\"It's always special to be able to do this in front of your family.",
        "\"I've never been to a race without my parents with me and I know how much they put into me when I was growing up to get me to this point, so it's a team effort.\"",
        "Maguire finished fourth in the T54 400m on Tuesday but has the opportunity to pick up another medal in the 800m event this weekend.",
        "Britain's Hannah Taunton missed out on a medal in the women's T20 1500m final as she finished fourth in four minutes 42.95 seconds, seven seconds behind Australia's Annabelle Colman who took bronze.",
        "Brazil's Antonia Keyla Da Silva Barros set a world record of 4:19.22 to take gold.",
        "Sophie Hahn, a two-time Paralympic champion over 100m, finished eighth for Great Britain in the women's T38 200m final in 27.11, with Colombia's Karen Palomeque taking gold with a world record of 24.98.",
        "Britain's Cockroft wins second gold at Worlds",
        "Fortune eyes Commonwealths after World Para win"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/athletics/articles/cz9j079njejo",
      "main_category": "sport",
      "detailed_category": "athletics",
      "topic": "Muir's former coach Young banned for three years",
      "content": [
        "Olympic silver medallist Laura Muir has said she has put a \"difficult chapter firmly behind\" her after her former coach Andrew Young was banned for three years for \"serious misconduct\".A UK Athletics disciplinary panel found that Young - who Scotland's Muir stopped working with in 2023 - \"ignored medical advice\" and \"used manipulative and coercive behaviour towards those he coached\".One incident highlighted was when Young, \"following a disagreement, drove at speed with an athlete in his car before abandoning them at the roadside, disregarding their safety and wellbeing\".Other examples included \"requiring an athlete to compete against the clear advice of a physiotherapist, threatening to exclude athletes from training or races if they did not comply with his demands, and emotionally undermining those who raised concerns about injuries\". Young faced 39 charges and, in September 2024, a UKA disciplinary panel found nine of those proven \"wholly or in part\", with seven of them serious.He was then suspended for five years in a ban backdated to April 2023.Young appealed against the ruling and, while an independent panel expressed \"a slightly lesser view of the gravity of the misconduct overall\" in August 2025 and reduced his ban to three years, \"it rejected claims of bias, legal error and unfairness, and it confirmed the misconduct findings in full\".",
        "\"It agreed that seven of the breaches were serious and that revocation of his licence was necessary to protect athletes,\" said UKA.The governing body also said that Young would be required to \"complete training on athlete welfare, injury management and bullying/harassment before a return to coaching could be considered\".Muir, who won a silver medal in the 1,500m at the Olympics in Tokyo in 2021, is now being coached by Laura Weightman, while world indoor silver medallist Jemma Reekie - who had also been coached by Young - is now working with Jon Bigg.\"I have chosen to waive my anonymity and confirm my involvement in this case,\" said Muir. \"I fully support the decisions reached by both independent panels and I am grateful that the process has been followed through so thoroughly. \"I want to thank those who came forward and those who contributed to the process - it has not been easy, but it was necessary.\"Athletics has always been my passion, and I am pleased to say that I have rediscovered the love of my sport and the enjoyment of training and working within a supportive and positive coaching environment. \"I am now focused on the future, looking forward to the next few years of my career, and putting this difficult chapter firmly behind me.\"Canada's Gabriela DeBues-Stafford, who trained under Young from 2019 to 2020, said she had been approached by the investigation three years ago and her testimony related to some of the findings and charges.\"The whole hearing process and its aftermath felt dehumanising and frustrating,\" the 30-year-old wrote on social media.\"I feel grateful to have been able to support my fellow teammates by participating.\"I look forward to providing feedback to UKA and UK Sport on how to better support athletes in future.\"",
        "Laura Muir split with her former coach Andrew Young in 2023",
        "Olympic silver medallist Laura Muir has said she has put a \"difficult chapter firmly behind\" her after her former coach Andrew Young was banned for three years for \"serious misconduct\".",
        "A UK Athletics disciplinary panel found that Young - who Scotland's Muir stopped working with in 2023 - \"ignored medical advice\" and \"used manipulative and coercive behaviour towards those he coached\".",
        "One incident highlighted was when Young, \"following a disagreement, drove at speed with an athlete in his car before abandoning them at the roadside, disregarding their safety and wellbeing\".",
        "Other examples included \"requiring an athlete to compete against the clear advice of a physiotherapist, threatening to exclude athletes from training or races if they did not comply with his demands, and emotionally undermining those who raised concerns about injuries\".",
        "Young faced 39 charges and, in September 2024, a UKA disciplinary panel found nine of those proven \"wholly or in part\", with seven of them serious.",
        "He was then suspended for five years in a ban backdated to April 2023.",
        "Young appealed against the ruling and, while an independent panel expressed \"a slightly lesser view of the gravity of the misconduct overall\" in August 2025 and reduced his ban to three years, \"it rejected claims of bias, legal error and unfairness, and it confirmed the misconduct findings in full\".",
        "\"It agreed that seven of the breaches were serious and that revocation of his licence was necessary to protect athletes,\" said UKA.",
        "The governing body also said that Young would be required to \"complete training on athlete welfare, injury management and bullying/harassment before a return to coaching could be considered\".",
        "Muir, who won a silver medal in the 1,500m at the Olympics in Tokyo in 2021, is now being coached by Laura Weightman, while world indoor silver medallist Jemma Reekie - who had also been coached by Young - is now working with Jon Bigg.",
        "\"I have chosen to waive my anonymity and confirm my involvement in this case,\" said Muir.",
        "\"I fully support the decisions reached by both independent panels and I am grateful that the process has been followed through so thoroughly.",
        "\"I want to thank those who came forward and those who contributed to the process - it has not been easy, but it was necessary.",
        "\"Athletics has always been my passion, and I am pleased to say that I have rediscovered the love of my sport and the enjoyment of training and working within a supportive and positive coaching environment.",
        "\"I am now focused on the future, looking forward to the next few years of my career, and putting this difficult chapter firmly behind me.\"",
        "Canada's Gabriela DeBues-Stafford, who trained under Young from 2019 to 2020, said she had been approached by the investigation three years ago and her testimony related to some of the findings and charges.",
        "\"The whole hearing process and its aftermath felt dehumanising and frustrating,\" the 30-year-old wrote on social media.",
        "\"I feel grateful to have been able to support my fellow teammates by participating.",
        "\"I look forward to providing feedback to UKA and UK Sport on how to better support athletes in future.\""
      ]
    },
    {
      "url": "https://www.bbc.com/sport/athletics/articles/c306938dg3eo",
      "main_category": "sport",
      "detailed_category": "athletics",
      "topic": "'Not on my cards this year' - Arnold wins bronze",
      "content": [
        "Former champion Hollie Arnold said winning a medal was way beyond her expectations after securing a bronze in the women's F46 javelin at the World Para Athletics Championships in New Delhi.The 31-year-old took nine months off after finishing third at the 2024 Paralympics in Paris, but returned to secure an eighth world podium place with a season-best throw of 41.94m.\"It's a real weird mix of emotions. I'm proud, there's upset, there's a million and one things,\" said Arnold, who won this event at the previous six World Championships.\"After Paris mental health came first for me and I just needed to take that time for myself and really understand myself.\"I didn't know if I was going to be here, this was not on my cards this year whatsoever, so to be able have very little training out here, throw pretty consistently well - I'm really proud of myself.\" Arnold led the field in India's capital after the first round of throws, but did not improve on her mark with five subsequent attempts.Noelle Roerda of the Netherlands won the event, with a personal best of 43.74m putting her clear of Uzbekistan's Shahinakhon Yigitalieva.\"It's just been a really messy year, but I've found magic in chaos and I think that's something to very proud of,\" Arnold added.\"I'm not the same person I was in Paris, I'm a very different Hollie and I'm a happy Hollie. To come out here and compete, yeah, I loved it.\"",
        "Along with her six world titles, Hollie Arnold won Paralympic gold in 2016 and bronze at the next two Games",
        "Former champion Hollie Arnold said winning a medal was way beyond her expectations after securing a bronze in the women's F46 javelin at the World Para Athletics Championships in New Delhi.",
        "The 31-year-old took nine months off after finishing third at the 2024 Paralympics in Paris, but returned to secure an eighth world podium place with a season-best throw of 41.94m.",
        "\"It's a real weird mix of emotions. I'm proud, there's upset, there's a million and one things,\" said Arnold, who won this event at the previous six World Championships.",
        "\"After Paris mental health came first for me and I just needed to take that time for myself and really understand myself.",
        "\"I didn't know if I was going to be here, this was not on my cards this year whatsoever, so to be able have very little training out here, throw pretty consistently well - I'm really proud of myself.\"",
        "Arnold led the field in India's capital after the first round of throws, but did not improve on her mark with five subsequent attempts.",
        "Noelle Roerda of the Netherlands won the event, with a personal best of 43.74m putting her clear of Uzbekistan's Shahinakhon Yigitalieva.",
        "\"It's just been a really messy year, but I've found magic in chaos and I think that's something to very proud of,\" Arnold added.",
        "\"I'm not the same person I was in Paris, I'm a very different Hollie and I'm a happy Hollie. To come out here and compete, yeah, I loved it.\""
      ]
    },
    {
      "url": "https://www.bbc.com/sport/athletics/articles/c2dn2ejpe1go",
      "main_category": "sport",
      "detailed_category": "athletics",
      "topic": "Fortune eyes Commonwealths after World Para win",
      "content": [
        "Sabrina Fortune is hoping to compete at the 2026 Commonwealth Games in Glasgow after smashing her own shot put world record at the World Para Athletics Championships.The 28-year-old from Wrexham competes in the F20 category for athletes with intellectual impairments and has dominated her event since taking gold at the 2024 Paris Paralympics.Fortune claimed a fourth consecutive world title with a new world record throw of 16.75m in New Delhi - bettering her own previous mark of 15.75m.With the Los Angeles Paralympics not taking place until 2028, Fortune believes her progress could allow her to compete for Wales against non-disability athletes in Glasgow.\"I want [to throw] 17.07m for mainstream Commonwealths, that's really my next goal,\" she told BBC Radio 5 Live.\"My event's not in the Commonwealths cycle so I'm chasing the mainstream instead.\"Welsh Athletics' B standard women's shot put qualifying distance to be considered for selection for the next Commonwealth Games is a throw longer than 17.07m, while the A standard - the mark that would trigger automatic selection - is 18.24m.In the meantime, Fortune can enjoy her success, having praised the organisation of this World Para Athletics Championships while dealing with the high temperatures of India. \"Everything has been put on so, so well but it's definitely a lot hotter here though,\" she added.\"That's the one that we're all struggling with, it's just the heat of it. Compared to what we have in the UK it's quite different, very humid.\"",
        "Sabrina Fortune won F20 shot put gold at the 2024 Paralympics in Paris",
        "Sabrina Fortune is hoping to compete at the 2026 Commonwealth Games in Glasgow after smashing her own shot put world record at the World Para Athletics Championships.",
        "The 28-year-old from Wrexham competes in the F20 category for athletes with intellectual impairments and has dominated her event since taking gold at the 2024 Paris Paralympics.",
        "Fortune claimed a fourth consecutive world title with a new world record throw of 16.75m in New Delhi - bettering her own previous mark of 15.75m.",
        "With the Los Angeles Paralympics not taking place until 2028, Fortune believes her progress could allow her to compete for Wales against non-disability athletes in Glasgow.",
        "\"I want [to throw] 17.07m for mainstream Commonwealths, that's really my next goal,\" she told BBC Radio 5 Live.",
        "\"My event's not in the Commonwealths cycle so I'm chasing the mainstream instead.\"",
        "Welsh Athletics' B standard women's shot put qualifying distance to be considered for selection for the next Commonwealth Games is a throw longer than 17.07m, while the A standard - the mark that would trigger automatic selection - is 18.24m.",
        "In the meantime, Fortune can enjoy her success, having praised the organisation of this World Para Athletics Championships while dealing with the high temperatures of India.",
        "\"Everything has been put on so, so well but it's definitely a lot hotter here though,\" she added.",
        "\"That's the one that we're all struggling with, it's just the heat of it. Compared to what we have in the UK it's quite different, very humid.\""
      ]
    },
    {
      "url": "https://www.bbc.com/sport/athletics/articles/cre52vdj5ejo",
      "main_category": "sport",
      "detailed_category": "athletics",
      "topic": "Kerr 'did more damage' by finishing world final",
      "content": [
        "Josh Kerr has confirmed that a pulled calf muscle was what caused him to finish a distant last in the 1500m final at the World Athletics Championship last week.The Olympic silver medallist and 2023 world champion had been expected to be among those competing for medals but pulled up on the penultimate lap, with fellow Scot Jake Wightman finishing second to winner Isaac Nader.Kerr, 27, revealed the issue originated as a \"minor strain\" following an \"overstretch\" near the end of his semi-final.\"I relied a lot on my medical team and we got pretty close,\" he said on Instagram.\"I felt pretty confident going into the final and was just ready to send it, and then with 600m to go in the world final, fully pulled my calf.\"",
        "Kerr continued the race, dragged himself to the finish in four minutes 11.23 seconds, and concedes he \"definitely did some more damage\" in the final 600m. Subsequent scans have determined he has suffered a grade two tear of the muscle, but the Scot has no regrets about forcing himself to complete the distance.\"My job is to get to the finish line as quickly as possible and that's what I wanted to commit to - you never know what can happen in these races,\" he added.\"It's frustrating and the journey on the way back is going to be an interesting one but I'm getting better already and definitely feeling the fire for 2026.\"Kerr also posted photographs of his injured calf and a video of him doing some work in the pool.He explained he had kept a low profile since the final to \"process\" the injury and \"to keep the focus where the focus is supposed to be - on the winners and the medals of that race and not of the sob stories\".\"Massive congrats to the medallists, massive congrats to Jake - huge result for him and so awesome to see him back on the podium,\" Kerr said.\"Massive congratulations to the new world champion.\"",
        "This video can not be played",
        "'There was something amiss' - Cram and Radcliffe analyse what went wrong for Kerr",
        "Josh Kerr has confirmed that a pulled calf muscle was what caused him to finish a distant last in the 1500m final at the World Athletics Championship last week.",
        "The Olympic silver medallist and 2023 world champion had been expected to be among those competing for medals but pulled up on the penultimate lap, with fellow Scot Jake Wightman finishing second to winner Isaac Nader.",
        "Kerr, 27, revealed the issue originated as a \"minor strain\" following an \"overstretch\" near the end of his semi-final.",
        "\"I relied a lot on my medical team and we got pretty close,\" he said on Instagram.",
        "\"I felt pretty confident going into the final and was just ready to send it, and then with 600m to go in the world final, fully pulled my calf.\"",
        "Injury denied Kerr podium spot with me - Wightman",
        "Wightman eyes Scottish clean sweep at Glasgow 2026",
        "'I toasted silver by singing Gold in karaoke bar'",
        "Kerr continued the race, dragged himself to the finish in four minutes 11.23 seconds, and concedes he \"definitely did some more damage\" in the final 600m.",
        "Subsequent scans have determined he has suffered a grade two tear of the muscle, but the Scot has no regrets about forcing himself to complete the distance.",
        "\"My job is to get to the finish line as quickly as possible and that's what I wanted to commit to - you never know what can happen in these races,\" he added.",
        "\"It's frustrating and the journey on the way back is going to be an interesting one but I'm getting better already and definitely feeling the fire for 2026.\"",
        "Kerr also posted photographs of his injured calf and a video of him doing some work in the pool.",
        "He explained he had kept a low profile since the final to \"process\" the injury and \"to keep the focus where the focus is supposed to be - on the winners and the medals of that race and not of the sob stories\".",
        "\"Massive congrats to the medallists, massive congrats to Jake - huge result for him and so awesome to see him back on the podium,\" Kerr said.",
        "\"Massive congratulations to the new world champion.\""
      ]
    },
    {
      "url": "https://www.bbc.com/sport/athletics/articles/cn76jlvlpp5o",
      "main_category": "sport",
      "detailed_category": "athletics",
      "topic": "Stockholm marathon winner Alene dies aged 30",
      "content": [
        "Ethiopian runner Shewarge Alene has died aged 30, the organiser of the Stockholm marathon has confirmed.Alene won the race - her most recent competition - in the Swedish capital in May.She competed in 27 marathons as a professional between 2011 and 2025, recording 12 victories.\"It is with deep sorrow that we have received the news of the passing of Shewarge Alene, winner of adidas Stockholm Marathon 2025,\" the Stockholm marathon posted on Instagram, external.\"Shewarge Alene became unwell during a training session and was taken to hospital, where sadly, her life could not be saved. \"Our thoughts are with her family and loved ones.\"Alene recorded a personal best time of 2:27:26 in Cape Town, South Africa in 2023.",
        "Shewarge Alene last competed at the Stockholm marathon in May",
        "Ethiopian runner Shewarge Alene has died aged 30, the organiser of the Stockholm marathon has confirmed.",
        "Alene won the race - her most recent competition - in the Swedish capital in May.",
        "She competed in 27 marathons as a professional between 2011 and 2025, recording 12 victories.",
        "\"It is with deep sorrow that we have received the news of the passing of Shewarge Alene, winner of adidas Stockholm Marathon 2025,\" the Stockholm marathon posted on Instagram, external.",
        "\"Shewarge Alene became unwell during a training session and was taken to hospital, where sadly, her life could not be saved.",
        "\"Our thoughts are with her family and loved ones.\"",
        "Alene recorded a personal best time of 2:27:26 in Cape Town, South Africa in 2023."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/athletics/articles/c701x1wn5rno",
      "main_category": "sport",
      "detailed_category": "athletics",
      "topic": "Tears of joy as GB's Hunt claims superb 200m silver",
      "content": [
        "Great Britain's Amy Hunt announced herself on the global stage by claiming a superb 200m silver in her first major final at the World Athletics Championships in Tokyo.The 23-year-old stared up at the screen in disbelief before bursting into celebration and skipping down the track as her breakthrough achievement was confirmed.Reaching for the line, Hunt edged out Jamaican sprint great Shericka Jackson for second place as American Melissa Jefferson-Wooden completed a dominant clean sweep of the sprint titles after gold in the 100m, while Dina Asher-Smith came fifth.It was GB's second medal of the championships, following Jake Wightman's silver in the men's 1500m.\"I have not stopped smiling or crying!\" Hunt told BBC Sport following her stunning performance.\"As soon as I saw my mum, I burst into tears. I knew I could do it as long as I put in a good turn and was with them off the bend. I am so proud of myself.\"After placing fifth in the world indoor 60m final in March - the least favourite of her sprint events - an emotional Hunt revealed her grandfather John had provided inspiration in her \"battles\" during the winter.Referencing a tattoo bearing his name on her arm after he passed away earlier this year, Hunt said: \"Moments before the race, I just thought of my grandad. \"I knew he was watching over me, I knew he was going to guide me.\"Reflecting on her daughter's achievement, Hunt's mum Claire told BBC Sport: \"Oh my God, I've not actually taken it in yet. It's just absolutely amazing, what a star.\"It's been a long time coming, there's been ups, there's been downs, but oh my God, what a star.\"It's been a year where we've had two grandparents, unfortunately one [became] very ill and one passed away. \"It's been a lot for her to cope with this year, but I think that's given her some extra passion.\"",
        "Hunt was part of Great Britain's 4x100m relay quartet that took silver at the Paris 2024 Olympic Games, and followed their European gold. But this was her first individual global podium and, following an injury-disrupted start to her senior career while she balanced her sporting ambitions with studying English at the University of Cambridge, Hunt will hope there are many more to come.\"I am so proud of myself for choosing the harder path,\" she added.\"I could have chosen an easier way out many times. I chose to go to Cambridge to get a degree - in part for myself to look back on and be proud of, but also to show other young sports people, other young girls that you don't have to give up education. \"You can be an academic badass and a track goddess.\"",
        "Hunt broke into tears as she embraced friends and family, having delivered on the promise shown as a record-breaking junior.She set a women's under-18 200m world record in 2019, breaking Asher-Smith's British under-20 record in the process - in the same year her compatriot won her world 200m title in Doha.One year later, Hunt was named as one of the 'faces to define the decade' by Vogue magazine.But, after Hunt ruptured her quadriceps in early 2022, she would go a total of six years before managing to run a personal best again, finally doing so over 200m at the London Diamond League in July.Having finished ahead of two-time defending champion Jackson on the sport's biggest stage, Hunt proved she is ready to kick on in her career.She clocked 22.14 seconds as Jefferson-Wooden stormed to her second gold in 21.68, with the 24-year-old the first woman to win both the 100m and 200m at a world championships since Shelly-Ann Fraser-Pryce in 2013.Asher-Smith finished in 22.43 and said: \"Amy did incredibly. I'm disappointed with my race. I think I could have done a better job of executing and I have to go away and work on that.\"",
        "Continuing her rise, Hunt arrived in Tokyo having set personal bests over 60m, 100m and 200m this season as she developed under the guidance of coach Marco Airale in Italy.In a strong start to a year which has only got better, Hunt - keen to improve on her starts in particular - was delighted to achieve a significant personal best of 7.09 over 60m during the indoor season.Typically not the quickest off the blocks, Hunt was joint-sixth after the first 100m.From that point, though, she made up a deficit of 0.17 seconds with a blistering finish to overhaul Jackson, 31. \"Her form this year has gone from strength to strength,\" four-time global heptathlon champion Jessica Ennis-Hill told BBC TV.\"For me, the most impressive thing with Amy is her pick-up in the latter part of the race. She was not letting anyone get away from her, she was tearing down those last 30 metres.\"What a fabulous silver medal for her.\"",
        "Hunt also moved up to fourth on the British all-time 100m list and into the nation's fastest three in history over 200m when finishing runner-up to Asher-Smith in a thrilling photo finish at the UK Championships this year.But she went even faster in booking her place in the world final, replacing Kathy Cook as the second-fastest British woman over 200m with a new best of 22.08.That performance strengthened her belief before the final, where she seized her moment.\"I just beat some amazing girls and I can't believe it,\" said Hunt.\"I am showing that you can do everything. Anything you set your mind to, you can be the best at everything.\"On how she would celebrate, she added: \"Maybe some karaoke tonight!\"",
        "This video can not be played",
        "'Immense performance' - GB's Hunt takes silver in 200m",
        "Great Britain's Amy Hunt announced herself on the global stage by claiming a superb 200m silver in her first major final at the World Athletics Championships in Tokyo.",
        "The 23-year-old stared up at the screen in disbelief before bursting into celebration and skipping down the track as her breakthrough achievement was confirmed.",
        "Reaching for the line, Hunt edged out Jamaican sprint great Shericka Jackson for second place as American Melissa Jefferson-Wooden completed a dominant clean sweep of the sprint titles after gold in the 100m, while Dina Asher-Smith came fifth.",
        "It was GB's second medal of the championships, following Jake Wightman's silver in the men's 1500m.",
        "\"I have not stopped smiling or crying!\" Hunt told BBC Sport following her stunning performance.",
        "\"As soon as I saw my mum, I burst into tears. I knew I could do it as long as I put in a good turn and was with them off the bend. I am so proud of myself.\"",
        "After placing fifth in the world indoor 60m final in March - the least favourite of her sprint events - an emotional Hunt revealed her grandfather John had provided inspiration in her \"battles\" during the winter.",
        "Referencing a tattoo bearing his name on her arm after he passed away earlier this year, Hunt said: \"Moments before the race, I just thought of my grandad.",
        "\"I knew he was watching over me, I knew he was going to guide me.\"",
        "Reflecting on her daughter's achievement, Hunt's mum Claire told BBC Sport: \"Oh my God, I've not actually taken it in yet. It's just absolutely amazing, what a star.",
        "\"It's been a long time coming, there's been ups, there's been downs, but oh my God, what a star.",
        "\"It's been a year where we've had two grandparents, unfortunately one [became] very ill and one passed away.",
        "\"It's been a lot for her to cope with this year, but I think that's given her some extra passion.\"",
        "'Energised' Lyle makes happier Tokyo memories after heartbreak",
        "Coe's record under threat as Burgin targets world podium",
        "World Athletics medal table - and what's on Saturday?",
        "Hunt was part of Great Britain's 4x100m relay quartet that took silver at the Paris 2024 Olympic Games, and followed their European gold.",
        "But this was her first individual global podium and, following an injury-disrupted start to her senior career while she balanced her sporting ambitions with studying English at the University of Cambridge, Hunt will hope there are many more to come.",
        "\"I am so proud of myself for choosing the harder path,\" she added.",
        "\"I could have chosen an easier way out many times. I chose to go to Cambridge to get a degree - in part for myself to look back on and be proud of, but also to show other young sports people, other young girls that you don't have to give up education.",
        "\"You can be an academic badass and a track goddess.\"",
        "This video can not be played",
        "Hunt reaction to 200m silver",
        "Hunt broke into tears as she embraced friends and family, having delivered on the promise shown as a record-breaking junior.",
        "She set a women's under-18 200m world record in 2019, breaking Asher-Smith's British under-20 record in the process - in the same year her compatriot won her world 200m title in Doha.",
        "One year later, Hunt was named as one of the 'faces to define the decade' by Vogue magazine.",
        "But, after Hunt ruptured her quadriceps in early 2022, she would go a total of six years before managing to run a personal best again, finally doing so over 200m at the London Diamond League in July.",
        "Having finished ahead of two-time defending champion Jackson on the sport's biggest stage, Hunt proved she is ready to kick on in her career.",
        "She clocked 22.14 seconds as Jefferson-Wooden stormed to her second gold in 21.68, with the 24-year-old the first woman to win both the 100m and 200m at a world championships since Shelly-Ann Fraser-Pryce in 2013.",
        "Asher-Smith finished in 22.43 and said: \"Amy did incredibly. I'm disappointed with my race. I think I could have done a better job of executing and I have to go away and work on that.\"",
        "Continuing her rise, Hunt arrived in Tokyo having set personal bests over 60m, 100m and 200m this season as she developed under the guidance of coach Marco Airale in Italy.",
        "In a strong start to a year which has only got better, Hunt - keen to improve on her starts in particular - was delighted to achieve a significant personal best of 7.09 over 60m during the indoor season.",
        "Typically not the quickest off the blocks, Hunt was joint-sixth after the first 100m.",
        "From that point, though, she made up a deficit of 0.17 seconds with a blistering finish to overhaul Jackson, 31.",
        "\"Her form this year has gone from strength to strength,\" four-time global heptathlon champion Jessica Ennis-Hill told BBC TV.",
        "\"For me, the most impressive thing with Amy is her pick-up in the latter part of the race. She was not letting anyone get away from her, she was tearing down those last 30 metres.",
        "\"What a fabulous silver medal for her.\"",
        "Amy Hunt has won two international relay medals as part of Great Britain's women's 4x100m quartet",
        "Hunt also moved up to fourth on the British all-time 100m list and into the nation's fastest three in history over 200m when finishing runner-up to Asher-Smith in a thrilling photo finish at the UK Championships this year.",
        "But she went even faster in booking her place in the world final, replacing Kathy Cook as the second-fastest British woman over 200m with a new best of 22.08.",
        "That performance strengthened her belief before the final, where she seized her moment.",
        "\"I just beat some amazing girls and I can't believe it,\" said Hunt.",
        "\"I am showing that you can do everything. Anything you set your mind to, you can be the best at everything.\"",
        "On how she would celebrate, she added: \"Maybe some karaoke tonight!\"",
        "This video can not be played",
        "Meet the Great Britain athletics superfans"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/athletics/articles/cm28z94l623o",
      "main_category": "sport",
      "detailed_category": "athletics",
      "topic": "'Who are you trying to convince?' - do mind games really work?",
      "content": [
        "When the biggest prizes are decided by fractions of a second, every detail counts.And when you've done all you can to prepare, the ability to unsettle your rivals can provide those final, marginal advantages.Noah Lyles, among the sport's most outspoken athletes and who will seek to retain his world 200m title on Friday, is not one to miss such an opportunity.During last weekend's 100m competition, Lyles said he \"knew\" that Jamaica's Oblique Seville would make a slow start in his heat after seeing the 24-year-old \"panicking\" before heading out to the track.Whatever his motive, it did not have the desired effect. Seville produced a personal best in the final to become the first man from his nation to win a global 100m title since Usain Bolt, with the dethroned Lyles taking bronze.On Thursday night, Lyles moved to dishearten his rivals when, having already established a sizeable advantage, he did not relent and set the fastest time this year.\"After the first 50m I thought I heard [Great Britain's] Zharnel [Hughes] running alongside me and I said to myself, 'You ain't catching me'.\"The message today was that they can't beat me. Don't miss the final, it's going to be magical.\"Hughes previously admitted that disparaging comments by Lyles had \"raised all the red in me\" prior to last summer's Olympics, where the American would win the 100m title.So do mind games really work in athletics? What tricks are used? And how do they play out around the sport's major finals?",
        "Former world 200m champion Ato Boldon is no stranger to the art of mind games - and in particular attempting to block them out. The Trinidadian recalls one attempt to unsettle him - and indeed the rest of his competitors - by American John Capel at the Sydney 2000 Olympics.\"John Capel hadn't run in the 100m, while I was on one hamstring after getting the silver and thought I was going to have to pull out,\" Boldon, who added 200m bronze to his 100m silver at those Games, tells BBC 5 Live Sport.\"In the call room, Capel was shouting and psyching himself up, while trying to intimidate us.\"But he gets to the start line and, because he's so hyped up, he flinches, rocks back, the gun sounds - and I think he got dead last.\"So it can backfire.\"Boldon believes Lyles may have realised his error after making his comments about Seville: \"I think he wanted to say it but then he realised he may have given him fuel for the final.\"I would say 80% of performance [at major championships] is mental because everybody is strong. It's a matter of being ready for the fight. If you're not, you're done.\"",
        "Facing the likes of intense three-time global 100m medallist Dennis Mitchell in major finals, Boldon chose to adopt a different approach.\"My thing was that you weren't going to be able to read me,\" Boldon says.\"Dennis Mitchell would be hopping up and down and screaming. I used to look at that and think who are you trying to convince - me or yourself?\"It didn't work on me.\"With so many dynamics at play, the call room in particular can be a daunting place for many athletes - one which has the potential to make or break a performance.British Paralympic bronze medallist Stef Reid found call rooms to be \"one of the weirdest experiences\" around competition.\"It took me a couple of years to figure out who I wanted to be in that situation. Yes, I am smiley and friendly, but I also wanted to kick some serious ass,\" says Reid.\"It's easy to spot who is nervous and ready to crack. They're fidgety. They're checking their bag and equipment constantly, doing panic stretches and warm up drills every five seconds. \"So I did the opposite. I sat in my chair like I was lounging on the beach, full of confidence and totally unfazed. \"Mind games don't have to be loud. Sometimes quiet confidence, even if it's fake, is more off-putting.\"",
        "There can be valuable information to be gained from paying attention to your rivals in those telling, close-quarter moments before battle, too.Knowing how to read your competition, filtering the clearly confident from those potential poker players, is something many of the greats ensured they mastered.\"Daley Thompson was by far the best at this stuff,\" former world 1500m champion Steve Cram said of GB's three-time global decathlon champion.\"He saw it as a real sign of weakness if anyone reacted.\"Former world marathon champion Paula Radcliffe says: \"Mind games can be played everywhere. The call room is always a very interesting place to be - and here in Tokyo you also have the twist of the bus journey to the stadium to extend that.\"",
        "That 20-minute bus journey from warm-up track to stadium is an additional factor extending the call room eeriness in Tokyo.For Great Britain's 1500m silver medallist Jake Wightman, enduring a silent mini bus journey to the stadium for Wednesday's final with all his rivals was not ideal preparation.\"It is deadly silent. I don't really like silence,\" Wightman said.\"Through the rounds, I was trying to make conversation, and you realise not too many people want to hear you chatting. \"Before the final there's a lot of nerves. So there wasn't much conversation.\"Wightman's British team-mate Josh Kerr and Norwegian Jakob Ingebrigtsen have made no secret of their attempts to unsettle each other in recent years, and Kerr often wears sunglasses so that his rivals cannot read his facial expressions.\"All of us do it in one way or another,\" says Cram.\"But often the so-called mind games are played outwardly by people who feel a need to address their own doubts or insecurities.\"I think a lot of it in today's world, though, is not really mind games. It's athletes just trying to get attention and exposure.\"",
        "Noah Lyles will race in the men's 200m final in Tokyo on Friday",
        "When the biggest prizes are decided by fractions of a second, every detail counts.",
        "And when you've done all you can to prepare, the ability to unsettle your rivals can provide those final, marginal advantages.",
        "Noah Lyles, among the sport's most outspoken athletes and who will seek to retain his world 200m title on Friday, is not one to miss such an opportunity.",
        "During last weekend's 100m competition, Lyles said he \"knew\" that Jamaica's Oblique Seville would make a slow start in his heat after seeing the 24-year-old \"panicking\" before heading out to the track.",
        "Whatever his motive, it did not have the desired effect.",
        "Seville produced a personal best in the final to become the first man from his nation to win a global 100m title since Usain Bolt, with the dethroned Lyles taking bronze.",
        "On Thursday night, Lyles moved to dishearten his rivals when, having already established a sizeable advantage, he did not relent and set the fastest time this year.",
        "\"After the first 50m I thought I heard [Great Britain's] Zharnel [Hughes] running alongside me and I said to myself, 'You ain't catching me'.",
        "\"The message today was that they can't beat me. Don't miss the final, it's going to be magical.\"",
        "Hughes previously admitted that disparaging comments by Lyles had \"raised all the red in me\" prior to last summer's Olympics, where the American would win the 100m title.",
        "So do mind games really work in athletics? What tricks are used? And how do they play out around the sport's major finals?",
        "Former world 200m champion Ato Boldon is no stranger to the art of mind games - and in particular attempting to block them out.",
        "The Trinidadian recalls one attempt to unsettle him - and indeed the rest of his competitors - by American John Capel at the Sydney 2000 Olympics.",
        "\"John Capel hadn't run in the 100m, while I was on one hamstring after getting the silver and thought I was going to have to pull out,\" Boldon, who added 200m bronze to his 100m silver at those Games, tells BBC 5 Live Sport.",
        "\"In the call room, Capel was shouting and psyching himself up, while trying to intimidate us.",
        "\"But he gets to the start line and, because he's so hyped up, he flinches, rocks back, the gun sounds - and I think he got dead last.",
        "\"So it can backfire.\"",
        "Boldon believes Lyles may have realised his error after making his comments about Seville: \"I think he wanted to say it but then he realised he may have given him fuel for the final.",
        "\"I would say 80% of performance [at major championships] is mental because everybody is strong. It's a matter of being ready for the fight. If you're not, you're done.\"",
        "Ato Boldon and his Trinidad and Tobago team members wore unique sunglasses during the men's 4x100m relay at Sydney 2000",
        "Facing the likes of intense three-time global 100m medallist Dennis Mitchell in major finals, Boldon chose to adopt a different approach.",
        "\"My thing was that you weren't going to be able to read me,\" Boldon says.",
        "\"Dennis Mitchell would be hopping up and down and screaming. I used to look at that and think who are you trying to convince - me or yourself?",
        "\"It didn't work on me.\"",
        "With so many dynamics at play, the call room in particular can be a daunting place for many athletes - one which has the potential to make or break a performance.",
        "British Paralympic bronze medallist Stef Reid found call rooms to be \"one of the weirdest experiences\" around competition.",
        "\"It took me a couple of years to figure out who I wanted to be in that situation. Yes, I am smiley and friendly, but I also wanted to kick some serious ass,\" says Reid.",
        "\"It's easy to spot who is nervous and ready to crack. They're fidgety. They're checking their bag and equipment constantly, doing panic stretches and warm up drills every five seconds.",
        "\"So I did the opposite. I sat in my chair like I was lounging on the beach, full of confidence and totally unfazed.",
        "\"Mind games don't have to be loud. Sometimes quiet confidence, even if it's fake, is more off-putting.\"",
        "There can be valuable information to be gained from paying attention to your rivals in those telling, close-quarter moments before battle, too.",
        "Knowing how to read your competition, filtering the clearly confident from those potential poker players, is something many of the greats ensured they mastered.",
        "\"Daley Thompson was by far the best at this stuff,\" former world 1500m champion Steve Cram said of GB's three-time global decathlon champion.",
        "\"He saw it as a real sign of weakness if anyone reacted.\"",
        "Former world marathon champion Paula Radcliffe says: \"Mind games can be played everywhere. The call room is always a very interesting place to be - and here in Tokyo you also have the twist of the bus journey to the stadium to extend that.\"",
        "Hodgkinson makes winning start to world title bid",
        "I don't see it as a redemption story - Johnson-Thompson",
        "'I toasted silver by singing Gold in karaoke bar'",
        "That 20-minute bus journey from warm-up track to stadium is an additional factor extending the call room eeriness in Tokyo.",
        "For Great Britain's 1500m silver medallist Jake Wightman, enduring a silent mini bus journey to the stadium for Wednesday's final with all his rivals was not ideal preparation.",
        "\"It is deadly silent. I don't really like silence,\" Wightman said.",
        "\"Through the rounds, I was trying to make conversation, and you realise not too many people want to hear you chatting.",
        "\"Before the final there's a lot of nerves. So there wasn't much conversation.\"",
        "Wightman's British team-mate Josh Kerr and Norwegian Jakob Ingebrigtsen have made no secret of their attempts to unsettle each other in recent years, and Kerr often wears sunglasses so that his rivals cannot read his facial expressions.",
        "\"All of us do it in one way or another,\" says Cram.",
        "\"But often the so-called mind games are played outwardly by people who feel a need to address their own doubts or insecurities.",
        "\"I think a lot of it in today's world, though, is not really mind games. It's athletes just trying to get attention and exposure.\""
      ]
    },
    {
      "url": "https://www.bbc.com/sport/athletics/articles/czjmgzne1wvo",
      "main_category": "sport",
      "detailed_category": "athletics",
      "topic": "The must-watch events at the World Championships",
      "content": [
        "The World Athletics Championships get under way in Tokyo on Saturday, beginning nine days of captivating drama featuring the world's biggest track and field stars.There are 147 medals to be awarded across 49 events in an action-packed schedule in the Japanese capital, with a total prize pot of $8.5m (£6.3m) on offer.Here are some of the events you definitely do not want to miss.",
        "Thursday, 18 September 11:55 BST - heats; Friday, 19 September 12:45 BST - semi-finals; Sunday, 21 September 11:35 BST - finalDespite being forced to wait 12 months to compete for the first time as Olympic champion because of injury, Great Britain's Keely Hodgkinson will line up in Tokyo as the gold medal favourite.The 23-year-old made her return just four weeks before the World Championships, after two torn hamstrings, but clocked the fastest time of 2025 in her comeback and backed that up with another win at last month's Lausanne Diamond League.Olympic 1500m bronze medallist Georgia Hunter Bell has decided to focus her full attention on the 800m, joining training partner Hodgkinson and fellow Briton Jemma Reekie in the battle for the podium.Among the athletes hoping to deny them will be Kenya's reigning champion Mary Moraa, Ethiopia's Olympic silver medallist Tsige Duguma and Swiss athlete Audrey Werro.",
        "Saturday, 13 September 12:35 BST - heats; Sunday, 14 September 12:43 BST - semi-finals and 14:20 - finalAmerican Noah Lyles seeks a third consecutive global 100m title after following up world glory in Budapest with a dramatic Olympic gold at Paris 2024.The 28-year-old edged out Jamaica's Kishane Thompson in the fastest race in history last summer but his season's best of 9.90 seconds ranks just 11th in the world this year.Thompson arrives as 2025's fastest man in 9.75, while fellow Jamaican Oblique Seville beat Lyles comprehensively in August. There will also be attention on Australian teenager Gout Gout, who has been likened to sprint icon Usain Bolt.Zharnel Hughes, the 2023 bronze medallist and with a best time this year of 9.91, leads British interest as he targets a second global medal.",
        "Saturday, 13 September 10:55 BST - heats; Sunday, 14 September 12:20 BST - semi-finals and 14:13 BST - finalSt Lucia's Olympic 100m champion Julien Alfred will target a sprint double in the absence of injured American 200m gold medallist Gabby Thomas - the only athlete able to deny her that achievement last summer.American Sha'Carri Richardson will aim to retain her world title after taking Olympic silver, but it is Paris 2024 bronze medallist Melissa Jefferson-Wooden who has been the standout performer this season.Not only has Jefferson-Wooden run an unmatched 10.65 seconds, but she also boasts five of the six fastest times this year - with her fourth-fastest tied with Alfred's best of 10.75 secs.Great Britain's former world 200m champion Dina Asher-Smith, Daryl Neita and Amy Hunt will each hope to be in the medal mix, as will Jamaican legend Shelly-Ann Fraser-Pryce at her final major championship.",
        "Sunday, 14 September 01:35 BST - heats; Monday, 15 September 13:30 BST - semi-finals; Wednesday, 17 September 14:20 BST - finalJosh Kerr and Jakob Ingebrigtsen meet for their latest duel, this time fully alert to the threats around them.Defending champion Kerr emulated British team-mate Jake Wightman in beating Ingebrigtsen to world gold two years ago.But American Cole Hocker delivered a surprise twist to the latest showdown between the two fierce rivals as he pipped Kerr to gold in an Olympic record time.One of the most enthralling events of recent years appears wide open, with Ingebrigtsen's season disrupted by injury and Olympic bronze medallist Yared Nuguse failing to qualify.",
        "Friday, 19 September 09:33 BST - 100m hurdles; 10:20 BST - high jump; 12:30 BST - shot put; 13:38 BST - 200m; Saturday, 20 September 03:30 BST - long jump; 11:00 BST - javelin; 13:11 BST - 800mGreat Britain's Katerina Johnson-Thompson and Belgian Nafi Thiam go head-to-head as both seek to become three-time world champions in Tokyo.The pair have split the past four world golds between them, with Johnson-Thompson triumphing as Thiam missed the 2023 championships through injury.Thiam became a three-time Olympic champion last year, edging Johnson-Thompson to take gold by just 36 points in a dramatic concluding 800m in Paris.After ending her wait for an Olympic medal, Johnson-Thompson will hope to again go toe-to-toe with Thiam at the stadium where she suffered injury heartbreak at the Games four years ago.",
        "Sunday, 14 September 10:35 BST - heats; Tuesday, 16 September 13:35 BST - semi-finals; Thursday, 18 September 14:10 BST - finalWill Tokyo be the scene of Matthew Hudson-Smith's crowning moment?The British 30-year-old has gone agonisingly close to gold at the past two global championships, missing out to American Quincy Hall by four-hundredths of a second at the Olympics after finishing within 0.09secs of the world title 12 months earlier.His European record time of 43.44 seconds at Paris 2024 made him the fifth-quickest 400m runner in history, but three men have gone faster than his season's best of 44.10 - including American Diamond League champion Jacory Patterson.British team-mate Charlie Dobson will target the podium after stunning Hudson-Smith at July's London Diamond League, taking victory in a personal best 44.14.",
        "Great Britain won 10 athletics medals at the Paris 2024 Olympic Games",
        "The World Athletics Championships get under way in Tokyo on Saturday, beginning nine days of captivating drama featuring the world's biggest track and field stars.",
        "There are 147 medals to be awarded across 49 events in an action-packed schedule in the Japanese capital, with a total prize pot of $8.5m (£6.3m) on offer.",
        "Here are some of the events you definitely do not want to miss.",
        "This video can not be played",
        "'Back with a bang!' - Hodgkinson sets world lead time to win 800m",
        "Thursday, 18 September 11:55 BST - heats; Friday, 19 September 12:45 BST - semi-finals; Sunday, 21 September 11:35 BST - final",
        "Despite being forced to wait 12 months to compete for the first time as Olympic champion because of injury, Great Britain's Keely Hodgkinson will line up in Tokyo as the gold medal favourite.",
        "The 23-year-old made her return just four weeks before the World Championships, after two torn hamstrings, but clocked the fastest time of 2025 in her comeback and backed that up with another win at last month's Lausanne Diamond League.",
        "Olympic 1500m bronze medallist Georgia Hunter Bell has decided to focus her full attention on the 800m, joining training partner Hodgkinson and fellow Briton Jemma Reekie in the battle for the podium.",
        "Among the athletes hoping to deny them will be Kenya's reigning champion Mary Moraa, Ethiopia's Olympic silver medallist Tsige Duguma and Swiss athlete Audrey Werro.",
        "Noah Lyles won Olympic 100m gold by five-thousandths of a second from Jamaica's Kishane Thompson in a dramatic photo finish at the Stade de France",
        "Saturday, 13 September 12:35 BST - heats; Sunday, 14 September 12:43 BST - semi-finals and 14:20 - final",
        "American Noah Lyles seeks a third consecutive global 100m title after following up world glory in Budapest with a dramatic Olympic gold at Paris 2024.",
        "The 28-year-old edged out Jamaica's Kishane Thompson in the fastest race in history last summer but his season's best of 9.90 seconds ranks just 11th in the world this year.",
        "Thompson arrives as 2025's fastest man in 9.75, while fellow Jamaican Oblique Seville beat Lyles comprehensively in August.",
        "There will also be attention on Australian teenager Gout Gout, who has been likened to sprint icon Usain Bolt.",
        "Zharnel Hughes, the 2023 bronze medallist and with a best time this year of 9.91, leads British interest as he targets a second global medal.",
        "This video can not be played",
        "GB's Neita finishes third in 100m as USA's Jefferson-Wooden wins race",
        "Saturday, 13 September 10:55 BST - heats; Sunday, 14 September 12:20 BST - semi-finals and 14:13 BST - final",
        "St Lucia's Olympic 100m champion Julien Alfred will target a sprint double in the absence of injured American 200m gold medallist Gabby Thomas - the only athlete able to deny her that achievement last summer.",
        "American Sha'Carri Richardson will aim to retain her world title after taking Olympic silver, but it is Paris 2024 bronze medallist Melissa Jefferson-Wooden who has been the standout performer this season.",
        "Not only has Jefferson-Wooden run an unmatched 10.65 seconds, but she also boasts five of the six fastest times this year - with her fourth-fastest tied with Alfred's best of 10.75 secs.",
        "Great Britain's former world 200m champion Dina Asher-Smith, Daryl Neita and Amy Hunt will each hope to be in the medal mix, as will Jamaican legend Shelly-Ann Fraser-Pryce at her final major championship.",
        "Cole Hocker edged Josh Kerr in a sprint for Olympic gold at Paris 2024",
        "Sunday, 14 September 01:35 BST - heats; Monday, 15 September 13:30 BST - semi-finals; Wednesday, 17 September 14:20 BST - final",
        "Josh Kerr and Jakob Ingebrigtsen meet for their latest duel, this time fully alert to the threats around them.",
        "Defending champion Kerr emulated British team-mate Jake Wightman in beating Ingebrigtsen to world gold two years ago.",
        "But American Cole Hocker delivered a surprise twist to the latest showdown between the two fierce rivals as he pipped Kerr to gold in an Olympic record time.",
        "One of the most enthralling events of recent years appears wide open, with Ingebrigtsen's season disrupted by injury and Olympic bronze medallist Yared Nuguse failing to qualify.",
        "Katarina Johnson-Thompson won her first Olympic medal at Paris 2024",
        "Friday, 19 September 09:33 BST - 100m hurdles; 10:20 BST - high jump; 12:30 BST - shot put; 13:38 BST - 200m; Saturday, 20 September 03:30 BST - long jump; 11:00 BST - javelin; 13:11 BST - 800m",
        "Great Britain's Katerina Johnson-Thompson and Belgian Nafi Thiam go head-to-head as both seek to become three-time world champions in Tokyo.",
        "The pair have split the past four world golds between them, with Johnson-Thompson triumphing as Thiam missed the 2023 championships through injury.",
        "Thiam became a three-time Olympic champion last year, edging Johnson-Thompson to take gold by just 36 points in a dramatic concluding 800m in Paris.",
        "After ending her wait for an Olympic medal, Johnson-Thompson will hope to again go toe-to-toe with Thiam at the stadium where she suffered injury heartbreak at the Games four years ago.",
        "Matthew Hudson-Smith missed out on Olympic 400m gold by four-hundredths of a second in Paris",
        "Sunday, 14 September 10:35 BST - heats; Tuesday, 16 September 13:35 BST - semi-finals; Thursday, 18 September 14:10 BST - final",
        "Will Tokyo be the scene of Matthew Hudson-Smith's crowning moment?",
        "The British 30-year-old has gone agonisingly close to gold at the past two global championships, missing out to American Quincy Hall by four-hundredths of a second at the Olympics after finishing within 0.09secs of the world title 12 months earlier.",
        "His European record time of 43.44 seconds at Paris 2024 made him the fifth-quickest 400m runner in history, but three men have gone faster than his season's best of 44.10 - including American Diamond League champion Jacory Patterson.",
        "British team-mate Charlie Dobson will target the podium after stunning Hudson-Smith at July's London Diamond League, taking victory in a personal best 44.14."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/athletics/articles/c9qyw3842xgo",
      "main_category": "sport",
      "detailed_category": "athletics",
      "topic": "My 30-year-old world record 'not a good sign for athletics' - Edwards",
      "content": [
        "\"I don't think it's a good sign for athletics as a sport that you have a record that stands for 30 years.\"Jonathan Edwards' pride in his triple jump world record is tinged with surprise at the fact no-one has surpassed the 18.29m he set on 7 August 1995 at the World Championships in Gothenburg.\"When you think of all the developments in sports science, nutrition, training methods, all of those things, I don't think it necessarily speaks to a really healthy and thriving sport, if I'm honest,\" Edwards, who is Britain's only track and field world record holder in regularly contested events, told BBC Sport.Perhaps that plays down his own achievement. Only seven other men in history have surpassed the 18m mark.But, if you subscribe to the view that records are there to be broken, then why is this one still standing?",
        "When Edwards arrived at Gothenburg's Ullevi Stadium, no-one had ever jumped beyond 18 metres in 'legal' wind conditions.Within the first two rounds of the competition, he had managed it twice.He landed beyond the measuring board with his opening-round jump of 18.16m and then added another 13cm to the record around 20 minutes later in what is one of British athletics' greatest performances.He was the event's form athlete that year, arriving in Sweden as the world record holder after jumping 17.98 to beat American Willie Banks' previous mark by one centimetre and had also recorded the longest jump in history of a wind-assisted 18.43m.He has always described himself as a sprinter, rather than a jumper, likening his contact with the ground through the hop-step-jump phases to a pebble skimming the water and at 71kg was also lighter than many other athletes.He had changed his technique that season, adopting a double arm action - rather than an alternate arm movement - that he said made him \"so well balanced\" through all of his phases.But nevertheless he was far from confident, admitting that he bought sunglasses at Gothenburg airport to hide his eyes when he was warming up so his competitors \"wouldn't see the fear\" he had.What his rivals saw was very different.\"In our training sessions, we studied Edwards videos day in, day out,\" Jerome Romain, who took the bronze medal in Gothenburg, said. \"It was just remarkable the things that he did.\"Silver medallist Brian Wellman believes Edward set the record because \"he was the most efficient triple jumper out there\".",
        "Edwards believes part of the reason he still holds the triple jump world record is because athletics has not \"kept pace with the professionalisation of sport\", which means talented young athletes are choosing other sports instead because they can earn more money.\"It doesn't offer the same rewards as other sports,\" he said.\"If you're a talented young kid, you wouldn't necessarily pick track and field. You wouldn't certainly pick a field event where the rewards are less than on the track.\"When four-time Olympic champion Michael Johnson launched Grand Slam Track this season, where athletes compete for a top prize of $100,000 (£75,125) at each meet, the disciplines were limited to track races.Investment in the sport has also been falling, with UK Sport cutting funding for athletics for the second successive Olympic cycle, announcing last year that UK Athletics would get 8% less for the 2028 Los Angeles Games than it had for Paris 2024.Participation in track and field has also been falling, according to England Athletics, and youngsters are increasingly dropping out.",
        "Three of the five longest held men's world records in the most commonly contested events are jumps: the high jump, long jump and triple jump records were all set between 1991 and 1995.And yet, technology has advanced since then, including in footwear.But Edwards thinks the carbon fibre plates in today's running shoes may not actually be helping jumpers in contrast to the running events where records have continued to be broken.\"I wonder whether or not a carbon fibre plate is able to cope with the intensity of that impact and then offer anything on the rebound, because that's what I think we're seeing on the track.\"You're seeing athletes who are actually getting a spring effect, and that's why you're seeing some of the times that you're getting. But the forces are so extreme in triple jump, indeed long jump, even high jump when people take off and I'm not sure that that sort of trampoline effect is able to have the same impact.\"Dr Tom Allen, sports engineering expert at Manchester Metropolitan University and University of Canterbury Visiting Erskine Fellow, agrees that while the shoes offer gains in running economy, the impact of the shoes on jumping events is \"likely to be small or negligible\".",
        "The closest anyone has come to Edwards' record was 10 years ago when American Christian Taylor jumped 18.21m.The world leading distance this year is 17.80m, while last year's Olympic gold was won with 17.86m.\"He [Edwards] can rest easy for a while,\" Romain said. \"This is not an easy feat, I'm telling you.\"Edwards says he does not know how he will feel if his record goes.\"It's been a part of me for so long now,\" said Edwards, whose record jump is depicted in a mosaic in Ilfracombe, Devon, where he lived in his teens. \"Actually it would be nice if it carried on.\"It would be quite a good funeral [if there was] something down the aisle - 18.29m.\"",
        "This video can not be played",
        "Edwards relives his triple jump world record 30 years on",
        "\"I don't think it's a good sign for athletics as a sport that you have a record that stands for 30 years.\"",
        "Jonathan Edwards' pride in his triple jump world record is tinged with surprise at the fact no-one has surpassed the 18.29m he set on 7 August 1995 at the World Championships in Gothenburg.",
        "\"When you think of all the developments in sports science, nutrition, training methods, all of those things, I don't think it necessarily speaks to a really healthy and thriving sport, if I'm honest,\" Edwards, who is Britain's only track and field world record holder in regularly contested events, told BBC Sport.",
        "Perhaps that plays down his own achievement. Only seven other men in history have surpassed the 18m mark.",
        "But, if you subscribe to the view that records are there to be broken, then why is this one still standing?",
        "Hop, Step Jump: The Unbeatable Record",
        "Record Breakers: Edwards and Cram",
        "Jonathan Edwards is Britain's only track and field world record holder in regularly contested events",
        "When Edwards arrived at Gothenburg's Ullevi Stadium, no-one had ever jumped beyond 18 metres in 'legal' wind conditions.",
        "Within the first two rounds of the competition, he had managed it twice.",
        "He landed beyond the measuring board with his opening-round jump of 18.16m and then added another 13cm to the record around 20 minutes later in what is one of British athletics' greatest performances.",
        "He was the event's form athlete that year, arriving in Sweden as the world record holder after jumping 17.98 to beat American Willie Banks' previous mark by one centimetre and had also recorded the longest jump in history of a wind-assisted 18.43m.",
        "He has always described himself as a sprinter, rather than a jumper, likening his contact with the ground through the hop-step-jump phases to a pebble skimming the water and at 71kg was also lighter than many other athletes.",
        "He had changed his technique that season, adopting a double arm action - rather than an alternate arm movement - that he said made him \"so well balanced\" through all of his phases.",
        "But nevertheless he was far from confident, admitting that he bought sunglasses at Gothenburg airport to hide his eyes when he was warming up so his competitors \"wouldn't see the fear\" he had.",
        "What his rivals saw was very different.",
        "\"In our training sessions, we studied Edwards videos day in, day out,\" Jerome Romain, who took the bronze medal in Gothenburg, said. \"It was just remarkable the things that he did.\"",
        "Silver medallist Brian Wellman believes Edward set the record because \"he was the most efficient triple jumper out there\".",
        "Edwards believes part of the reason he still holds the triple jump world record is because athletics has not \"kept pace with the professionalisation of sport\", which means talented young athletes are choosing other sports instead because they can earn more money.",
        "\"It doesn't offer the same rewards as other sports,\" he said.",
        "\"If you're a talented young kid, you wouldn't necessarily pick track and field. You wouldn't certainly pick a field event where the rewards are less than on the track.\"",
        "When four-time Olympic champion Michael Johnson launched Grand Slam Track this season, where athletes compete for a top prize of $100,000 (£75,125) at each meet, the disciplines were limited to track races.",
        "Investment in the sport has also been falling, with UK Sport cutting funding for athletics for the second successive Olympic cycle, announcing last year that UK Athletics would get 8% less for the 2028 Los Angeles Games than it had for Paris 2024.",
        "Participation in track and field has also been falling, according to England Athletics, and youngsters are increasingly dropping out.",
        "Three of the five longest held men's world records in the most commonly contested events are jumps: the high jump, long jump and triple jump records were all set between 1991 and 1995.",
        "And yet, technology has advanced since then, including in footwear.",
        "But Edwards thinks the carbon fibre plates in today's running shoes may not actually be helping jumpers in contrast to the running events where records have continued to be broken.",
        "\"I wonder whether or not a carbon fibre plate is able to cope with the intensity of that impact and then offer anything on the rebound, because that's what I think we're seeing on the track.",
        "\"You're seeing athletes who are actually getting a spring effect, and that's why you're seeing some of the times that you're getting. But the forces are so extreme in triple jump, indeed long jump, even high jump when people take off and I'm not sure that that sort of trampoline effect is able to have the same impact.\"",
        "Dr Tom Allen, sports engineering expert at Manchester Metropolitan University and University of Canterbury Visiting Erskine Fellow, agrees that while the shoes offer gains in running economy, the impact of the shoes on jumping events is \"likely to be small or negligible\".",
        "The closest anyone has come to Edwards' record was 10 years ago when American Christian Taylor jumped 18.21m.",
        "The world leading distance this year is 17.80m, while last year's Olympic gold was won with 17.86m.",
        "\"He [Edwards] can rest easy for a while,\" Romain said. \"This is not an easy feat, I'm telling you.\"",
        "Edwards says he does not know how he will feel if his record goes.",
        "\"It's been a part of me for so long now,\" said Edwards, whose record jump is depicted in a mosaic in Ilfracombe, Devon, where he lived in his teens. \"Actually it would be nice if it carried on.",
        "\"It would be quite a good funeral [if there was] something down the aisle - 18.29m.\""
      ]
    },
    {
      "url": "https://www.bbc.com/sport/athletics/articles/cx2qn6glp03o",
      "main_category": "sport",
      "detailed_category": "athletics",
      "topic": "Couch to 5k - Top tips to get started with running",
      "content": [
        "\"You never regret a run,\" according to Giovanna Fletcher, host of BBC Sport's new Couch to 5K podcast.It might be hard to get out the door sometimes, but, according to the NHS, external, being active is one of the best things you can do for your mental health. As part of the BBC's Wellbeing Week, which runs from 12 to 18 May, BBC Sport has gathered some of the Couch to 5K Podcast's top tips to start running.",
        "Couch to 5K is a great way to get into running, providing a free, beginner-friendly running plan.The best way to start is to plan a route, wear comfortable clothing and trainers – and get out there. Of course, it might be hard at first, but it will get easier with time.Fletcher says: \"I can remember my first run. I only ran for 10 minutes and I felt this burn through my lungs for the majority of the day. My next run, I didn't feel that.\"Lindsey Burrow – the widow of rugby legend Rob – has used running to support her through grief, completing the London Marathon and the Rob Burrow Leeds Marathon in April and May 2025.\"Anyone that starts running, you've got to start somewhere,\" Burrow says.\"The first run seems impossible. The second one's not much better. Then something changes.\"Your lungs get stronger. Your legs get stronger. You just start to build on that courage, that resilience and that bravery.\"",
        "If you feel self-conscious running outside or are struggling to get started, organising to run with other people can help.\"I find it really hard running on my own,\" says radio DJ and Couch to 5K coach Jo Whiley.\"I really like running clubs, parkruns and running with a friend. That makes all the difference.\"You can find a running club near you on the England Athletics website, external and parkrun, external organises 5ks in local parks across the UK every weekend.Whiley adds that she finds it easier if she can talk to a friend while running: \"That's distracting and it stops you thinking about running.\"It's a really good way of catching up with friends. You don't have to look at each other, so if you're getting something off your chest, it's somehow easier to talk.\"",
        "By committing to Couch to 5K, you will get fitter over time, but that does not mean every run will be easy.\"Every run is different,\" Whiley says. \"There are days when you go out and it's really hard work. Then the next day, it's really easy and you can't quite work out why.\"On the days when it is tough, Burrow's advice is to \"keep putting one foot in front of the other\".\"Keep going,\" she adds. \"There will be tough times. There are parts of the run where you're thinking, 'This is awful, this is horrendous, how am I going to get through this?'\"Then, the elation you get, that endorphin release. You feel so much better in yourself.\"",
        "Once you start running, it can be easy to compare your running times to others.Whether it takes you 15 minutes, or an hour and 15 minutes, completing the Couch to 5K programme is a big achievement.\"So many people say, 'I'm not a runner',\" Fletcher says.\"Years ago I would have said I'm not a runner. Back then a runner was someone who did a 5k in 15 minutes. That's a runner.\"If I can slowly move my body around and get to 5k, I'm a runner. It doesn't matter how fast, it doesn't matter how long it takes you – you've done it.\"",
        "Even the most experienced runners do not want to run sometimes. On those days, focus on the benefits that running will bring.\"You can just have the headspace,\" Burrow says. \"You don't have to think about the worries of life.\"You put the music on and go out for a run. I don't know if it's the endorphin release of the run.\"I come back and I find I have much more patience. It puts me in a better mood for the day. I try to get my runs in early in the morning because I know it's going to set me up for the day.\"Whiley adds: \"On those days when you don't want to go out the door, you will always find an excuse not to run but make yourself do it because you never regret a run.\"",
        "Find the perfect playlist for your run with Pace Setter on BBC Sounds. From Romesh Ranganathan's Marathon Mix to motivational R&B or 2010s bangers, we have you covered.",
        "Couch to 5k coach Jo Whiley recommends running with others",
        "\"You never regret a run,\" according to Giovanna Fletcher, host of BBC Sport's new Couch to 5K podcast.",
        "It might be hard to get out the door sometimes, but, according to the NHS, external, being active is one of the best things you can do for your mental health.",
        "As part of the BBC's Wellbeing Week, which runs from 12 to 18 May, BBC Sport has gathered some of the Couch to 5K Podcast's top tips to start running.",
        "Couch to 5K is a great way to get into running, providing a free, beginner-friendly running plan.",
        "The best way to start is to plan a route, wear comfortable clothing and trainers – and get out there. Of course, it might be hard at first, but it will get easier with time.",
        "Fletcher says: \"I can remember my first run. I only ran for 10 minutes and I felt this burn through my lungs for the majority of the day. My next run, I didn't feel that.\"",
        "Lindsey Burrow – the widow of rugby legend Rob – has used running to support her through grief, completing the London Marathon and the Rob Burrow Leeds Marathon in April and May 2025.",
        "\"Anyone that starts running, you've got to start somewhere,\" Burrow says.",
        "\"The first run seems impossible. The second one's not much better. Then something changes.",
        "\"Your lungs get stronger. Your legs get stronger. You just start to build on that courage, that resilience and that bravery.\"",
        "Thousands of runners turn out in Rob Burrow's memory",
        "If you feel self-conscious running outside or are struggling to get started, organising to run with other people can help.",
        "\"I find it really hard running on my own,\" says radio DJ and Couch to 5K coach Jo Whiley.",
        "\"I really like running clubs, parkruns and running with a friend. That makes all the difference.\"",
        "You can find a running club near you on the England Athletics website, external and parkrun, external organises 5ks in local parks across the UK every weekend.",
        "Whiley adds that she finds it easier if she can talk to a friend while running: \"That's distracting and it stops you thinking about running.",
        "\"It's a really good way of catching up with friends. You don't have to look at each other, so if you're getting something off your chest, it's somehow easier to talk.\"",
        "What is Couch to 5k and how do I start?",
        "By committing to Couch to 5K, you will get fitter over time, but that does not mean every run will be easy.",
        "\"Every run is different,\" Whiley says. \"There are days when you go out and it's really hard work. Then the next day, it's really easy and you can't quite work out why.\"",
        "On the days when it is tough, Burrow's advice is to \"keep putting one foot in front of the other\".",
        "\"Keep going,\" she adds. \"There will be tough times. There are parts of the run where you're thinking, 'This is awful, this is horrendous, how am I going to get through this?'",
        "\"Then, the elation you get, that endorphin release. You feel so much better in yourself.\"",
        "This video can not be played",
        "Running 'builds up strong mindset' - Lindsey Burrow",
        "Once you start running, it can be easy to compare your running times to others.",
        "Whether it takes you 15 minutes, or an hour and 15 minutes, completing the Couch to 5K programme is a big achievement.",
        "\"So many people say, 'I'm not a runner',\" Fletcher says.",
        "\"Years ago I would have said I'm not a runner. Back then a runner was someone who did a 5k in 15 minutes. That's a runner.",
        "\"If I can slowly move my body around and get to 5k, I'm a runner. It doesn't matter how fast, it doesn't matter how long it takes you – you've done it.\"",
        "Even the most experienced runners do not want to run sometimes. On those days, focus on the benefits that running will bring.",
        "\"You can just have the headspace,\" Burrow says. \"You don't have to think about the worries of life.",
        "\"You put the music on and go out for a run. I don't know if it's the endorphin release of the run.",
        "\"I come back and I find I have much more patience. It puts me in a better mood for the day. I try to get my runs in early in the morning because I know it's going to set me up for the day.\"",
        "Whiley adds: \"On those days when you don't want to go out the door, you will always find an excuse not to run but make yourself do it because you never regret a run.\"",
        "Find the perfect playlist for your run with Pace Setter on BBC Sounds. From Romesh Ranganathan's Marathon Mix to motivational R&B or 2010s bangers, we have you covered.",
        "The Couch to 5K Podcast"
      ]
    }
  ]
}