{
  "scraped_at": "2025-10-27T18:56:59.807546",
  "total_articles": 13,
  "category": "rugby-league",
  "articles_per_category": 100,
  "articles": [
    {
      "url": "https://www.bbc.com/sport/rugby-league/articles/c74jz23jdp0o",
      "main_category": "sport",
      "detailed_category": "rugby-league",
      "topic": "Error-prone England suffer Ashes 'torture' at Wembley",
      "content": [
        "It is never a good sign when a head coach describes an international fixture involving his team as \"torture\".Shaun Wane was clearly hurting after watching his England side suffer a comprehensive 26-6 defeat by Australia at Wembley in the first Ashes match for 22 years.In truth, it could have been a lot worse. Australia started slowly and led by only eight points at half-time but eased clear in the second half while England wasted chances and made simple mistakes.Australia will retain the Ashes if they beat England at Hill Dickinson Stadium in Liverpool next weekend - and they are not out of second gear yet.\"They are very disappointed in the dressing room,\" Wane told his post-match media conference of his players. \"I really wanted to see the best of our players, but we undersold ourselves today. That's torture for me.\"The gap in quality between the sides was illustrated by the first actions of the respective full-backs in the second half.Reece Walsh, who was player of the match, carried the ball 80 metres following a slip by England's much-vaunted scrum-half Mikey Lewis. While England resisted the initial thrust, the ground gained provided the platform for Australia to score a killer second try of the match.\"Reece Walsh has saved two tries and he has scored two,\" former England forward James Graham told BBC One. \"Let's not forget that break he made at the beginning of the second half, which set the tone.\"The try resulting from that break was scored by second row Angus Crichton, who evaded England full back Jack Welsby to score.In contrast to the forward-thinking Walsh, Welsby was caught out. He backed off Crichton until his heels were on the try line; when he made a limp attempt to tackle his man, it was far too late.That is what tortured Wane the most - not being outclassed by the world number one international side and clear favourites for this series, but being outfought.\"I know what these players are capable of, but we didn't give ourselves a chance to win,\" he said. \"It hurts a lot; we didn't put our best show on today. What we did wrong are easy fixes.\"They outplayed and outkicked us. It is easy to fix but has a knock-on effect. It was simple rugby; we did not nail the details.\"",
        "Changes will surely be made before England play at Everton's new home next Saturday. AJ Brimson could come in for Welsby at full back, while Harry Smith - the usual central partner for captain George Williams - could also return.Williams and Super League Grand Final star Lewis coped well with ball in hand, but their kicking was poor. Given England's clearest first-half openings came via grubber kicks, it is something which will need urgent improvement.And all this is without acknowledging than Man of Steel Jake Connor has been left out of the England squad for this series entirely. A big decision by Wane, and one that will continue to be picked over as the series progresses.As for Australia, this was business as usual. They have not lost to England since 1995, or to a British side since 2006 - when Brian Noble's side won a Tri-Nations contest in Sydney.On this form, Australia will fancy significantly extending an unbeaten Test series run on UK soil that stands at 66 years.And the best is yet to come, coach Kevin Walters says.\"It was a bit scrappy - we expect us to get better, and the English side will too,\" Walters told his post-match media conference. \"Our defence was good, which makes me happier for than anything.\"There's no relief. I am in a strong position as the coach of this side. These guys give you confidence. they handled the pressure well and then will get on for next week.\"The only downside for Walters is that captain Isaah Yeo will be absent next weekend after suffering a category one head injury during the first half following a clash with Dom Young.\"Yeo is with us, but had a bad knock,\" the coach said. \"We have good medical staff then we will see where he is at in the next couple of days. Isaah is a tough hombre.\"",
        "This video can not be played",
        "England 'undersold' ourselves today - Wane",
        "It is never a good sign when a head coach describes an international fixture involving his team as \"torture\".",
        "Shaun Wane was clearly hurting after watching his England side suffer a comprehensive 26-6 defeat by Australia at Wembley in the first Ashes match for 22 years.",
        "In truth, it could have been a lot worse. Australia started slowly and led by only eight points at half-time but eased clear in the second half while England wasted chances and made simple mistakes.",
        "Australia will retain the Ashes if they beat England at Hill Dickinson Stadium in Liverpool next weekend - and they are not out of second gear yet.",
        "\"They are very disappointed in the dressing room,\" Wane told his post-match media conference of his players. \"I really wanted to see the best of our players, but we undersold ourselves today. That's torture for me.\"",
        "The gap in quality between the sides was illustrated by the first actions of the respective full-backs in the second half.",
        "Reece Walsh, who was player of the match, carried the ball 80 metres following a slip by England's much-vaunted scrum-half Mikey Lewis. While England resisted the initial thrust, the ground gained provided the platform for Australia to score a killer second try of the match.",
        "\"Reece Walsh has saved two tries and he has scored two,\" former England forward James Graham told BBC One. \"Let's not forget that break he made at the beginning of the second half, which set the tone.\"",
        "The try resulting from that break was scored by second row Angus Crichton, who evaded England full back Jack Welsby to score.",
        "In contrast to the forward-thinking Walsh, Welsby was caught out. He backed off Crichton until his heels were on the try line; when he made a limp attempt to tackle his man, it was far too late.",
        "That is what tortured Wane the most - not being outclassed by the world number one international side and clear favourites for this series, but being outfought.",
        "\"I know what these players are capable of, but we didn't give ourselves a chance to win,\" he said. \"It hurts a lot; we didn't put our best show on today. What we did wrong are easy fixes.",
        "\"They outplayed and outkicked us. It is easy to fix but has a knock-on effect. It was simple rugby; we did not nail the details.\"",
        "Australia crush England in first Ashes match for 22 years",
        "Walsh and Crichton drive Australia to win over England - as it happened",
        "This video can not be played",
        "Australia dominate England in first Ashes Test",
        "Changes will surely be made before England play at Everton's new home next Saturday. AJ Brimson could come in for Welsby at full back, while Harry Smith - the usual central partner for captain George Williams - could also return.",
        "Williams and Super League Grand Final star Lewis coped well with ball in hand, but their kicking was poor. Given England's clearest first-half openings came via grubber kicks, it is something which will need urgent improvement.",
        "And all this is without acknowledging than Man of Steel Jake Connor has been left out of the England squad for this series entirely. A big decision by Wane, and one that will continue to be picked over as the series progresses.",
        "As for Australia, this was business as usual. They have not lost to England since 1995, or to a British side since 2006 - when Brian Noble's side won a Tri-Nations contest in Sydney.",
        "On this form, Australia will fancy significantly extending an unbeaten Test series run on UK soil that stands at 66 years.",
        "And the best is yet to come, coach Kevin Walters says.",
        "\"It was a bit scrappy - we expect us to get better, and the English side will too,\" Walters told his post-match media conference. \"Our defence was good, which makes me happier for than anything.",
        "\"There's no relief. I am in a strong position as the coach of this side. These guys give you confidence. they handled the pressure well and then will get on for next week.\"",
        "The only downside for Walters is that captain Isaah Yeo will be absent next weekend after suffering a category one head injury during the first half following a clash with Dom Young.",
        "\"Yeo is with us, but had a bad knock,\" the coach said. \"We have good medical staff then we will see where he is at in the next couple of days. Isaah is a tough hombre.\"",
        "25 October, 1 November, 8 November",
        "Wembley, Hill Dickinson Stadium, AMT Headingley",
        "Watch all three Tests live on BBC One, BBC iPlayer and the BBC Sport website and app"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/rugby-league/articles/ceq0r4vg1j1o",
      "main_category": "sport",
      "detailed_category": "rugby-league",
      "topic": "Australia crush England in first Ashes match for 22 years",
      "content": [
        "Rugby League Ashes - Match 1 of 3England (0) 6Try: Clark Goal: LewisAustralia (8) 26Tries: Walsh 2, Crichton 2 Goals: Cleary 5",
        "Twenty-two years later, same story. Australia picked up where they left off in their domination of the Rugby League Ashes.During the last series in 2003, the Kangaroos won 3-0 after edging a trio of tight contests. All three games were won by six points or fewer, with Great Britain having led in the second half.The early signs here are the 2025 edition may not be so close. England did not shirk from the challenge, but Australia had more quality when it mattered and eased through the gears in the second half to win comfortably.The hosts defended well but had to do so in numbers against a Kangaroos side that looked a well-oiled machine whenever they advanced with their attacking threat.And the flamboyant dive by brilliant full-back Reece Walsh - the outstanding player of this match - as he crossed for the first score of the series lit up the Wembley encounter and highlighted the difference between the rivals. Despite the best efforts of Shaun Wane's men, Australia still have the upper hand.",
        "After a bruising, hard-fought opening, Walsh's try set the tone as debutant Mark Nawaqanitawase shifted the ball left for the rampaging Brisbane Broncos full-back to go over in style.England were unhappy as scrum-half Mikey Lewis appeared to be tripped in the build-up, and there looked to be a forward pass too - but the try was given following a review by video referee Jack Smith.Smith partly redeemed himself to the Wembley crowd by disallowing a second Australia try before the break as Dom Young was taken out by Josh Addo-Carr as he jumped to catch a high kick.Wane's side initially responded well to conceding and defence-splitting grubber kicks from George Williams and Tom Johnstone had the green and gold defence on their heels.But Nathan Cleary added a penalty with the last action of the first half to put Australia 8-0 up - and they extended the lead straight after the interval.After putting the hosts under constant pressure from the restart, Angus Crichton strode through to score with full-back Jack Welsby too deep and allowing him to go through far too easily.Australia kept England at arm's length thereafter, easing their way to victory in the first meeting between the sides since the 2017 World Cup final.That success was secured with 15 minutes remaining as second row Crichton scythed through the defence again for his second try, and more gloss was added when a superb field-length move down the left was finished by Walsh.Daryl Clark barged over in the final minutes for England, but it was no more than a consolation.A downside for the visitors was that captain Isaah Yeo was forced off in the first half after failing a head injury assessment following a clash with Young. He will also miss the second Test on Saturday (14:30 GMT) at Hill Dickinson Stadium in Liverpool.There, England will continue a quest for a first win over Australia in three decades, and try to rescue a first Ashes series triumph in 55 years.",
        "England: Welsby, Young, Farnworth, Wardle, Johnstone, Williams, Lewis, Havard, Clark, Lees, Bateman, Pearce-Paul, KnowlesInterchanges: Litten, Walmsley, Trout, McMeekenAustralia: Walsh, Nawaqanitawase, Staggs, Shibasaki, Addo-Carr, Munster, Cleary, Carrigan, Grant, Fa'asuamaleaui, Crichton, Young, YeoInterchanges: Dearden, Collins, Cotter, KoloamatangiReferee: Liam Moore",
        "This video can not be played",
        "Australia dominate England in first Ashes Test",
        "Rugby League Ashes - Match 1 of 3",
        "Try: Clark Goal: Lewis",
        "Tries: Walsh 2, Crichton 2 Goals: Cleary 5",
        "Twenty-two years later, same story. Australia picked up where they left off in their domination of the Rugby League Ashes.",
        "During the last series in 2003, the Kangaroos won 3-0 after edging a trio of tight contests.",
        "All three games were won by six points or fewer, with Great Britain having led in the second half.",
        "The early signs here are the 2025 edition may not be so close. England did not shirk from the challenge, but Australia had more quality when it mattered and eased through the gears in the second half to win comfortably.",
        "The hosts defended well but had to do so in numbers against a Kangaroos side that looked a well-oiled machine whenever they advanced with their attacking threat.",
        "And the flamboyant dive by brilliant full-back Reece Walsh - the outstanding player of this match - as he crossed for the first score of the series lit up the Wembley encounter and highlighted the difference between the rivals.",
        "Despite the best efforts of Shaun Wane's men, Australia still have the upper hand.",
        "Walsh and Crichton drive Australia to win over England - as it happened",
        "'Cleary's their general' - Morley's five Australia players to watch",
        "This video can not be played",
        "'We undersold ourselves today' - Wane",
        "After a bruising, hard-fought opening, Walsh's try set the tone as debutant Mark Nawaqanitawase shifted the ball left for the rampaging Brisbane Broncos full-back to go over in style.",
        "England were unhappy as scrum-half Mikey Lewis appeared to be tripped in the build-up, and there looked to be a forward pass too - but the try was given following a review by video referee Jack Smith.",
        "Smith partly redeemed himself to the Wembley crowd by disallowing a second Australia try before the break as Dom Young was taken out by Josh Addo-Carr as he jumped to catch a high kick.",
        "Wane's side initially responded well to conceding and defence-splitting grubber kicks from George Williams and Tom Johnstone had the green and gold defence on their heels.",
        "But Nathan Cleary added a penalty with the last action of the first half to put Australia 8-0 up - and they extended the lead straight after the interval.",
        "After putting the hosts under constant pressure from the restart, Angus Crichton strode through to score with full-back Jack Welsby too deep and allowing him to go through far too easily.",
        "Australia kept England at arm's length thereafter, easing their way to victory in the first meeting between the sides since the 2017 World Cup final.",
        "That success was secured with 15 minutes remaining as second row Crichton scythed through the defence again for his second try, and more gloss was added when a superb field-length move down the left was finished by Walsh.",
        "Daryl Clark barged over in the final minutes for England, but it was no more than a consolation.",
        "A downside for the visitors was that captain Isaah Yeo was forced off in the first half after failing a head injury assessment following a clash with Young. He will also miss the second Test on Saturday (14:30 GMT) at Hill Dickinson Stadium in Liverpool.",
        "There, England will continue a quest for a first win over Australia in three decades, and try to rescue a first Ashes series triumph in 55 years.",
        "England: Welsby, Young, Farnworth, Wardle, Johnstone, Williams, Lewis, Havard, Clark, Lees, Bateman, Pearce-Paul, Knowles",
        "Interchanges: Litten, Walmsley, Trout, McMeeken",
        "Australia: Walsh, Nawaqanitawase, Staggs, Shibasaki, Addo-Carr, Munster, Cleary, Carrigan, Grant, Fa'asuamaleaui, Crichton, Young, Yeo",
        "Interchanges: Dearden, Collins, Cotter, Koloamatangi",
        "25 October, 1 November, 8 November",
        "Wembley, Hill Dickinson Stadium, AMT Headingley",
        "Watch all three Tests live on BBC One, BBC iPlayer and the BBC Sport website and app"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/rugby-league/articles/cy8v3gpjndro",
      "main_category": "sport",
      "detailed_category": "rugby-league",
      "topic": "Farnworth - the Lancashire lad who could light up Ashes for England",
      "content": [
        "Having made the journey from Blacko in Lancashire to the bright lights of Brisbane, England's Herbie Farnworth has emerged as an NRL star in Australia.As arguably the best centre in the world, he is also the \"cheat code\" England hope can help deliver a first Ashes series victory over the Kangaroos since 1970.Farnworth is one of six men in Shaun Wane's England squad who play in Australia's premier competition.And his abilities cannot be underestimated, even as former Australia forward Aaron Woods and other pundits from outside the UK have provided fuel for Wane's squad with withering comments about their quality.A key member of the side who reached the World Cup semi-final in 2022, Farnworth was named as one of the two Dally M centres of the year in both 2023 and 2024 and was instrumental in England's 2-0 win over Samoa 12 months ago - scoring three tries and emerging as the series' top metre maker.During 2025, Farnworth exhibited his class for the Dolphins, as he crossed for 12 tries in 19 appearances until a hamstring injury ended his season in early August and affected the Queensland side's push for the finals.Wane has repeatedly referred to him as \"one of the best centres in the world\", a view endorsed by England captain George Williams, who looks set to be a club-mate of Farnworth's in the near future.\"Herbie is unbelievable,\" said the England stand-off. \"He is one of the best players in the world at the minute. He is a cheat code playing in the NRL so we welcome him into our team with open arms.\"He creates something from nothing. He's a good lad too, who I have known for a long time. He kills it in the NRL.\"In the last series we played against Samoa, it was like he was playing a different game to anyone else. He was just running through like he was playing under-sevens.\"Gold Coast Titans back AJ Brimson, who is a newcomer to Wane's squad added: \"In my opinion, he was the best centre [in the NRL] this year. \"He has been the Dally M centre the last two years and missed out this year by a smidge and I thought this was his best year at centre. He's in fine form and is someone I am looking forward to playing with.\"",
        "The 25-year-old's rise to prominence is well documented.  Once on the books of Manchester United, he was courted by Burnley and Manchester City as a promising young footballer.Instead he devoted himself to rugby league and under the tutelage of his uncle, the former Wigan scout Brian Foley, he excelled as a junior for Wigan St Patricks before leaving his Lancashire home, aged 17, to pursue his dream 10,000 miles away.Signed by Brisbane Broncos, he made his NRL debut in 2019, and was a part of the team who reached the 2023 Grand Final before switching to their local rivals the Dolphins - the NRL's 17th franchise - for 2024.Despite carrying a status to rival England's star-studded opponents and being the man many believe will illuminate the series, he remains modest and in touch with his roots. \"I keep trying to get better each year and I like to think I've done that over the time I've had in the NRL and it is just the same in this camp too,\" Farnworth said.\"I am going to learn a lot from the boys in Super League. We have some great footballers. We've got a really strong bond as a team and we're planning on doing something special.\"I play against them [Australia's players] week in and week out and they are very talented players, but they are just men. There is  nothing superhuman about them. I love playing the Aussies and am keen to get stuck into them at Wembley.\"Farnworth's remit this time around has also included looking after Brimson, who switched his international allegiance from Australia to England in May. The full-back's two brothers were born in Chertsey and he has often visited England's south coast for family holidays, with his mum hailing from London. And so Farnworth joked that he wanted to show him a little bit of northern culture.\"I took AJ to Greggs. We were walking around Manchester city centre and he was a bit hungry so I thought I'd show him a bit of culture,\" said Farnworth.",
        "With England based just outside Manchester for most of the three-Test series, Farnworth has been able to enjoy home comforts. \"I've been up Pendle Hill. It's a boost to see all my family and friends again because I don't get to see them too often,\" Farnworth said.\"When I do, it is very special and having them watch me play is a rare occasion, so it makes it even better for me. \"They will be coming to all three games. Whenever I go home it feels like I have not left. It's a very close-knit village and everyone knows me and the family.\"But his friends have called him out over a slight Queensland twang to his accent.\"You pick up the twang [in Australia],\" he said. \"It's the little slang words I have lost from over here but once I'm around the English boys, it comes back pretty quick. In Australia, I get slated for being English, then when I come back home, my mates slag me for being an Aussie. I can't win.\"With a record crowd for an Ashes Test of about 60,000 expected at Wembley on Saturday, the magnitude of the occasion - a first Test series against Australia since 2003 - is not lost on Farnworth.\"I might not get to play in one again. If it is every 20 years, it makes it very, very special. It is everything,\" he added.\"I have got a lot of bets riding on it with team-mates at the Dolphins, so I am going to be poor if I go back and we have lost.\"",
        "Herbie Farnworth is set to play a key part in England's first meeting with Australia since losing 6-0 in the 2017 World Cup final",
        "Having made the journey from Blacko in Lancashire to the bright lights of Brisbane, England's Herbie Farnworth has emerged as an NRL star in Australia.",
        "As arguably the best centre in the world, he is also the \"cheat code\" England hope can help deliver a first Ashes series victory over the Kangaroos since 1970.",
        "Farnworth is one of six men in Shaun Wane's England squad who play in Australia's premier competition.",
        "And his abilities cannot be underestimated, even as former Australia forward Aaron Woods and other pundits from outside the UK have provided fuel for Wane's squad with withering comments about their quality.",
        "A key member of the side who reached the World Cup semi-final in 2022, Farnworth was named as one of the two Dally M centres of the year in both 2023 and 2024 and was instrumental in England's 2-0 win over Samoa 12 months ago - scoring three tries and emerging as the series' top metre maker.",
        "During 2025, Farnworth exhibited his class for the Dolphins, as he crossed for 12 tries in 19 appearances until a hamstring injury ended his season in early August and affected the Queensland side's push for the finals.",
        "Wane has repeatedly referred to him as \"one of the best centres in the world\", a view endorsed by England captain George Williams, who looks set to be a club-mate of Farnworth's in the near future.",
        "\"Herbie is unbelievable,\" said the England stand-off. \"He is one of the best players in the world at the minute. He is a cheat code playing in the NRL so we welcome him into our team with open arms.",
        "\"He creates something from nothing. He's a good lad too, who I have known for a long time. He kills it in the NRL.",
        "\"In the last series we played against Samoa, it was like he was playing a different game to anyone else. He was just running through like he was playing under-sevens.\"",
        "Gold Coast Titans back AJ Brimson, who is a newcomer to Wane's squad added: \"In my opinion, he was the best centre [in the NRL] this year.",
        "\"He has been the Dally M centre the last two years and missed out this year by a smidge and I thought this was his best year at centre. He's in fine form and is someone I am looking forward to playing with.\"",
        "England aim to avoid late loss pain in Ashes opener",
        "Why has Rugby League Ashes waited so long for revival?",
        "More Than The Score: Rugby League Ashes rivalry renewed",
        "Herbie Farnworth had a starring role against Samoa last autumn",
        "The 25-year-old's rise to prominence is well documented.",
        "Once on the books of Manchester United, he was courted by Burnley and Manchester City as a promising young footballer.",
        "Instead he devoted himself to rugby league and under the tutelage of his uncle, the former Wigan scout Brian Foley, he excelled as a junior for Wigan St Patricks before leaving his Lancashire home, aged 17, to pursue his dream 10,000 miles away.",
        "Signed by Brisbane Broncos, he made his NRL debut in 2019, and was a part of the team who reached the 2023 Grand Final before switching to their local rivals the Dolphins - the NRL's 17th franchise - for 2024.",
        "Despite carrying a status to rival England's star-studded opponents and being the man many believe will illuminate the series, he remains modest and in touch with his roots.",
        "\"I keep trying to get better each year and I like to think I've done that over the time I've had in the NRL and it is just the same in this camp too,\" Farnworth said.",
        "\"I am going to learn a lot from the boys in Super League. We have some great footballers. We've got a really strong bond as a team and we're planning on doing something special.",
        "\"I play against them [Australia's players] week in and week out and they are very talented players, but they are just men. There is  nothing superhuman about them. I love playing the Aussies and am keen to get stuck into them at Wembley.\"",
        "Farnworth's remit this time around has also included looking after Brimson, who switched his international allegiance from Australia to England in May.",
        "The full-back's two brothers were born in Chertsey and he has often visited England's south coast for family holidays, with his mum hailing from London. And so Farnworth joked that he wanted to show him a little bit of northern culture.",
        "\"I took AJ to Greggs. We were walking around Manchester city centre and he was a bit hungry so I thought I'd show him a bit of culture,\" said Farnworth.",
        "25 October, 1 November, 8 November",
        "Wembley, Hill Dickinson Stadium, AMT Headingley",
        "Watch all three Tests live on BBC One, BBC iPlayer and the BBC Sport website and app",
        "With England based just outside Manchester for most of the three-Test series, Farnworth has been able to enjoy home comforts.",
        "\"I've been up Pendle Hill. It's a boost to see all my family and friends again because I don't get to see them too often,\" Farnworth said.",
        "\"When I do, it is very special and having them watch me play is a rare occasion, so it makes it even better for me.",
        "\"They will be coming to all three games. Whenever I go home it feels like I have not left. It's a very close-knit village and everyone knows me and the family.\"",
        "But his friends have called him out over a slight Queensland twang to his accent.",
        "\"You pick up the twang [in Australia],\" he said.",
        "\"It's the little slang words I have lost from over here but once I'm around the English boys, it comes back pretty quick. In Australia, I get slated for being English, then when I come back home, my mates slag me for being an Aussie. I can't win.\"",
        "With a record crowd for an Ashes Test of about 60,000 expected at Wembley on Saturday, the magnitude of the occasion - a first Test series against Australia since 2003 - is not lost on Farnworth.",
        "\"I might not get to play in one again. If it is every 20 years, it makes it very, very special. It is everything,\" he added.",
        "\"I have got a lot of bets riding on it with team-mates at the Dolphins, so I am going to be poor if I go back and we have lost.\""
      ]
    },
    {
      "url": "https://www.bbc.com/sport/rugby-league/articles/c4gwdxk5y3zo",
      "main_category": "sport",
      "detailed_category": "rugby-league",
      "topic": "'I was celebrating Grand Final when I got England call-up'",
      "content": [
        "Mikey Lewis had not even been to bed after helping Hull KR secure their historic treble, when he received another reason to celebrate.The 24-year-old is the man of the moment in English rugby league, after his starring role in their Super League Grand Final win over Wigan to complete a sensational season for his club.Despite this success, it was a matter of debate whether he would be called up for the first Rugby League Ashes series in 22 years, with England rich with talent in the central roles.But Lewis never doubted he would be part of the first Ashes series since 2003, before getting the good news from coach Shaun Wane.\"I was confident I would get a call up,\" he told BBC Sport at Wembley before the opening game of the three-match series at the national stadium.\"I knew I had to play well and I have done that. I am honoured and proud to be part of this.\"I was still having a drink with the lads, when Wane called me up it was Sunday morning, and I hadn't been to bed yet. Then we just carried on having beers.\"The final was a fantastic result. The treble was our focus, and we got it done. I feel like I have had a good year personally. It is fantastic preparation for this.\"",
        "Australia face England at Wembley on Saturday, at Everton's Hill Dickinson Stadium on 1 November and at AMT Headingley on 8 November. All three matches are 14:30 kick-offs and will be live on BBC One.The series has been a long time coming, after a planned tour in 2020 fell victim to the coronavirus pandemic.It means Lewis' generation have never experienced the Ashes - something he is delighted to put right.\"I was three years old at the last Ashes series,\" he said. \"It is the pinnacle of international rugby. For us as a playing group, it is an honour. We do not take it for granted. We want to do the English people proud.\"It is just exciting to be part of the series; this group could be in the history books forever.\"",
        "That is a sentiment shared in the Australian camp, as they aim to continue a remarkable spell of dominance on British soil.The Australians have not lost a series in England since 1959, nor an Ashes since 1970.\"It's huge to have the Ashes back,\" Kangaroos half-back Nathan Cleary told BBC Sport. \"The international game is heading in the right direction.\"I feel very lucky to be part of this series. I was very young in 2003 but back in Australia they have been showing a lot of clips from the games. To be able to watch that and hear stories, you feel very lucky.\"They're very excited back home; there will be a few early mornings for people to watch the games.\"Cleary, unlike opposite number Lewis, has endured a disappointing domestic campaign.Cleary's Penrith Panthers missed out on the National Rugby League title for the first time in five years, and the Grand Final for the first time in six. He was also beaten with New South Wales in the State of Origin series in July.The 27-year-old is determined that disappointment will not spill on to the international stage as Australia look to make good on their status as world champions, the number one ranked international side and clear favourites in this series.\"We didn't finish the way we wanted to at Penrith, but being able to represent Australia on a historic stage is something I can't wait to be a part of - it's a great way to finish the season,\" he said.England, meanwhile, are boosted by more NRL experience in their side than ever before, with six of their squad representing clubs down under.Newcastle Knights back rower Kai Pearce-Paul is among them and says his experience in the NRL could offer invaluable help to his international team-mates.\"My time in Australia, I've loved it,\" he told BBC Sport. \"Being at Newcastle, a small town big on rugby, it has made me feel at home. And waking up and going to the beach in the morning, I can't complain.\"A lot of these boys might not have seen much of the Australians play. Playing against them at the weekend helps me out, lets me see the patterns and the trends, so hopefully I can help my boys out too.\"",
        "Mikey Lewis helped Hull KR end their 40-year wait for silverware in 2025",
        "Mikey Lewis had not even been to bed after helping Hull KR secure their historic treble, when he received another reason to celebrate.",
        "The 24-year-old is the man of the moment in English rugby league, after his starring role in their Super League Grand Final win over Wigan to complete a sensational season for his club.",
        "Despite this success, it was a matter of debate whether he would be called up for the first Rugby League Ashes series in 22 years, with England rich with talent in the central roles.",
        "But Lewis never doubted he would be part of the first Ashes series since 2003, before getting the good news from coach Shaun Wane.",
        "\"I was confident I would get a call up,\" he told BBC Sport at Wembley before the opening game of the three-match series at the national stadium.",
        "\"I knew I had to play well and I have done that. I am honoured and proud to be part of this.",
        "\"I was still having a drink with the lads, when Wane called me up it was Sunday morning, and I hadn't been to bed yet. Then we just carried on having beers.",
        "\"The final was a fantastic result. The treble was our focus, and we got it done. I feel like I have had a good year personally. It is fantastic preparation for this.\"",
        "Lewis in England squad for first Test as Smith left out",
        "Walsh, Shibasaki & Nawaqanitawase start for Australia",
        "Best England set-up I've been part of - Williams",
        "Australia face England at Wembley on Saturday, at Everton's Hill Dickinson Stadium on 1 November and at AMT Headingley on 8 November. All three matches are 14:30 kick-offs and will be live on BBC One.",
        "The series has been a long time coming, after a planned tour in 2020 fell victim to the coronavirus pandemic.",
        "It means Lewis' generation have never experienced the Ashes - something he is delighted to put right.",
        "\"I was three years old at the last Ashes series,\" he said. \"It is the pinnacle of international rugby. For us as a playing group, it is an honour. We do not take it for granted. We want to do the English people proud.",
        "\"It is just exciting to be part of the series; this group could be in the history books forever.\"",
        "Nathan Cleary was part of the Australia side who won the 2022 World Cup in England",
        "That is a sentiment shared in the Australian camp, as they aim to continue a remarkable spell of dominance on British soil.",
        "The Australians have not lost a series in England since 1959, nor an Ashes since 1970.",
        "\"It's huge to have the Ashes back,\" Kangaroos half-back Nathan Cleary told BBC Sport. \"The international game is heading in the right direction.",
        "\"I feel very lucky to be part of this series. I was very young in 2003 but back in Australia they have been showing a lot of clips from the games. To be able to watch that and hear stories, you feel very lucky.",
        "\"They're very excited back home; there will be a few early mornings for people to watch the games.\"",
        "Cleary, unlike opposite number Lewis, has endured a disappointing domestic campaign.",
        "Cleary's Penrith Panthers missed out on the National Rugby League title for the first time in five years, and the Grand Final for the first time in six. He was also beaten with New South Wales in the State of Origin series in July.",
        "The 27-year-old is determined that disappointment will not spill on to the international stage as Australia look to make good on their status as world champions, the number one ranked international side and clear favourites in this series.",
        "\"We didn't finish the way we wanted to at Penrith, but being able to represent Australia on a historic stage is something I can't wait to be a part of - it's a great way to finish the season,\" he said.",
        "England, meanwhile, are boosted by more NRL experience in their side than ever before, with six of their squad representing clubs down under.",
        "Newcastle Knights back rower Kai Pearce-Paul is among them and says his experience in the NRL could offer invaluable help to his international team-mates.",
        "\"My time in Australia, I've loved it,\" he told BBC Sport. \"Being at Newcastle, a small town big on rugby, it has made me feel at home. And waking up and going to the beach in the morning, I can't complain.",
        "\"A lot of these boys might not have seen much of the Australians play. Playing against them at the weekend helps me out, lets me see the patterns and the trends, so hopefully I can help my boys out too.\"",
        "25 October, 1 November, 8 November",
        "Wembley, Hill Dickinson Stadium, AMT Headingley",
        "Watch all three Tests live on BBC One, BBC iPlayer and the BBC Sport website and app"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/rugby-league/articles/cx2p7xpejgyo",
      "main_category": "sport",
      "detailed_category": "rugby-league",
      "topic": "'Cleary's their general' - Morley's five Australia players to watch",
      "content": [
        "\"I can't believe it's been over 20 years since we last had an Ashes series,\" says Adrian Morley. The former Leeds, Sydney Roosters and Warrington forward played for Great Britain in the most recent Test series against Australia in 2003, and is thrilled to see it return.\"I know there have been one-off Test matches since, but this is the pinnacle - the oldest and fiercest rivalry in rugby league. Roll on Wembley.\"Australia face England at Wembley on 25 October, at Everton's Hill Dickinson Stadium on 1 November and at AMT Headingley on 8 November. All three matches are 14:30 kick-offs and will be live on BBC One.The first British player to win Super League and NRL Grand Finals, Morley keeps a keen eye on the Australian game - and here gives BBC Sport his thoughts on the Kangaroos players to watch.",
        "Age: 23 Club: Brisbane Broncos Position: Full-back\"The Justin Bieber of rugby league\" is how Australian Rugby League Commission chairman Peter V'landys described Walsh - a full-back with star quality and 640,000 Instagram followers.Walsh's first Australia call-up came the day after an incredible individual display propelled Brisbane Broncos to victory over Melbourne Storm in the NRL Grand Final. He scored a memorable individual try, provided three assists and made a dramatic try-saving tackle in the final seconds.He plays on the edge - he avoided a sin-binning but received a fine for a high tackle earlier in the game - and has plenty of personality. He often takes to the field with painted nails, which he decorates to bond with four-year-old daughter Leila.That personality occasionally gets him into bother - he went viral on social media last month over a video showing him drinking water out of a toilet bowl, joking that it helped his muscle recovery after games.The toilet was newly installed, and had not been used, although his club still had to hurry out a 'don't try this at home' statement.Morley's verdict: \"He's got great balance, speed, strength. He seems to be calm under pressure as well. That was one of the best Grand Final performances I've ever seen. It was fantastic, the way he went about his business. It was an iconic performance. He's etched himself into Brisbane Broncos folklore.\"",
        "Age: 27 Club: Penrith Panthers Position: Half-backWorld Cup winner. Expert kicker. Game changer. Once led his team to NRL Grand Final victory with a torn knee ligament. For years, Nathan Cleary has been Australian rugby league's main man.On the field, he inspired Penrith Panthers to four successive Grand Final wins from 2021 to 2024. Off it, he is one half of an elite sporting couple - his partner is Manchester City and Australia footballer Mary Fowler.But this has not been a straightforward season for the Panthers captain. They were bottom of the NRL after 12 rounds and, although they reached the play-offs, hopes of a fifth straight title were ended by eventual winners Brisbane Broncos.Cleary himself faced criticism after New South Wales surprisingly lost their State of Origin decider against Queensland in Sydney in July.However, he remains among rugby league's modern greats. It is only two years since that remarkable Grand Final display for the Panthers against the Broncos, playing with knee ligament damage for 71 minutes and still scoring the winning try.Morley's verdict: \"He's got a fantastic rugby league brain. He's another one who's very, very calm under pressure. And it doesn't matter who he's playing for - Penrith Panthers, New South Wales in the State of Origin or the Kangaroos - he's their general and he guides the team around the pitch.\"",
        "Age 27: Club: Brisbane Broncos Position: CentreShibasaki began the season by throwing up into a bucket. He ends it with a Grand Final title and an Ashes call-up. It is quite the comeback story.Twelve months ago his career was drifting: He had played only three NRL matches in three seasons and was working in youth support while playing reserve-grade rugby league. He was then offered a train-and-trial deal with Brisbane Broncos and, despite struggling with his first pre-season training session so much that it made him vomit, he won a place in the team.The upswing continued as he was called up to the Queensland side who won the State of Origin series. Although he received a late-season club ban for his part in a drinking session, he bounced back to score two tries in the Grand Final as the Broncos won their first NRL title in 19 years.Morley's verdict: \"I love stories like that where you get lads given a chance or asking for a trial, and really working hard and going about their business. It just goes to show that if you train hard and get a bit of luck on your side, there's no reason why you can't be scoring two tries in the Grand Final and being picked for a Kangaroos Ashes series. Fair play to him.\"",
        "Age: 30 Club: Penrith Panthers Position: Loose forwardPenrith Panthers' all-time leading appearance maker took over his country's captaincy last autumn after James Tedesco was dropped for the Pacific Championships, and led them to the title.Loose forward Yeo then captained New South Wales during the State of Origin series against Queensland.A World Cup winner three years ago, he will continue to lead the Kangaroos for the Ashes tour.Morley's verdict: \"He's the rock of the Penrith Panthers, who have had such a fantastic run in the NRL. You very rarely get teams who dominate for as long as Penrith have and it's down to players like Nathan Cleary and Isaah Yeo. He always puts his hand up. He's a workhorse. Whoever he's playing for, he always does a great job.\"",
        "Age: 25 Club: Sydney Roosters Position: Winger\"That's the try of the decade,\" exclaimed Channel Nine commentator Matthew Thompson after Mark Nawaqanitawase produced an outrageous piece of skill for the Sydney Roosters in May.If you haven't seen the try that the winger scored, external against the Canterbury-Bankstown Bulldogs, it's well worth seeking out. Heading for the corner, tight to the line, with opponents hurling themselves at his waist and ankles, Nawaqanitawase avoided going into touch by hopping on his left foot while tapping the ball ahead with his right in mid-air, before darting ahead to collect his own kick and grounding it just inside the line.It was one of 24 tries for the winger in his first full NRL season - putting him top of the scoring chart.Nawaqanitawase (pronounced Nwonga-neater-waazay) is a rugby union convert, having played for the Wallabies at the 2023 World Cup - and, like Walsh and Shibasaki, has earned his first Kangaroos call-up for the Ashes series.He intends to return to union at the end of next season to prepare for the 2027 World Cup in Australia. But Kangaroos head coach Kevin Walters has given him the chance to be a dual-code international.Morley's verdict: \"Being an ex-Rooster, I keep my eye on them more than any team. He's been tremendous. Some of the tries he's scored are unbelievable - world class.\"",
        "Among the other players Morley will be looking out for is Roosters forward Angus Crichton - \"he's such a handful, such a strong player\" - and he acknowledges that Australia's strength in depth creates a huge challenge for England.\"They are world champs and they have been the benchmark for a number of years, but the fact that it's on home soil will be huge for the English,\" he says. \"It's going to be a gripping, close three-game Test series.\"Australia have not lost an Ashes series since 1970, although they had to come from behind to win all three matches in 2003, including the opener, in which Morley was sent off after only 12 seconds for poleaxing Robbie Kearns.\"If he'd got up straight away, I don't think I'd have got sent off,\" he jokes.\"To be fair, it was a terrible challenge. It just happened so fast. It was a bit of a blur.\"Great Britain's 2006 Tri-Nations win in Sydney is a much happier memory.\"It was the infamous night when Willie Mason was on a mission trying to take all the British players out,\" he says.\"He punched Stuart Fielden and then did Sean Long with an even worse challenge. And I did think 'Why's he not been sent off and I was?' But they let a little bit more go in these Test matches. It was great to be part of that.\"No British side has beaten the Kangaroos since then.\"It's been a long time between drinks,\" Morley says. \"But if we can compete well and snatch a Test or two, it will be absolutely incredible and you'll see the game go to new levels.\"",
        "Adrian Morley, who played 53 internationals, was inducted into the Rugby League Hall of Fame in 2022",
        "\"I can't believe it's been over 20 years since we last had an Ashes series,\" says Adrian Morley.",
        "The former Leeds, Sydney Roosters and Warrington forward played for Great Britain in the most recent Test series against Australia in 2003, and is thrilled to see it return.",
        "\"I know there have been one-off Test matches since, but this is the pinnacle - the oldest and fiercest rivalry in rugby league. Roll on Wembley.\"",
        "Australia face England at Wembley on 25 October, at Everton's Hill Dickinson Stadium on 1 November and at AMT Headingley on 8 November. All three matches are 14:30 kick-offs and will be live on BBC One.",
        "The first British player to win Super League and NRL Grand Finals, Morley keeps a keen eye on the Australian game - and here gives BBC Sport his thoughts on the Kangaroos players to watch.",
        "Reece Walsh made light of his toilet-based viral social media video after leading Brisbane Broncos to Grand Final success",
        "Age: 23 Club: Brisbane Broncos Position: Full-back",
        "\"The Justin Bieber of rugby league\" is how Australian Rugby League Commission chairman Peter V'landys described Walsh - a full-back with star quality and 640,000 Instagram followers.",
        "Walsh's first Australia call-up came the day after an incredible individual display propelled Brisbane Broncos to victory over Melbourne Storm in the NRL Grand Final. He scored a memorable individual try, provided three assists and made a dramatic try-saving tackle in the final seconds.",
        "He plays on the edge - he avoided a sin-binning but received a fine for a high tackle earlier in the game - and has plenty of personality. He often takes to the field with painted nails, which he decorates to bond with four-year-old daughter Leila.",
        "That personality occasionally gets him into bother - he went viral on social media last month over a video showing him drinking water out of a toilet bowl, joking that it helped his muscle recovery after games.",
        "The toilet was newly installed, and had not been used, although his club still had to hurry out a 'don't try this at home' statement.",
        "Morley's verdict: \"He's got great balance, speed, strength. He seems to be calm under pressure as well. That was one of the best Grand Final performances I've ever seen. It was fantastic, the way he went about his business. It was an iconic performance. He's etched himself into Brisbane Broncos folklore.\"",
        "Nathan Cleary has only recently been overtaken by Reece Walsh as the rugby league player with the most Instagram followers",
        "Age: 27 Club: Penrith Panthers Position: Half-back",
        "World Cup winner. Expert kicker. Game changer. Once led his team to NRL Grand Final victory with a torn knee ligament. For years, Nathan Cleary has been Australian rugby league's main man.",
        "On the field, he inspired Penrith Panthers to four successive Grand Final wins from 2021 to 2024. Off it, he is one half of an elite sporting couple - his partner is Manchester City and Australia footballer Mary Fowler.",
        "But this has not been a straightforward season for the Panthers captain. They were bottom of the NRL after 12 rounds and, although they reached the play-offs, hopes of a fifth straight title were ended by eventual winners Brisbane Broncos.",
        "Cleary himself faced criticism after New South Wales surprisingly lost their State of Origin decider against Queensland in Sydney in July.",
        "However, he remains among rugby league's modern greats. It is only two years since that remarkable Grand Final display for the Panthers against the Broncos, playing with knee ligament damage for 71 minutes and still scoring the winning try.",
        "Morley's verdict: \"He's got a fantastic rugby league brain. He's another one who's very, very calm under pressure. And it doesn't matter who he's playing for - Penrith Panthers, New South Wales in the State of Origin or the Kangaroos - he's their general and he guides the team around the pitch.\"",
        "Gehamat Shibasaki (centre) scored two tries for Brisbane Broncos in the NRL Grand Final",
        "Age 27: Club: Brisbane Broncos Position: Centre",
        "Shibasaki began the season by throwing up into a bucket. He ends it with a Grand Final title and an Ashes call-up. It is quite the comeback story.",
        "Twelve months ago his career was drifting: He had played only three NRL matches in three seasons and was working in youth support while playing reserve-grade rugby league.",
        "He was then offered a train-and-trial deal with Brisbane Broncos and, despite struggling with his first pre-season training session so much that it made him vomit, he won a place in the team.",
        "The upswing continued as he was called up to the Queensland side who won the State of Origin series. Although he received a late-season club ban for his part in a drinking session, he bounced back to score two tries in the Grand Final as the Broncos won their first NRL title in 19 years.",
        "Morley's verdict: \"I love stories like that where you get lads given a chance or asking for a trial, and really working hard and going about their business. It just goes to show that if you train hard and get a bit of luck on your side, there's no reason why you can't be scoring two tries in the Grand Final and being picked for a Kangaroos Ashes series. Fair play to him.\"",
        "Isaah Yeo made his Panthers debut in 2014 and his Australia bow in 2022 at the start of their World Cup-winning campaign",
        "Age: 30 Club: Penrith Panthers Position: Loose forward",
        "Penrith Panthers' all-time leading appearance maker took over his country's captaincy last autumn after James Tedesco was dropped for the Pacific Championships, and led them to the title.",
        "Loose forward Yeo then captained New South Wales during the State of Origin series against Queensland.",
        "A World Cup winner three years ago, he will continue to lead the Kangaroos for the Ashes tour.",
        "Morley's verdict: \"He's the rock of the Penrith Panthers, who have had such a fantastic run in the NRL. You very rarely get teams who dominate for as long as Penrith have and it's down to players like Nathan Cleary and Isaah Yeo. He always puts his hand up. He's a workhorse. Whoever he's playing for, he always does a great job.\"",
        "Mark Nawaqanitawase helped Australia's sevens team finish fourth at the 2024 Olympics in Paris",
        "Age: 25 Club: Sydney Roosters Position: Winger",
        "\"That's the try of the decade,\" exclaimed Channel Nine commentator Matthew Thompson after Mark Nawaqanitawase produced an outrageous piece of skill for the Sydney Roosters in May.",
        "If you haven't seen the try that the winger scored, external against the Canterbury-Bankstown Bulldogs, it's well worth seeking out.",
        "Heading for the corner, tight to the line, with opponents hurling themselves at his waist and ankles, Nawaqanitawase avoided going into touch by hopping on his left foot while tapping the ball ahead with his right in mid-air, before darting ahead to collect his own kick and grounding it just inside the line.",
        "It was one of 24 tries for the winger in his first full NRL season - putting him top of the scoring chart.",
        "Nawaqanitawase (pronounced Nwonga-neater-waazay) is a rugby union convert, having played for the Wallabies at the 2023 World Cup - and, like Walsh and Shibasaki, has earned his first Kangaroos call-up for the Ashes series.",
        "He intends to return to union at the end of next season to prepare for the 2027 World Cup in Australia. But Kangaroos head coach Kevin Walters has given him the chance to be a dual-code international.",
        "Morley's verdict: \"Being an ex-Rooster, I keep my eye on them more than any team. He's been tremendous. Some of the tries he's scored are unbelievable - world class.\"",
        "25 October, 1 November, 8 November",
        "Wembley, Hill Dickinson Stadium, AMT Headingley",
        "Watch all three Tests live on BBC One, BBC iPlayer and the BBC Sport website and app",
        "Among the other players Morley will be looking out for is Roosters forward Angus Crichton - \"he's such a handful, such a strong player\" - and he acknowledges that Australia's strength in depth creates a huge challenge for England.",
        "\"They are world champs and they have been the benchmark for a number of years, but the fact that it's on home soil will be huge for the English,\" he says. \"It's going to be a gripping, close three-game Test series.\"",
        "Australia have not lost an Ashes series since 1970, although they had to come from behind to win all three matches in 2003, including the opener, in which Morley was sent off after only 12 seconds for poleaxing Robbie Kearns.",
        "\"If he'd got up straight away, I don't think I'd have got sent off,\" he jokes.",
        "\"To be fair, it was a terrible challenge. It just happened so fast. It was a bit of a blur.\"",
        "Great Britain's 2006 Tri-Nations win in Sydney is a much happier memory.",
        "\"It was the infamous night when Willie Mason was on a mission trying to take all the British players out,\" he says.",
        "\"He punched Stuart Fielden and then did Sean Long with an even worse challenge. And I did think 'Why's he not been sent off and I was?' But they let a little bit more go in these Test matches. It was great to be part of that.\"",
        "No British side has beaten the Kangaroos since then.",
        "\"It's been a long time between drinks,\" Morley says. \"But if we can compete well and snatch a Test or two, it will be absolutely incredible and you'll see the game go to new levels.\"",
        "Gone in 12 seconds - is Morley ultimate hard man?",
        "Rugby League Top 10: Aussie, Aussie, Aussie",
        "Walters' enthusiasm fuels Ashes anticipation",
        "Walsh gets first Australia call for England tour"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/rugby-league/articles/ce3kwgpek7yo",
      "main_category": "sport",
      "detailed_category": "rugby-league",
      "topic": "Why has Rugby League Ashes waited so long for revival?",
      "content": [
        "The Rugby League Ashes returns for the first time since 2003 as England take on world champions Australia in a best-of-three Test series that begins at Wembley this Saturday.They meet for the first time since the 2017 Rugby League World Cup final, which Australia won 6-0 in a tense affair in Brisbane.After Wembley, the teams move on to the second Test at Everton's new Hill Dickinson Stadium on 1 November before rounding off at Leeds Rhinos' AMT Headingley Stadium on 8 November.All three matches are 14:30 kick-offs and will be live on BBC One.",
        "The Ashes takes its name and format from the cricket series of the same title, and has traditionally pitted Australia against Great Britain.Unlike cricket's Ashes, no actual ashes are involved - but that is not to say it is lacking in history or heritage.Having first taken place in 1908, the series was contested 39 times until 2003, with Great Britain and Australia usually taking it in turns to host.From the 39 series to date, Great Britain have won 19 and Australia 20. The Lions historically had great pedigree in the event, winning 24 of the 39 Tests to take place before 1945.Since then, the momentum has shifted in favour of Australia.Ominously for Shaun Wane's England side, Australia won a record 13 consecutive Ashes series between 1973 and 2003.In the most recent Ashes series, staged in 2003, the Kangaroos won 3-0, although they had to come from behind to win all three matches.The 22 years it has taken to stage another Ashes series is the longest gap between series in its history.",
        "This year, Australia will be taking on England for the first time under the Ashes banner, having historically faced Great Britain.Following the last series in 2003, Great Britain as an international entity was largely wound down from 2006, barring an ill-fated return in 2019.That year culminated in a humiliating clean sweep of defeats, first by Tonga and then consecutive losses to New Zealand before a tour-ending loss to Papua New Guinea.The introduction of the Tri-Nations and Four Nations tournaments, as well as England's failure to reach the final of the 2021 Rugby League World Cup, means that opportunities to face Australia have been limited in the 22 years since a Darren Lockyer-captained side swept aside the Lions.A series had been mooted to take place in 2020 but was delayed by the Covid pandemic and was eventually agreed for this year.",
        "In short, for many years, the game had changed.Appetite down under for international rugby league waned as the yearly State of Origin series, which pits representative players from New South Wales and Queensland against each other in a best-of-three competition, took precedence, along with the National Rugby League (NRL).In recent times, however, international rugby league has enjoyed something of a revival.Australia's squad bonded three years ago on their way to winning the Covid-delayed 2021 Rugby League World Cup, reinstating their passion for the green and gold shirt.Meanwhile, the Pacific Championships have emerged as a successful tournament involving the Kangaroos, New Zealand, Tonga and Samoa. Those factors have led to Australia committing to a three-Test tour of England for the first time in a generation.It is all the more impressive, given the intensity with which the NRL is played, that Australia have committed to travelling to these shores for a much-anticipated series.This article is the latest from BBC Sport's Ask Me Anything team.",
        "Ask Me Anything is a service dedicated to answering your questions.We want to reward your time by telling you things you do not know and reminding you of things you do.The team will find out everything you need to know and be able to call upon a network of contacts including our experts and pundits.We will be answering your questions from the heart of the BBC Sport newsroom, and going behind the scenes at some of the world's biggest sporting events.Our coverage will span the BBC Sport website, app, social media and YouTube accounts, plus BBC TV and radio.",
        "What are IMG gradings and how do they work?What is the Rugby League Ashes?What is the Captain's Challenge in Super League?",
        "The Rugby League Ashes returns for the first time since 2003 as England take on world champions Australia in a best-of-three Test series that begins at Wembley this Saturday.",
        "They meet for the first time since the 2017 Rugby League World Cup final, which Australia won 6-0 in a tense affair in Brisbane.",
        "After Wembley, the teams move on to the second Test at Everton's new Hill Dickinson Stadium on 1 November before rounding off at Leeds Rhinos' AMT Headingley Stadium on 8 November.",
        "All three matches are 14:30 kick-offs and will be live on BBC One.",
        "Walsh, Shibasaki & Nawaqanitawase start for Australia",
        "Hull KR trio in England Ashes squad as Connor misses out",
        "Australia wrapped up the 2003 Ashes series with a tightly fought 3-0 win over Great Britain",
        "The Ashes takes its name and format from the cricket series of the same title, and has traditionally pitted Australia against Great Britain.",
        "Unlike cricket's Ashes, no actual ashes are involved - but that is not to say it is lacking in history or heritage.",
        "Having first taken place in 1908, the series was contested 39 times until 2003, with Great Britain and Australia usually taking it in turns to host.",
        "From the 39 series to date, Great Britain have won 19 and Australia 20. The Lions historically had great pedigree in the event, winning 24 of the 39 Tests to take place before 1945.",
        "Since then, the momentum has shifted in favour of Australia.",
        "Ominously for Shaun Wane's England side, Australia won a record 13 consecutive Ashes series between 1973 and 2003.",
        "In the most recent Ashes series, staged in 2003, the Kangaroos won 3-0, although they had to come from behind to win all three matches.",
        "The 22 years it has taken to stage another Ashes series is the longest gap between series in its history.",
        "25 October, 1 November, 8 November",
        "Wembley, Hill Dickinson Stadium, AMT Headingley",
        "Watch all three Tests live on BBC One, BBC iPlayer and the BBC Sport website and app",
        "This year, Australia will be taking on England for the first time under the Ashes banner, having historically faced Great Britain.",
        "Following the last series in 2003, Great Britain as an international entity was largely wound down from 2006, barring an ill-fated return in 2019.",
        "That year culminated in a humiliating clean sweep of defeats, first by Tonga and then consecutive losses to New Zealand before a tour-ending loss to Papua New Guinea.",
        "The introduction of the Tri-Nations and Four Nations tournaments, as well as England's failure to reach the final of the 2021 Rugby League World Cup, means that opportunities to face Australia have been limited in the 22 years since a Darren Lockyer-captained side swept aside the Lions.",
        "A series had been mooted to take place in 2020 but was delayed by the Covid pandemic and was eventually agreed for this year.",
        "Send us your questions",
        "Great Britain's most recent victory against Australia in an Ashes series was a 20-12 win on 11 November 2001",
        "In short, for many years, the game had changed.",
        "Appetite down under for international rugby league waned as the yearly State of Origin series, which pits representative players from New South Wales and Queensland against each other in a best-of-three competition, took precedence, along with the National Rugby League (NRL).",
        "In recent times, however, international rugby league has enjoyed something of a revival.",
        "Australia's squad bonded three years ago on their way to winning the Covid-delayed 2021 Rugby League World Cup, reinstating their passion for the green and gold shirt.",
        "Meanwhile, the Pacific Championships have emerged as a successful tournament involving the Kangaroos, New Zealand, Tonga and Samoa.",
        "Those factors have led to Australia committing to a three-Test tour of England for the first time in a generation.",
        "It is all the more impressive, given the intensity with which the NRL is played, that Australia have committed to travelling to these shores for a much-anticipated series.",
        "This article is the latest from BBC Sport's Ask Me Anything team.",
        "Ask Me Anything is a service dedicated to answering your questions.",
        "We want to reward your time by telling you things you do not know and reminding you of things you do.",
        "The team will find out everything you need to know and be able to call upon a network of contacts including our experts and pundits.",
        "We will be answering your questions from the heart of the BBC Sport newsroom, and going behind the scenes at some of the world's biggest sporting events.",
        "Our coverage will span the BBC Sport website, app, social media and YouTube accounts, plus BBC TV and radio.",
        "What are IMG gradings and how do they work?",
        "What is the Rugby League Ashes?",
        "What is the Captain's Challenge in Super League?"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/rugby-league/articles/cge5n125z8eo",
      "main_category": "sport",
      "detailed_category": "rugby-league",
      "topic": "Lewis in England squad for first Test as Smith left out",
      "content": [
        "Mikey Lewis has been named in England's 19-man matchday squad for their opening Ashes Test against Australia on Saturday.The Hull KR scrum-half is likely to start alongside captain George Williams in the half-back roles, with Wigan's Harry Smith left out of the party.Lewis was man of the match as Hull KR beat Wigan in the Grand Final earlier this month to complete a domestic treble, after also winning the Challenge Cup and League Leaders' Shield.Club-mate Jez Litten has also made the matchday squad - putting him in line to make his first England appearance since a mid-season victory over France in 2023.But their Hull KR team-mate Joe Burgess, who scored two tries in the Grand Final and returned to the England set-up after a 10-year absence when he was called up for the Ashes, has missed out.England head coach Shaun Wane has opted to name a matchday squad rather than confirm a starting line-up. Australia named their starting 13 on Tuesday.After Saturday's Test at Wembley, England face Australia at Everton's Hill Dickinson Stadium on 1 November and at AMT Headingley on 8 November. All three matches are 14:30 kick-offs and will be live on BBC One.England matchday squad: John Bateman, AJ Brimson, Daryl Clark, Herbie Farnworth, Ethan Havard, Tom Johnstone, Morgan Knowles, Matty Lees, Mikey Lewis, Jez Litten, Mike McMeeken, Mikolaj Oledzki, Kai Pearce-Paul, Owen Trout, Alex Walmsley, Jake Wardle, Jack Welsby, George Williams, Dom Young.",
        "AJ Brimson has made the squad, having switched his international allegiance from Australia earlier this year, qualifying for England because his mother is from London.Leigh forward Owen Trout is also in contention for an international debut, while St Helens forward Alex Walmsley could make his first England appearance since 2021.Wane said: \"We have a fantastic squad and whittling it down for the first Ashes Test match in 22 years wasn't easy, but I am confident the players selected can challenge the Kangaroos this weekend.\"We've had two fantastic weeks in camp preparing and we are now in touching distance of what will be a historic fixture under the Wembley arch.\"All involved will be aiming to win the Fulton-Reilly Award, which will be given to the player of the series. The new award has been created in honour of two rugby league greats who have featured in past Ashes encounters - Bob Fulton and Mal Reilly.Fulton played 35 Tests for the Kangaroos, including four Ashes series, and later coached Australia in three further series against Great Britain.Reilly inspired Great Britain's last Ashes series victory in 1970, and coached them to famous Test wins over the Kangaroos in 1988, 1990 and 1992.",
        "Despite that long wait for Ashes success, former England and Great Britain captain Jamie Peacock is in optimistic mood going into the first Test.Speaking on the BBC's Rugby League Top 10 podcast, Peacock said he feels the Kangaroos are more vulnerable than some of the great Australia sides he faced in the late 2000s.He said: \"It's a great time to play Australia. We came through and played against a team who might have had five 'Immortals' in there.\"They had Cameron Smith, Darren Lockyer, Johnathan Thurston, Cooper Cronk, Greg Inglis, Paul Gallen, some iconic players of the last 20 years.\"This current team have got Nathan Cleary, who's going to be a standout head and shoulders. They're reduced by all the Pacific Island switches.\"You can catch the latest episode of the Rugby League Top 10 podcast now on BBC Sounds.",
        "Mikey Lewis was man of the match in the Super League Grand Final on 11 October",
        "Mikey Lewis has been named in England's 19-man matchday squad for their opening Ashes Test against Australia on Saturday.",
        "The Hull KR scrum-half is likely to start alongside captain George Williams in the half-back roles, with Wigan's Harry Smith left out of the party.",
        "Lewis was man of the match as Hull KR beat Wigan in the Grand Final earlier this month to complete a domestic treble, after also winning the Challenge Cup and League Leaders' Shield.",
        "Club-mate Jez Litten has also made the matchday squad - putting him in line to make his first England appearance since a mid-season victory over France in 2023.",
        "But their Hull KR team-mate Joe Burgess, who scored two tries in the Grand Final and returned to the England set-up after a 10-year absence when he was called up for the Ashes, has missed out.",
        "England head coach Shaun Wane has opted to name a matchday squad rather than confirm a starting line-up. Australia named their starting 13 on Tuesday.",
        "After Saturday's Test at Wembley, England face Australia at Everton's Hill Dickinson Stadium on 1 November and at AMT Headingley on 8 November. All three matches are 14:30 kick-offs and will be live on BBC One.",
        "England matchday squad: John Bateman, AJ Brimson, Daryl Clark, Herbie Farnworth, Ethan Havard, Tom Johnstone, Morgan Knowles, Matty Lees, Mikey Lewis, Jez Litten, Mike McMeeken, Mikolaj Oledzki, Kai Pearce-Paul, Owen Trout, Alex Walmsley, Jake Wardle, Jack Welsby, George Williams, Dom Young.",
        "Best England set-up I've been part of - Williams",
        "Walsh, Shibasaki & Nawaqanitawase start for Australia",
        "'He's shouting pick me' - has Lewis played way into England's Ashes team?",
        "25 October, 1 November, 8 November",
        "Wembley, Hill Dickinson Stadium, AMT Headingley",
        "Watch all three Tests live on BBC One, BBC iPlayer and the BBC Sport website and app",
        "AJ Brimson has made the squad, having switched his international allegiance from Australia earlier this year, qualifying for England because his mother is from London.",
        "Leigh forward Owen Trout is also in contention for an international debut, while St Helens forward Alex Walmsley could make his first England appearance since 2021.",
        "Wane said: \"We have a fantastic squad and whittling it down for the first Ashes Test match in 22 years wasn't easy, but I am confident the players selected can challenge the Kangaroos this weekend.",
        "\"We've had two fantastic weeks in camp preparing and we are now in touching distance of what will be a historic fixture under the Wembley arch.\"",
        "All involved will be aiming to win the Fulton-Reilly Award, which will be given to the player of the series.",
        "The new award has been created in honour of two rugby league greats who have featured in past Ashes encounters - Bob Fulton and Mal Reilly.",
        "Fulton played 35 Tests for the Kangaroos, including four Ashes series, and later coached Australia in three further series against Great Britain.",
        "Reilly inspired Great Britain's last Ashes series victory in 1970, and coached them to famous Test wins over the Kangaroos in 1988, 1990 and 1992.",
        "This video can not be played",
        "Rugby League Top 10: Aussie, Aussie, Aussie",
        "Despite that long wait for Ashes success, former England and Great Britain captain Jamie Peacock is in optimistic mood going into the first Test.",
        "Speaking on the BBC's Rugby League Top 10 podcast, Peacock said he feels the Kangaroos are more vulnerable than some of the great Australia sides he faced in the late 2000s.",
        "He said: \"It's a great time to play Australia. We came through and played against a team who might have had five 'Immortals' in there.",
        "\"They had Cameron Smith, Darren Lockyer, Johnathan Thurston, Cooper Cronk, Greg Inglis, Paul Gallen, some iconic players of the last 20 years.",
        "\"This current team have got Nathan Cleary, who's going to be a standout head and shoulders. They're reduced by all the Pacific Island switches.\"",
        "You can catch the latest episode of the Rugby League Top 10 podcast now on BBC Sounds.",
        "This video can not be played",
        "Rugby League Ashes rivalry renewed"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/rugby-league/articles/c5y04kqywxyo",
      "main_category": "sport",
      "detailed_category": "rugby-league",
      "topic": "Best England set-up I've been part of - Williams",
      "content": [
        "In his BBC Sport column, England captain George Williams looks forward to Saturday's first Ashes Test against Australia, which kicks off the first touring Kangaroos series since 2003.We're almost there. England versus Australia at Wembley, and I mean it when I say, as a group, I don't think we've ever been more ready than this.It's the best England set-up I've been a part of, and I've been a part of it for 10 years now so I'm getting old.I don't say that lightly. It's our best chance.There's been a lot of talk over the past six months, and a lot of meetings with head coach Shaun Wane, and you walk out of those meetings wanting to play the game right there.Now the game is upon us. I'm looking forward to his talk on Saturday because we'll be firing and ready to go.This is what I did it for at Wigan St Pats at seven years old. You never think you'll reach these heights, as a kid with a dream. At 30, I'm still pinching myself that this is what I do. I love what I do. You can never get bored with this.",
        "It's taken lots of hard work from a fair few people, but as a group we're worlds apart from how it was even in 2015, 2016.Obviously results are key and we've not been beaten since the World Cup semi-final in 2022 at the Emirates. We're undefeated over the past couple of years against good opposition, but it's more what we've built.Waney talked about a 'club' feel to the squad. It's not always been like that.Before, we said we'd do it and no-one would really ever do it. Now, I come in, sit down and I've got a St Helens player to my right, Owen Trout of Leigh on my left, and we're all mates.Saints prop Alex Walmsley gave us a big compliment. He said: \"I can't believe what you've built.\" He's been out of the programme for a few years, so for him to say that made me feel good. It was a pat on the back for all the lads who've built that over the last few years, Waney included.Waney sets the standards for us. He's bothered about how we speak to waiters, how we talk to hotel staff. Do we clean up after ourselves? To him, it means everything.They're good people, which doesn't make you a great player - but when you have good players and good people, it becomes a great environment.",
        "Training has been intense, which is what you want. You come into the team and realise how good the players are we have around us.We had belief from previous years, but sometimes out there on the paddock, it's a reminder of how good we really are.The sessions have been so good, really slick. It's the first time I've heard Waney say, \"Will you just chill out?\" because everybody's running that quick and they're that keen to put their best foot forward.Everything goes out of the window from the season gone. Training is ramped up because everyone wants to be in the Test side and everyone is making each other better.When you're around good players, you get good energy, and it's a strong reminder of the stage you're at.",
        "Camp has been good. It's nice to catch up with old faces as well as the new lads. We were talking last night: There are about six or seven of us who started with Waney first getting the job and there are who lads have joined that and grown through.It was good to catch up with Herbie [Farnworth], but he's changed, you know. Now he's on the big money, I've been giving him a bit of stick, saying he's not humble any more. He's forgotten his Burnley roots.AJ Brimson, new into the group, is a good fella. I went for a beer with Herbie and AJ when they first got here from Australia. They guilt-tripped me by saying that if I was a good captain, I'd come for a drink. I went and met them for a little bit.AJ's really bought into it - he's passionate. We do this 'Life in Five' thing where you show five photos of your life and you've got to stand up and talk about them to the group.Again, it's about connections and building an understanding with the new lads and the old lads. He spoke really passionately about things, his mum being English and why he's doing what he's doing, which is brilliant.",
        "We looked at the Australia squad and respect the quality within it, we know they are full of great players. We had the same talk when we played Tonga and Samoa - they've got that many good players but we know what we've got now.We can match it with anyone.Their captain, Isaah Yeo, he's a good fella. I spent an hour before the press conference with him for the promotional photographs and he's a genuine bloke. He's at the top of his game right now.",
        "I think the Kangaroos respect us now because of our previous form and results. They've come over here and got Willie Peters in. I think that's to do with his good knowledge of Super League - he's had a brilliant year with Hull KR.We've also got some unknown lads that they won't have heard of, which is a strength of ours.One player who might have a target on me is an old face from Canberra days. I lived with Hudson Young when I first got to Australia, so we're really good friends and I Face-Time him a few times a week, but our chat has minimised a bit over the last week or so.We're getting into game mode, so there are fewer texts between us now. I look forward to playing against him.",
        "In his BBC Sport column, England captain George Williams looks forward to Saturday's first Ashes Test against Australia, which kicks off the first touring Kangaroos series since 2003.",
        "We're almost there. England versus Australia at Wembley, and I mean it when I say, as a group, I don't think we've ever been more ready than this.",
        "It's the best England set-up I've been a part of, and I've been a part of it for 10 years now so I'm getting old.",
        "I don't say that lightly. It's our best chance.",
        "There's been a lot of talk over the past six months, and a lot of meetings with head coach Shaun Wane, and you walk out of those meetings wanting to play the game right there.",
        "Now the game is upon us. I'm looking forward to his talk on Saturday because we'll be firing and ready to go.",
        "This is what I did it for at Wigan St Pats at seven years old. You never think you'll reach these heights, as a kid with a dream. At 30, I'm still pinching myself that this is what I do. I love what I do. You can never get bored with this.",
        "25 October, 1 November, 8 November",
        "Wembley, Hill Dickinson Stadium, AMT Headingley",
        "Watch all three Tests live on BBC One, BBC iPlayer and the BBC Sport website and app",
        "George Williams enjoys a laugh with strength and conditioning coach Chris 'Bubble' Baron, a key figure in the England camp",
        "It's taken lots of hard work from a fair few people, but as a group we're worlds apart from how it was even in 2015, 2016.",
        "Obviously results are key and we've not been beaten since the World Cup semi-final in 2022 at the Emirates. We're undefeated over the past couple of years against good opposition, but it's more what we've built.",
        "Waney talked about a 'club' feel to the squad. It's not always been like that.",
        "Before, we said we'd do it and no-one would really ever do it. Now, I come in, sit down and I've got a St Helens player to my right, Owen Trout of Leigh on my left, and we're all mates.",
        "Saints prop Alex Walmsley gave us a big compliment. He said: \"I can't believe what you've built.\" He's been out of the programme for a few years, so for him to say that made me feel good. It was a pat on the back for all the lads who've built that over the last few years, Waney included.",
        "Waney sets the standards for us. He's bothered about how we speak to waiters, how we talk to hotel staff. Do we clean up after ourselves? To him, it means everything.",
        "They're good people, which doesn't make you a great player - but when you have good players and good people, it becomes a great environment.",
        "England aim to avoid late loss pain in Ashes opener",
        "Walsh, Shibasaki & Nawaqanitawase start for Australia",
        "Why has Rugby League Ashes waited so long for revival?",
        "Consign my Ashes try to history - Davies' England challenge",
        "Training has been intense, which is what you want. You come into the team and realise how good the players are we have around us.",
        "We had belief from previous years, but sometimes out there on the paddock, it's a reminder of how good we really are.",
        "The sessions have been so good, really slick. It's the first time I've heard Waney say, \"Will you just chill out?\" because everybody's running that quick and they're that keen to put their best foot forward.",
        "Everything goes out of the window from the season gone. Training is ramped up because everyone wants to be in the Test side and everyone is making each other better.",
        "When you're around good players, you get good energy, and it's a strong reminder of the stage you're at.",
        "AJ Brimson has brought a different energy to the England camp, having pledged his allegiance based on his mother's heritage",
        "Camp has been good. It's nice to catch up with old faces as well as the new lads. We were talking last night: There are about six or seven of us who started with Waney first getting the job and there are who lads have joined that and grown through.",
        "It was good to catch up with Herbie [Farnworth], but he's changed, you know. Now he's on the big money, I've been giving him a bit of stick, saying he's not humble any more. He's forgotten his Burnley roots.",
        "AJ Brimson, new into the group, is a good fella. I went for a beer with Herbie and AJ when they first got here from Australia. They guilt-tripped me by saying that if I was a good captain, I'd come for a drink. I went and met them for a little bit.",
        "AJ's really bought into it - he's passionate. We do this 'Life in Five' thing where you show five photos of your life and you've got to stand up and talk about them to the group.",
        "Again, it's about connections and building an understanding with the new lads and the old lads. He spoke really passionately about things, his mum being English and why he's doing what he's doing, which is brilliant.",
        "We looked at the Australia squad and respect the quality within it, we know they are full of great players. We had the same talk when we played Tonga and Samoa - they've got that many good players but we know what we've got now.",
        "We can match it with anyone.",
        "Their captain, Isaah Yeo, he's a good fella. I spent an hour before the press conference with him for the promotional photographs and he's a genuine bloke. He's at the top of his game right now.",
        "Hudson Young is a friend of George Williams from the half-back's time with Canberra, and will face him on Saturday at Wembley",
        "I think the Kangaroos respect us now because of our previous form and results. They've come over here and got Willie Peters in. I think that's to do with his good knowledge of Super League - he's had a brilliant year with Hull KR.",
        "We've also got some unknown lads that they won't have heard of, which is a strength of ours.",
        "One player who might have a target on me is an old face from Canberra days. I lived with Hudson Young when I first got to Australia, so we're really good friends and I Face-Time him a few times a week, but our chat has minimised a bit over the last week or so.",
        "We're getting into game mode, so there are fewer texts between us now. I look forward to playing against him."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/rugby-league/articles/ckgy1wdxqp1o",
      "main_category": "sport",
      "detailed_category": "rugby-league",
      "topic": "Walsh, Shibasaki & Nawaqanitawase start for Australia",
      "content": [
        "Reece Walsh, Gehamat Shibasaki and Mark Nawaqanitawase will make their Australia debuts in the starting line-up for Saturday's first Rugby League Ashes Test against England at Wembley.Walsh, 23, displaces Dylan Edwards at full-back, having produced a man-of-the-match performance as Brisbane Broncos beat Melbourne Storm in the NRL Grand Final at the start of the month.Shibasaki, 27, scored two tries for the Broncos in that final. His selection for Saturday completes a remarkable personal comeback, as he only joined the Broncos on trial at the start of the season. The former North Queensland Cowboys and South Sydney Rabbitohs centre had played just three NRL games in three years before that.Sydney Roosters winger Nawaqanitawase, 25, was the NRL's leading try-scorer during the season just completed, having switched codes from rugby union, playing for the Wallabies at the 2023 World Cup.",
        "Forward Keaon Koloamatangi, a fourth debutant, will start on the bench. He has switched allegiance from Tonga, for whom he played at the last World Cup three years ago. He also played for them in their three-match series against England in 2023.\"It's going to be huge thrill for all four of them to wear the green and gold for the first time in a Test match at such an iconic stadium,\" Australia head coach Kevin Walters said.\"I'm excited for them as well as all of our players. Every member of our squad, whether they take the field or not, is about to experience something incredibly special this Saturday at Wembley.\"As I've said from day one of our preparations here in England, we're on this Ashes journey together because it's going to take a collective effort from everyone involved.\"Australia team: Reece Walsh, Mark Nawaqanitawase, Kotoni Staggs, Gehamat Shibasaki, Josh Addo-Carr, Cameron Munster, Nathan Cleary, Patrick Carrigan, Harry Grant, Tino Fa'asuamaleaui, Angus Crichton, Hudson Young, Isaah Yeo (captain).Interchanges: Tom Dearden, Lindsay Collins, Reuben Cotter, Keaon Koloamatangi.Reserves: Bradman Best, Lindsay Smith, Mitchell Moses.",
        "Reece Walsh won the Clive Churchill Medal as man of the match in the NRL Grand Final on 5 October",
        "Reece Walsh, Gehamat Shibasaki and Mark Nawaqanitawase will make their Australia debuts in the starting line-up for Saturday's first Rugby League Ashes Test against England at Wembley.",
        "Walsh, 23, displaces Dylan Edwards at full-back, having produced a man-of-the-match performance as Brisbane Broncos beat Melbourne Storm in the NRL Grand Final at the start of the month.",
        "Shibasaki, 27, scored two tries for the Broncos in that final. His selection for Saturday completes a remarkable personal comeback, as he only joined the Broncos on trial at the start of the season.",
        "The former North Queensland Cowboys and South Sydney Rabbitohs centre had played just three NRL games in three years before that.",
        "Sydney Roosters winger Nawaqanitawase, 25, was the NRL's leading try-scorer during the season just completed, having switched codes from rugby union, playing for the Wallabies at the 2023 World Cup.",
        "Consign my Ashes try to history - Davies' England challenge",
        "Why has Rugby League Ashes waited so long for revival?",
        "Forward Keaon Koloamatangi, a fourth debutant, will start on the bench. He has switched allegiance from Tonga, for whom he played at the last World Cup three years ago. He also played for them in their three-match series against England in 2023.",
        "\"It's going to be huge thrill for all four of them to wear the green and gold for the first time in a Test match at such an iconic stadium,\" Australia head coach Kevin Walters said.",
        "\"I'm excited for them as well as all of our players. Every member of our squad, whether they take the field or not, is about to experience something incredibly special this Saturday at Wembley.",
        "\"As I've said from day one of our preparations here in England, we're on this Ashes journey together because it's going to take a collective effort from everyone involved.\"",
        "Australia team: Reece Walsh, Mark Nawaqanitawase, Kotoni Staggs, Gehamat Shibasaki, Josh Addo-Carr, Cameron Munster, Nathan Cleary, Patrick Carrigan, Harry Grant, Tino Fa'asuamaleaui, Angus Crichton, Hudson Young, Isaah Yeo (captain).",
        "Interchanges: Tom Dearden, Lindsay Collins, Reuben Cotter, Keaon Koloamatangi.",
        "Reserves: Bradman Best, Lindsay Smith, Mitchell Moses.",
        "25 October, 1 November, 8 November",
        "Wembley, Hill Dickinson Stadium, AMT Headingley",
        "Watch all three Tests live on BBC One, BBC iPlayer and the BBC Sport website and app"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/rugby-league/articles/cdxrn5wy3k0o",
      "main_category": "sport",
      "detailed_category": "rugby-league",
      "topic": "Clark extends St Helens deal to 2027",
      "content": [
        "England hooker Daryl Clark has extended his contract with St Helens until the end of the 2027 season.The 32-year-old, who is in Shaun Wane's national squad for the upcoming Ashes Test series, was already under terms until 2026 but Saints have moved to tie down one of their most consistent performers. Clark joined Saints from Warrington Wolves last year and has since made his 400th career appearance and scored his 100th career try.He told the club website, external that new head coach Paul Rowley's style of rugby will suit him: \"I think the way Paul likes to play is very much how I like to play, too. He likes expansive rugby and to move the ball around, get quick plays off the ruck, which plays into my hands.\"",
        "Daryl Clark was already signed up until the end of next season at St Helens",
        "England hooker Daryl Clark has extended his contract with St Helens until the end of the 2027 season.",
        "The 32-year-old, who is in Shaun Wane's national squad for the upcoming Ashes Test series, was already under terms until 2026 but Saints have moved to tie down one of their most consistent performers.",
        "Clark joined Saints from Warrington Wolves last year and has since made his 400th career appearance and scored his 100th career try.",
        "He told the club website, external that new head coach Paul Rowley's style of rugby will suit him: \"I think the way Paul likes to play is very much how I like to play, too. He likes expansive rugby and to move the ball around, get quick plays off the ruck, which plays into my hands.\""
      ]
    },
    {
      "url": "https://www.bbc.com/sport/rugby-league/articles/cx2l82l0047o",
      "main_category": "sport",
      "detailed_category": "rugby-league",
      "topic": "Charles crosses city to join Hull KR",
      "content": [
        "Hull Kingston Rovers have captured exciting young halfback Jack Charles from neighbours Hull FC.The Treble winners have wasted no time building on their first Super League title, signing the talented 19-year-old on a four-year deal.Charles had a breakthrough season in 2024, playing 17 times for the Black and Whites, and figured again in the last campaign, as well as having a spell at Doncaster in the Championship.The England Academy international is the son of former Robins player Chris Charles, and he told BBC Radio Humberside that the chance to play under head coach Willie Peters and alongside 2024 Man of Steel Mikey Lewis was key to the switch.The move will not go down well at the MKM Stadium, where Charles was seen as part of a gradual rebuild for KR's cross-city rivals.However, Charles said: \"I loved my time at Hull FC. There are some great people there, people who have put a lot of time and effort into me in the last couple of years, but this is just something that I couldn't turn down.\"It's such a great opportunity for me over the next couple of years to create my own legacy and produce something special. I want to win trophies and win games.\"",
        "Jack Charles has left Hull FC to join rivals Hull Kingston Rovers",
        "Hull Kingston Rovers have captured exciting young halfback Jack Charles from neighbours Hull FC.",
        "The Treble winners have wasted no time building on their first Super League title, signing the talented 19-year-old on a four-year deal.",
        "Charles had a breakthrough season in 2024, playing 17 times for the Black and Whites, and figured again in the last campaign, as well as having a spell at Doncaster in the Championship.",
        "The England Academy international is the son of former Robins player Chris Charles, and he told BBC Radio Humberside that the chance to play under head coach Willie Peters and alongside 2024 Man of Steel Mikey Lewis was key to the switch.",
        "The move will not go down well at the MKM Stadium, where Charles was seen as part of a gradual rebuild for KR's cross-city rivals.",
        "However, Charles said: \"I loved my time at Hull FC. There are some great people there, people who have put a lot of time and effort into me in the last couple of years, but this is just something that I couldn't turn down.",
        "\"It's such a great opportunity for me over the next couple of years to create my own legacy and produce something special. I want to win trophies and win games.\""
      ]
    },
    {
      "url": "https://www.bbc.com/sport/rugby-league/articles/c986g8g4eqlo",
      "main_category": "sport",
      "detailed_category": "rugby-league",
      "topic": "Castleford sign Gold Coast half-back Weaver",
      "content": [
        "Castleford Tigers have signed Australian half-back Tom Weaver from NRL side Gold Coast Titans.The 22-year-old joins the Yorkshire side on a two-year contract, as part of their revamp under new head coach Ryan Carr.Weaver played 11 NRL games over three seasons for the Titans before being released by them last month.His arrival follows the surprise departure of hooker Liam Horne to Leigh Leopards, while Mikaele Ravalawa, Semi Valemei and Blake Taaffe have already joined the Tigers for next season.Cas director of rugby Chris Chester told the club website, external: \"He's the final piece of our spine for 2026.\"Tom is an organising, on-the-ball number seven who has a strong running and kicking game.\"I know Ryan can take Tom's game to a whole new level, and I'm really looking forward to seeing him get to work in pre-season.\"",
        "Tom Weaver played five times for Gold Coast Titans this season, and had a 75% kicking success rate",
        "Castleford Tigers have signed Australian half-back Tom Weaver from NRL side Gold Coast Titans.",
        "The 22-year-old joins the Yorkshire side on a two-year contract, as part of their revamp under new head coach Ryan Carr.",
        "Weaver played 11 NRL games over three seasons for the Titans before being released by them last month.",
        "His arrival follows the surprise departure of hooker Liam Horne to Leigh Leopards, while Mikaele Ravalawa, Semi Valemei and Blake Taaffe have already joined the Tigers for next season.",
        "Cas director of rugby Chris Chester told the club website, external: \"He's the final piece of our spine for 2026.",
        "\"Tom is an organising, on-the-ball number seven who has a strong running and kicking game.",
        "\"I know Ryan can take Tom's game to a whole new level, and I'm really looking forward to seeing him get to work in pre-season.\""
      ]
    },
    {
      "url": "https://www.bbc.com/sport/rugby-league/articles/cn51xxz4qv4o",
      "main_category": "sport",
      "detailed_category": "rugby-league",
      "topic": "Bradford sign half-back Nikorima",
      "content": [
        "Bradford Bulls have signed Salford Red Devils half-back Jayden Nikorima on a three-year deal.The 29-year-old New Zealander had spells with Melbourne Storm and Sydney Roosters in the NRL before joining Catalans for the 2024 Super League season.The French club sacked him midway through that season for a \"highly unacceptable\" incident and he moved on to Salford.\"I am super pumped to be joining the Bulls, they were my dad's favourite Super League team when I was growing up,\" he told the club website., external\"It's a really exciting time for the club and I'm looking forward to ripping in, meeting the fans and wearing that Bulls jersey.\"He is the second former Salford player to join Bradford this week after Ethan Ryan returned to the club on Monday., externalThe Bulls, whose return to Super League was confirmed last week, will be led by former Red Devils assistant Kurt Haggerty next season.",
        "Jayden Nikorima has played for Catalans Dragons and Salford Red Devils in Super League",
        "Bradford Bulls have signed Salford Red Devils half-back Jayden Nikorima on a three-year deal.",
        "The 29-year-old New Zealander had spells with Melbourne Storm and Sydney Roosters in the NRL before joining Catalans for the 2024 Super League season.",
        "The French club sacked him midway through that season for a \"highly unacceptable\" incident and he moved on to Salford.",
        "\"I am super pumped to be joining the Bulls, they were my dad's favourite Super League team when I was growing up,\" he told the club website., external",
        "\"It's a really exciting time for the club and I'm looking forward to ripping in, meeting the fans and wearing that Bulls jersey.\"",
        "He is the second former Salford player to join Bradford this week after Ethan Ryan returned to the club on Monday., external",
        "The Bulls, whose return to Super League was confirmed last week, will be led by former Red Devils assistant Kurt Haggerty next season."
      ]
    }
  ]
}