{
  "scraped_at": "2025-10-27T18:56:59.815547",
  "total_articles": 17,
  "category": "swimming",
  "articles_per_category": 100,
  "articles": [
    {
      "url": "https://www.bbc.com/sport/olympics/articles/c70j359pjyyo",
      "main_category": "sport",
      "detailed_category": "swimming",
      "topic": "Irish Olympian Ryan joins Enhanced Games",
      "content": [
        "Irish Olympic swimmer Shane Ryan has joined the Enhanced Games, a multi-sport competition that will allow athletes to use performance-enhancing substances without being subject to drug tests.Ryan, who was born in the USA, competed in three successive Olympics Games for Ireland before announcing his retirement from the sport earlier this month.\"After a decade dedicated to traditional competition on the world's highest stage, I'm excited to dive into this next chapter with the Enhanced Games,\" the 31-year-old said on his decision.Ryan joins Team GB Olympic swimmer Ben Proud, four-time Greece Olympian Kristian Gkolomeev and US sprinter Fred Kerley in announcing his intentions to compete at the Games.The move has been criticised by Sport Ireland, which says it is \"deeply disappointed\" with the decision.The first Enhanced Games are due to take place in Las Vegas in 2026 with each event awarded a total prize purse of $500,000 and a $1m on offer for competitors who break world records.Swim Ireland has also condemned the move, confirming his disassociation with the organisation and that he will no longer be provided with any funding or services.Ryan competed at the Rio 2016, Tokyo 2020 and Paris 2024 Games, becoming the first Irish swimmer to participate at three Olympics.The Olympic Federation of Ireland said that Ryan's move to the Enhanced Games \"stands in direct opposition to our core clean sport values\".",
        "Ryan became the first Irish swimmer to compete in three Olympic Games",
        "Irish Olympic swimmer Shane Ryan has joined the Enhanced Games, a multi-sport competition that will allow athletes to use performance-enhancing substances without being subject to drug tests.",
        "Ryan, who was born in the USA, competed in three successive Olympics Games for Ireland before announcing his retirement from the sport earlier this month.",
        "\"After a decade dedicated to traditional competition on the world's highest stage, I'm excited to dive into this next chapter with the Enhanced Games,\" the 31-year-old said on his decision.",
        "Ryan joins Team GB Olympic swimmer Ben Proud, four-time Greece Olympian Kristian Gkolomeev and US sprinter Fred Kerley in announcing his intentions to compete at the Games.",
        "The move has been criticised by Sport Ireland, which says it is \"deeply disappointed\" with the decision.",
        "The first Enhanced Games are due to take place in Las Vegas in 2026 with each event awarded a total prize purse of $500,000 and a $1m on offer for competitors who break world records.",
        "Swim Ireland has also condemned the move, confirming his disassociation with the organisation and that he will no longer be provided with any funding or services.",
        "Ryan competed at the Rio 2016, Tokyo 2020 and Paris 2024 Games, becoming the first Irish swimmer to participate at three Olympics.",
        "The Olympic Federation of Ireland said that Ryan's move to the Enhanced Games \"stands in direct opposition to our core clean sport values\"."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/swimming/articles/c93d5gl55yzo",
      "main_category": "sport",
      "detailed_category": "swimming",
      "topic": "GB win three medals and Peaty returns at World Cup",
      "content": [
        "Abbie Wood won two of Great Britain's three medals at the first event of the Swimming World Cup in Carmel, Indiana.Wood followed Saturday's gold in the women's 400m medley with a silver medal in the 200m medley on Sunday.Matt Richards added bronze in the men's 200m freestyle.Meanwhile, Britain's three-time Olympic gold medallist Adam Peaty competed for the first time since Paris 2024.The 30-year-old finished sixth in the men's 50m breaststroke final, but narrowly missed out on qualification for the 100m and 200m finals.The second leg of the World Cup takes place in Westmont, Illinois on 17-19 October, with the final event being held in the Canadian city of Toronto on 23-25 October.",
        "The World Aquatics Swimming World Cup takes place over three weekends, from 10-25 October",
        "Abbie Wood won two of Great Britain's three medals at the first event of the Swimming World Cup in Carmel, Indiana.",
        "Wood followed Saturday's gold in the women's 400m medley with a silver medal in the 200m medley on Sunday.",
        "Matt Richards added bronze in the men's 200m freestyle.",
        "Meanwhile, Britain's three-time Olympic gold medallist Adam Peaty competed for the first time since Paris 2024.",
        "The 30-year-old finished sixth in the men's 50m breaststroke final, but narrowly missed out on qualification for the 100m and 200m finals.",
        "The second leg of the World Cup takes place in Westmont, Illinois on 17-19 October, with the final event being held in the Canadian city of Toronto on 23-25 October."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/swimming/articles/cwyw24dyr9no",
      "main_category": "sport",
      "detailed_category": "swimming",
      "topic": "'Sewage, spilled pasta and fight for change'",
      "content": [
        "When I started out in open water swimming, I was more concerned about sharks than sewage.I was a novice to the issues of pollution. It is not the norm for humans to think about it.But, as I prepared for the lake equivalent of the 'three peaks challenge' earlier this year, it was clear I had to take the risks from pollution into account.According to figures from the Environment Agency, raw sewage was spilled by water companies into England's rivers and seas for a record 3.6 million hours in 2024.And concerns about water quality impacting sporting events have also been widely reported, such as postponements and illness at the Paris Olympics and concerns before the boat race.I took Pepto-Bismol and precautionary antibiotics to try and ward off E.coli or bacteria, and also used the extensive health and safety protocol from the Team GB doctor at the Olympics.For the challenge, I swam alongside boats that were kitted out with a sensor that measured water quality in real time.I met the chief executive of the water sensor company a few weeks later, who showed me the results and said it was remarkable how filthy these lakes are, not just from sewage but from other polluting sources like agriculture run-off too.He said if it had been any other swimmer or kids in it, they would have become very ill, and the only reason I didn't was because of my immunity from swimming in these conditions around the world.Mentally, it can be difficult knowing you are going into these waters, but at the moment it is just part of the sport, and that is why I am using my platform to try and change that.",
        "I was recognised at the BBC Green Sport Awards last year and was able to present athlete of the year Imogen Grant with her award on stage.That left me inspired to take it to the next level. To see what I could do to amplify my messaging, raise more money, push the sustainable message that comes with my sport of open water swimming.The challenge was to swim the three largest lakes in the UK - Loch Lomond, Lake Windermere, Llyn Tegid - and to try to do it all in 24 hours. It had not been done before so I just took it from there.The total distance of the challenge was 55km (34 miles) and it would be the longest swim of my career so far.It began at the biggest of the lakes - Loch Lomond - at midnight.I had never done night swimming before, so that was daunting and I needed to plan for that.Loch Lomond is also probably one of the darkest lochs in the world. It is 400-500m deep and it is like you are just staring into an enormous black hole. It is scary and nothing could really prepare me for that.That leg of the challenge was tough, it was brutal - 14 degree waters, nearly eight hours of exposure, cold air temperature.But I broke the timing record for that loch, and I jumped in the car and thought the hardest part of the challenge was done.Once I had got the biggest one out of the way, it would feel like I was coming back down the mountain - but it very much did not feel like that.I was now sleep deprived, knackered, frustrated, and probably a little bit delirious. I started refuelling because I had burned around 7,000 calories, but I have never been that tired before in my life and fell asleep, dropping the pasta all over me.That was probably the toughest moment. Waking up covered in pasta and asking my dad how long until Windermere, only to find out it was 20 minutes away and I didn't even feel like I had had more than five minutes break.My forearms were completely swollen but the competitive nature in me wanted to see it through.Thank goodness Bala Lake was a small one because I don't think I could have taken much more.It was amazing and inspiring to have so many people there at the finish line, but I was also just happy to know that I was going to be in my bed in a few hours.Surfers Against Sewage - a UK charity that campaigns for cleaner oceans, lakes and rivers - who I raised money for, were amazing. They were a support throughout the build-up and the day and I have made genuine friends through them now.",
        "In open water, we swim as a pack.Because when you swim together the current is stronger, and I think the same applies to the environment. When we are working together, we are advocating and pushing a message for a cleaner environment and a cleaner world.We are stronger, we are united and I think we are all swimming the same course here.Everyone can help by just talking about it, raising the issue and applying pressure. Sometimes it feels like we are fighting an uphill battle, but we are coming together, the community is taking a stand - we are fighting.In July, the environment minister pledged the number of times sewage is discharged by water companies will be halved by 2030, so the issue is being acknowledged.There are so many individuals, not just myself, who are doing remarkable things out there, like these kinds of challenges, to bring attention to it.My YouTube documentary from the challenge, external has already had more than 175,000 views, which has shown me how strong doing something like this can be. It can really amplify the issues of pollution in UK waterways.Already I am looking ahead to what I can do next year. What is the next one that I can do to amplify the message even more?Hector was speaking to BBC Sport's Nicola Pearson",
        "Pardoe becomes the fourth winner of the Athlete of the Year award at the BBC Green Sport awards",
        "When I started out in open water swimming, I was more concerned about sharks than sewage.",
        "I was a novice to the issues of pollution. It is not the norm for humans to think about it.",
        "But, as I prepared for the lake equivalent of the 'three peaks challenge' earlier this year, it was clear I had to take the risks from pollution into account.",
        "According to figures from the Environment Agency, raw sewage was spilled by water companies into England's rivers and seas for a record 3.6 million hours in 2024.",
        "And concerns about water quality impacting sporting events have also been widely reported, such as postponements and illness at the Paris Olympics and concerns before the boat race.",
        "I took Pepto-Bismol and precautionary antibiotics to try and ward off E.coli or bacteria, and also used the extensive health and safety protocol from the Team GB doctor at the Olympics.",
        "For the challenge, I swam alongside boats that were kitted out with a sensor that measured water quality in real time.",
        "I met the chief executive of the water sensor company a few weeks later, who showed me the results and said it was remarkable how filthy these lakes are, not just from sewage but from other polluting sources like agriculture run-off too.",
        "He said if it had been any other swimmer or kids in it, they would have become very ill, and the only reason I didn't was because of my immunity from swimming in these conditions around the world.",
        "Mentally, it can be difficult knowing you are going into these waters, but at the moment it is just part of the sport, and that is why I am using my platform to try and change that.",
        "Pardoe won a 10km bronze medal at the 2024 World Aquatics Championships",
        "I was recognised at the BBC Green Sport Awards last year and was able to present athlete of the year Imogen Grant with her award on stage.",
        "That left me inspired to take it to the next level. To see what I could do to amplify my messaging, raise more money, push the sustainable message that comes with my sport of open water swimming.",
        "The challenge was to swim the three largest lakes in the UK - Loch Lomond, Lake Windermere, Llyn Tegid - and to try to do it all in 24 hours. It had not been done before so I just took it from there.",
        "The total distance of the challenge was 55km (34 miles) and it would be the longest swim of my career so far.",
        "It began at the biggest of the lakes - Loch Lomond - at midnight.",
        "I had never done night swimming before, so that was daunting and I needed to plan for that.",
        "Loch Lomond is also probably one of the darkest lochs in the world. It is 400-500m deep and it is like you are just staring into an enormous black hole. It is scary and nothing could really prepare me for that.",
        "That leg of the challenge was tough, it was brutal - 14 degree waters, nearly eight hours of exposure, cold air temperature.",
        "But I broke the timing record for that loch, and I jumped in the car and thought the hardest part of the challenge was done.",
        "Once I had got the biggest one out of the way, it would feel like I was coming back down the mountain - but it very much did not feel like that.",
        "I was now sleep deprived, knackered, frustrated, and probably a little bit delirious. I started refuelling because I had burned around 7,000 calories, but I have never been that tired before in my life and fell asleep, dropping the pasta all over me.",
        "That was probably the toughest moment. Waking up covered in pasta and asking my dad how long until Windermere, only to find out it was 20 minutes away and I didn't even feel like I had had more than five minutes break.",
        "My forearms were completely swollen but the competitive nature in me wanted to see it through.",
        "Thank goodness Bala Lake was a small one because I don't think I could have taken much more.",
        "It was amazing and inspiring to have so many people there at the finish line, but I was also just happy to know that I was going to be in my bed in a few hours.",
        "Surfers Against Sewage - a UK charity that campaigns for cleaner oceans, lakes and rivers - who I raised money for, were amazing. They were a support throughout the build-up and the day and I have made genuine friends through them now.",
        "Pardoe broke the record for crossing Loch Lomond by swimming end-to-end in seven hours and 46 minutes",
        "In open water, we swim as a pack.",
        "Because when you swim together the current is stronger, and I think the same applies to the environment. When we are working together, we are advocating and pushing a message for a cleaner environment and a cleaner world.",
        "We are stronger, we are united and I think we are all swimming the same course here.",
        "Everyone can help by just talking about it, raising the issue and applying pressure. Sometimes it feels like we are fighting an uphill battle, but we are coming together, the community is taking a stand - we are fighting.",
        "In July, the environment minister pledged the number of times sewage is discharged by water companies will be halved by 2030, so the issue is being acknowledged.",
        "There are so many individuals, not just myself, who are doing remarkable things out there, like these kinds of challenges, to bring attention to it.",
        "My YouTube documentary from the challenge, external has already had more than 175,000 views, which has shown me how strong doing something like this can be. It can really amplify the issues of pollution in UK waterways.",
        "Already I am looking ahead to what I can do next year. What is the next one that I can do to amplify the message even more?",
        "Hector was speaking to BBC Sport's Nicola Pearson"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/articles/cwydzg52yzno",
      "main_category": "sport",
      "detailed_category": "swimming",
      "topic": "Pardoe wins athlete of the year at BBC Green Sport Awards",
      "content": [
        "Olympic open-water swimmer Hector Pardoe was named the athlete of the year at the BBC Green Sport Awards 2025, while former Arsenal player Hector Bellerin and Formula E were also honoured.The awards were presented to those who have shown an inspiring commitment to making a difference to sustainability in sport. In its fourth year, the BBC Green Sport Awards ceremony took place at BBC Broadcasting House in London and was presented by former sprinter Jeanette Kwakye.\"It's fantastic to celebrate the game-changers pushing sport in a greener direction,\" said Alex Kay-Jelski, director of BBC Sport.\"The competition this year is fierce and it shows just how much amazing work is happening to make sport more sustainable. Sport has the power to inspire, unite, and lead - and these awards spotlight those using that power to protect the planet.\"",
        "Athlete of the YearWinner: Hector PardoeWhy did he win? The 24-year-old open-water swimmer has used his platform \"for something bigger than just winning a medal\",  speaking out about the UK's poor water quality, which has caused the Olympian and his team-mates illness and threatens the future of his sport because of the closure of open-water venues.In August Pardoe, who describes himself as a plant-based athlete, became the first person to swim the largest lakes in England, Scotland and Wales inside 24 hours, raising awareness for pollution and funds for campaign group Surfers Against Sewage.  Global ChampionWinner: Hector BellerinWhy did he win? Bellerin's career-long commitment to sustainability is a shining example of athletes using their significant platform for good. Since he fundraised to plant about 60,000 trees during his time at Arsenal, Bellerin has become the second-largest shareholder at Forest Green Rovers, the world's first carbon-neutral football club, and launched a sustainable fashion brand producing made-to-order clothing with deadstock waste.He is chief ambassador for Forever Green, the sustainability arm of his current club Real Betis, and an ambassador for Green Football's Great Save campaign.",
        "PioneerWinner: Formula EWhy did it win? Since its inception in 2014, Formula E has been carbon neutral and promotes the use of electric vehicles by showcasing their performance. This year, Formula E introduced the pit boost feature, an electric vehicle recharging technology that delivers a 10% energy increase via a 30-second, 600kW charge in the pit lane, a competition innovation which could supercharge the uptake of electric vehicles if rolled out globally.",
        "Hector Pardoe came sixth in the 10km open water race at the 2024 Paris Olympics",
        "Olympic open-water swimmer Hector Pardoe was named the athlete of the year at the BBC Green Sport Awards 2025, while former Arsenal player Hector Bellerin and Formula E were also honoured.",
        "The awards were presented to those who have shown an inspiring commitment to making a difference to sustainability in sport.",
        "In its fourth year, the BBC Green Sport Awards ceremony took place at BBC Broadcasting House in London and was presented by former sprinter Jeanette Kwakye.",
        "\"It's fantastic to celebrate the game-changers pushing sport in a greener direction,\" said Alex Kay-Jelski, director of BBC Sport.",
        "\"The competition this year is fierce and it shows just how much amazing work is happening to make sport more sustainable. Sport has the power to inspire, unite, and lead - and these awards spotlight those using that power to protect the planet.\"",
        "'With power comes responsibility' - why Bellerin cycles to work",
        "Green Sport Awards nominees announced",
        "Olympian swims '3 peaks' in pollution campaign",
        "Winner: Hector Pardoe",
        "The 24-year-old open-water swimmer has used his platform \"for something bigger than just winning a medal\",  speaking out about the UK's poor water quality, which has caused the Olympian and his team-mates illness and threatens the future of his sport because of the closure of open-water venues.",
        "In August Pardoe, who describes himself as a plant-based athlete, became the first person to swim the largest lakes in England, Scotland and Wales inside 24 hours, raising awareness for pollution and funds for campaign group Surfers Against Sewage.",
        "Winner: Hector Bellerin",
        "Bellerin's career-long commitment to sustainability is a shining example of athletes using their significant platform for good.",
        "Since he fundraised to plant about 60,000 trees during his time at Arsenal, Bellerin has become the second-largest shareholder at Forest Green Rovers, the world's first carbon-neutral football club, and launched a sustainable fashion brand producing made-to-order clothing with deadstock waste.",
        "He is chief ambassador for Forever Green, the sustainability arm of his current club Real Betis, and an ambassador for Green Football's Great Save campaign.",
        "Since its inception in 2014, Formula E has been carbon neutral and promotes the use of electric vehicles by showcasing their performance.",
        "This year, Formula E introduced the pit boost feature, an electric vehicle recharging technology that delivers a 10% energy increase via a 30-second, 600kW charge in the pit lane, a competition innovation which could supercharge the uptake of electric vehicles if rolled out globally.",
        "This video can not be played",
        "With power comes responsibility - Bellerin"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/swimming/articles/cqxzd99v0zxo",
      "main_category": "sport",
      "detailed_category": "swimming",
      "topic": "Maskill sets world record as GB end with 40 medals",
      "content": [
        "Great Britain's Poppy Maskill broke her own world record to win the women's S14 100m butterfly on the final day of the World Para Swimming Championships in Singapore.The 20-year-old Cheshire swimmer won in one minute 2.58 seconds, lowering the mark of 1:03.00 she set in winning Paralympic gold in Paris last year.Britain's Olivia Newman-Baronius also dipped under the previous record, finishing less than two-tenths of a second behind her team-mate to claim silver.  There was also a gold medal for Britain's Will Ellard in the men's event of the same discipline, while Brock Whiston claimed silver in the women's SB8 100m breaststroke. The four medals took Britain's tally up to 40 for the championships - 15 gold, 14 silver and 11 bronze - as they finished fifth in the final medal table. \"I'm really happy with that,\" said Maskill, after following up on the Paralympic success she had as a teenager in a race with three Britons in the top four, as Louise Fiddes finished just outside the podium places. \"To get the world record again was amazing and just an unreal feeling.\"I think I've done a good job this week being the first year [in the cycle] back after Paris. I'll go back and look at all the little things I can improve with my coach Nick [Thompson] and can hopefully come back for more.\"Ellard, 19, beat Brazilian world record holder Gabriel Bandiera in a blanket finish to win the men's S14 100m butterfly. Whiston, 28, claimed her fourth medal of the championships, but was once again unable to edge out Spain's Paralympic champion Anastasiy Dmytriv Dmytriv in the women's SB8 100m breaststroke, after also finishing second to her at the Paris Games.",
        "Poppy Maskill won Paralympic gold in Paris in 2024",
        "Great Britain's Poppy Maskill broke her own world record to win the women's S14 100m butterfly on the final day of the World Para Swimming Championships in Singapore.",
        "The 20-year-old Cheshire swimmer won in one minute 2.58 seconds, lowering the mark of 1:03.00 she set in winning Paralympic gold in Paris last year.",
        "Britain's Olivia Newman-Baronius also dipped under the previous record, finishing less than two-tenths of a second behind her team-mate to claim silver.",
        "There was also a gold medal for Britain's Will Ellard in the men's event of the same discipline, while Brock Whiston claimed silver in the women's SB8 100m breaststroke.",
        "The four medals took Britain's tally up to 40 for the championships - 15 gold, 14 silver and 11 bronze - as they finished fifth in the final medal table.",
        "\"I'm really happy with that,\" said Maskill, after following up on the Paralympic success she had as a teenager in a race with three Britons in the top four, as Louise Fiddes finished just outside the podium places.",
        "\"To get the world record again was amazing and just an unreal feeling.",
        "\"I think I've done a good job this week being the first year [in the cycle] back after Paris. I'll go back and look at all the little things I can improve with my coach Nick [Thompson] and can hopefully come back for more.\"",
        "Ellard, 19, beat Brazilian world record holder Gabriel Bandiera in a blanket finish to win the men's S14 100m butterfly.",
        "Whiston, 28, claimed her fourth medal of the championships, but was once again unable to edge out Spain's Paralympic champion Anastasiy Dmytriv Dmytriv in the women's SB8 100m breaststroke, after also finishing second to her at the Paris Games."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/swimming/articles/cx2j32g4rkxo",
      "main_category": "sport",
      "detailed_category": "swimming",
      "topic": "Harvey earns breaststroke gold as GB win six medals",
      "content": [
        "Grace Harvey won gold in the women's SB5 100m breaststroke as Great Britain added a further six medals to their tally at the World Para Swimming Championships in Singapore. Harvey, 27, finished nearly four seconds ahead of Ukraine's Anna Hontar to win in one minute 42.88 seconds and reclaim the title she last won in 2022. It was Great Britain's 11th gold of the Championships. \"It was such an exciting race with Anna going out fast and that's great competition for the SB5 class, but to bring home the win, I'm beyond happy,\" said Harvey. \"I've been training breaststroke all season and this was the one, my child, my baby, so I gave it everything today and couldn't have put another stroke in. That was the perfect race for me.\"Alice Tai, who won four golds in the competition's first four days, added a silver medal to her collection alongside Bruce Dee, Roan Brennan, and Faye Rogers in the mixed 4x100m medley. They set a British record of 4:31.65 as they finished behind Spain. Earlier on day five, Rogers collected an individual silver in the women's S10 100m butterfly, finishing just three-hundredths of a second behind Turkey's Defne Kurt. Elsewhere, Rhys Darbey broke the former world record mark as he finished second behind Brazil's Gabriel Bandeira in the men's SM14 200m individual medley. His time of 2:05.84 is a European record. \"It's nice to go under that old world record mark, and for two of us to go under it is unbelievable,\" Darbey said. In the women's SM14 200m individual medley, Olivia Newman-Baronius took silver and Bethany Firth bronze, with team-mate Poppy Maskill in fourth place.",
        "Great Britain sit fourth in the medal table, with 11 golds among their 33 medals",
        "Grace Harvey won gold in the women's SB5 100m breaststroke as Great Britain added a further six medals to their tally at the World Para Swimming Championships in Singapore.",
        "Harvey, 27, finished nearly four seconds ahead of Ukraine's Anna Hontar to win in one minute 42.88 seconds and reclaim the title she last won in 2022.",
        "It was Great Britain's 11th gold of the Championships.",
        "\"It was such an exciting race with Anna going out fast and that's great competition for the SB5 class, but to bring home the win, I'm beyond happy,\" said Harvey.",
        "\"I've been training breaststroke all season and this was the one, my child, my baby, so I gave it everything today and couldn't have put another stroke in. That was the perfect race for me.\"",
        "Alice Tai, who won four golds in the competition's first four days, added a silver medal to her collection alongside Bruce Dee, Roan Brennan, and Faye Rogers in the mixed 4x100m medley.",
        "They set a British record of 4:31.65 as they finished behind Spain.",
        "Earlier on day five, Rogers collected an individual silver in the women's S10 100m butterfly, finishing just three-hundredths of a second behind Turkey's Defne Kurt.",
        "Elsewhere, Rhys Darbey broke the former world record mark as he finished second behind Brazil's Gabriel Bandeira in the men's SM14 200m individual medley. His time of 2:05.84 is a European record.",
        "\"It's nice to go under that old world record mark, and for two of us to go under it is unbelievable,\" Darbey said.",
        "In the women's SM14 200m individual medley, Olivia Newman-Baronius took silver and Bethany Firth bronze, with team-mate Poppy Maskill in fourth place."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/swimming/articles/c15k07yqe09o",
      "main_category": "sport",
      "detailed_category": "swimming",
      "topic": "Whiston wins medley gold as GB break world record",
      "content": [
        "Paralympic champion Brock Whiston won gold in the women's SM8 200m individual medley as Great Britain set a new world record at the World Para Swimming Championships in Singapore.Whiston backed up her Paralympic title from 12 months ago with a season's best time of two minutes 40.25 seconds, albeit five seconds slower than the world record she set in 2019.The 28-year-old completed her medal set at this year's meet after winning silver in the 400m freestyle and bronze in the 100m butterfly.\"I felt like coming into it I had a lot of pressure on myself,\" Whiston said.\"No one else put the pressure on me but after winning gold at Paris I just wanted to come here and prove that it wasn't just a one off and that I deserve to be on the podium. I can't stop smiling, I'm super happy.\"Later in the session GB triumphed in the mixed S14 4x100m medley relay to claim a 13th gold medal of the championships.Poppy Maskill, Harry Stewart, Will Ellard and Bethany Firth produced a world record time of four minutes 2.86 secs, almost five seconds faster than the previous record set by Australia at the 2023 championships.Maskill and Stewart put in firm foundations for the team over the opening backstroke and breaststroke legs, before Ellard held off Brazil across the 100m butterfly and Firth surged to victory on the freestyle leg.\"I'm so happy! These guys are amazing, they're so good to swim with and I think we're just setting the standard for what is to come,\" said Firth.With the format to be introduced at the 2028 LA Paralympics, Ellard said: \"Now that it's a Paralympic event I'm sure we'll try at different things to keep aiming to get better and better [in this format].\"Faye Rogers set a British record time of 1.00.46 to finish second in the women's S10 100m freestyle and win her fourth medal of the week in Singapore.Bruce Dee set another national record but missed out on a medal in the men's SB6 100m breaststroke final by a tenth of a second, while 14-year-old Iona Winnifrith missed the podium by the same margin in the women's S7 50m freestyle despite producing a lifetime best of 33.77 secs.China top the medal table heading into the final day with 16 golds, with Italy second with 15 and Ukraine and the United States both on 14.",
        "Whiston has won three medals in Singapore this week",
        "Paralympic champion Brock Whiston won gold in the women's SM8 200m individual medley as Great Britain set a new world record at the World Para Swimming Championships in Singapore.",
        "Whiston backed up her Paralympic title from 12 months ago with a season's best time of two minutes 40.25 seconds, albeit five seconds slower than the world record she set in 2019.",
        "The 28-year-old completed her medal set at this year's meet after winning silver in the 400m freestyle and bronze in the 100m butterfly.",
        "\"I felt like coming into it I had a lot of pressure on myself,\" Whiston said.",
        "\"No one else put the pressure on me but after winning gold at Paris I just wanted to come here and prove that it wasn't just a one off and that I deserve to be on the podium. I can't stop smiling, I'm super happy.\"",
        "Later in the session GB triumphed in the mixed S14 4x100m medley relay to claim a 13th gold medal of the championships.",
        "Poppy Maskill, Harry Stewart, Will Ellard and Bethany Firth produced a world record time of four minutes 2.86 secs, almost five seconds faster than the previous record set by Australia at the 2023 championships.",
        "Maskill and Stewart put in firm foundations for the team over the opening backstroke and breaststroke legs, before Ellard held off Brazil across the 100m butterfly and Firth surged to victory on the freestyle leg.",
        "\"I'm so happy! These guys are amazing, they're so good to swim with and I think we're just setting the standard for what is to come,\" said Firth.",
        "With the format to be introduced at the 2028 LA Paralympics, Ellard said: \"Now that it's a Paralympic event I'm sure we'll try at different things to keep aiming to get better and better [in this format].\"",
        "Faye Rogers set a British record time of 1.00.46 to finish second in the women's S10 100m freestyle and win her fourth medal of the week in Singapore.",
        "Bruce Dee set another national record but missed out on a medal in the men's SB6 100m breaststroke final by a tenth of a second, while 14-year-old Iona Winnifrith missed the podium by the same margin in the women's S7 50m freestyle despite producing a lifetime best of 33.77 secs.",
        "China top the medal table heading into the final day with 16 golds, with Italy second with 15 and Ukraine and the United States both on 14.",
        "Harvey earns breaststroke gold as GB win six medals"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/swimming/articles/cvgvrnlj8v5o",
      "main_category": "sport",
      "detailed_category": "swimming",
      "topic": "Tai wins fourth world Para-swimming gold",
      "content": [
        "Alice Tai won her fourth gold in as many days at the World Para Swimming Championships in Singapore - while Great Britain defended their mixed relay title. Tai, 26, has won every final she has faced at this year's Championships to date, finishing first in the women's S8 100m backstroke, S8 400m freestyle, and S8 100m butterfly before Wednesday's triumph in the S8 100m freestyle. She finished ahead of Italy's Xenia Palazzo and USA's Jessica Long, winning in a time of one minute 05.49 seconds. \"This week is taking its toll a bit now. I'm definitely a bit tired but there's still three days to go,\" said Tai, who could another two golds to her collection on Thursday. \"I'm really happy with that time, it's a season's best and the fastest I've done since my amputation [in 2022], so I'm over the moon with it.\"William Ellard, Poppy Maskill, Dylan Broom, and Georgia Sheffield set a championship record as Great Britain won the mixed S14 4x100m freestyle in 3:41.14 - less than one second short of their own world record, set in 2021. Great Britain have won the event at both world and Paralympic level stretching back to its introduction in 2019. \"The goal is to keep building this to LA [2028 Paralympics]. We've got a great team here and a lot of good people coming through, so it could be quite good for the future,\" Ellard said. There was also gold for Ellie Challis, who retained her women's S3 50m backstroke title in a time of 53.92. Astrid Carroll, meanwhile, beat China's Jietong Zheng by three hundredths of a second to win silver in the women's SB12 100m breaststroke.",
        "Alice Tai has won four of Great Britain's 10 gold medals in Singapore",
        "Alice Tai won her fourth gold in as many days at the World Para Swimming Championships in Singapore - while Great Britain defended their mixed relay title.",
        "Tai, 26, has won every final she has faced at this year's Championships to date, finishing first in the women's S8 100m backstroke, S8 400m freestyle, and S8 100m butterfly before Wednesday's triumph in the S8 100m freestyle.",
        "She finished ahead of Italy's Xenia Palazzo and USA's Jessica Long, winning in a time of one minute 05.49 seconds.",
        "\"This week is taking its toll a bit now. I'm definitely a bit tired but there's still three days to go,\" said Tai, who could another two golds to her collection on Thursday.",
        "\"I'm really happy with that time, it's a season's best and the fastest I've done since my amputation [in 2022], so I'm over the moon with it.\"",
        "William Ellard, Poppy Maskill, Dylan Broom, and Georgia Sheffield set a championship record as Great Britain won the mixed S14 4x100m freestyle in 3:41.14 - less than one second short of their own world record, set in 2021.",
        "Great Britain have won the event at both world and Paralympic level stretching back to its introduction in 2019.",
        "\"The goal is to keep building this to LA [2028 Paralympics]. We've got a great team here and a lot of good people coming through, so it could be quite good for the future,\" Ellard said.",
        "There was also gold for Ellie Challis, who retained her women's S3 50m backstroke title in a time of 53.92.",
        "Astrid Carroll, meanwhile, beat China's Jietong Zheng by three hundredths of a second to win silver in the women's SB12 100m breaststroke."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/swimming/articles/cy7pe3lggr1o",
      "main_category": "sport",
      "detailed_category": "swimming",
      "topic": "Rogers and Tai win gold at World Para Championships",
      "content": [
        "Faye Rogers set a British record to win the 400m freestyle and Alice Tai earned  gold in the 100m butterfly at the World Para Swimming Championships in Singapore.Having claimed silver in the 200m individual medley on Monday, Rogers went one better on Tuesday, winning the S10 freestyle in a time of 4:32.34. Rogers, who won gold in the 100m butterfly at the 2024 Paralympics, finished 3.92 seconds in front of Hungary's Bianka Pap.\"I was just focusing on swimming my race plan. I still think I went out a little too fast, but we didn't die off as much towards the end, so mission accomplished there,\" Rogers said.\"That was a big PB and a gold medal, so I can't ask for much more than that.\"Tai, meanwhile, collected her third gold medal in as many days as she won the S8 100m butterfly in 1:11.20, with team-mate Brock Whiston finishing in third place.The other titles for Tai have come in the S8 100m backstroke and S8 400m freestyle.\"I was not expecting to win that one,\" Tai said. \"My fly is always a bit unpredictable and I guess it just went well today. I feel like I'm in a good place to start the LA [Los Angeles 2028 Paralympics] cycle.\"Fourteen-year-old Iona Winnifrith claimed silver in the SB7 100m breaststroke. The Briton, who was the youngest member of Team GB at the 2024 Paralympics, bettered her own national record as she finished 2.06 seconds behind winner Mariia Pavlova.Harry Stewart earned bronze in the 100m breaststroke SB14, while Olivia Newman-Baronius won bronze in the female category of the same event.Grace Harvey added a further welcome medal to Great Britain's tally with bronze in the SM6 200m individual medley.",
        "Faye Rogers has won two medals in Singapore",
        "Faye Rogers set a British record to win the 400m freestyle and Alice Tai earned  gold in the 100m butterfly at the World Para Swimming Championships in Singapore.",
        "Having claimed silver in the 200m individual medley on Monday, Rogers went one better on Tuesday, winning the S10 freestyle in a time of 4:32.34.",
        "Rogers, who won gold in the 100m butterfly at the 2024 Paralympics, finished 3.92 seconds in front of Hungary's Bianka Pap.",
        "\"I was just focusing on swimming my race plan. I still think I went out a little too fast, but we didn't die off as much towards the end, so mission accomplished there,\" Rogers said.",
        "\"That was a big PB and a gold medal, so I can't ask for much more than that.\"",
        "Tai, meanwhile, collected her third gold medal in as many days as she won the S8 100m butterfly in 1:11.20, with team-mate Brock Whiston finishing in third place.",
        "The other titles for Tai have come in the S8 100m backstroke and S8 400m freestyle.",
        "\"I was not expecting to win that one,\" Tai said. \"My fly is always a bit unpredictable and I guess it just went well today. I feel like I'm in a good place to start the LA [Los Angeles 2028 Paralympics] cycle.\"",
        "Fourteen-year-old Iona Winnifrith claimed silver in the SB7 100m breaststroke.",
        "The Briton, who was the youngest member of Team GB at the 2024 Paralympics, bettered her own national record as she finished 2.06 seconds behind winner Mariia Pavlova.",
        "Harry Stewart earned bronze in the 100m breaststroke SB14, while Olivia Newman-Baronius won bronze in the female category of the same event.",
        "Grace Harvey added a further welcome medal to Great Britain's tally with bronze in the SM6 200m individual medley.",
        "All-British top three in World Para Championships"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/swimming/articles/cn82vrzg700o",
      "main_category": "sport",
      "detailed_category": "swimming",
      "topic": "All-British top three in World Para Championships",
      "content": [
        "Poppy Maskill won gold, Bethany Firth silver and Georgia Sheffield bronze as Great Britain clinched the top three places in the women's S14 100m backstroke at the World Para Swimming Championships in Singapore.Returning to global competition following the birth of her daughter, Firth led into the turn, but Maskill, who won gold at the Paris 2024 Paralympic Games, had just enough to edge the victory in a new championship record time of one minute 5.09 seconds.Fellow Briton Alice Tai secured her second gold of the championships with victory in the women's S8 100m backstroke.Tai, who won gold in the women's S8 400m freestyle on Sunday, paced herself perfectly to claim her second win in two days and said: \"That's the second fastest time I've done this season which I'm really happy with. \"I'm trying to manage my week because I've got racing every day so I'm super happy and excited to be on the podium hearing the national anthem again.\"Meanwhile, Faye Rogers set a new British record of 2:28.52 to claim silver in the women's SM10 200m individual medley competition, finishing 0.22 seconds behind Turkey's Defne Kurt.\"I got a bit excited in the first 100m, went out a little bit quick, possibly could have been a bit more controlled going out to have a little more coming back, but we live and learn,\" said Rogers.\"It was a good swim, I'm happy with it being a PB and I was super excited with getting a silver - at the last world champs I won a bronze so that's an improvement.\"Ellie Challis won bronze in the women's SM3 150m individual medley and Will Ellard also came third in his final in the men's S14 100m backstroke.",
        "Poppy Maskill (centre), Bethany Firth (right) and Georgia Sheffield (left) with their medals from an all-British top three in the S14 100m backstroke at the World Para Swimming Championships in Singapore",
        "Poppy Maskill won gold, Bethany Firth silver and Georgia Sheffield bronze as Great Britain clinched the top three places in the women's S14 100m backstroke at the World Para Swimming Championships in Singapore.",
        "Returning to global competition following the birth of her daughter, Firth led into the turn, but Maskill, who won gold at the Paris 2024 Paralympic Games, had just enough to edge the victory in a new championship record time of one minute 5.09 seconds.",
        "Fellow Briton Alice Tai secured her second gold of the championships with victory in the women's S8 100m backstroke.",
        "Tai, who won gold in the women's S8 400m freestyle on Sunday, paced herself perfectly to claim her second win in two days and said: \"That's the second fastest time I've done this season which I'm really happy with.",
        "\"I'm trying to manage my week because I've got racing every day so I'm super happy and excited to be on the podium hearing the national anthem again.\"",
        "Meanwhile, Faye Rogers set a new British record of 2:28.52 to claim silver in the women's SM10 200m individual medley competition, finishing 0.22 seconds behind Turkey's Defne Kurt.",
        "\"I got a bit excited in the first 100m, went out a little bit quick, possibly could have been a bit more controlled going out to have a little more coming back, but we live and learn,\" said Rogers.",
        "\"It was a good swim, I'm happy with it being a PB and I was super excited with getting a silver - at the last world champs I won a bronze so that's an improvement.\"",
        "Ellie Challis won bronze in the women's SM3 150m individual medley and Will Ellard also came third in his final in the men's S14 100m backstroke."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/swimming/articles/c30669m2n49o",
      "main_category": "sport",
      "detailed_category": "swimming",
      "topic": "Ellard sets new world record as GB claim nine medals",
      "content": [
        "Paralympic champion William Ellard broke his own world record to win the men's 200m freestyle on the opening day of the World Para-swimming Championships in Singapore.The 19-year-old, who set the mark during his first Paralympics at Paris 2024 with a time of one minute 51.30 seconds, bettered his pace in Singapore, winning the race with a time of 1:51.08.Ellard said he was happy with the feat but still wanted to be quicker.\"I feel really good but I was expecting to go a bit faster, maybe 1:50.00 or 1:49.00,\" he explained. \"I think I went out too quick and it got to me in my head. I was thinking about the time rather than the swim itself.\"But, it was a good race. I'm happy to get the gold.\"",
        "Elsewhere, there were eight other medals for Great Britain on day one including two golds. Poppy Maskill won her first individual world title in the women's 200m freestyle S14, with Louise Fiddes also finishing on the podium in third place.There was a British one-two in the Women's 400m freestyle S8 with Alice Tai edging out Brock Whiston.Ellie Challis won the 12th world championship medal of her career with a second-placed finish in the women's 50m breaststroke SB2, while 14-year-old Iona Winnifrith claimed bronze in the women's 200m individual medley SM7.And there was another double podium for Great Britain to round off day one, this time in the women's 100m backstroke S12.Ela Letton-Jones and Astrid Carroll claimed silver and bronze on their respective world championship debuts, with Brazil's Carol Santiago, 40, beating them to the finish.",
        "William Ellard (centre) won two golds and one silver at Paris 2024",
        "Paralympic champion William Ellard broke his own world record to win the men's 200m freestyle on the opening day of the World Para-swimming Championships in Singapore.",
        "The 19-year-old, who set the mark during his first Paralympics at Paris 2024 with a time of one minute 51.30 seconds, bettered his pace in Singapore, winning the race with a time of 1:51.08.",
        "Ellard said he was happy with the feat but still wanted to be quicker.",
        "\"I feel really good but I was expecting to go a bit faster, maybe 1:50.00 or 1:49.00,\" he explained. \"I think I went out too quick and it got to me in my head. I was thinking about the time rather than the swim itself.",
        "\"But, it was a good race. I'm happy to get the gold.\"",
        "Elsewhere, there were eight other medals for Great Britain on day one including two golds.",
        "Poppy Maskill won her first individual world title in the women's 200m freestyle S14, with Louise Fiddes also finishing on the podium in third place.",
        "There was a British one-two in the Women's 400m freestyle S8 with Alice Tai edging out Brock Whiston.",
        "Ellie Challis won the 12th world championship medal of her career with a second-placed finish in the women's 50m breaststroke SB2, while 14-year-old Iona Winnifrith claimed bronze in the women's 200m individual medley SM7.",
        "And there was another double podium for Great Britain to round off day one, this time in the women's 100m backstroke S12.",
        "Ela Letton-Jones and Astrid Carroll claimed silver and bronze on their respective world championship debuts, with Brazil's Carol Santiago, 40, beating them to the finish."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/articles/cp3qn6xd91ro",
      "main_category": "sport",
      "detailed_category": "swimming",
      "topic": "Enhanced Games could 'turn away future athletes'",
      "content": [
        "The Enhanced Games is a \"reckless\" venture that could dissuade athletes of the future from competing in sport, says the athlete commission of UK Anti-Doping (Ukad).The commission - a group of current and former athletes advising Ukad - believes the Enhanced Games could \"damage the integrity of world sport irrevocably.\"The controversial event, scheduled to take place for the first time in 2026, allows athletes to take banned performance-enhancing drugs under medical supervision.It has been criticised for endangering athletes' health and undermining fair play, though organisers say there are safety measures in place, including supervision from doctors and healthcare professionals.Last week, Olympic swimmer Ben Proud became the first British athlete to sign up.\"The games represent a reckless departure from what sport is all about, and its fundamental values of fairness and integrity,\" read an athletes commission statement.\"We believe that celebrating performances achieved through doping goes against everything the world of sport should be striving for. \"Sporting performance on the world stage should serve to inspire the next generation, and our fear is that this competition will intimidate, demotivate and in effect turn away potential athletes of the future who may think the only way to succeed is through cheating.\"",
        "UK Sport and Aquatics GB have condemned Proud's decision, while the British Olympic Association described the Enhanced Games as a \"cynical and dangerous event\".Earlier this year, World Aquatics became the first international sport federation to ban athletes, coaches and officials from its events if they have taken part in the Enhanced Games.Proud insists what he is doing is not undermining 'clean' sport, arguing \"traditional sport\" and the Enhanced Games are \"two very different formats\" - adding he has no plans to return to traditional swimming.The 30-year-old, a silver medallist in 50m freestyle at the 2024 Olympics, says it would take \"13 years of winning a World Championship title\" to earn the same amount of prize money on offer for winning a single race at the Enhanced Games.The Enhanced Games offers appearance fees, with a $1m bonus on offer for breaking the world record for the 50m freestyle - the event in which Proud has won world and European gold.Speaking in 2024, the event's founder Aron D'Souza said athletes - able to openly seek performance-enhancing drugs, rather than buy them from shady, illicit sources - will actually be safer at the Enhanced Games.\"Part of our liberation is the liberation of information,\" he told BBC Sport.\"Bodily autonomy is a fundamental human right. Adults with free, informed consent should be able to do with their body what they wish.\"Individuals should be able to make risk decisions for themselves.\"",
        "This video can not be played",
        "Ben Proud talks about joining the Enhanced Games",
        "The Enhanced Games is a \"reckless\" venture that could dissuade athletes of the future from competing in sport, says the athlete commission of UK Anti-Doping (Ukad).",
        "The commission - a group of current and former athletes advising Ukad - believes the Enhanced Games could \"damage the integrity of world sport irrevocably.\"",
        "The controversial event, scheduled to take place for the first time in 2026, allows athletes to take banned performance-enhancing drugs under medical supervision.",
        "It has been criticised for endangering athletes' health and undermining fair play, though organisers say there are safety measures in place, including supervision from doctors and healthcare professionals.",
        "Last week, Olympic swimmer Ben Proud became the first British athlete to sign up.",
        "\"The games represent a reckless departure from what sport is all about, and its fundamental values of fairness and integrity,\" read an athletes commission statement.",
        "\"We believe that celebrating performances achieved through doping goes against everything the world of sport should be striving for.",
        "\"Sporting performance on the world stage should serve to inspire the next generation, and our fear is that this competition will intimidate, demotivate and in effect turn away potential athletes of the future who may think the only way to succeed is through cheating.\"",
        "'Enhanced Games prize money worth 13 world titles'",
        "Olympic medallist becomes first Briton to join Enhanced Games",
        "UK Sport and Aquatics GB have condemned Proud's decision, while the British Olympic Association described the Enhanced Games as a \"cynical and dangerous event\".",
        "Earlier this year, World Aquatics became the first international sport federation to ban athletes, coaches and officials from its events if they have taken part in the Enhanced Games.",
        "Proud insists what he is doing is not undermining 'clean' sport, arguing \"traditional sport\" and the Enhanced Games are \"two very different formats\" - adding he has no plans to return to traditional swimming.",
        "The 30-year-old, a silver medallist in 50m freestyle at the 2024 Olympics, says it would take \"13 years of winning a World Championship title\" to earn the same amount of prize money on offer for winning a single race at the Enhanced Games.",
        "The Enhanced Games offers appearance fees, with a $1m bonus on offer for breaking the world record for the 50m freestyle - the event in which Proud has won world and European gold.",
        "Speaking in 2024, the event's founder Aron D'Souza said athletes - able to openly seek performance-enhancing drugs, rather than buy them from shady, illicit sources - will actually be safer at the Enhanced Games.",
        "\"Part of our liberation is the liberation of information,\" he told BBC Sport.",
        "\"Bodily autonomy is a fundamental human right. Adults with free, informed consent should be able to do with their body what they wish.",
        "\"Individuals should be able to make risk decisions for themselves.\"",
        "The mind behind the 'Doped Games'",
        "What are the Enhanced Games and why are they controversial?"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/articles/c1j5w5kgn50o",
      "main_category": "sport",
      "detailed_category": "swimming",
      "topic": "What are the Enhanced Games and why are they controversial?",
      "content": [
        "British swimmer and 2024 Olympic silver medallist Ben Proud will compete in the 2026 Enhanced Games. But what are they?The multi-sport Enhanced Games will allow athletes to use performance-enhancing substances without being subject to drug tests.Those behind the proposal claim it will be the 'Olympics of the future', allowing athletes to take drugs in a bid to break 'world records'.Founder Aron D'Souza believes athletes should be entitled to do what they wish with their own bodies.But the Australian businessman's concept has been heavily criticised for the potential impact on athletes' health, and undermining fair play.UK Anti-Doping (Ukad) said last year its mission was \"to protect sport from doping cheats\". It added: \"There is no place in sport for performance-enhancing drugs, nor the Enhanced Games.\"At a launch event on Wednesday, Las Vegas was announced as the host of the inaugural Enhanced Games, which will run from 21-24 May 2026.Organisers said that under their permitted conditions, Greek swimmer Kristian Gkolomeev had gone quicker than the 50m freestyle world record, which has stood since 2009.",
        "D'Souza's idea has been backed by a venture capital fund which includes Donald Trump Jr - the son of the US president - and billionaire entrepreneur Peter Thiel.It was first launched as a concept in 2023, when it was presented as an opportunity to beat world records for cash prizes up to $1m (746,570).World Athletics president Lord Coe has said taking part would be \"moronic\", and any competitor would face a lengthy ban.D'Souza said his concept - which he wants to make an annual feature - was \"truly extraordinary\" and \"shaping the future\".The first Enhanced Games will consist of events in short-course swimming, sprinting and weightlifting.",
        "Participants are permitted to use some substances that are banned from elite sport, but cocaine and heroin are among those banned.The Enhanced Games have said they will carry out some doping measures under medical supervision.Only substances approved by the United States' Food and Drug Administration, external (FDA) can be taken. That is a different list to the one the World Anti-Doping Agency (Wada) allows for elite athletes.",
        "Proud, who won a silver medal in 50m freestyle at the Paris Olympics, has announced he will take part in the games. He also represented Great Britain in the 2016 and 2020 Olympics - finishing fourth and fifth respectively in the same distance. He holds the British record for short-course 50m freestyle.Proud told BBC Sport that Gkolomeev reportedly breaking the 50m freestyle world record during the 2024 Enhanced Games changed his perspective on the event and \"seeing someone go faster is always slightly hard to take\".Gkolomeev will also compete in 2026.Ukrainian swimmer Andriy Govorov, who holds the world record for the 50m butterfly, and Bulgaria's Josif Miladinov - a European silver medallist in the 100m butterfly - have also signed up.Australian former world champion James Magnussen came out of retirement to join the Enhanced Games in 2024.USA sprinter Fred Kerley is the first track athlete to join the Enhanced Games - he is also the first American male to join.Kerley, who is an Olympic silver and bronze medalist, has been provisionally suspended for an alleged anti-doping whereabouts violation and is therefore not competing in the 2025 World Athletics Championships in Tokyo.This article is the latest from BBC Sport's Ask Me Anything team.",
        "Ask Me Anything is a service dedicated to answering your questions.We want to reward your time by telling you things you do not know and reminding you of things you do.The team will find out everything you need to know and be able to call upon a network of contacts including our experts and pundits.We will be answering your questions from the heart of the BBC Sport newsroom, and going behind the scenes at some of the world's biggest sporting events.Our coverage will span the BBC Sport website, app, social media and YouTube accounts, plus BBC TV and radio.",
        "Has F1's iconic Monaco Grand Prix become boring?What does Hotspur mean?What is World Sevens Football?When did the New York Knicks last win the NBA Championship?",
        "British swimmer and 2024 Olympic silver medallist Ben Proud will compete in the 2026 Enhanced Games. But what are they?",
        "The multi-sport Enhanced Games will allow athletes to use performance-enhancing substances without being subject to drug tests.",
        "Those behind the proposal claim it will be the 'Olympics of the future', allowing athletes to take drugs in a bid to break 'world records'.",
        "Founder Aron D'Souza believes athletes should be entitled to do what they wish with their own bodies.",
        "But the Australian businessman's concept has been heavily criticised for the potential impact on athletes' health, and undermining fair play.",
        "UK Anti-Doping (Ukad) said last year its mission was \"to protect sport from doping cheats\". It added: \"There is no place in sport for performance-enhancing drugs, nor the Enhanced Games.\"",
        "At a launch event on Wednesday, Las Vegas was announced as the host of the inaugural Enhanced Games, which will run from 21-24 May 2026.",
        "Organisers said that under their permitted conditions, Greek swimmer Kristian Gkolomeev had gone quicker than the 50m freestyle world record, which has stood since 2009.",
        "Send us your questions",
        "Swimmer Kristian Gkolomeev is among the athletes signed up for the Enhanced Games",
        "D'Souza's idea has been backed by a venture capital fund which includes Donald Trump Jr - the son of the US president - and billionaire entrepreneur Peter Thiel.",
        "It was first launched as a concept in 2023, when it was presented as an opportunity to beat world records for cash prizes up to $1m (746,570).",
        "World Athletics president Lord Coe has said taking part would be \"moronic\", and any competitor would face a lengthy ban.",
        "D'Souza said his concept - which he wants to make an annual feature - was \"truly extraordinary\" and \"shaping the future\".",
        "The first Enhanced Games will consist of events in short-course swimming, sprinting and weightlifting.",
        "Participants are permitted to use some substances that are banned from elite sport, but cocaine and heroin are among those banned.",
        "The Enhanced Games have said they will carry out some doping measures under medical supervision.",
        "Only substances approved by the United States' Food and Drug Administration, external (FDA) can be taken. That is a different list to the one the World Anti-Doping Agency (Wada) allows for elite athletes.",
        "Proud, who won a silver medal in 50m freestyle at the Paris Olympics, has announced he will take part in the games. He also represented Great Britain in the 2016 and 2020 Olympics - finishing fourth and fifth respectively in the same distance.",
        "He holds the British record for short-course 50m freestyle.",
        "Proud told BBC Sport that Gkolomeev reportedly breaking the 50m freestyle world record during the 2024 Enhanced Games changed his perspective on the event and \"seeing someone go faster is always slightly hard to take\".",
        "Gkolomeev will also compete in 2026.",
        "Ukrainian swimmer Andriy Govorov, who holds the world record for the 50m butterfly, and Bulgaria's Josif Miladinov - a European silver medallist in the 100m butterfly - have also signed up.",
        "Australian former world champion James Magnussen came out of retirement to join the Enhanced Games in 2024.",
        "USA sprinter Fred Kerley is the first track athlete to join the Enhanced Games - he is also the first American male to join.",
        "Kerley, who is an Olympic silver and bronze medalist, has been provisionally suspended for an alleged anti-doping whereabouts violation and is therefore not competing in the 2025 World Athletics Championships in Tokyo.",
        "This article is the latest from BBC Sport's Ask Me Anything team.",
        "Ask Me Anything is a service dedicated to answering your questions.",
        "We want to reward your time by telling you things you do not know and reminding you of things you do.",
        "The team will find out everything you need to know and be able to call upon a network of contacts including our experts and pundits.",
        "We will be answering your questions from the heart of the BBC Sport newsroom, and going behind the scenes at some of the world's biggest sporting events.",
        "Our coverage will span the BBC Sport website, app, social media and YouTube accounts, plus BBC TV and radio.",
        "Has F1's iconic Monaco Grand Prix become boring?",
        "What does Hotspur mean?",
        "What is World Sevens Football?",
        "When did the New York Knicks last win the NBA Championship?"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/swimming/articles/cz69pe53q3qo",
      "main_category": "sport",
      "detailed_category": "swimming",
      "topic": "'Enhanced Games prize money worth 13 world titles'",
      "content": [
        "Olympic swimmer Ben Proud said it would take \"13 years of winning a World Championship title\" for athletes to earn the same amount of prize money on offer for winning a single race at the Enhanced Games.On Wednesday, Proud became the first British athlete to join the controversial event, which allows athletes to take banned performance-enhancing drugs under medical supervision.The Enhanced Games offers appearance fees, with a $1m bonus on offer for breaking the world record for the 50m freestyle - the event in which Proud has won world and European gold.At the World Aquatics Championships in 2022, the total prize money for swimming was $2.73m, with athletes receiving $20,000 for finishing first.\"I'm 30 years old and retirement has been a topic of contention for quite a few years,\" Proud told BBC Radio 5 Live.",
        "\"In reality, us athletes in the Olympic programme don't earn enough money to retire off the back of this and I am always seeking something that can see me through a bit longer.\"Proud is on Aquatics GB's 'podium' list of their World Class Programme for 2025 which \"supports athletes possessing genuine and strong medal potential at the next Olympic Games in LA 2028\" and awards them with up to 29,000 of investment.Aquatics GB has said it \"condemns Ben's decision in the strongest terms\".Proud said he understands governing bodies' criticism, but argued \"traditional sport\" and the Enhanced Games are \"two very different formats\" and he does not expect to return to traditional swimming. \"It would have taken me 13 years of winning a World Championship title in order to win what I could win in one race at this games,\" Proud said.\"I love what I do, I love my sport and to continue it a little longer gives me that satisfaction.\"The Enhanced Games is planned to be an annual competition, initially comprising short-distance swimming, sprinting and weightlifting, with the inaugural event set to be held in Las Vegas from 21-24 May 2026.",
        "The Enhanced Games has been criticised for endangering athletes' health and undermining fair play, with the World Anti-Doping Agency (Wada) describing it as a \"dangerous and irresponsible project\", external.Proud, who has previously supported UK Anti-Doping's (Ukad) Clean Sport Week, said he is \"not under any obligation to take anything\" despite joining the event.\"In order to compete in these games, to be in a position to earn this prize money that you would never see in professional sport, I am forced to retire,\" he said.\"There are many different doctors and healthcare specialists who will guide and inform me on decisions. If that was to become the case later on [that I would take performance-enhancing drugs], I would be in good hands to make the best informed decision.\"Only substances approved by the United States' Food and Drug Administration (FDA) can be taken, which is different to the list Wada allows for elite athletes.Earlier this year, World Aquatics became the first international sport federation to ban athletes, coaches and officials from its events if they have taken part in the Enhanced Games.\"The Enhanced Games is trying to reduce the stigma around some of these substances,\" Proud added. \"Some of these things, they have fantastic effects on the body and really limited side effects. Those are the ones to me that are curious - what could you take that makes you feel better, better energy, more recovery, without health risks.\"",
        "Proud's move to the Enhanced Games was met with a lot of criticism.In a statement on social media, external, Aquatics GB said it is \"immensely disappointed\", while UK Sport said it was working with Aquatics GB \"as a matter of urgency to determine Ben Proud's suitability to receive public funds\".Meanwhile, Ukad chief executive Jane Rumble said: \"It is incredibly disappointing that any British athlete would consider competing in an event that flies in the face of the true spirit of sport.\"Proud said he \"fully understands\" the negative reaction.\"I respect what UK Sport and Aquatics GB have said because if I were in their shoes, I would agree fully,\" Proud said.\"They need to protect themselves and the sport from this competition so I fully understand the reactions I have received from making this change.\"Proud won world gold at 50m freestyle in 2022, and Olympic silver at the 2024 Games in Paris, while he claimed a world silver medal earlier this year.\"I want to hold as much respect to swimming by removing myself as much as I can,\" he said.\"I don't expect to come back. Being one of the first people to make this move comes with a lot of controversy.\"",
        "Ben Proud won a world silver medal in the 50m freestyle earlier this year",
        "Olympic swimmer Ben Proud said it would take \"13 years of winning a World Championship title\" for athletes to earn the same amount of prize money on offer for winning a single race at the Enhanced Games.",
        "On Wednesday, Proud became the first British athlete to join the controversial event, which allows athletes to take banned performance-enhancing drugs under medical supervision.",
        "The Enhanced Games offers appearance fees, with a $1m bonus on offer for breaking the world record for the 50m freestyle - the event in which Proud has won world and European gold.",
        "At the World Aquatics Championships in 2022, the total prize money for swimming was $2.73m, with athletes receiving $20,000 for finishing first.",
        "\"I'm 30 years old and retirement has been a topic of contention for quite a few years,\" Proud told BBC Radio 5 Live.",
        "\"In reality, us athletes in the Olympic programme don't earn enough money to retire off the back of this and I am always seeking something that can see me through a bit longer.\"",
        "Proud is on Aquatics GB's 'podium' list of their World Class Programme for 2025 which \"supports athletes possessing genuine and strong medal potential at the next Olympic Games in LA 2028\" and awards them with up to 29,000 of investment.",
        "Aquatics GB has said it \"condemns Ben's decision in the strongest terms\".",
        "Proud said he understands governing bodies' criticism, but argued \"traditional sport\" and the Enhanced Games are \"two very different formats\" and he does not expect to return to traditional swimming.",
        "\"It would have taken me 13 years of winning a World Championship title in order to win what I could win in one race at this games,\" Proud said.",
        "\"I love what I do, I love my sport and to continue it a little longer gives me that satisfaction.\"",
        "The Enhanced Games is planned to be an annual competition, initially comprising short-distance swimming, sprinting and weightlifting, with the inaugural event set to be held in Las Vegas from 21-24 May 2026.",
        "This video can not be played",
        "Ben Proud talks about joining the Enhanced Games",
        "The Enhanced Games has been criticised for endangering athletes' health and undermining fair play, with the World Anti-Doping Agency (Wada) describing it as a \"dangerous and irresponsible project\", external.",
        "Proud, who has previously supported UK Anti-Doping's (Ukad) Clean Sport Week, said he is \"not under any obligation to take anything\" despite joining the event.",
        "\"In order to compete in these games, to be in a position to earn this prize money that you would never see in professional sport, I am forced to retire,\" he said.",
        "\"There are many different doctors and healthcare specialists who will guide and inform me on decisions. If that was to become the case later on [that I would take performance-enhancing drugs], I would be in good hands to make the best informed decision.\"",
        "Only substances approved by the United States' Food and Drug Administration (FDA) can be taken, which is different to the list Wada allows for elite athletes.",
        "Earlier this year, World Aquatics became the first international sport federation to ban athletes, coaches and officials from its events if they have taken part in the Enhanced Games.",
        "\"The Enhanced Games is trying to reduce the stigma around some of these substances,\" Proud added.",
        "\"Some of these things, they have fantastic effects on the body and really limited side effects. Those are the ones to me that are curious - what could you take that makes you feel better, better energy, more recovery, without health risks.\"",
        "Proud's move to the Enhanced Games was met with a lot of criticism.",
        "In a statement on social media, external, Aquatics GB said it is \"immensely disappointed\", while UK Sport said it was working with Aquatics GB \"as a matter of urgency to determine Ben Proud's suitability to receive public funds\".",
        "Meanwhile, Ukad chief executive Jane Rumble said: \"It is incredibly disappointing that any British athlete would consider competing in an event that flies in the face of the true spirit of sport.\"",
        "Proud said he \"fully understands\" the negative reaction.",
        "\"I respect what UK Sport and Aquatics GB have said because if I were in their shoes, I would agree fully,\" Proud said.",
        "\"They need to protect themselves and the sport from this competition so I fully understand the reactions I have received from making this change.\"",
        "Proud won world gold at 50m freestyle in 2022, and Olympic silver at the 2024 Games in Paris, while he claimed a world silver medal earlier this year.",
        "\"I want to hold as much respect to swimming by removing myself as much as I can,\" he said.",
        "\"I don't expect to come back. Being one of the first people to make this move comes with a lot of controversy.\""
      ]
    },
    {
      "url": "https://www.bbc.com/sport/swimming/articles/c15kzdq8eyxo",
      "main_category": "sport",
      "detailed_category": "swimming",
      "topic": "Letton-Jones takes on Worlds with Paralympic ambitions",
      "content": [
        "Growing up with a condition that limited her vision to little more than a metre, Ela Letton-Jones never imagined sport could be a full-time occupation.So it was little surprise that she cried with happiness on learning she would represent Great Britain at this week's World Para Swimming Championships.\"My mum was there when I got the call and we were both crying, it was a really nice moment,\" said the 18-year-old.\"I was really shocked, I was just not expecting it at all, it took a few days to sink in.\"",
        "Letton-Jones has albinism, a congenital condition that severely affects her sight, so has to count her strokes to know when she is approaching the wall of the swimming pool.But that has not let that stop her from following her dream to reach the 2028 Paralympics in Los Angeles.After narrowly missing out in the Paris Games last year, the teenager from Felinheli, Gwynedd, was invited onto the Aquatics GB Para-swimming world class programme.\"I didn't realise it could be my job until I got on to the programme. I didn't realise people just swam,\" she said.\"It's the best of both worlds because I still get to go to uni and have that lifestyle and I've also got my other job, swimming, which I really enjoy as well.\"",
        "She now trains with Caernarfon swimming club Nofio Gwynedd that has already produced two Welsh Commonwealth Games stars in Medi Harris and Mari Davies.Her coach Bronwen Hill has been quick to sing her praises.\"Ela came to me after lockdown and she's improved masses,\" she said.\"She works really hard, she's really focused and that's why she's got where she is today.\"It [the World Championships] will be a wonderful experience for her, she hasn't done anything of this high level before. But it will focus her because international competition is something different.\"Letton-Jones will compete in five events at the championships in Singapore from 21-27 September, starting with the S12 100m backstroke on Saturday.The next target is flying the flag for Wales at next year's Commonwealth Games before the ultimate goal of Los Angeles in 2028.\"I just like holding the Welsh flag so I want to compete at the Commonwealth Games,\" she said.\"But I'd love to go to the Paralympics, that's my main goal. I'm just trying to work towards getting selected for that.\"",
        "Roan Brennan (S10/SB10/SM10)Dylan Broom (S14/SB14/SM14)Astrid Carroll (S12/SB12/SM12)Ellie Challis (S3/SB2/SM3)Rhys Darbey (S14/SB14/SM14)Bruce Dee (S6/SB6/SM6)William Ellard (S14/SB14/SM14)Louise Fiddes (S14/SB14/SM14)Bethany Firth (S14/SB14/SM14)Grace Harvey (S6/SB5/SM6)Ela Letton-Jones (S12/SB12/SM12)Poppy Maskill (S14/SB14/SM14)Olivia Newman-Baronius (S14/SB14/SM14)Faye Rogers (S10/SB10/SM10)Georgia Sheffield (S14/SB14/SM14)Harry Stewart (S14/SB14/SM14)Alice Tai (S8/SB8/SM8)Mark Tompsett (S14/SB14/SM14)Cameron Vearncombe (S14/SB14/SM14)Brock Whiston (S8/SB8/SM8)Kieran Williams (S10/SB10/SM10)Iona Winnifrith (S7/SB7/SM7)",
        "This video can not be played",
        "World Para Swimming Championships: Letton-Jones set for debut",
        "Growing up with a condition that limited her vision to little more than a metre, Ela Letton-Jones never imagined sport could be a full-time occupation.",
        "So it was little surprise that she cried with happiness on learning she would represent Great Britain at this week's World Para Swimming Championships.",
        "\"My mum was there when I got the call and we were both crying, it was a really nice moment,\" said the 18-year-old.",
        "\"I was really shocked, I was just not expecting it at all, it took a few days to sink in.\"",
        "Letton-Jones has albinism, a congenital condition that severely affects her sight, so has to count her strokes to know when she is approaching the wall of the swimming pool.",
        "But that has not let that stop her from following her dream to reach the 2028 Paralympics in Los Angeles.",
        "After narrowly missing out in the Paris Games last year, the teenager from Felinheli, Gwynedd, was invited onto the Aquatics GB Para-swimming world class programme.",
        "\"I didn't realise it could be my job until I got on to the programme. I didn't realise people just swam,\" she said.",
        "\"It's the best of both worlds because I still get to go to uni and have that lifestyle and I've also got my other job, swimming, which I really enjoy as well.\"",
        "Van der Poll swaps surf for ice at historic World Champs",
        "World record 'pretty surreal' for Pritchard",
        "Disability sport calendar",
        "She now trains with Caernarfon swimming club Nofio Gwynedd that has already produced two Welsh Commonwealth Games stars in Medi Harris and Mari Davies.",
        "Her coach Bronwen Hill has been quick to sing her praises.",
        "\"Ela came to me after lockdown and she's improved masses,\" she said.",
        "\"She works really hard, she's really focused and that's why she's got where she is today.",
        "\"It [the World Championships] will be a wonderful experience for her, she hasn't done anything of this high level before. But it will focus her because international competition is something different.\"",
        "Letton-Jones will compete in five events at the championships in Singapore from 21-27 September, starting with the S12 100m backstroke on Saturday.",
        "The next target is flying the flag for Wales at next year's Commonwealth Games before the ultimate goal of Los Angeles in 2028.",
        "\"I just like holding the Welsh flag so I want to compete at the Commonwealth Games,\" she said.",
        "\"But I'd love to go to the Paralympics, that's my main goal. I'm just trying to work towards getting selected for that.\"",
        "Roan Brennan (S10/SB10/SM10)",
        "Dylan Broom (S14/SB14/SM14)",
        "Astrid Carroll (S12/SB12/SM12)",
        "Ellie Challis (S3/SB2/SM3)",
        "Rhys Darbey (S14/SB14/SM14)",
        "Bruce Dee (S6/SB6/SM6)",
        "William Ellard (S14/SB14/SM14)",
        "Louise Fiddes (S14/SB14/SM14)",
        "Bethany Firth (S14/SB14/SM14)",
        "Grace Harvey (S6/SB5/SM6)",
        "Ela Letton-Jones (S12/SB12/SM12)",
        "Poppy Maskill (S14/SB14/SM14)",
        "Olivia Newman-Baronius (S14/SB14/SM14)",
        "Faye Rogers (S10/SB10/SM10)",
        "Georgia Sheffield (S14/SB14/SM14)",
        "Harry Stewart (S14/SB14/SM14)",
        "Alice Tai (S8/SB8/SM8)",
        "Mark Tompsett (S14/SB14/SM14)",
        "Cameron Vearncombe (S14/SB14/SM14)",
        "Brock Whiston (S8/SB8/SM8)",
        "Kieran Williams (S10/SB10/SM10)",
        "Iona Winnifrith (S7/SB7/SM7)"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/swimming/articles/c5yevrrv1kwo",
      "main_category": "sport",
      "detailed_category": "swimming",
      "topic": "Olympic medallist becomes first Briton to join Enhanced Games",
      "content": [
        "Olympic swimmer Ben Proud has become the first British athlete to join the controversial Enhanced Games - but insists what he is doing is not undermining 'clean' sport.Proud, 30, is a world and European champion at 50m freestyle, and won silver at the 2024 Olympics in Paris.But he has now committed to an event that allows athletes to take banned performance-enhancing drugs. By taking part he will be barred from international competition.Proud never won Olympic gold or broke the 50m freestyle world record, which has stood since 2009, but feels the Enhanced Games \"give me a new opportunity to continue this pursuit and see how far I can take things\".Asked if he thinks the event undermines clean sport, Proud told BBC Sport: \"No. I think it opens up the potential avenue to excel in a very different way.\"I think realistically I've achieved everything I can, and now the Enhanced [Games] is giving me a new opportunity. I definitely don't think that's undermining a clean sport.\"I really respect the sport I've been part of, and I would never step back in knowing I've done something which isn't in the rules.\"",
        "In a statement on social media,, external Aquatics GB said: \"Aquatics GB is immensely disappointed in Ben Proud's announcement to sign with the Enhanced Games.\"Aquatics GB, along with our partners, stand firmly behind the values and principles of clean sport and condemns Ben's decision in the strongest terms.\"UK Sport said it is working with Aquatics GB \"as a matter of urgency to determine Ben Proud's suitability to receive public funds\" and that any breach of anti-doping rules contravenes policies athletes must comply with to receive UK Sport funding.UK Sport added it \"condemns everything the Enhanced Games stands for in the strongest possible terms\" and is \"incredibly disappointed\" that any British athletes in its programmes would support such an event.Earlier this year, World Aquatics became the first international sport federation to ban athletes, coaches and officials from its events if they have taken part in the  Enhanced Games.Proud has previously supported UK Anti-Doping's (Ukad) Clean Sport Week while British team-mates Adam Peaty and Duncan Scott have been outspoken against doping.Proud said he sees 'traditional sport' and the Enhanced Games as \"two very separate entities\", and that he found athletes breaking the rules \"incredibly frustrating\".\"I see doping in clean sports as a complete no-go,\" he said. \"I don't have any time for that.\"The fact it's still happening is a problem. It'll always be a cat and mouse game, there will always be people developing new techniques or people getting away with things.\"That's one thing that has ruined sport for a lot of people. The anti-doping agencies just don't have the ability to completely make sure everyone is clean and on a level playing field, and that to me has always been the biggest frustration.\"If you were part of my life for the past 12, 13 years, you'd see how much time you have to allocate to making sure we're available to be tested on a daily basis, making sure we're constantly giving our samples.\"Ukad chief executive Jane Rumble said: \"It is incredibly disappointing that any British athlete would consider competing in an event that flies in the face of the true spirit of sport.\"It is an undertaking that diminishes, rather than 'enhances', all those involved.\"A British Olympic Association spokesperson said: \"In upholding the values of clean sport we remain vehemently opposed to what we believe to be a cynical and dangerous event.\"When asked for comment, the World Anti-Doping Agency (Wada) referred BBC Sport to its previous statement on the Enhanced Games, condemning it as a \"a dangerous and irresponsible concept\".Wada's latest Anti-Doping Rule Violations (ADRVs) report, external was published in July, covering 2022. It said that from 241,143 samples, 1,979 (0.82%) were reported to be adverse findings, of which 1,376 (69.5%) resulted in an ADRV.",
        "The Enhanced Games were launched as a concept in 2023, with some doping measures permitted under medical supervision.Only substances approved by the United States' Food and Drug Administration (FDA) can be taken, which is different to the list Wada allows for elite athletes.The event has been criticised for endangering athletes' health and undermining fair play, with Wada describing it as a \"dangerous and irresponsible project\", external and Travis Tygart, chief executive of the US Anti-Doping Agency, calling it a \"clown show\"., external\"We have access to some of the greatest specialists out there to make sure that everything will be an informed decision,\" Proud said.\"Everything is FDA approved. Everything's readily available to the general public. It's done under very strict supervision from doctors and health care professionals, and I will never take anything that I am unsure of.\"They are not allowing anyone to participate if they are under any stress or health risks.\"Proud also said that organisers \"aren't asking me to take anything\" and he is unsure at the moment what substances he would use.\"If you ask me in six months' time, I'll probably have a bit more of an answer,\" he said. \"I'm coming into this very new, I don't know any pros and cons about anything that could be available.\"All I know is that it's going to be a very interesting dynamic to learn about these things, things that have not been available to us for a long time.\"I'm very curious as to what could be done to feel better in certain aspects of the race or training. I have the next three, four months to figure out what it is. After that, ultimately, I have the decision to say I want to take it or not.\"The Enhanced Games are planned to be an annual competition, initially comprising short-distance swimming, sprinting and weightlifting, with the inaugural event set to be held in Las Vegas from 21-24 May 2026.",
        "The Enhanced Games offers appearance fees and bonuses, with Greek swimmer Kristian Gkolomeev receiving a prize of $1m (739,000) for beating a world record time in the US in February.Organisers said he swam 20.89 seconds in a 50m freestyle time trial, 0.02 seconds quicker than the world record set by Brazil's Cesar Cielo in December 2009, although the time will not be recognised by World Aquatics.\"Seeing someone break the world record really changed my perspective,\" said Proud. \"Suddenly there's another format and the fastest man in the water is no longer in the traditional format.\"It made me think about myself, my life, my career, and what it is that I really want out of this.\"I find it really interesting to see what I can do with this new format, and I feel like I'm the best person at this point in time to really deliver a good product for this.\"After winning his first Olympic medal last year and silver at the World Aquatics Championships in Singapore last month, Proud felt \"the most content with my career that I've ever been\".The 2022 world champion added that he has spoken to \"one or two\" of his former team-mates about his new venture.\"All I've had is positive feedback,\" Proud said. \"You talk to people in the swimming community and it does come with some questions, like 'are you sure this is right?'\"But the people who I've told know me well enough to know that this is the best opportunity I have.\"It's something that I think I can excel at, and it's coming at a time in my career where I'm satisfied, I'm happy. I'm ready to step away.\"",
        "This video can not be played",
        "Ben Proud talks about joining the Enhanced Games",
        "Olympic swimmer Ben Proud has become the first British athlete to join the controversial Enhanced Games - but insists what he is doing is not undermining 'clean' sport.",
        "Proud, 30, is a world and European champion at 50m freestyle, and won silver at the 2024 Olympics in Paris.",
        "But he has now committed to an event that allows athletes to take banned performance-enhancing drugs. By taking part he will be barred from international competition.",
        "Proud never won Olympic gold or broke the 50m freestyle world record, which has stood since 2009, but feels the Enhanced Games \"give me a new opportunity to continue this pursuit and see how far I can take things\".",
        "Asked if he thinks the event undermines clean sport, Proud told BBC Sport: \"No. I think it opens up the potential avenue to excel in a very different way.",
        "\"I think realistically I've achieved everything I can, and now the Enhanced [Games] is giving me a new opportunity. I definitely don't think that's undermining a clean sport.",
        "\"I really respect the sport I've been part of, and I would never step back in knowing I've done something which isn't in the rules.\"",
        "In a statement on social media,, external Aquatics GB said: \"Aquatics GB is immensely disappointed in Ben Proud's announcement to sign with the Enhanced Games.",
        "\"Aquatics GB, along with our partners, stand firmly behind the values and principles of clean sport and condemns Ben's decision in the strongest terms.\"",
        "UK Sport said it is working with Aquatics GB \"as a matter of urgency to determine Ben Proud's suitability to receive public funds\" and that any breach of anti-doping rules contravenes policies athletes must comply with to receive UK Sport funding.",
        "UK Sport added it \"condemns everything the Enhanced Games stands for in the strongest possible terms\" and is \"incredibly disappointed\" that any British athletes in its programmes would support such an event.",
        "Earlier this year, World Aquatics became the first international sport federation to ban athletes, coaches and officials from its events if they have taken part in the  Enhanced Games.",
        "Proud has previously supported UK Anti-Doping's (Ukad) Clean Sport Week while British team-mates Adam Peaty and Duncan Scott have been outspoken against doping.",
        "Proud said he sees 'traditional sport' and the Enhanced Games as \"two very separate entities\", and that he found athletes breaking the rules \"incredibly frustrating\".",
        "\"I see doping in clean sports as a complete no-go,\" he said. \"I don't have any time for that.",
        "\"The fact it's still happening is a problem. It'll always be a cat and mouse game, there will always be people developing new techniques or people getting away with things.",
        "\"That's one thing that has ruined sport for a lot of people. The anti-doping agencies just don't have the ability to completely make sure everyone is clean and on a level playing field, and that to me has always been the biggest frustration.",
        "\"If you were part of my life for the past 12, 13 years, you'd see how much time you have to allocate to making sure we're available to be tested on a daily basis, making sure we're constantly giving our samples.\"",
        "Ukad chief executive Jane Rumble said: \"It is incredibly disappointing that any British athlete would consider competing in an event that flies in the face of the true spirit of sport.",
        "\"It is an undertaking that diminishes, rather than 'enhances', all those involved.\"",
        "A British Olympic Association spokesperson said: \"In upholding the values of clean sport we remain vehemently opposed to what we believe to be a cynical and dangerous event.\"",
        "When asked for comment, the World Anti-Doping Agency (Wada) referred BBC Sport to its previous statement on the Enhanced Games, condemning it as a \"a dangerous and irresponsible concept\".",
        "Wada's latest Anti-Doping Rule Violations (ADRVs) report, external was published in July, covering 2022. It said that from 241,143 samples, 1,979 (0.82%) were reported to be adverse findings, of which 1,376 (69.5%) resulted in an ADRV.",
        "What are the Enhanced Games and why are they controversial?",
        "Enhanced Games swimmer 'breaks world record'",
        "The Enhanced Games were launched as a concept in 2023, with some doping measures permitted under medical supervision.",
        "Only substances approved by the United States' Food and Drug Administration (FDA) can be taken, which is different to the list Wada allows for elite athletes.",
        "The event has been criticised for endangering athletes' health and undermining fair play, with Wada describing it as a \"dangerous and irresponsible project\", external and Travis Tygart, chief executive of the US Anti-Doping Agency, calling it a \"clown show\"., external",
        "\"We have access to some of the greatest specialists out there to make sure that everything will be an informed decision,\" Proud said.",
        "\"Everything is FDA approved. Everything's readily available to the general public. It's done under very strict supervision from doctors and health care professionals, and I will never take anything that I am unsure of.",
        "\"They are not allowing anyone to participate if they are under any stress or health risks.\"",
        "Proud also said that organisers \"aren't asking me to take anything\" and he is unsure at the moment what substances he would use.",
        "\"If you ask me in six months' time, I'll probably have a bit more of an answer,\" he said. \"I'm coming into this very new, I don't know any pros and cons about anything that could be available.",
        "\"All I know is that it's going to be a very interesting dynamic to learn about these things, things that have not been available to us for a long time.",
        "\"I'm very curious as to what could be done to feel better in certain aspects of the race or training. I have the next three, four months to figure out what it is. After that, ultimately, I have the decision to say I want to take it or not.\"",
        "The Enhanced Games are planned to be an annual competition, initially comprising short-distance swimming, sprinting and weightlifting, with the inaugural event set to be held in Las Vegas from 21-24 May 2026.",
        "The mind behind the 'Doped Games'",
        "Peaty questions China relay win amid doping row",
        "Proud completed the set for 50m freestyle at this year's World Aquatics Championships, winning his first silver medal after one world gold and three bronze",
        "The Enhanced Games offers appearance fees and bonuses, with Greek swimmer Kristian Gkolomeev receiving a prize of $1m (739,000) for beating a world record time in the US in February.",
        "Organisers said he swam 20.89 seconds in a 50m freestyle time trial, 0.02 seconds quicker than the world record set by Brazil's Cesar Cielo in December 2009, although the time will not be recognised by World Aquatics.",
        "\"Seeing someone break the world record really changed my perspective,\" said Proud. \"Suddenly there's another format and the fastest man in the water is no longer in the traditional format.",
        "\"It made me think about myself, my life, my career, and what it is that I really want out of this.",
        "\"I find it really interesting to see what I can do with this new format, and I feel like I'm the best person at this point in time to really deliver a good product for this.\"",
        "After winning his first Olympic medal last year and silver at the World Aquatics Championships in Singapore last month, Proud felt \"the most content with my career that I've ever been\".",
        "The 2022 world champion added that he has spoken to \"one or two\" of his former team-mates about his new venture.",
        "\"All I've had is positive feedback,\" Proud said. \"You talk to people in the swimming community and it does come with some questions, like 'are you sure this is right?'",
        "\"But the people who I've told know me well enough to know that this is the best opportunity I have.",
        "\"It's something that I think I can excel at, and it's coming at a time in my career where I'm satisfied, I'm happy. I'm ready to step away.\""
      ]
    },
    {
      "url": "https://www.bbc.com/sport/swimming/articles/cy8j29e4d22o",
      "main_category": "sport",
      "detailed_category": "swimming",
      "topic": "Nowacki wins second gold medal at World Juniors",
      "content": [
        "Jersey's Filip Nowacki won his second gold medal at the World Junior Swimming Championships in Romania, setting a championship record for the men's 200m breaststroke.The 17-year-old finished in two minutes 7.32 seconds, 0.24 seconds clear of Japan's Shin Ohashi, whom he also beat in the 100m breaststroke on Wednesday.His time shaved two seconds off the previous championship record of 2:09.40, set by Josh Matheny, of the United States, in 2019.Nowacki will be chasing his third medal when he competes in the 50m breaststroke heats on Saturday, with the final taking place on Sunday.",
        "Nowacki shaved two seconds off the previous championship record in the men's 200m breaststroke",
        "Jersey's Filip Nowacki won his second gold medal at the World Junior Swimming Championships in Romania, setting a championship record for the men's 200m breaststroke.",
        "The 17-year-old finished in two minutes 7.32 seconds, 0.24 seconds clear of Japan's Shin Ohashi, whom he also beat in the 100m breaststroke on Wednesday.",
        "His time shaved two seconds off the previous championship record of 2:09.40, set by Josh Matheny, of the United States, in 2019.",
        "Nowacki will be chasing his third medal when he competes in the 50m breaststroke heats on Saturday, with the final taking place on Sunday."
      ]
    }
  ]
}