{
  "scraped_at": "2025-10-27T18:56:59.803546",
  "total_articles": 31,
  "category": "olympics",
  "articles_per_category": 100,
  "articles": [
    {
      "url": "https://www.bbc.com/sport/articles/c1dmp9krz91o",
      "main_category": "sport",
      "detailed_category": "olympics",
      "topic": "What's happening and when at the Paris Olympics?",
      "content": [
        "Just one day of competition remains at the Paris Olympics, with only a handful of gold medals to be decided before Sunday's closing ceremony - all times BST.Team GB has named a squad of 327 athletes and UK Sport has set a target of 50 to 70 medals at the Games. They will enter the final day on 63 medals, one short of their tally in Tokyo three years ago.There will be live coverage of Paris 2024 across the BBC on TV, radio and online. The Games officially opened at a unique and spectacular opening ceremony along the River Seine on Friday, 26 July and will close on Sunday, 11 August.",
        "Gold medal events:Athletics (women's marathon), basketball (women's), handball (men's), modern pentathlon (women's), track cycling (men's keirin, women's sprint, women's omnium), volleyball (women's), water polo (men's), weightlifting (women's +81kg), wrestling (men's freestyle 65kg, men's freestyle 97kg, women's freestyle 76kg).HighlightsThe final day of the Games brings three more gold medals to be won in the velodrome if Team GB are looking for a late boost.Option one: the women's sprint (final from 11:45). While you have to go back to Victoria Pendleton in 2008 to find the last Briton who took gold in this event, GB's Emma Finucane is the defending world champion.Option two: the men's keirin (final at 12:32), an event beloved first by Sir Chris Hoy with gold in 2008 and 2012, then by Sir Jason Kenny with gold in 2016 and 2021. Imagine adding your name to that list. That's the task ahead of GB’s Commonwealth silver medallist Jack Carlin and Hamish Turnbull, but the likes of the Netherlands’ Harrie Lavreysen could be hard to defeat.Option three: the women's omnium (decided at 12:56). This is the final event in the velodrome at Paris 2024 and presents one last opportunity for GB, but perhaps even more of an opportunity for US rider Jennifer Valente, the defending world and Olympic champion.Emily Campbell took Britain's first medal in women's Olympic weightlifting with silver in Tokyo. She has since added world silver and has won four successive European titles. Her +81kg category begins at 10:30, with China's Li Wenwen the favourite for gold.The Paris 2024 closing ceremony is due to begin at 19:00. This time, we are back in the traditional stadium setting as the Stade de France hosts the world's athletes for a final goodbye. The show you will see performed during the closing ceremony is titled Records, although not too much has been given away by its creators. This also marks the handover to Los Angeles 2028 for the next Olympics and to the Paris 2024 Paralympics, which begin on Wednesday, 28 August.",
        "Brit watchRose Harvey, Calli Hauger-Thackery and Clara Evans - a late replacement for the injured Charlotte Purdue - are the British athletes in the women's marathon, which starts at 07:00. The name to watch is Ethiopia's Tigst Assefa.World watchIf the United States beat France in Sunday's gold medal match (14:30), it will be the nation's eighth consecutive Olympic women's basketball title, the record for any Olympic team sport.Women’s volleyball concludes with the gold-medal match at 12:00. The US, who beat Brazil and Serbia to gold in 2021, face recently dominant Italy.The men's water polo final is at 13:00. Hungary won this event three times in a row from 2000 to 2008 but have not been in a final since and will face the USA for bronze in Paris, with the final to be contested by Serbia and Croatia.Expert knowledgeThere's a really good chance for another GB medal in the women's modern pentathlon (from 10:00), and perhaps another gold, as defending Olympic champion Kate French lines up alongside world bronze medallist Kerenza Bryson.You are also about to see the last Olympic modern pentathlon involving horses.The sport's world governing body has been trying to find a way to, er, modernise the sport, since modern pentathlon was given that name in 1912 (when it made its Olympic debut) and may no longer feel quite so up-to-date to many viewers.The showjumping leg of modern pentathlon - the others being fencing, swimming, running and shooting - has always attracted criticism because it involves pairing athletes with randomly assigned local horses, sometimes to competition-destroying effect when horse and rider fail to find the same wavelength. Those moments have become less a test of skill than a form of equestrian roulette that can make or break four years of training.While some athletes advocated for simply improving the showjumping with various changes, the world governing body has pursued the idea of obstacle course racing as a replacement. Think Ninja Warrior, Total Wipeout, that kind of thing. Proponents say younger people will be more likely to watch that kind of event than showjumping, no matter how good the jumping is. While modern pentathlon was briefly threatened with being dropped from the Olympics entirely, it is on the schedule for LA 2028 with obstacle included at the expense of jumping.",
        "Just one day of competition remains at the Paris Olympics, with only a handful of gold medals to be decided before Sunday's closing ceremony - all times BST.",
        "Team GB has named a squad of 327 athletes and UK Sport has set a target of 50 to 70 medals at the Games. They will enter the final day on 63 medals, one short of their tally in Tokyo three years ago.",
        "There will be live coverage of Paris 2024 across the BBC on TV, radio and online.",
        "The Games officially opened at a unique and spectacular opening ceremony along the River Seine on Friday, 26 July and will close on Sunday, 11 August.",
        "Athletics (women's marathon), basketball (women's), handball (men's), modern pentathlon (women's), track cycling (men's keirin, women's sprint, women's omnium), volleyball (women's), water polo (men's), weightlifting (women's +81kg), wrestling (men's freestyle 65kg, men's freestyle 97kg, women's freestyle 76kg).",
        "The final day of the Games brings three more gold medals to be won in the velodrome if Team GB are looking for a late boost.",
        "Option one: the women's sprint (final from 11:45). While you have to go back to Victoria Pendleton in 2008 to find the last Briton who took gold in this event, GB's Emma Finucane is the defending world champion.",
        "Option two: the men's keirin (final at 12:32), an event beloved first by Sir Chris Hoy with gold in 2008 and 2012, then by Sir Jason Kenny with gold in 2016 and 2021. Imagine adding your name to that list. That's the task ahead of GB’s Commonwealth silver medallist Jack Carlin and Hamish Turnbull, but the likes of the Netherlands’ Harrie Lavreysen could be hard to defeat.",
        "Option three: the women's omnium (decided at 12:56). This is the final event in the velodrome at Paris 2024 and presents one last opportunity for GB, but perhaps even more of an opportunity for US rider Jennifer Valente, the defending world and Olympic champion.",
        "Emily Campbell took Britain's first medal in women's Olympic weightlifting with silver in Tokyo. She has since added world silver and has won four successive European titles. Her +81kg category begins at 10:30, with China's Li Wenwen the favourite for gold.",
        "The Paris 2024 closing ceremony is due to begin at 19:00. This time, we are back in the traditional stadium setting as the Stade de France hosts the world's athletes for a final goodbye. The show you will see performed during the closing ceremony is titled Records, although not too much has been given away by its creators. This also marks the handover to Los Angeles 2028 for the next Olympics and to the Paris 2024 Paralympics, which begin on Wednesday, 28 August.",
        "This video can not be played",
        "Paris 2024: Could you lift like British weightlifter Emily Campbell?",
        "Rose Harvey, Calli Hauger-Thackery and Clara Evans - a late replacement for the injured Charlotte Purdue - are the British athletes in the women's marathon, which starts at 07:00. The name to watch is Ethiopia's Tigst Assefa.",
        "If the United States beat France in Sunday's gold medal match (14:30), it will be the nation's eighth consecutive Olympic women's basketball title, the record for any Olympic team sport.",
        "Women’s volleyball concludes with the gold-medal match at 12:00. The US, who beat Brazil and Serbia to gold in 2021, face recently dominant Italy.",
        "The men's water polo final is at 13:00. Hungary won this event three times in a row from 2000 to 2008 but have not been in a final since and will face the USA for bronze in Paris, with the final to be contested by Serbia and Croatia.",
        "There's a really good chance for another GB medal in the women's modern pentathlon (from 10:00), and perhaps another gold, as defending Olympic champion Kate French lines up alongside world bronze medallist Kerenza Bryson.",
        "You are also about to see the last Olympic modern pentathlon involving horses.",
        "The sport's world governing body has been trying to find a way to, er, modernise the sport, since modern pentathlon was given that name in 1912 (when it made its Olympic debut) and may no longer feel quite so up-to-date to many viewers.",
        "The showjumping leg of modern pentathlon - the others being fencing, swimming, running and shooting - has always attracted criticism because it involves pairing athletes with randomly assigned local horses, sometimes to competition-destroying effect when horse and rider fail to find the same wavelength. Those moments have become less a test of skill than a form of equestrian roulette that can make or break four years of training.",
        "While some athletes advocated for simply improving the showjumping with various changes, the world governing body has pursued the idea of obstacle course racing as a replacement. Think Ninja Warrior, Total Wipeout, that kind of thing. Proponents say younger people will be more likely to watch that kind of event than showjumping, no matter how good the jumping is. While modern pentathlon was briefly threatened with being dropped from the Olympics entirely, it is on the schedule for LA 2028 with obstacle included at the expense of jumping.",
        "Full Paris 2024 schedule",
        "All you need to know about the Paris 2024 Olympics",
        "How to follow Paris 2024 Olympics across the BBC"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/olympics/articles/c3gdyj88d30o",
      "main_category": "sport",
      "detailed_category": "olympics",
      "topic": "Who were Team GB's medal winners at Paris 2024?",
      "content": [
        "Team GB won 65 medals at Paris 2024 - beating the 64 they earned at Tokyo 2020, and within the target range set before these Games by UK Sport, which expected between 50 and 70 medals. This page has the roll of honour of British medallists - and a tracker comparing the total to Tokyo, where Britain finished fourth in the standings as they won 22 golds.",
        "Mountain bikingHow he did it: It looked as though Pidcock would not be able to retain the Olympic title he first won in Tokyo when he suffered a puncture on lap three. He recovered in remarkable style, catching the leaders and overtaking France's Victor Koretzky late in the race for victory.",
        "Equestrian - team eventingHow they did it: Great Britain retained the team eventing title they won in Tokyo to win Team GB's first gold medal at Paris 2024. Collett, McEwen and Canter ended the three-day competition with 91.30 penalties to finish a commanding 12.3 clear of host nation France, while Japan took bronze.",
        "Shooting - men's trap finalHow he did it: Who knew we would all be invested in shooting on a Tuesday afternoon in July? Hales was the reason for that as he won gold for Team GB, setting a new Olympic record of 48 (out of 50) in the process. It comes just a year after he set a new world record of 49 out of 50.",
        "Swimming - men's 4x200m freestyle relay finalHow they did it: Just as they did in Tokyo, GB's 4x200m freestyle swimming team struck gold with a dominant display in the pool. Richards, Guy, Dean and Scott reunited to triumph ahead of the USA in second and Australia in third.",
        "Rowing - women's quadruple scullsHow they did it: The GB quartet were behind for most of the race, then pulled through for a dramatic photo finish with the Netherlands. They edged ahead when it counted most to claim gold just 15 minutes after Yee's triathlon victory.",
        "Men's triathlonHow he did it: Yee's sensational sprint finish provided a thrilling end to the men's triathlon as he reeled in New Zealand's Hayden Wilde in the closing stages of the final-leg run. Yee finished in one hour 43 minutes 33 seconds, just six seconds ahead of Wilde.",
        "Rowing - women's double scullsHow they did it: After missing the podium by just 0.1 seconds in Tokyo three years ago, Grant and Craig are now Olympic champions. In a dominant performance, they took the lead at the 500m mark of the 2,000m race and pulled away to win by almost a length from Romania and Greece.",
        "Gymnastics - trampolineHow she did it: Page took Great Britain's first trampoline Olympic gold to complete her set of a medal of every colour, after silver at Rio 2016 and bronze at Tokyo 2020. She secured the ultimate prize in Paris with 56.480 points and looked in disbelief when her score beat Viyaleta Bardzilouskaya, who took silver, with Canada's Sophiane Methot in bronze.",
        "Equestrian - team jumpingHow they did it: The British trio of Maher, Charles and Brash picked up just two time penalties to top the standings at the stunning Chateau de Versailles, with the United States second.",
        "Rowing - men's eightHow they did it: GB's men's eight topped the podium in a thrilling race, trading the lead with the Netherlands before surging ahead at the halfway stage and winning by 1.08 seconds.",
        "Cycling - women's team sprintHow they did it: In some style. The trio of Finucane, Capewell and Marchant set a new world record every time they took to the track on Monday, managing the feat twice in qualifying before blowing New Zealand away in the final.",
        "Athletics - women's 800mHow she did it: Having finished second at successive World Championships after claiming a stunning silver on her Olympic debut as a teenager in Tokyo three years ago, this was Hodgkinson's golden moment. The 22-year-old produced a dominant performance to beat Ethiopia's Tsige Duguma to victory.",
        "Sailing - women's kiteHow she did it: The 27-year-old became the inaugural Olympic kitesurfing champion by winning two races in the final series on Thursday.Three victories are needed in the final series for an athlete to finish first, but Aldridge carried one over from the semi-finals.",
        "Sport climbing - Men's boulder and leadHow he did it: The 19-year-old had his head in his hands, unable to believe his win, when Japanese world silver medallist and favourite Sorato Anraku slipped on his ascent up the 15-metre wall to give the Englishman victory.",
        "Cycling - women's time trialHow she did it: Grace Brown took the lead from Henderson as the Australian finished more than a minute and a half quicker. But the final rider, the United States' world champion Chloe Dygert, was unable to better Henderson's time so the Briton claimed silver by less than one second.",
        "Swimming - men's 100m breaststrokeHow he did it: A tearful Peaty had to settle for Olympic silver as Italy's Nicolo Martinenghi snatched a shock gold by 0.02 seconds. Silver still caps a remarkable turnaround for Peaty, who had taken a break from the sport after issues with alcoholism and his mental health since his last gold in Tokyo.",
        "Diving - men's synchronised 10m platformHow they did it: Daley won his fifth Olympic medal and Williams his first as they finished second behind China's Lian Junjie and Yang Hao. Daley, 30, effectively retired from diving after winning synchronised 10m platform gold at the Tokyo Games, but was persuaded to return to the sport by his son Robbie.",
        "Canoe slalom singlesHow he did it: The 32-year-old qualified fourth fastest with a clean semi-final performance and produced another impressive run in the final to win his first Olympic medal, having missed out on the podium by 0.16 seconds in Tokyo.",
        "Swimming - men's 200m freestyleHow he did it: Richards missed out on a stunning Olympic gold by two hundredths of a second but took a thrilling silver behind David Popovici of Romania.",
        "Men's BMX freestyleHow he did it: Reilly was the final rider to go and trailed Argentina's Jose Torres Gil and France's Anthony Jeanjean before his second run. The 23-year-old put in a superb run to surpass Jeanjean and claim silver.",
        "Rowing - women's fourHow they did it: An agonisingly close race, the boat of mother-of-three Helen Glover, Esme Booth, Sam Redgrave and Rebecca Shorten was neck and neck with the Netherlands for the final 500m of the 2,000m race, eventually edged out on the line by 0.18 seconds. Glover claimed her third Olympic medal aged 38, having retired from rowing twice previously.",
        "Rowing - men's pairHow they did it: Wynne-Griffith, from Wales, and George, of England, led for the majority of the race and looked set for gold but were unable to hold off the dynamic charge of Croatia's Sinkovic brothers, who went ahead in the closing 20m and won by just 0.45 seconds.",
        "Swimming - men's 50m freestyleHow he did it: In the shortest swimming event of the Games, Ben Proud came within a fingernail of taking gold in a thrilling final, finishing just behind Australia's Cameron McEvoy.",
        "Swimming - Men's 200m individual medleyHow he did it: France's Leon Marchand won a sensational fourth Olympic gold in the Paris pool, beating Duncan Scott into second place.With French President Emmanuel Macron in the crowd, home superstar Marchand led from the start of the 200m medley to cap a sensational week for the 22-year-old.Scott, 27, was second behind the Frenchman - just as he was at last year's World Championships - and took silver for the sixth time in his career, and an eighth Olympic medal overall.",
        "Shooting - women's skeetHow she did it: Great Britain's Amber Rutter had to settle for silver in a dramatic and controversial final of the women's skeet shooting.The 26-year-old finished in a tie of 55 shots out of 60 targets with Chile's Francisca Crovetto Chadid.They went to a shoot-off and were still tied after three rounds but, in a moment of contention, Rutter was called to have missed a shot which slow motion replays appeared to show she hit.The call stood and Crovetto Chadid, 34, took both her next shots to make history and clinch her country's first ever shooting gold medal.",
        "Men's golfHow he did it: Great Britain's Tommy Fleetwood had to settle for Olympic silver in the men’s golf after falling agonisingly short of American world number one Scottie Scheffler in an enthralling finale.On an exciting final day in Paris, Fleetwood was tied with Scheffler on 19 under walking on to the 17th hole.But a bogey after missing the green and over-hitting a chip left him trailing Scheffler going down the last.The 33-year-old Englishman also overhit an approach on the 18th as he attacked, settling for a par which secured the silver medal.",
        "Men's kayak crossHow he did it: Joe Clarke was aiming for Olympic redemption after being overlooked for the Tokyo 2020 team and stormed through to make the final in Paris.But the 31-year-old started slower than his previous races and was unable to make up the gap on New Zealand's Finn Butcher.",
        "Cycling - men's team sprintHow they did it: After beating Germany to qualify for the final, they came up against a supreme Netherlands trio in the gold medal race - and had to settle for second place, as the Dutch set a new world record.",
        "Athletics - men's 1500mHow he did it: All eyes were on Kerr and rival Jakob Ingebrigtsen before the race, but it was the USA's Cole Hocker who stunned the field to take gold, leaving the British runner with silver and Norway's Ingebrigtsen outside of the medal positions altogether.",
        "Cycling - men's team pursuitHow they did it: GB were pipped to gold by Australia in a dramatic final as, with less than 200m to go, Hayter came out of his saddle and almost lost control of his bike while leading GB around the final lap.",
        "Athletics - men's 400mHow he did it: Hudson-Smith was bidding to become the first British man in 100 years to win 400m Olympic gold, but the USA's Quincy Hall produced a sensational finish to pip him to victory.",
        "Track cycling - women's madisonHow they did it: A huge push on the final sprint gave them a total of 31 points, six points behind champions Italy who gained a lap.GB were the only team on the podium to not take a 20-point lap, with bronze medallists the Netherlands being the first to make the catch.Barker won the final sprint, which awards double points, to catapult her and Evans up a step from bronze medal position.",
        "Athletics - women's 4x100m relayHow they did it: What a race! Team GB led at the halfway point and pushed Team USA all the way, but Daryll Neita could not quite overhaul Sha'Carri Richardson on the anchor leg.",
        "Athletics - heptathlonHow she did it: Johnson-Thompson needed to beat Nafi Thiam by 8.5 seconds in the 800m to snatch gold from the Belgian and despite a personal best, had to settle for silver.",
        "Artistic swimming - duetHow they did it: Shortman and Thorpe created history by winning Great Britain's first ever Olympic medal in artistic swimming, a superb free routine scoring 294.5085 for a combined total of 558.5367.The British pair, who are two-time World Championship medallists, had been fourth after Friday's Big Ben-themed technical routine before delivering a high-energy free routine.",
        "Taekwondo - men's +80kgHow he did it: Cunningham was hoping to become the first British man to win Olympic gold in taekwondo, but lost his final to Iran's Arian Salimi.Cunningham's silver meant Great Britain have won at least one taekwondo medal in five successive Olympic Games.",
        "Diving - women's synchronised 3m springboardHow they did it: The British pair moved from fourth to third with an excellent final dive. A horrible mistake on Australia's final dive meant they failed to overhaul Harper and Mew Jensen, who claimed GB's first opening day medal since 2004.",
        "Canoe slalom - women's kayakHow she did it: In a dramatic final, Woods was holding on to third place in the standings with only reigning Olympic champion Ricarda Funk to run. But when Germany's Funk clipped a gate and picked up a 50-second penalty, the bronze was secured for 28-year-old Woods and Team GB.",
        "Equestrian - individual eventingHow she did it: Collett followed up her team eventing gold with an individual eventing bronze later the same day after a penalty-free jumping round.",
        "Women's triathlonHow she did it: After uncertainty over whether the race would go ahead because of poor water quality in the river Seine, Potter held on to third place for her first Olympic medal. France's Cassandre Beaugrand took gold to the delight of the home crowd, with Switzerland's Julie Derron winning silver.",
        "Diving - women's synchronised 10m platformHow they did it: Spendolini-Sirieix and Toulson's superb final dive lifted them up from fourth to the medal places. They scored 304.38 points from their five dives, finishing behind China and North Korea.",
        "Rowing - men's fourHow they did it: The men's four of Oli Wilkes, David Ambler, Matt Aldridge and Freddie Davidson - all Olympic debutants - started slowly but fought back hard to go past Italy and take the bronze, with the USA claiming gold.",
        "Rowing - women's double scullsHow they did it: Britain's Mathilda Hodgkins-Byrne and Becky Wilde secured an emotional bronze, making a strong start before being overtaken by eventual champions New Zealand and silver medallists Romania, but digging deep to hold off the Netherlands.",
        "Diving - men's synchronised 3m springboardHow they did it: Laugher and Harding only began working together in 2021 but have won European, Commonwealth, world and now Olympic medals. Having saved their most difficult two dives until the final rounds to keep themselves in contention, the pair celebrated wildly after finishing behind China and Mexico.",
        "Rowing - women's eightHow they did it: This bronze is only Britain's second in the women's eights after their silver at the Rio Olympics in 2016. The team, coxed by Henry Fieldman, battled all the way to the line to finish behind champions Romania.",
        "Sailing - women's IQFoil windsurfingHow she did it: Wilson, who won bronze at the Tokyo 2020 Games, was guaranteed a windsurfing medal after dominating the opening series in Marseille, but had to settle for bronze in the final as Italy's Marta Maggetti won gold and Israel's Sharon Kantor took silver.",
        "Equestrian - team dressageHow they did it: Great Britain's dressage riders won team bronze in Paris as seven-time Olympian Carl Hester, Lottie Fry and Becky Moody scored a combined 232.492% to place behind gold medallists Germany and Denmark in silver on the podium at Chateau de Versailles.",
        "Gymnastics - men's floorHow he did it: Jake Jarman took bronze in the men's floor final to win the nation's first artistic gymnastics medal of the Paris Olympics.Five days after helping GB to an agonising fourth-place finish in the team event, Jarman made sure he would be going home with a medal on his Olympic debut with a routine that scored 14.933.",
        "Athletics - 4x400m mixed relayHow they did it: Great Britain clinched Olympic mixed 4x400m relay bronze as Femke Bol anchored the Netherlands to a sensational gold.Amber Anning held on to third position as the British team finished in a national record time of three minutes 08.01 seconds at the Stade de France.",
        "Equestrian - individual dressageHow she did it: Fry, on stallion Glamourdale, scored 88.971% as Germany's Jessica von Bredow-Werndl successfully defended her Olympic title. The podium marks a third Olympic medal for Fry, who made her debut in Tokyo and won team bronze in Paris the day before.",
        "Gymnastics - men's vaultHow he did it: Harry Hepworth became the first British man to win an Olympic vault medal with bronze in a high-quality final in Paris.",
        "Triathlon - mixed team relayHow they did it: In a captivating race around Paris, the GB team dominated right up until the final leg, in which Beth Potter was overtaken during the cycling. Potter did briefly retake the lead but a dramatic photo finish initially resulted in GB announced as silver medallists, before being downgraded to bronze.",
        "Women's kayak crossHow she did it: Reigning world champion Woods, 28, started the final strongly but had difficulty at the final gate and lost momentum.While Woods came over the line fourth, she nicked a bronze after Germany's Elena Lilik was disqualified for a fault earlier in the race.",
        "Skateboarding - women's parkHow she did it: Three years on from winning Olympic bronze aged only 13, Brown again finished third in the women's park final - an achievement made all the more remarkable having dislocated her shoulder just days before travelling to Paris for the Games.",
        "Boxing - men's 71kgHow he did it: Richardson impressed in reaching the semi-finals but had to settle for bronze after losing to Mexico's Marco Alonso Verde Alvarez, the second seed, 3-2 on a split decision.",
        "Cycling - women's team pursuitHow they did it: Up against Italy in the bronze-medal race, GB trailed by 1.2 seconds and looked like they had it all to do at one point - but they managed to reel their opponents in to secure a spot on the podium.",
        "Cycling - women's keirinHow she did it: Britain's Emma Finucane got bronze in the women's keirin final.Ellesse Andrews of New Zealand led through most of the race and took the gold, with Hetty van de Wouw of the Netherlands pipping Finucane to silver.Britain's Katy Marchant came fourth and just missed out on a medal.",
        "Athletics - men's 4x100m relayHow they did it: Zharnel Hughes starred for the men on the anchor leg, running a superb final few metres to secure a medal for the quartet of Hughes, Jeremiah Azu, Louie Hinchliffe and Nethaneel Mitchell-Blake.Canada took victory in a season's best 37.50, with South Africa second in 37.57 and Britain third with 37.61.",
        "Track cycling - men's individual sprintHow he did it: Carlin missed out on the chance to race for gold when he lost to eventual champion Harrie Lavreysen in the semi-finals, but beat his Dutch compatriot Jeffrey Hoogland over three races for bronze.It was not without controversy, though, with the race restarted after Carlin mistakenly caused a collision he thought had ruined his chances.",
        "Diving - men's 10m platformHow he did it: Having won 10m synchro silver earlier in the Games, Williams secured his second medal of Paris 2024 with a stunning final-round dive.Williams only just qualified for the final - taking the last of the 12 available spots in the semi-final - then capitalised after errors by his rivals opened up the medal positions.He delivered a forward four-and-a-half somersaults that scored 94.35 to give him a total of 497.35.",
        "Athletics - women's 1500mHow she did it: In an incredibly fast final, Bell and fellow British athlete Laura Muir were in medal contention on the home straight.Muir eventually finished fifth, while Bell ran a new British record time of three minutes 52.61 seconds to finish third behind Kenya's Faith Kipyegon and Jessica Hull of Australia.",
        "Athletics - men's 4x400m relayHow they did it: The British quartet set a new European record to finish third behind the United States and Botswana, who took gold and silver respectively.Hudson-Smith added relay bronze to the silver he won in the individual event earlier in the Games.",
        "Athletics - women's 4x400m relayHow they did it: Shortly after Great Britain's men won bronze in their 4x400m relay, the team of Ohuruogu, Nielsen, Yeargin and Anning matched that achievement in the women's event.The United States were dominant winners, with the British quartet narrowly missing out on silver to the Netherlands.",
        "Cycling - women's sprintHow she did it: History for Emma Finucane, as she became the first British woman since athlete Mary Rand in 1964 to win three medals at a single Olympics. Finucane, 21, rounded off her first Games by beating Hetty van de Wouw of the Netherlands comfortably over two legs in the bronze medal final to add an Olympic medal to her World Championship title in the event.And it followed her bronze in the keirin and a team sprint gold at Paris 2024.Ellesse Andrews of New Zealand, who had defeated Finucane in the semi-finals, won sprint gold, beating Germany's Lea Friedrich.",
        "Weightlifting - women's +81kg finalHow she did it: Britain's only weightlifter in Paris added to the silver she took home from Tokyo 2020 with her country's final medal of 2024.The 30-year-old finished with a total of 288kg, lifting 126kg in the snatch and 162kg in the clean and jerk - and celebrated with a cartwheel across the stage.China's Li Wenwen, who took gold, and Park Hye-jeong of South Korea the silver.It is only the ninth Olympic weightlifting medal GB have won, with Campbell the only woman to have finished on the podium.",
        "This video can not be played",
        "Olympics 2024: Every Team GB Olympic medal in Paris",
        "Team GB won 65 medals at Paris 2024 - beating the 64 they earned at Tokyo 2020, and within the target range set before these Games by UK Sport, which expected between 50 and 70 medals.",
        "This page has the roll of honour of British medallists - and a tracker comparing the total to Tokyo, where Britain finished fourth in the standings as they won 22 golds.",
        "How he did it: It looked as though Pidcock would not be able to retain the Olympic title he first won in Tokyo when he suffered a puncture on lap three. He recovered in remarkable style, catching the leaders and overtaking France's Victor Koretzky late in the race for victory.",
        "This video can not be played",
        "Team GB Tom Pidcock secures gold medal in men's mountain bike final",
        "Equestrian - team eventing",
        "How they did it: Great Britain retained the team eventing title they won in Tokyo to win Team GB's first gold medal at Paris 2024. Collett, McEwen and Canter ended the three-day competition with 91.30 penalties to finish a commanding 12.3 clear of host nation France, while Japan took bronze.",
        "This video can not be played",
        "Eventing team win GB's first Gold in Paris Games",
        "Shooting - men's trap final",
        "How he did it: Who knew we would all be invested in shooting on a Tuesday afternoon in July? Hales was the reason for that as he won gold for Team GB, setting a new Olympic record of 48 (out of 50) in the process. It comes just a year after he set a new world record of 49 out of 50.",
        "This video can not be played",
        "GB's Nathan Hales wins gold in men's trap",
        "Swimming - men's 4x200m freestyle relay final",
        "How they did it: Just as they did in Tokyo, GB's 4x200m freestyle swimming team struck gold with a dominant display in the pool. Richards, Guy, Dean and Scott reunited to triumph ahead of the USA in second and Australia in third.",
        "This video can not be played",
        "'Absolutely brilliant!' - Team GB retain men's 4x200m freestyle relay gold medal",
        "Rowing - women's quadruple sculls",
        "How they did it: The GB quartet were behind for most of the race, then pulled through for a dramatic photo finish with the Netherlands. They edged ahead when it counted most to claim gold just 15 minutes after Yee's triathlon victory.",
        "This video can not be played",
        "Team GB come back to win gold in the women's quad sculls",
        "How he did it: Yee's sensational sprint finish provided a thrilling end to the men's triathlon as he reeled in New Zealand's Hayden Wilde in the closing stages of the final-leg run. Yee finished in one hour 43 minutes 33 seconds, just six seconds ahead of Wilde.",
        "This video can not be played",
        "GB's Yee wins gold in the men's triathlon",
        "Rowing - women's double sculls",
        "How they did it: After missing the podium by just 0.1 seconds in Tokyo three years ago, Grant and Craig are now Olympic champions. In a dominant performance, they took the lead at the 500m mark of the 2,000m race and pulled away to win by almost a length from Romania and Greece.",
        "This video can not be played",
        "Brilliant rowing gold for GB's Craig and Grant",
        "Gymnastics - trampoline",
        "How she did it: Page took Great Britain's first trampoline Olympic gold to complete her set of a medal of every colour, after silver at Rio 2016 and bronze at Tokyo 2020. She secured the ultimate prize in Paris with 56.480 points and looked in disbelief when her score beat Viyaleta Bardzilouskaya, who took silver, with Canada's Sophiane Methot in bronze.",
        "This video can not be played",
        "Page wins trampoline gold medal",
        "Equestrian - team jumping",
        "How they did it: The British trio of Maher, Charles and Brash picked up just two time penalties to top the standings at the stunning Chateau de Versailles, with the United States second.",
        "This video can not be played",
        "Brash secures team jumping gold for Team GB",
        "How they did it: GB's men's eight topped the podium in a thrilling race, trading the lead with the Netherlands before surging ahead at the halfway stage and winning by 1.08 seconds.",
        "This video can not be played",
        "Team GB hold on secure gold in the Men's eight final",
        "Cycling - women's team sprint",
        "How they did it: In some style. The trio of Finucane, Capewell and Marchant set a new world record every time they took to the track on Monday, managing the feat twice in qualifying before blowing New Zealand away in the final.",
        "This video can not be played",
        "Gold Medal and world record for Great Britain in women's team sprint",
        "Athletics - women's 800m",
        "How she did it: Having finished second at successive World Championships after claiming a stunning silver on her Olympic debut as a teenager in Tokyo three years ago, this was Hodgkinson's golden moment. The 22-year-old produced a dominant performance to beat Ethiopia's Tsige Duguma to victory.",
        "This video can not be played",
        "Hodgkinson wins gold in women's 800m",
        "Sailing - women's kite",
        "How she did it: The 27-year-old became the inaugural Olympic kitesurfing champion by winning two races in the final series on Thursday.",
        "Three victories are needed in the final series for an athlete to finish first, but Aldridge carried one over from the semi-finals.",
        "This video can not be played",
        "Aldridge wins women's kite gold for GB",
        "Sport climbing - Men's boulder and lead",
        "How he did it: The 19-year-old had his head in his hands, unable to believe his win, when Japanese world silver medallist and favourite Sorato Anraku slipped on his ascent up the 15-metre wall to give the Englishman victory.",
        "This video can not be played",
        "Roberts wins shock climbing gold medal for Team GB",
        "Cycling - women's time trial",
        "How she did it: Grace Brown took the lead from Henderson as the Australian finished more than a minute and a half quicker. But the final rider, the United States' world champion Chloe Dygert, was unable to better Henderson's time so the Briton claimed silver by less than one second.",
        "This video can not be played",
        "Henderson won silver medal",
        "Swimming - men's 100m breaststroke",
        "How he did it: A tearful Peaty had to settle for Olympic silver as Italy's Nicolo Martinenghi snatched a shock gold by 0.02 seconds. Silver still caps a remarkable turnaround for Peaty, who had taken a break from the sport after issues with alcoholism and his mental health since his last gold in Tokyo.",
        "This video can not be played",
        "GB's Adam Peaty narrowly misses out on 100m breaststroke gold",
        "Diving - men's synchronised 10m platform",
        "How they did it: Daley won his fifth Olympic medal and Williams his first as they finished second behind China's Lian Junjie and Yang Hao. Daley, 30, effectively retired from diving after winning synchronised 10m platform gold at the Tokyo Games, but was persuaded to return to the sport by his son Robbie.",
        "This video can not be played",
        "Daley and Williams seal silver",
        "How he did it: The 32-year-old qualified fourth fastest with a clean semi-final performance and produced another impressive run in the final to win his first Olympic medal, having missed out on the podium by 0.16 seconds in Tokyo.",
        "This video can not be played",
        "GB's Adam Burgess wins silver in men's canoe slalom",
        "Swimming - men's 200m freestyle",
        "How he did it: Richards missed out on a stunning Olympic gold by two hundredths of a second but took a thrilling silver behind David Popovici of Romania.",
        "This video can not be played",
        "GB's Matt Richards wins silver in men's 200m freestyle final",
        "How he did it: Reilly was the final rider to go and trailed Argentina's Jose Torres Gil and France's Anthony Jeanjean before his second run. The 23-year-old put in a superb run to surpass Jeanjean and claim silver.",
        "This video can not be played",
        "Reilly's 'super technical' final run secures BMX silver medal",
        "Rowing - women's four",
        "How they did it: An agonisingly close race, the boat of mother-of-three Helen Glover, Esme Booth, Sam Redgrave and Rebecca Shorten was neck and neck with the Netherlands for the final 500m of the 2,000m race, eventually edged out on the line by 0.18 seconds. Glover claimed her third Olympic medal aged 38, having retired from rowing twice previously.",
        "This video can not be played",
        "Glover and women's four pipped to Olympic gold",
        "How they did it: Wynne-Griffith, from Wales, and George, of England, led for the majority of the race and looked set for gold but were unable to hold off the dynamic charge of Croatia's Sinkovic brothers, who went ahead in the closing 20m and won by just 0.45 seconds.",
        "This video can not be played",
        "Croatia comeback edges Team GB's George and Wynne-Griffith into silver",
        "Swimming - men's 50m freestyle",
        "How he did it: In the shortest swimming event of the Games, Ben Proud came within a fingernail of taking gold in a thrilling final, finishing just behind Australia's Cameron McEvoy.",
        "This video can not be played",
        "'Brilliant!' GB's Ben Proud wins men's 50m freestyle silver",
        "Swimming - Men's 200m individual medley",
        "How he did it: France's Leon Marchand won a sensational fourth Olympic gold in the Paris pool, beating Duncan Scott into second place.",
        "With French President Emmanuel Macron in the crowd, home superstar Marchand led from the start of the 200m medley to cap a sensational week for the 22-year-old.",
        "Scott, 27, was second behind the Frenchman - just as he was at last year's World Championships - and took silver for the sixth time in his career, and an eighth Olympic medal overall.",
        "This video can not be played",
        "GB's Duncan Scott wins men's 200m individual medley silver",
        "Shooting - women's skeet",
        "How she did it: Great Britain's Amber Rutter had to settle for silver in a dramatic and controversial final of the women's skeet shooting.",
        "The 26-year-old finished in a tie of 55 shots out of 60 targets with Chile's Francisca Crovetto Chadid.",
        "They went to a shoot-off and were still tied after three rounds but, in a moment of contention, Rutter was called to have missed a shot which slow motion replays appeared to show she hit.",
        "The call stood and Crovetto Chadid, 34, took both her next shots to make history and clinch her country's first ever shooting gold medal.",
        "This video can not be played",
        "GB's Rutter wins skeet silver medal after tense shoot-off loss to Chile's Chadid",
        "How he did it: Great Britain's Tommy Fleetwood had to settle for Olympic silver in the men’s golf after falling agonisingly short of American world number one Scottie Scheffler in an enthralling finale.",
        "On an exciting final day in Paris, Fleetwood was tied with Scheffler on 19 under walking on to the 17th hole.",
        "But a bogey after missing the green and over-hitting a chip left him trailing Scheffler going down the last.",
        "The 33-year-old Englishman also overhit an approach on the 18th as he attacked, settling for a par which secured the silver medal.",
        "How he did it: Joe Clarke was aiming for Olympic redemption after being overlooked for the Tokyo 2020 team and stormed through to make the final in Paris.",
        "But the 31-year-old started slower than his previous races and was unable to make up the gap on New Zealand's Finn Butcher.",
        "Cycling - men's team sprint",
        "How they did it: After beating Germany to qualify for the final, they came up against a supreme Netherlands trio in the gold medal race - and had to settle for second place, as the Dutch set a new world record.",
        "This video can not be played",
        "GB take silver in the men's team sprint",
        "Athletics - men's 1500m",
        "How he did it: All eyes were on Kerr and rival Jakob Ingebrigtsen before the race, but it was the USA's Cole Hocker who stunned the field to take gold, leaving the British runner with silver and Norway's Ingebrigtsen outside of the medal positions altogether.",
        "This video can not be played",
        "Kerr 'did his best' and secures silver in 1500m final",
        "Cycling - men's team pursuit",
        "How they did it: GB were pipped to gold by Australia in a dramatic final as, with less than 200m to go, Hayter came out of his saddle and almost lost control of his bike while leading GB around the final lap.",
        "This video can not be played",
        "Team GB miss out on gold medal in men's team pursuit final against Australia",
        "Athletics - men's 400m",
        "How he did it: Hudson-Smith was bidding to become the first British man in 100 years to win 400m Olympic gold, but the USA's Quincy Hall produced a sensational finish to pip him to victory.",
        "This video can not be played",
        "Hudson-Smith secures silver medal in men's 400m final",
        "Track cycling - women's madison",
        "How they did it: A huge push on the final sprint gave them a total of 31 points, six points behind champions Italy who gained a lap.",
        "GB were the only team on the podium to not take a 20-point lap, with bronze medallists the Netherlands being the first to make the catch.",
        "Barker won the final sprint, which awards double points, to catapult her and Evans up a step from bronze medal position.",
        "This video can not be played",
        "GB's Elinor Barker and Neah Evans claim silver in the women's madison",
        "Athletics - women's 4x100m relay",
        "How they did it: What a race! Team GB led at the halfway point and pushed Team USA all the way, but Daryll Neita could not quite overhaul Sha'Carri Richardson on the anchor leg.",
        "This video can not be played",
        "GB take silver in women's 4x100m relay final",
        "Athletics - heptathlon",
        "How she did it: Johnson-Thompson needed to beat Nafi Thiam by 8.5 seconds in the 800m to snatch gold from the Belgian and despite a personal best, had to settle for silver.",
        "This video can not be played",
        "Johnson-Thompson runs PB in heptathlon 800m",
        "Artistic swimming - duet",
        "How they did it: Shortman and Thorpe created history by winning Great Britain's first ever Olympic medal in artistic swimming, a superb free routine scoring 294.5085 for a combined total of 558.5367.",
        "The British pair, who are two-time World Championship medallists, had been fourth after Friday's Big Ben-themed technical routine before delivering a high-energy free routine.",
        "This video can not be played",
        "GB's Shortman and Thorpe win historic silver in artistic swimming",
        "Taekwondo - men's +80kg",
        "How he did it: Cunningham was hoping to become the first British man to win Olympic gold in taekwondo, but lost his final to Iran's Arian Salimi.",
        "Cunningham's silver meant Great Britain have won at least one taekwondo medal in five successive Olympic Games.",
        "This video can not be played",
        "GB's Caden Cunningham wins silver after losing men's +80kg category final",
        "Diving - women's synchronised 3m springboard",
        "How they did it: The British pair moved from fourth to third with an excellent final dive. A horrible mistake on Australia's final dive meant they failed to overhaul Harper and Mew Jensen, who claimed GB's first opening day medal since 2004.",
        "This video can not be played",
        "Harper and Mew Jensen claim bronze medal",
        "Canoe slalom - women's kayak",
        "How she did it: In a dramatic final, Woods was holding on to third place in the standings with only reigning Olympic champion Ricarda Funk to run. But when Germany's Funk clipped a gate and picked up a 50-second penalty, the bronze was secured for 28-year-old Woods and Team GB.",
        "This video can not be played",
        "Kimberley Woods takes kayak bronze",
        "Equestrian - individual eventing",
        "How she did it: Collett followed up her team eventing gold with an individual eventing bronze later the same day after a penalty-free jumping round.",
        "This video can not be played",
        "Collett guarantees herself a bronze 'a beautiful performance'.",
        "How she did it: After uncertainty over whether the race would go ahead because of poor water quality in the river Seine, Potter held on to third place for her first Olympic medal. France's Cassandre Beaugrand took gold to the delight of the home crowd, with Switzerland's Julie Derron winning silver.",
        "This video can not be played",
        "Paris 2024 Olympics: GB's Beth Potter wins triathlon bronze",
        "Diving - women's synchronised 10m platform",
        "How they did it: Spendolini-Sirieix and Toulson's superb final dive lifted them up from fourth to the medal places. They scored 304.38 points from their five dives, finishing behind China and North Korea.",
        "This video can not be played",
        "Toulson and Spendolini-Sirieix's brilliant final dive",
        "How they did it: The men's four of Oli Wilkes, David Ambler, Matt Aldridge and Freddie Davidson - all Olympic debutants - started slowly but fought back hard to go past Italy and take the bronze, with the USA claiming gold.",
        "This video can not be played",
        "Bronze for Great Britain's men's four",
        "Rowing - women's double sculls",
        "How they did it: Britain's Mathilda Hodgkins-Byrne and Becky Wilde secured an emotional bronze, making a strong start before being overtaken by eventual champions New Zealand and silver medallists Romania, but digging deep to hold off the Netherlands.",
        "This video can not be played",
        "Hodgkins-Byrne and Wilde win double sculls bronze",
        "Diving - men's synchronised 3m springboard",
        "How they did it: Laugher and Harding only began working together in 2021 but have won European, Commonwealth, world and now Olympic medals. Having saved their most difficult two dives until the final rounds to keep themselves in contention, the pair celebrated wildly after finishing behind China and Mexico.",
        "This video can not be played",
        "Laugher and Harding win 3m synchro diving bronze",
        "Rowing - women's eight",
        "How they did it: This bronze is only Britain's second in the women's eights after their silver at the Rio Olympics in 2016. The team, coxed by Henry Fieldman, battled all the way to the line to finish behind champions Romania.",
        "This video can not be played",
        "Paris 2024 Olympics: GB win bronze in women's eight final",
        "Sailing - women's IQFoil windsurfing",
        "How she did it: Wilson, who won bronze at the Tokyo 2020 Games, was guaranteed a windsurfing medal after dominating the opening series in Marseille, but had to settle for bronze in the final as Italy's Marta Maggetti won gold and Israel's Sharon Kantor took silver.",
        "This video can not be played",
        "GB's Emma Wilson secures bronze medal in women's windsurfing final",
        "Equestrian - team dressage",
        "How they did it: Great Britain's dressage riders won team bronze in Paris as seven-time Olympian Carl Hester, Lottie Fry and Becky Moody scored a combined 232.492% to place behind gold medallists Germany and Denmark in silver on the podium at Chateau de Versailles.",
        "This video can not be played",
        "GB's Carl Hester, Lottie Fry & Becky Moody take bronze in the dressage team event",
        "Gymnastics - men's floor",
        "How he did it: Jake Jarman took bronze in the men's floor final to win the nation's first artistic gymnastics medal of the Paris Olympics.",
        "Five days after helping GB to an agonising fourth-place finish in the team event, Jarman made sure he would be going home with a medal on his Olympic debut with a routine that scored 14.933.",
        "This video can not be played",
        "Watch GB's Jake Jarman's 'great' routine in Men's floor final as he wins bronze",
        "Athletics - 4x400m mixed relay",
        "How they did it: Great Britain clinched Olympic mixed 4x400m relay bronze as Femke Bol anchored the Netherlands to a sensational gold.",
        "Amber Anning held on to third position as the British team finished in a national record time of three minutes 08.01 seconds at the Stade de France.",
        "This video can not be played",
        "Netherlands make a late charge to snatch gold from USA",
        "Equestrian - individual dressage",
        "How she did it: Fry, on stallion Glamourdale, scored 88.971% as Germany's Jessica von Bredow-Werndl successfully defended her Olympic title. The podium marks a third Olympic medal for Fry, who made her debut in Tokyo and won team bronze in Paris the day before.",
        "This video can not be played",
        "GB's Lottie Fry wins bronze in the Equestrian individual dressage final",
        "Gymnastics - men's vault",
        "How he did it: Harry Hepworth became the first British man to win an Olympic vault medal with bronze in a high-quality final in Paris.",
        "Triathlon - mixed team relay",
        "How they did it: In a captivating race around Paris, the GB team dominated right up until the final leg, in which Beth Potter was overtaken during the cycling. Potter did briefly retake the lead but a dramatic photo finish initially resulted in GB announced as silver medallists, before being downgraded to bronze.",
        "This video can not be played",
        "Team GB seal bronze in triathlon mixed team relay",
        "How she did it: Reigning world champion Woods, 28, started the final strongly but had difficulty at the final gate and lost momentum.",
        "While Woods came over the line fourth, she nicked a bronze after Germany's Elena Lilik was disqualified for a fault earlier in the race.",
        "Skateboarding - women's park",
        "How she did it: Three years on from winning Olympic bronze aged only 13, Brown again finished third in the women's park final - an achievement made all the more remarkable having dislocated her shoulder just days before travelling to Paris for the Games.",
        "This video can not be played",
        "Sky Brown's third run wins bronze in skateboarding",
        "How he did it: Richardson impressed in reaching the semi-finals but had to settle for bronze after losing to Mexico's Marco Alonso Verde Alvarez, the second seed, 3-2 on a split decision.",
        "Cycling - women's team pursuit",
        "How they did it: Up against Italy in the bronze-medal race, GB trailed by 1.2 seconds and looked like they had it all to do at one point - but they managed to reel their opponents in to secure a spot on the podium.",
        "This video can not be played",
        "Team GB win bronze medal in women's team pursuit",
        "Cycling - women's keirin",
        "How she did it: Britain's Emma Finucane got bronze in the women's keirin final.",
        "Ellesse Andrews of New Zealand led through most of the race and took the gold, with Hetty van de Wouw of the Netherlands pipping Finucane to silver.",
        "Britain's Katy Marchant came fourth and just missed out on a medal.",
        "This video can not be played",
        "GB's Finucane wins bronze",
        "Athletics - men's 4x100m relay",
        "How they did it: Zharnel Hughes starred for the men on the anchor leg, running a superb final few metres to secure a medal for the quartet of Hughes, Jeremiah Azu, Louie Hinchliffe and Nethaneel Mitchell-Blake.",
        "Canada took victory in a season's best 37.50, with South Africa second in 37.57 and Britain third with 37.61.",
        "This video can not be played",
        "Canada win gold in men's 4x100m relay as GB take bronze",
        "Track cycling - men's individual sprint",
        "How he did it: Carlin missed out on the chance to race for gold when he lost to eventual champion Harrie Lavreysen in the semi-finals, but beat his Dutch compatriot Jeffrey Hoogland over three races for bronze.",
        "It was not without controversy, though, with the race restarted after Carlin mistakenly caused a collision he thought had ruined his chances.",
        "This video can not be played",
        "Carlin gets bronze in men's sprint",
        "Diving - men's 10m platform",
        "How he did it: Having won 10m synchro silver earlier in the Games, Williams secured his second medal of Paris 2024 with a stunning final-round dive.",
        "Williams only just qualified for the final - taking the last of the 12 available spots in the semi-final - then capitalised after errors by his rivals opened up the medal positions.",
        "He delivered a forward four-and-a-half somersaults that scored 94.35 to give him a total of 497.35.",
        "This video can not be played",
        "Noah Williams performs impressive final dive, scoring 94.35",
        "Athletics - women's 1500m",
        "How she did it: In an incredibly fast final, Bell and fellow British athlete Laura Muir were in medal contention on the home straight.",
        "Muir eventually finished fifth, while Bell ran a new British record time of three minutes 52.61 seconds to finish third behind Kenya's Faith Kipyegon and Jessica Hull of Australia.",
        "This video can not be played",
        "Kipyegon sets new Olympic record as Bell gets bronze in 1500m final",
        "Athletics - men's 4x400m relay",
        "How they did it: The British quartet set a new European record to finish third behind the United States and Botswana, who took gold and silver respectively.",
        "Hudson-Smith added relay bronze to the silver he won in the individual event earlier in the Games.",
        "This video can not be played",
        "Watch as Team GB secure bronze in the 4x400m relay final",
        "Athletics - women's 4x400m relay",
        "How they did it: Shortly after Great Britain's men won bronze in their 4x400m relay, the team of Ohuruogu, Nielsen, Yeargin and Anning matched that achievement in the women's event.",
        "The United States were dominant winners, with the British quartet narrowly missing out on silver to the Netherlands.",
        "This video can not be played",
        "Watch as Team GB win bronze and set new British record in 4x400m relay",
        "This video can not be played",
        "Team GB's Finucane wins bronze in women's sprint",
        "Cycling - women's sprint",
        "How she did it: History for Emma Finucane, as she became the first British woman since athlete Mary Rand in 1964 to win three medals at a single Olympics.",
        "Finucane, 21, rounded off her first Games by beating Hetty van de Wouw of the Netherlands comfortably over two legs in the bronze medal final to add an Olympic medal to her World Championship title in the event.",
        "And it followed her bronze in the keirin and a team sprint gold at Paris 2024.",
        "Ellesse Andrews of New Zealand, who had defeated Finucane in the semi-finals, won sprint gold, beating Germany's Lea Friedrich.",
        "This video can not be played",
        "Team GB's Emily Campbell secures a bronze medal in women's +81kg weightlifting",
        "Weightlifting - women's +81kg final",
        "How she did it: Britain's only weightlifter in Paris added to the silver she took home from Tokyo 2020 with her country's final medal of 2024.",
        "The 30-year-old finished with a total of 288kg, lifting 126kg in the snatch and 162kg in the clean and jerk - and celebrated with a cartwheel across the stage.",
        "China's Li Wenwen, who took gold, and Park Hye-jeong of South Korea the silver.",
        "It is only the ninth Olympic weightlifting medal GB have won, with Campbell the only woman to have finished on the podium.",
        "Today's Olympics guide",
        "Full Paris Olympics schedule",
        "BBC's Paris Olympics TV schedule",
        "Who were Team GB's medal winners at Tokyo 2020?"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/olympics/articles/clyl2pd8n1vo",
      "main_category": "sport",
      "detailed_category": "olympics",
      "topic": "IOC to tell members not to host events in Indonesia",
      "content": [
        "International sport federations will be told not to allow Indonesia to host events following the country's ban on Israeli athletes.Indonesia said it would not grant visas to the Israel team for the ongoing World Artistic Gymnastics Championships in Jakarta because of the country's military offensive in Gaza.The International Olympic Committee (IOC) could not find a resolution to the decision, which the Israeli Gymnastics Federation (IGF) said set a \"dangerous precedent\" - as it also criticised the International Gymnastics Federation (FIG).In response, the IOC executive board met this week and have decided to \"end any form of dialogue\" with the National Olympic Committee of Indonesia \"about hosting future editions of the Olympic Games, Youth Olympic Games, Olympic events or conferences\".It stated that this ban would remain in place until the Indonesian governing body could provide \"adequate guarantees that it will allow access to the country for all participants, regardless of nationality, to attend\".",
        "Additionally, the IOC will \"recommend to all international federations not to host any international sports events or meetings in Indonesia\".Indonesia's sports and youth minister Erick Thohir said the country was aware that its ban would \"carry consequences\" but that it would not deter them from playing an \"active role\" in global sports. \"We adhere to the principle of maintaining security, public order and public interest in every international event organised,\" Thohir wrote on X.\"Indonesian sports can serve as an ambassador and a reflection of the nation's strength in the eyes of the world.\"Indonesia, the world's most populous Muslim nation, has no formal diplomatic ties with Israel but the IGF says it had been given assurances its delegation would be welcome at the championships.Among the athletes unable to compete are defending world floor champion Artem Dolgopyat.The 28-year-old won Olympic floor gold at the Tokyo 2020 Olympics and silver in Paris last year. He is also a two-time European champion.The IGF made a request to the Court of Arbitration for Sport (Cas) for urgent provisional measures to guarantee Israeli participation, or to move or cancel the event, but this was rejected.Following its meeting this week, the IOC said it has also asked Indonesia's Olympic committee and the FIG \"to come to the IOC headquarters in Lausanne to discuss the situation that occurred\".The IOC's executive board added that it \"took the opportunity\" at its meeting \"to remind all Olympic Movement stakeholders of the importance of free and unfettered access to the respective country for all participants to attend international competitions without restrictions\".",
        "Artem Dolgopyat is a two-time Olympic floor medallist",
        "International sport federations will be told not to allow Indonesia to host events following the country's ban on Israeli athletes.",
        "Indonesia said it would not grant visas to the Israel team for the ongoing World Artistic Gymnastics Championships in Jakarta because of the country's military offensive in Gaza.",
        "The International Olympic Committee (IOC) could not find a resolution to the decision, which the Israeli Gymnastics Federation (IGF) said set a \"dangerous precedent\" - as it also criticised the International Gymnastics Federation (FIG).",
        "In response, the IOC executive board met this week and have decided to \"end any form of dialogue\" with the National Olympic Committee of Indonesia \"about hosting future editions of the Olympic Games, Youth Olympic Games, Olympic events or conferences\".",
        "It stated that this ban would remain in place until the Indonesian governing body could provide \"adequate guarantees that it will allow access to the country for all participants, regardless of nationality, to attend\".",
        "Additionally, the IOC will \"recommend to all international federations not to host any international sports events or meetings in Indonesia\".",
        "Indonesia's sports and youth minister Erick Thohir said the country was aware that its ban would \"carry consequences\" but that it would not deter them from playing an \"active role\" in global sports.",
        "\"We adhere to the principle of maintaining security, public order and public interest in every international event organised,\" Thohir wrote on X.",
        "\"Indonesian sports can serve as an ambassador and a reflection of the nation's strength in the eyes of the world.\"",
        "Indonesia, the world's most populous Muslim nation, has no formal diplomatic ties with Israel but the IGF says it had been given assurances its delegation would be welcome at the championships.",
        "Among the athletes unable to compete are defending world floor champion Artem Dolgopyat.",
        "The 28-year-old won Olympic floor gold at the Tokyo 2020 Olympics and silver in Paris last year. He is also a two-time European champion.",
        "The IGF made a request to the Court of Arbitration for Sport (Cas) for urgent provisional measures to guarantee Israeli participation, or to move or cancel the event, but this was rejected.",
        "Following its meeting this week, the IOC said it has also asked Indonesia's Olympic committee and the FIG \"to come to the IOC headquarters in Lausanne to discuss the situation that occurred\".",
        "The IOC's executive board added that it \"took the opportunity\" at its meeting \"to remind all Olympic Movement stakeholders of the importance of free and unfettered access to the respective country for all participants to attend international competitions without restrictions\".",
        "IOC says sport must be 'safe space' amid Israel gymnast row",
        "Boycott of Israel gymnasts sets 'dangerous precedent'",
        "Liverpool to bid for 2030 World Gymnastic Championships"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/swimming/articles/czxndzggwnko",
      "main_category": "sport",
      "detailed_category": "olympics",
      "topic": "Australian Olympic swim star Titmus retires at 25",
      "content": [
        "Four-time Australian Olympic gold medallist Ariarne Titmus has announced she is retiring from swimming at the age of 25, saying \"the time feels right to step away\". \"It's a tough one [decision] but one that I'm really happy with\", she said on Instagram on Thursday, adding: \"I've always loved swimming, it's been my passion since I was a little girl.\"She took a break after last year's Paris Olympics and \"realised some things in my life that have always been important to me are just a little bit more important to me now than swimming\".Titmus is the world record holder in the 200m freestyle and is retiring with 32 international medals to her name, including eight Olympic medals.",
        "A two-time Olympic champion in the 400m freestyle, she triumphed in Tokyo in 2021 and in Paris last year. She also won 200m freestyle gold in Tokyo and was part of the Australia team that won the 4x200m freestyle relay in Paris. Before the Paris Games, Titmus underwent surgery to remove an ovarian tumour, which she referred to in Thursday's announcement, saying she had faced health challenges which \"really rocked me mentally\".After 18 years of swimming, and having just turned 25, \"the time feels right to step away from swimming\", she wrote in a letter to her seven-year-old self that she shared on Instagram. \"The pursuit was unrelenting and you gave it every skerrick of yourself. You walk away knowing every stone was turned, no regrets. You're fulfilled, content and happy.\"American swimmer Katie Ledecky - a rival of Titmus and who the Australian beat to win the 400m freestyle gold in Paris - responded to the announcement, saying Titmus was an \"outstanding competitor, champion and person\".Fellow Australian Olympic swimmer Mollie O'Callaghan, who beat Titmus in the 200m freestyle in Paris to win gold, congratulated her former team-mate on an \"amazing career\".",
        "Ariarne Titmus has eight Olympic medals, including four golds",
        "Four-time Australian Olympic gold medallist Ariarne Titmus has announced she is retiring from swimming at the age of 25, saying \"the time feels right to step away\".",
        "\"It's a tough one [decision] but one that I'm really happy with\", she said on Instagram on Thursday, adding: \"I've always loved swimming, it's been my passion since I was a little girl.\"",
        "She took a break after last year's Paris Olympics and \"realised some things in my life that have always been important to me are just a little bit more important to me now than swimming\".",
        "Titmus is the world record holder in the 200m freestyle and is retiring with 32 international medals to her name, including eight Olympic medals.",
        "A two-time Olympic champion in the 400m freestyle, she triumphed in Tokyo in 2021 and in Paris last year. She also won 200m freestyle gold in Tokyo and was part of the Australia team that won the 4x200m freestyle relay in Paris.",
        "Before the Paris Games, Titmus underwent surgery to remove an ovarian tumour, which she referred to in Thursday's announcement, saying she had faced health challenges which \"really rocked me mentally\".",
        "After 18 years of swimming, and having just turned 25, \"the time feels right to step away from swimming\", she wrote in a letter to her seven-year-old self that she shared on Instagram.",
        "\"The pursuit was unrelenting and you gave it every skerrick of yourself. You walk away knowing every stone was turned, no regrets. You're fulfilled, content and happy.\"",
        "American swimmer Katie Ledecky - a rival of Titmus and who the Australian beat to win the 400m freestyle gold in Paris - responded to the announcement, saying Titmus was an \"outstanding competitor, champion and person\".",
        "Fellow Australian Olympic swimmer Mollie O'Callaghan, who beat Titmus in the 200m freestyle in Paris to win gold, congratulated her former team-mate on an \"amazing career\".",
        "This video can not be played",
        "Swimming legend Ariarne Titmus retires aged 25",
        "Australia's Titmus sets 200m freestyle world record",
        "Titmus breaks Ledecky's 400m freestyle record",
        "Titmus and Marchand set new swimming world records"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/olympics/articles/cn7el62zj2ko",
      "main_category": "sport",
      "detailed_category": "olympics",
      "topic": "GB medallist Carlin retires after losing 'spark'",
      "content": [
        "Team GB track cyclist Jack Carlin has announced his retirement after feeling unable to \"ignite that spark again\" after last summer's Olympic Games. The 28-year-old claimed team sprint silver and sprint bronze in Paris last August -  and the same in Tokyo three years earlier - among a haul of 19 international medals.However, after taking time to recover and decompress with partner Christie in Australia, New Zealand and south east Asia last winter - following a horrendous crash in his final Olympic event - the Scot found his appetite to go again was lacking.Carlin - who has had a \"creeping realisation\" that his career was drawing to a close for some time -  says he is \"daunted but excited\" by his decision and finishes his career \"content\" with what he has achieved in a \"whirlwind 10 years\" at the top of the sport.He plans to spend the day with his phone on 'do not disturb', potentially immersing himself instead in his rediscovered love of golf at his local club in Paisley.  \"It's a decision that wasn't taken lightly, but also it is a relief,\" he told BBC Sport Scotland. \"Even going into Paris, my motivation was dwindling. I had injuries leading into the Olympics and it took a lot to get to that start line.\"After that, I took myself away from the high-performance environment and tried to search for the fire to go until the next Olympics. But it never came back. \"I can win or lose by thousands of a second in every race so unless I can give 100%, I'm doing myself a disservice.\"",
        "Less than a month ago, Carlin spoke of his excitement about the Commonwealth Games returning to Glasgow next summer. Not least because he is now living near the Sir Chris Hoy Velodrome, where the cycling will be held.But his decision to quit had already been made and retrospective examination of what he said at the time shows a vagueness about his ambitions for that event.As a potential poster boy for the reimagined event - as a kid he sat rapt in the tribunes in 2014 and won medals at the next two Games - was it a wrench to walk away from the chance of a glorious career conclusion?\"It's been the elephant in the room,\" Carlin said of Glasgow 2026.\"People I've told have asked, 'what about Glasgow?' but it's less than a year away and I'd be doing myself and the jersey a disservice if I decided to try and put it round my back again when I'm just not in the shape to do it.\"Carlin does not need that elusive gold medal or one more wave of adoration from a home crowd to validate his achievements. They are achievements that place him fourth in the list of all-time Scottish Olympic medal winners, behind only Duncan Scott, Sir Chris Hoy and Katherine Grainger.As he says, plenty of his competitors will leave the sport without ribbons around their neck and precious metal in their hands. Like him, they will have memories, experiences and friendships, and it is those - as much as the medals - that the Scot will cherish when he reflects.\"It's rare that someone steps away when they're still rubbing shoulders at the top,\" he adds. \"But you have to be able to give 100%.\"I can come away from this saying 'I gave everything I could, I gave my whole body to this sport, and I'm satisfied'. I couldn't do anything more. So I can't be upset.\"I started this journey when I was 14 years old and my mum and dad gave up time and money that we didn't have to let me chase that dream.\"And if someone said to 'Wee Jack from Paisley' a decade ago that he'd have four Olympic medals around his neck, he wouldn't have believed them.\"",
        "The challenge Carlin now faces is in establishing a new identity. As of today - and for the first time in his adult life - he is no longer 'Jack the cyclist'. He has not been on a track in more than a year now, and does not miss squatting obscenely heavy amounts in the gym and endless hours indoors on static bikes.He has, however, rediscovered his childhood love for simply riding a bike - if not quite one with a basket, bell and streamers. Golf is scratching his sporting itch at the moment - his handicap is down to single figures - and even watching Scotland's footballers toil against Belarus at Hampden has not unduly affected his sunny disposition.But 28 is young to retire. So what now?\"That's the question I've been sitting thinking about myself, to be honest,\" he says, suggesting a visit to the Jobcentre was not entirely out of the question.\"Sport's taught me a lot of life skills and given me a lot of experiences. I've probably done more in 10 years than some people do in 40 in the normal business world.\"I feel like I've got strengths I could add to a company so we'll wait and see. It's all about who the next Jack is after Jack the cyclist, which is actually really exciting.\"",
        "This video can not be played",
        "'I couldn't do anything more' - Jack Carlin",
        "Team GB track cyclist Jack Carlin has announced his retirement after feeling unable to \"ignite that spark again\" after last summer's Olympic Games.",
        "The 28-year-old claimed team sprint silver and sprint bronze in Paris last August -  and the same in Tokyo three years earlier - among a haul of 19 international medals.",
        "However, after taking time to recover and decompress with partner Christie in Australia, New Zealand and south east Asia last winter - following a horrendous crash in his final Olympic event - the Scot found his appetite to go again was lacking.",
        "Carlin - who has had a \"creeping realisation\" that his career was drawing to a close for some time -  says he is \"daunted but excited\" by his decision and finishes his career \"content\" with what he has achieved in a \"whirlwind 10 years\" at the top of the sport.",
        "He plans to spend the day with his phone on 'do not disturb', potentially immersing himself instead in his rediscovered love of golf at his local club in Paisley.",
        "\"It's a decision that wasn't taken lightly, but also it is a relief,\" he told BBC Sport Scotland. \"Even going into Paris, my motivation was dwindling. I had injuries leading into the Olympics and it took a lot to get to that start line.",
        "\"After that, I took myself away from the high-performance environment and tried to search for the fire to go until the next Olympics. But it never came back.",
        "\"I can win or lose by thousands of a second in every race so unless I can give 100%, I'm doing myself a disservice.\"",
        "'I don't want to be stopped eating a sausage roll'",
        "Carlin left listening again as Dutch call the tune in team sprint",
        "Carlin is Scotland's low profile, high achiever",
        "Less than a month ago, Carlin spoke of his excitement about the Commonwealth Games returning to Glasgow next summer. Not least because he is now living near the Sir Chris Hoy Velodrome, where the cycling will be held.",
        "But his decision to quit had already been made and retrospective examination of what he said at the time shows a vagueness about his ambitions for that event.",
        "As a potential poster boy for the reimagined event - as a kid he sat rapt in the tribunes in 2014 and won medals at the next two Games - was it a wrench to walk away from the chance of a glorious career conclusion?",
        "\"It's been the elephant in the room,\" Carlin said of Glasgow 2026.",
        "\"People I've told have asked, 'what about Glasgow?' but it's less than a year away and I'd be doing myself and the jersey a disservice if I decided to try and put it round my back again when I'm just not in the shape to do it.\"",
        "Carlin does not need that elusive gold medal or one more wave of adoration from a home crowd to validate his achievements.",
        "They are achievements that place him fourth in the list of all-time Scottish Olympic medal winners, behind only Duncan Scott, Sir Chris Hoy and Katherine Grainger.",
        "As he says, plenty of his competitors will leave the sport without ribbons around their neck and precious metal in their hands.",
        "Like him, they will have memories, experiences and friendships, and it is those - as much as the medals - that the Scot will cherish when he reflects.",
        "\"It's rare that someone steps away when they're still rubbing shoulders at the top,\" he adds. \"But you have to be able to give 100%.",
        "\"I can come away from this saying 'I gave everything I could, I gave my whole body to this sport, and I'm satisfied'. I couldn't do anything more. So I can't be upset.",
        "\"I started this journey when I was 14 years old and my mum and dad gave up time and money that we didn't have to let me chase that dream.",
        "\"And if someone said to 'Wee Jack from Paisley' a decade ago that he'd have four Olympic medals around his neck, he wouldn't have believed them.\"",
        "The challenge Carlin now faces is in establishing a new identity. As of today - and for the first time in his adult life - he is no longer 'Jack the cyclist'.",
        "He has not been on a track in more than a year now, and does not miss squatting obscenely heavy amounts in the gym and endless hours indoors on static bikes.",
        "He has, however, rediscovered his childhood love for simply riding a bike - if not quite one with a basket, bell and streamers.",
        "Golf is scratching his sporting itch at the moment - his handicap is down to single figures - and even watching Scotland's footballers toil against Belarus at Hampden has not unduly affected his sunny disposition.",
        "But 28 is young to retire. So what now?",
        "\"That's the question I've been sitting thinking about myself, to be honest,\" he says, suggesting a visit to the Jobcentre was not entirely out of the question.",
        "\"Sport's taught me a lot of life skills and given me a lot of experiences. I've probably done more in 10 years than some people do in 40 in the normal business world.",
        "\"I feel like I've got strengths I could add to a company so we'll wait and see. It's all about who the next Jack is after Jack the cyclist, which is actually really exciting.\""
      ]
    },
    {
      "url": "https://www.bbc.com/sport/rowing/articles/cx2n5g2n0g3o",
      "main_category": "sport",
      "detailed_category": "olympics",
      "topic": "Wales' Jack Tottem 'living the dream' as GB women's eight cox",
      "content": [
        "Jack Tottem knows how to win some of rowing's biggest races. He steered Oxford to victory in the 2022 Boat Race, and now the 24-year-old from Monmouth is guiding Great Britain's women's eight at the World Rowing Championships in Shanghai.He is the sole male voice in the boat – a scenario that until recently would not have been possible. Before 2017, coxswains had to be the same sex as their crew, but a rule change opened the door for Tottem to take charge.\"For me, the challenge is the same in any eight,\" he told BBC Sport Wales. \"You've got nine people in the boat, a coach on the bank, and the job is to create unity of purpose. That's what really matters.\"",
        "Tottem first picked up coxing at Monmouth School in 2015, later racing at Oxford University and then with Leander Club in Henley. This year he broke into the national squad full-time, and is now guiding one of Britain's flagship boats.\"I was always obsessed with sport growing up,\" he said.\"But I was smaller and less athletic than most, and would always get smashed around on the rugby pitch, but coxing was something I could sink my teeth into and allowed me to be involved in a team sport without my lack of physicality inhibiting that.\"It's felt like a nice progression to get to this point.\"",
        "Since March, Tottem has been working daily with the women's eight, helping shape the crew's rhythm and spirit.\"I've made a conscious effort to get to know everyone individually,\" he said. \"My role is about relieving pressure from the athletes, and helping each of them to be the fullest version of themselves.\"If we get the most out of everyone's personality, then we build a real crew identity – and I think we've done good work on that.\"That unity has already brought results, with gold medals at the European Championships and World Rowing Cup.\"It's been quite an intense season in many ways,\" \"We sat down as a team and as a crew and set some really clear goals – winning a [World Championships] gold medal is at the top of that list.\"We've had some good races already this season at the European Championships and the World Cup, but the step up at the Worlds will be huge. We're under no illusions about the scale of the task.\"",
        "Away from the water, Tottem admits he sometimes has to pinch himself at how far he has come.\"I try and say to myself as often as possible that we're living the dream,\" he said. \"I feel privileged to do this, and grateful for the support we get from UK Sport and the lottery – I've even got a mate in Cardiff who plays the lottery and I tell him he's helping me live my dream.\"As part of a growing Welsh contingent in the GB squad, he feels firmly at home.\"There's a good group of us in the team now, which is nice. It feels like a big Welsh family within the wider GB set-up.\"Great Britain's women's eight are due to begin their World Championship campaign in Shanghai at 03:11 BST on Thursday, 25 September.",
        "Jack Tottem (centre), will guide Great Britain's women's eight at the World Rowing Championships in Shanghai.",
        "Jack Tottem knows how to win some of rowing's biggest races.",
        "He steered Oxford to victory in the 2022 Boat Race, and now the 24-year-old from Monmouth is guiding Great Britain's women's eight at the World Rowing Championships in Shanghai.",
        "He is the sole male voice in the boat – a scenario that until recently would not have been possible.",
        "Before 2017, coxswains had to be the same sex as their crew, but a rule change opened the door for Tottem to take charge.",
        "\"For me, the challenge is the same in any eight,\" he told BBC Sport Wales. \"You've got nine people in the boat, a coach on the bank, and the job is to create unity of purpose. That's what really matters.\"",
        "Tottem first picked up coxing at Monmouth School in 2015, later racing at Oxford University and then with Leander Club in Henley.",
        "This year he broke into the national squad full-time, and is now guiding one of Britain's flagship boats.",
        "\"I was always obsessed with sport growing up,\" he said.",
        "\"But I was smaller and less athletic than most, and would always get smashed around on the rugby pitch, but coxing was something I could sink my teeth into and allowed me to be involved in a team sport without my lack of physicality inhibiting that.",
        "\"It's felt like a nice progression to get to this point.\"",
        "Since March, Tottem has been working daily with the women's eight, helping shape the crew's rhythm and spirit.",
        "\"I've made a conscious effort to get to know everyone individually,\" he said. \"My role is about relieving pressure from the athletes, and helping each of them to be the fullest version of themselves.",
        "\"If we get the most out of everyone's personality, then we build a real crew identity – and I think we've done good work on that.\"",
        "That unity has already brought results, with gold medals at the European Championships and World Rowing Cup.",
        "\"It's been quite an intense season in many ways,\"",
        "\"We sat down as a team and as a crew and set some really clear goals – winning a [World Championships] gold medal is at the top of that list.",
        "\"We've had some good races already this season at the European Championships and the World Cup, but the step up at the Worlds will be huge. We're under no illusions about the scale of the task.\"",
        "Away from the water, Tottem admits he sometimes has to pinch himself at how far he has come.",
        "\"I try and say to myself as often as possible that we're living the dream,\" he said.",
        "\"I feel privileged to do this, and grateful for the support we get from UK Sport and the lottery – I've even got a mate in Cardiff who plays the lottery and I tell him he's helping me live my dream.\"",
        "As part of a growing Welsh contingent in the GB squad, he feels firmly at home.",
        "\"There's a good group of us in the team now, which is nice. It feels like a big Welsh family within the wider GB set-up.\"",
        "Great Britain's women's eight are due to begin their World Championship campaign in Shanghai at 03:11 BST on Thursday, 25 September."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/olympics/articles/c89dle4dq9po",
      "main_category": "sport",
      "detailed_category": "olympics",
      "topic": "IOC sets up working group 'to protect women's sport'",
      "content": [
        "The International Olympic Committee has set up four working groups, including one for the protection of women's sport, in its bid to reshape the Olympic Games under new president Kirsty Coventry. Working groups to review the Olympic programme, the Youth Olympic Games and commercial partnerships and marketing have also been established. Coventry, who became the first female IOC president in March, had promised to create a working group for women's sports, saying the organisation must \"play a leading role\" in discussions on gender eligibility.The IOC said the working group will \"look at how we can best protect the female category\".However, while naming the members of the other three groups, it declined to say who would be on the Protection of the Female Category Working Group.\"The group will consist of experts and international federations,\" it said.",
        "\"The names of the members of the working group will remain confidential for now to protect the integrity of the group and its work.\"The IOC has previously left gender regulations to the governing bodies of individual sports rather than applying a universal approach.A growing number of sports federations have barred athletes who have undergone male puberty from competing in elite female competition.In February, US President Donald Trump signed an executive order that prevents transgender women from competing in female categories.He specified the order would include the 2028 Olympic Games in Los Angeles, adding he will deny visas for transgender athletes trying to visit America to compete at the LA Games.Coventry said the groups \"will allow us to meet deadlines, and bring important technical expertise to these complex and important discussions, while realigning where we feel that it is necessary to strengthen our movement\". The Zimbabwean added: \"These groups will receive constant feedback to make sure that everybody is fully aligned and that all recommendations are fully integrated.\"The IOC said the Olympic programme working group will explore the relevance of the disciplines at the Games as well as the scope of integrating new sports into it.\"It will also consider the suggestion that traditional summer or winter sports could cross over, the timing of the Games, and the sports calendar,\" it said. The Youth Olympic Games group will look at the potential and relevance of the youth event and take over the process of selecting the host for its 2030 edition.",
        "Two-time Olympic gold medallist Kirsty Coventry beat Britain's Lord Coe to become IOC president",
        "The International Olympic Committee has set up four working groups, including one for the protection of women's sport, in its bid to reshape the Olympic Games under new president Kirsty Coventry.",
        "Working groups to review the Olympic programme, the Youth Olympic Games and commercial partnerships and marketing have also been established.",
        "Coventry, who became the first female IOC president in March, had promised to create a working group for women's sports, saying the organisation must \"play a leading role\" in discussions on gender eligibility.",
        "The IOC said the working group will \"look at how we can best protect the female category\".",
        "However, while naming the members of the other three groups, it declined to say who would be on the Protection of the Female Category Working Group.",
        "\"The group will consist of experts and international federations,\" it said.",
        "\"The names of the members of the working group will remain confidential for now to protect the integrity of the group and its work.\"",
        "The IOC has previously left gender regulations to the governing bodies of individual sports rather than applying a universal approach.",
        "A growing number of sports federations have barred athletes who have undergone male puberty from competing in elite female competition.",
        "In February, US President Donald Trump signed an executive order that prevents transgender women from competing in female categories.",
        "He specified the order would include the 2028 Olympic Games in Los Angeles, adding he will deny visas for transgender athletes trying to visit America to compete at the LA Games.",
        "Coventry said the groups \"will allow us to meet deadlines, and bring important technical expertise to these complex and important discussions, while realigning where we feel that it is necessary to strengthen our movement\".",
        "The Zimbabwean added: \"These groups will receive constant feedback to make sure that everybody is fully aligned and that all recommendations are fully integrated.\"",
        "The IOC said the Olympic programme working group will explore the relevance of the disciplines at the Games as well as the scope of integrating new sports into it.",
        "\"It will also consider the suggestion that traditional summer or winter sports could cross over, the timing of the Games, and the sports calendar,\" it said.",
        "The Youth Olympic Games group will look at the potential and relevance of the youth event and take over the process of selecting the host for its 2030 edition.",
        "Trump signs order banning transgender women from female sports",
        "We have to protect the female category - IOC's Coventry"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/american-football/articles/c23prnv7xnxo",
      "main_category": "sport",
      "detailed_category": "olympics",
      "topic": "GB finish fifth in flag football at World Games",
      "content": [
        "Great Britain clinched a fifth-placed finish in flag football at their maiden World Games, with Mexico retaining their women's title.The tournament was seen as crucial for the GB team's development before flag football makes its Olympic debut at Los Angeles 2028.GB faced hosts China in their final ranking game on Sunday and the European champions ended their campaign with a 34-13 victory.Canada then claimed a 38-20 win over Austria in the bronze medal match before Mexico beat the USA 26-21 in a thrilling final in Chengdu.The World Games is a global multi-sport event showcasing sports not currently on the Olympic programme.GB qualified for the first time after securing seventh place at last year's Flag Football World Championships and are ranked fifth in the world.",
        "After ending their group campaign with a defeat by Mexico and losing to Austria in the quarter-finals, GB beat Italy in their first ranking game on Saturday.They then ensured they finished the tournament in fifth place by cruising to their fourth win from six games in China. Britain led 19-7 at half-time with quarterback Jessica Allen making touchdown passes to Hannah Elliott and Emily Kemp, before Kemp threw one to Elliott.They finished the game with five touchdowns in total, with Allen finding Kemp and Kate Bruinvels for second-half scores.GB women will head to Paris next month looking to defend their European title from 24-27 September, while GB men hope to improve on their sixth-placed finish in 2023.",
        "There was no men's event at the World Games in China, where there was a repeat of the women's final from 2022 in Birmingham, Alabama.Mexico shocked USA on that occasion by winning 39-6, though the Americans beat Mexico in the past two World Championship finals  - in 2021 and 2024.And Mexico showed that their 2022 gold was no fluke by clinching a dramatic victory in a game which went right down to the wire.Mexico led 14-7 at half-time before USA edged into a 21-20 lead, as they added the extra point after scoring a touchdown with just 28 seconds left on the clock.But the defending champions were able to get into position to snatch victory and with just three seconds remaining, quarterback Diana Flores found a wide-open Victoria Chavez in the end zone to spark emotional celebrations among the Mexico players.\"I'm so proud,\" said Flores. \"We just played the greatest football here and I'm blessed to be part of it.\"Pierre Trochet, president of the International Federation of American Football (Ifaf), added: \"It's a thrilling time for flag football.\"This was simply an amazing tournament - the best ever in our sport's history - and a huge step forward on the road to Los Angeles 2028.\"",
        "GB women became European champions in flag football for the first time in Ireland in 2023",
        "Great Britain clinched a fifth-placed finish in flag football at their maiden World Games, with Mexico retaining their women's title.",
        "The tournament was seen as crucial for the GB team's development before flag football makes its Olympic debut at Los Angeles 2028.",
        "GB faced hosts China in their final ranking game on Sunday and the European champions ended their campaign with a 34-13 victory.",
        "Canada then claimed a 38-20 win over Austria in the bronze medal match before Mexico beat the USA 26-21 in a thrilling final in Chengdu.",
        "The World Games is a global multi-sport event showcasing sports not currently on the Olympic programme.",
        "GB qualified for the first time after securing seventh place at last year's Flag Football World Championships and are ranked fifth in the world.",
        "After ending their group campaign with a defeat by Mexico and losing to Austria in the quarter-finals, GB beat Italy in their first ranking game on Saturday.",
        "They then ensured they finished the tournament in fifth place by cruising to their fourth win from six games in China.",
        "Britain led 19-7 at half-time with quarterback Jessica Allen making touchdown passes to Hannah Elliott and Emily Kemp, before Kemp threw one to Elliott.",
        "They finished the game with five touchdowns in total, with Allen finding Kemp and Kate Bruinvels for second-half scores.",
        "GB women will head to Paris next month looking to defend their European title from 24-27 September, while GB men hope to improve on their sixth-placed finish in 2023.",
        "Mexico are ranked second in the world, behind the USA",
        "There was no men's event at the World Games in China, where there was a repeat of the women's final from 2022 in Birmingham, Alabama.",
        "Mexico shocked USA on that occasion by winning 39-6, though the Americans beat Mexico in the past two World Championship finals  - in 2021 and 2024.",
        "And Mexico showed that their 2022 gold was no fluke by clinching a dramatic victory in a game which went right down to the wire.",
        "Mexico led 14-7 at half-time before USA edged into a 21-20 lead, as they added the extra point after scoring a touchdown with just 28 seconds left on the clock.",
        "But the defending champions were able to get into position to snatch victory and with just three seconds remaining, quarterback Diana Flores found a wide-open Victoria Chavez in the end zone to spark emotional celebrations among the Mexico players.",
        "\"I'm so proud,\" said Flores. \"We just played the greatest football here and I'm blessed to be part of it.\"",
        "Pierre Trochet, president of the International Federation of American Football (Ifaf), added: \"It's a thrilling time for flag football.",
        "\"This was simply an amazing tournament - the best ever in our sport's history - and a huge step forward on the road to Los Angeles 2028.\"",
        "NFL flag vote sees Olympic 'Dream Team' move closer",
        "How Taylor Swift is inspiring girls to follow Olympic dream",
        "Get American Football news sent straight to your phone"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/olympics/articles/cjey9wlqxqjo",
      "main_category": "sport",
      "detailed_category": "olympics",
      "topic": "Cricket's Olympic places decided by continents and play-offs",
      "content": [
        "Qualification for the Los Angeles Olympics in 2028 will be decided based on continents and play-off matches, rather than the top six-ranked sides, says England and Wales Cricket Board (ECB) chair Richard Thompson. Cricket is returning to the Games for the first time in 128 years and will be played as a six-team T20 tournament. Thompson said that the qualification process had not been finalised but that it would be decided geographically rather than by rankings.\"We are there by invitation of the International Olympic Committee (IOC) and you abide by their rules,\" Thompson told BBC Test Match Special.\"It is still being finalised but the IOC's preference is to work to the five-ring principle, with teams from each of the continents - so Europe would be between Ireland and Great Britain. We would unite with Scotland and create Team GB.\"It would throw up the opportunity, if you took the principle that USA would play as the host country, and that would free up one additional slot for every other full country to have a play-off match to enable one of them to qualify.\"",
        "Thompson also expressed an ambition for more than six teams to take part, with the 2032 Games to be played in Brisbane and likely a three-way tussle for 2036 between Qatar, Saudi and India - with the hope that the latter would see cricket at the \"front and centre\". He also said that talks are still ongoing regarding the opportunity for cricket in the Paralympics, but believes that its inclusion in the Games will \"globalise\" the sport. \"At the moment we are a very significant international game, but once you're at the Olympics you become a global game. \"China will only focus on sport that is in the Olympics, they will look to Hong Kong to be their outpost for cricket.\"The opportunity to grow the game globally is very, very real and it starts now and we'll certainly see that play out in 2028.\"The matches, featuring both men's and women's teams, will begin on 12 July - two days before the opening ceremony - with all matches staged at a venue which will be constructed at the Fairgrounds in Pomona.There will be two games played daily at Pomona - located 30 miles from the athletes' village in Los Angeles - starting at 09:00 and 18:30 Pacific Daylight Time.Those matches will be shown at 21:30 and 07:00 India Standard Time (17:00 and 02:30 British Summer Time).",
        "Cricket is returning to the Olympics after 128 years",
        "Qualification for the Los Angeles Olympics in 2028 will be decided based on continents and play-off matches, rather than the top six-ranked sides, says England and Wales Cricket Board (ECB) chair Richard Thompson.",
        "Cricket is returning to the Games for the first time in 128 years and will be played as a six-team T20 tournament.",
        "Thompson said that the qualification process had not been finalised but that it would be decided geographically rather than by rankings.",
        "\"We are there by invitation of the International Olympic Committee (IOC) and you abide by their rules,\" Thompson told BBC Test Match Special.",
        "\"It is still being finalised but the IOC's preference is to work to the five-ring principle, with teams from each of the continents - so Europe would be between Ireland and Great Britain. We would unite with Scotland and create Team GB.",
        "\"It would throw up the opportunity, if you took the principle that USA would play as the host country, and that would free up one additional slot for every other full country to have a play-off match to enable one of them to qualify.\"",
        "Thompson also expressed an ambition for more than six teams to take part, with the 2032 Games to be played in Brisbane and likely a three-way tussle for 2036 between Qatar, Saudi and India - with the hope that the latter would see cricket at the \"front and centre\".",
        "He also said that talks are still ongoing regarding the opportunity for cricket in the Paralympics, but believes that its inclusion in the Games will \"globalise\" the sport.",
        "\"At the moment we are a very significant international game, but once you're at the Olympics you become a global game.",
        "\"China will only focus on sport that is in the Olympics, they will look to Hong Kong to be their outpost for cricket.",
        "\"The opportunity to grow the game globally is very, very real and it starts now and we'll certainly see that play out in 2028.\"",
        "The matches, featuring both men's and women's teams, will begin on 12 July - two days before the opening ceremony - with all matches staged at a venue which will be constructed at the Fairgrounds in Pomona.",
        "There will be two games played daily at Pomona - located 30 miles from the athletes' village in Los Angeles - starting at 09:00 and 18:30 Pacific Daylight Time.",
        "Those matches will be shown at 21:30 and 07:00 India Standard Time (17:00 and 02:30 British Summer Time).",
        "Get cricket news sent straight to your phone"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/swimming/articles/cx29nwgd8q5o",
      "main_category": "sport",
      "detailed_category": "olympics",
      "topic": "Peaty targets four gold medals at 2028 Olympics",
      "content": [
        "Great Britain's Adam Peaty is targeting four gold medals in the pool at the Los Angeles Olympics in 2028. The 30-year-old has previously competed in the 100m breaststroke, 4x100m mixed medley, and 4x100m medley at the Olympics, winning three gold medals and three silver medals. It was confirmed in April 2025 that the 50m breaststroke would be one of three disciplines added to the 2028 programme, with Peaty a three-time world champion and the current world record holder over that distance. Peaty has said he is aiming to compete in both individual disciplines in Los Angeles, while the two medley events have the added incentive of beating defending champions USA on \"home turf\". \"I'm very excited the 50m has been added but I will do the 100m as well, so that will give me four opportunities to [win a] medal,\" he told BBC Radio 5 Live. \"We want to beat America on home turf in that medley. We've got the incredible Oliver Morgan on backstroke, some very strong times - and that's always been our weak link at previous Olympics. It's very exciting.\"",
        "Peaty took a break from swimming after winning silver in the 100m breaststroke at the 2024 Olympics in Paris. He previously took an extended break from sport in 2023 to prioritise his mental health after experiencing a \"major, major burnout\". However, while \"the athlete in my head\" is missing not competing at the ongoing World Championships in Singapore, Peaty has a clear plan for his return to competition and is training \"a lot smarter\" as an older athlete.\"I made the call in January or February, when I started to get back into training, that this Worlds wouldn't be for me because it would be too rushed,\" Peaty said. \"I want to be at the [2026] Commonwealth Games. I want to be at the Europeans next year. I'm never going to take my spot for granted - just because I've got a world record doesn't mean I'm going to be there, it's ridiculous. I've got to earn those places, which excites me. \"I did some race prep before I came out here to see where I'm at and we're in a good place for October World Cups in America and Canada.\"On his training, he added: \"If you'd told me 10 years ago I'd be doing a pilates session this morning, I would have said 'no way'. \"I look back on certain camps and I was chasing numbers, I needed the outputs, the validation. But I wasn't swimming the smartest in my head in terms of recovery, mental health and the warning signs of what burnout looks like. \"[Now] it's what I decide. This block [in Los Angeles], I know it's a holiday so I'm just going to see how I feel. When I get back into England I'm ramping up for the Commonwealth Games - 4km sessions, 4.5km - and that gives me the best results.\"Listen to live coverage of the World Aquatics Championships on BBC Radio 5 Live Sports Extra, BBC Sounds and the BBC Sport website & app from 12:00 BST",
        "Adam Peaty is a three-time Olympic and eight-time world champion",
        "Great Britain's Adam Peaty is targeting four gold medals in the pool at the Los Angeles Olympics in 2028.",
        "The 30-year-old has previously competed in the 100m breaststroke, 4x100m mixed medley, and 4x100m medley at the Olympics, winning three gold medals and three silver medals.",
        "It was confirmed in April 2025 that the 50m breaststroke would be one of three disciplines added to the 2028 programme, with Peaty a three-time world champion and the current world record holder over that distance.",
        "Peaty has said he is aiming to compete in both individual disciplines in Los Angeles, while the two medley events have the added incentive of beating defending champions USA on \"home turf\".",
        "\"I'm very excited the 50m has been added but I will do the 100m as well, so that will give me four opportunities to [win a] medal,\" he told BBC Radio 5 Live.",
        "\"We want to beat America on home turf in that medley. We've got the incredible Oliver Morgan on backstroke, some very strong times - and that's always been our weak link at previous Olympics. It's very exciting.\"",
        "Peaty '100%' at LA 2028 if 50m breaststroke added",
        "Adam Peaty's mum tells of sacrifices behind medals",
        "Peaty took a break from swimming after winning silver in the 100m breaststroke at the 2024 Olympics in Paris.",
        "He previously took an extended break from sport in 2023 to prioritise his mental health after experiencing a \"major, major burnout\".",
        "However, while \"the athlete in my head\" is missing not competing at the ongoing World Championships in Singapore, Peaty has a clear plan for his return to competition and is training \"a lot smarter\" as an older athlete.",
        "\"I made the call in January or February, when I started to get back into training, that this Worlds wouldn't be for me because it would be too rushed,\" Peaty said.",
        "\"I want to be at the [2026] Commonwealth Games. I want to be at the Europeans next year. I'm never going to take my spot for granted - just because I've got a world record doesn't mean I'm going to be there, it's ridiculous. I've got to earn those places, which excites me.",
        "\"I did some race prep before I came out here to see where I'm at and we're in a good place for October World Cups in America and Canada.\"",
        "On his training, he added: \"If you'd told me 10 years ago I'd be doing a pilates session this morning, I would have said 'no way'.",
        "\"I look back on certain camps and I was chasing numbers, I needed the outputs, the validation. But I wasn't swimming the smartest in my head in terms of recovery, mental health and the warning signs of what burnout looks like.",
        "\"[Now] it's what I decide. This block [in Los Angeles], I know it's a holiday so I'm just going to see how I feel. When I get back into England I'm ramping up for the Commonwealth Games - 4km sessions, 4.5km - and that gives me the best results.\"",
        "Listen to live coverage of the World Aquatics Championships on BBC Radio 5 Live Sports Extra, BBC Sounds and the BBC Sport website & app from 12:00 BST"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/athletics/articles/c877l72gv6yo",
      "main_category": "sport",
      "detailed_category": "olympics",
      "topic": "Irish sporting pioneer Kyle dies aged 96",
      "content": [
        "Maeve Kyle, who became Ireland's first female track and field Olympian at the 1956 summer Games in Melbourne, has died at the age of 96.The Kilkenny native played hockey for Ireland before forging a successful international athletics career.Her move to athletics, although she still played hockey, came after meeting Ballymena man Sean Kyle in 1953.The athlete gave birth to daughter Shauna in 1954 after their marriage but was soon back in Olympic training.The by-now Ballymena-based athlete's Olympic selection led a letter writer to the Irish Times branding her a \"disgrace to Irish motherhood and the Irish nation\" but the 28-year remained unperturbed as she ran in the 100m and 200m at the Melbourne Games after having to pay the then huge sum of £200 which the Olympic Council of Ireland had demanded of her.",
        "Kyle went on to compete at further Olympic Games in Rome and Tokyo before winning a 400m bronze medal at the 1966 European Indoor Championships in Dortmund.The Kilkenny-born woman continued to race into her 40s although she had also long since moved into coaching alongside her husband at the Ballymena & Antrim club which they had set up in 1955.International athletes who benefited from the couple's guidance included high jump stars Sharon McPeake and Janet Boyle in addition to Mark Forsythe, Mark Kirk, Sean O'Neill, Eddie King and countless others down through the decades.Mary Peters, who went on to achieve Olympic glory in 1972, had a stint at the Ballymena & Antrim club early in her career while both Kyles were continued to coach international athletes well into their 70s after the emergence of the likes of James McIlroy, Paul Brizzel, John McAdorey and Anna Boyle.But while they nurtured many stars, their greatest contribution to the sport was the work that they did with the grassroots of the sport.",
        "During the worst period of the Northern Ireland troubles in the early 1970s, the Kyles were instrumental in setting up Top Towns meetings which saw towns from Northern Ireland and even a number from the southern border counties compete in team athletics meetings.Maeve had the distinction of operating as manager for both Great Britain and Ireland teams and as a 71-year-old coached the Irish relay squads at the 2000 Olympics in Sydney.She was appointed an OBE in the 2008 New Year Honours list and also served as President of the then Northern Ireland Athletics Federation during the mid-1990s.2008 also saw her being inducted into the RTE/Irish Sports Council's Hall of Fame as Ballymena & Antrim was named the UK's athletics club of the year while she was the recipient of the Belfast Telegraph/Sport Northern Ireland's Hall of Fame honour in 2009.Maeve Kyle was predeceased by her husband Sean in November 2015 and is survived by daughter Shauna.",
        "Maeve Kyle competed in three Olympics for Ireland and also was a hockey star for her country",
        "Maeve Kyle, who became Ireland's first female track and field Olympian at the 1956 summer Games in Melbourne, has died at the age of 96.",
        "The Kilkenny native played hockey for Ireland before forging a successful international athletics career.",
        "Her move to athletics, although she still played hockey, came after meeting Ballymena man Sean Kyle in 1953.",
        "The athlete gave birth to daughter Shauna in 1954 after their marriage but was soon back in Olympic training.",
        "The by-now Ballymena-based athlete's Olympic selection led a letter writer to the Irish Times branding her a \"disgrace to Irish motherhood and the Irish nation\" but the 28-year remained unperturbed as she ran in the 100m and 200m at the Melbourne Games after having to pay the then huge sum of £200 which the Olympic Council of Ireland had demanded of her.",
        "Kyle went on to compete at further Olympic Games in Rome and Tokyo before winning a 400m bronze medal at the 1966 European Indoor Championships in Dortmund.",
        "The Kilkenny-born woman continued to race into her 40s although she had also long since moved into coaching alongside her husband at the Ballymena & Antrim club which they had set up in 1955.",
        "International athletes who benefited from the couple's guidance included high jump stars Sharon McPeake and Janet Boyle in addition to Mark Forsythe, Mark Kirk, Sean O'Neill, Eddie King and countless others down through the decades.",
        "Mary Peters, who went on to achieve Olympic glory in 1972, had a stint at the Ballymena & Antrim club early in her career while both Kyles were continued to coach international athletes well into their 70s after the emergence of the likes of James McIlroy, Paul Brizzel, John McAdorey and Anna Boyle.",
        "But while they nurtured many stars, their greatest contribution to the sport was the work that they did with the grassroots of the sport.",
        "Maeve Kyle and husband Sean were a formidable coaching partnership at the Ballymena & Antrim club which they set up in 1955",
        "During the worst period of the Northern Ireland troubles in the early 1970s, the Kyles were instrumental in setting up Top Towns meetings which saw towns from Northern Ireland and even a number from the southern border counties compete in team athletics meetings.",
        "Maeve had the distinction of operating as manager for both Great Britain and Ireland teams and as a 71-year-old coached the Irish relay squads at the 2000 Olympics in Sydney.",
        "She was appointed an OBE in the 2008 New Year Honours list and also served as President of the then Northern Ireland Athletics Federation during the mid-1990s.",
        "2008 also saw her being inducted into the RTE/Irish Sports Council's Hall of Fame as Ballymena & Antrim was named the UK's athletics club of the year while she was the recipient of the Belfast Telegraph/Sport Northern Ireland's Hall of Fame honour in 2009.",
        "Maeve Kyle was predeceased by her husband Sean in November 2015 and is survived by daughter Shauna."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/cricket/articles/cddzp9qeq4vo",
      "main_category": "sport",
      "detailed_category": "olympics",
      "topic": "Olympic cricket at LA 2028 set for 9am start times",
      "content": [
        "LA 2028 organisers have slated matches at the Olympic cricket tournament to start at 09:00 in the morning to cater for lucrative television audiences in India.One of the major factors behind cricket's return to the Games after a 128-year hiatus is the desire of the International Olympic Committee (IOC) to tap into a lucrative South Asian media rights and sponsorship market. The six-team T20 tournament, featuring both men's and women's teams, will begin on Wednesday, 12 July - two days before the opening ceremony - with all matches staged at a venue which will be constructed at the Fairgrounds in Pomona.There will be two games played daily at Pomona - located 30 miles from the athletes' village in Los Angeles - starting at 09:00 and 18:30 Pacific Daylight Time.Those matches will be shown at 21:30 and 07:00 India Standard Time (17:00 and 02:30 British Summer Time).The evening fixtures at the ground in Pomona will be played under floodlights. Kit McConnell, who oversaw cricket's return to the Games after a 128-year hiatus as the IOC's sports director, told BBC Sport organisers considered \"core cricket markets in the subcontinent\" when planning the tournament. \"The vision the International Cricket Council (ICC) has outlined for us is aimed at providing the best players and the best teams on the Olympic stage,\" McConnell said.\"There's three years to go but now we're very excited about where cricket is, what it will bring to the Games and equally what the Olympics can offer to cricket and its global expansion as well.\"",
        "BBC Sport understands the competition structure for cricket at the Olympics has now been agreed following meetings between the ICC, IOC and LA 2028 organisers.The six participating teams will be divided into two groups of three with each team playing each other once.Teams will then play two sides from the other pool, apart from those who were ranked in the same corresponding position.For example, the winners of Group A will play the second and third-placed teams in Group B and vice-versa.Results from all four matches will then be used to determine final rankings with the top two sides playing in a final to decide the gold and silver medals. The teams who finish third and fourth will play off for bronze.Medal matches will be played on 20 and 29 July with the women's and men's tournament set to run in separate slots rather than being played concurrently.The ICC is set to discuss how teams will qualify for LA 2028 at their Annual General Meeting in Singapore, starting on 17 July.Some members want T20 rankings to determine which teams go to Los Angeles but others have expressed a preference for qualifying tournaments.The England and Wales Cricket Board (ECB) and Cricket Scotland have held talks to form a new entity called GB Cricket to oversee a team for LA.",
        "The IOC have given assurances there will not be a repeat of the pitch controversy which blighted showpiece games at last year's T20 World Cup in New York, which the USA co-hosted.The 34,000-seat temporary stadium in Eisenhower Park looked impressive, but the drop-in pitches used for matches during the initial group stage, including the high-profile fixture between India and Pakistan, were subject to criticism.Unlike the venue in New York, which returned to use as a public park, the ground in Pomona is set to remain a cricket facility for permanent usage by Indian Premier League and Major League Cricket franchise owners Knight Riders.As reported by The Cricketer,, external the IOC and ICC are in negotiations with the Knight Riders over installing a square as opposed to using drop-in surfaces.\"We're very conscious about the importance of the field of play and in the case of cricket, the pitch,\" McConnell added.\"Now that we have finalised the venue, we can move forward with all of those plannings in a more concrete sense.\"I don't think it's only the T20 World Cup. I think every cricket match has commentary about the pitch and what type of play it suits.\"",
        "USA are set to qualify for the Olympic cricket tournament at LA 2028 as hosts",
        "LA 2028 organisers have slated matches at the Olympic cricket tournament to start at 09:00 in the morning to cater for lucrative television audiences in India.",
        "One of the major factors behind cricket's return to the Games after a 128-year hiatus is the desire of the International Olympic Committee (IOC) to tap into a lucrative South Asian media rights and sponsorship market.",
        "The six-team T20 tournament, featuring both men's and women's teams, will begin on Wednesday, 12 July - two days before the opening ceremony - with all matches staged at a venue which will be constructed at the Fairgrounds in Pomona.",
        "There will be two games played daily at Pomona - located 30 miles from the athletes' village in Los Angeles - starting at 09:00 and 18:30 Pacific Daylight Time.",
        "Those matches will be shown at 21:30 and 07:00 India Standard Time (17:00 and 02:30 British Summer Time).",
        "The evening fixtures at the ground in Pomona will be played under floodlights.",
        "Kit McConnell, who oversaw cricket's return to the Games after a 128-year hiatus as the IOC's sports director, told BBC Sport organisers considered \"core cricket markets in the subcontinent\" when planning the tournament.",
        "\"The vision the International Cricket Council (ICC) has outlined for us is aimed at providing the best players and the best teams on the Olympic stage,\" McConnell said.",
        "\"There's three years to go but now we're very excited about where cricket is, what it will bring to the Games and equally what the Olympics can offer to cricket and its global expansion as well.\"",
        "BBC Sport understands the competition structure for cricket at the Olympics has now been agreed following meetings between the ICC, IOC and LA 2028 organisers.",
        "The six participating teams will be divided into two groups of three with each team playing each other once.",
        "Teams will then play two sides from the other pool, apart from those who were ranked in the same corresponding position.",
        "For example, the winners of Group A will play the second and third-placed teams in Group B and vice-versa.",
        "Results from all four matches will then be used to determine final rankings with the top two sides playing in a final to decide the gold and silver medals.",
        "The teams who finish third and fourth will play off for bronze.",
        "Medal matches will be played on 20 and 29 July with the women's and men's tournament set to run in separate slots rather than being played concurrently.",
        "The ICC is set to discuss how teams will qualify for LA 2028 at their Annual General Meeting in Singapore, starting on 17 July.",
        "Some members want T20 rankings to determine which teams go to Los Angeles but others have expressed a preference for qualifying tournaments.",
        "The England and Wales Cricket Board (ECB) and Cricket Scotland have held talks to form a new entity called GB Cricket to oversee a team for LA.",
        "The Nassau County International Cricket Stadium was dismantled after the 2024 T20 World Cup",
        "The IOC have given assurances there will not be a repeat of the pitch controversy which blighted showpiece games at last year's T20 World Cup in New York, which the USA co-hosted.",
        "The 34,000-seat temporary stadium in Eisenhower Park looked impressive, but the drop-in pitches used for matches during the initial group stage, including the high-profile fixture between India and Pakistan, were subject to criticism.",
        "Unlike the venue in New York, which returned to use as a public park, the ground in Pomona is set to remain a cricket facility for permanent usage by Indian Premier League and Major League Cricket franchise owners Knight Riders.",
        "As reported by The Cricketer,, external the IOC and ICC are in negotiations with the Knight Riders over installing a square as opposed to using drop-in surfaces.",
        "\"We're very conscious about the importance of the field of play and in the case of cricket, the pitch,\" McConnell added.",
        "\"Now that we have finalised the venue, we can move forward with all of those plannings in a more concrete sense.",
        "\"I don't think it's only the T20 World Cup. I think every cricket match has commentary about the pitch and what type of play it suits.\"",
        "Get cricket news sent straight to your phone"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/olympics/articles/c77vrep0y2mo",
      "main_category": "sport",
      "detailed_category": "olympics",
      "topic": "'Back-to-back world titles would top Olympic gold'",
      "content": [
        "Olympic champion Daniel Wiffen believes that winning back-to-back World Championship titles would mean more to him than his gold medal from Paris.In a stunning 2024, Team Ireland swimmer Wiffen claimed a 1500m and 800m freestyle double at the World Championships and won a historic gold medal in the 800m at the Paris Olympics. The 23-year-old also won a bronze medal in the 1500m at the Games.\"Everyone says the hardest thing to do is to win a World Championships after an Olympics, and I'm up for the challenge,\" Wiffen told BBC Sport NI in anticipation of this year's World Championships in Singapore.\"I think winning back-to-back World Championships is going to be better than winning the Olympics for me.\"",
        "By winning his gold medal in Paris, Wiffen became the first athlete from Northern Ireland to claim Olympic gold in 36 years. He will look to replicate that form when he heads to the World Aquatics Championships in Singapore, which take place from 11 July to 3 August.After a golden 2024, Wiffen says he wants to add to his winning legacy and that has given him added motivation heading to the Worlds. \"For me, the Olympics is what everyone watches. If you can win consecutively over the next number of years then it becomes bigger than just winning an Olympics.,\" he added.\"It becomes about being how many times can you win before you lose? Then you get to the point where you keep striving for that excellence. \"You're trying to go bigger and bigger and you are bringing the curiosity of 'what happens if I do keep winning?' or 'what happens if I lose?'.\"You then use that mindset of 'if I lose here then it's not going to go very well', and that motivates you even further to keep winning. That's what I am looking forward to.\"",
        "After the Worlds, Wiffen will move his training base back to Ireland after a number of years studying and swimming at Loughborough University. He will split his time between Dublin and America, where his twin Nathan will move to at the University of California later in the year, as he builds towards the next Olympics in Los Angeles in 2028. The move will also mean the end of his successful partnership with coach Andi Manley, and Wiffen says he is undecided on who he will work with in the next stage of his career.But for now his focus is on the World Championships, where he will add the 400 metre freestyle to the longer-distance 800m and 1500m.Wiffen finished seventh in the 400m final in Doha before winning his two titles, admitting that \"sparked something in me\".\"I don't want to come in seventh place, I want to win. I'm adding it back in, I'm going to try and better seventh place as my goal. \"We'll see how it goes. I'm hoping for a medal in it. It will be tough having now swam it for a year but I'm looking forward to it and the challenge.\"He added that the 400m would be treated as a \"warm-up\" for the longer events, but he is still aiming for a podium finish. \"This is going to sound weird because I try and treat the 400m as a warm-up. Even though I want a medal in it, we're talking about trying to get that swim out of the way before the 800m. \"Sometimes you need that start-up race to have a really good race in your second one. For the 400m, it's a warm-up race but I will give it the credit and I am trying to win a medal.\"",
        "Daniel Wiffen won two golds at the World Championships and became Olympic champion in a successful 2024",
        "Olympic champion Daniel Wiffen believes that winning back-to-back World Championship titles would mean more to him than his gold medal from Paris.",
        "In a stunning 2024, Team Ireland swimmer Wiffen claimed a 1500m and 800m freestyle double at the World Championships and won a historic gold medal in the 800m at the Paris Olympics.",
        "The 23-year-old also won a bronze medal in the 1500m at the Games.",
        "\"Everyone says the hardest thing to do is to win a World Championships after an Olympics, and I'm up for the challenge,\" Wiffen told BBC Sport NI in anticipation of this year's World Championships in Singapore.",
        "\"I think winning back-to-back World Championships is going to be better than winning the Olympics for me.\"",
        "Wiffen wins Irish title with 2025's fastest time",
        "Wiffen makes history with Olympic 800m freestyle gold",
        "By winning his gold medal in Paris, Wiffen became the first athlete from Northern Ireland to claim Olympic gold in 36 years.",
        "He will look to replicate that form when he heads to the World Aquatics Championships in Singapore, which take place from 11 July to 3 August.",
        "After a golden 2024, Wiffen says he wants to add to his winning legacy and that has given him added motivation heading to the Worlds.",
        "\"For me, the Olympics is what everyone watches. If you can win consecutively over the next number of years then it becomes bigger than just winning an Olympics.,\" he added.",
        "\"It becomes about being how many times can you win before you lose? Then you get to the point where you keep striving for that excellence.",
        "\"You're trying to go bigger and bigger and you are bringing the curiosity of 'what happens if I do keep winning?' or 'what happens if I lose?'.",
        "\"You then use that mindset of 'if I lose here then it's not going to go very well', and that motivates you even further to keep winning. That's what I am looking forward to.\"",
        "After the Worlds, Wiffen will move his training base back to Ireland after a number of years studying and swimming at Loughborough University.",
        "He will split his time between Dublin and America, where his twin Nathan will move to at the University of California later in the year, as he builds towards the next Olympics in Los Angeles in 2028.",
        "The move will also mean the end of his successful partnership with coach Andi Manley, and Wiffen says he is undecided on who he will work with in the next stage of his career.",
        "But for now his focus is on the World Championships, where he will add the 400 metre freestyle to the longer-distance 800m and 1500m.",
        "Wiffen finished seventh in the 400m final in Doha before winning his two titles, admitting that \"sparked something in me\".",
        "\"I don't want to come in seventh place, I want to win. I'm adding it back in, I'm going to try and better seventh place as my goal.",
        "\"We'll see how it goes. I'm hoping for a medal in it. It will be tough having now swam it for a year but I'm looking forward to it and the challenge.\"",
        "He added that the 400m would be treated as a \"warm-up\" for the longer events, but he is still aiming for a podium finish.",
        "\"This is going to sound weird because I try and treat the 400m as a warm-up. Even though I want a medal in it, we're talking about trying to get that swim out of the way before the 800m.",
        "\"Sometimes you need that start-up race to have a really good race in your second one. For the 400m, it's a warm-up race but I will give it the credit and I am trying to win a medal.\""
      ]
    },
    {
      "url": "https://www.bbc.com/sport/cycling/articles/cly1nzz04ngo",
      "main_category": "sport",
      "detailed_category": "olympics",
      "topic": "GB's Cullen and Shriever collect World Cup wins",
      "content": [
        "Great Britain's Ross Cullen registered his first ever BMX World Cup victory with a win in round four in the Netherlands.Cullen executed a perfect run of 33.98 seconds to finish ahead of American Cameron Wood by nearly five hundredths of a second in the men's elite race.The win helped Cullen jump from 12th to fifth in the standings, on 865 points with two races remaining. Earlier in the day, Olympic champion Beth Shriever collected her first World Cup win of the season. Shriever led from the start and finished with a time of 33.072 seconds ahead of Australia's Saya Sakakibara.\"That was unreal. I needed that,\" said Shriever after the race. The 26-year-old, an Olympic gold medallist in 2021 in Tokyo, moves from sixth in the standings into fifth.",
        "Beth Shriever (left) won Olympic gold in 2021",
        "Great Britain's Ross Cullen registered his first ever BMX World Cup victory with a win in round four in the Netherlands.",
        "Cullen executed a perfect run of 33.98 seconds to finish ahead of American Cameron Wood by nearly five hundredths of a second in the men's elite race.",
        "The win helped Cullen jump from 12th to fifth in the standings, on 865 points with two races remaining.",
        "Earlier in the day, Olympic champion Beth Shriever collected her first World Cup win of the season.",
        "Shriever led from the start and finished with a time of 33.072 seconds ahead of Australia's Saya Sakakibara.",
        "\"That was unreal. I needed that,\" said Shriever after the race.",
        "The 26-year-old, an Olympic gold medallist in 2021 in Tokyo, moves from sixth in the standings into fifth."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/articles/cwyk1744vypo",
      "main_category": "sport",
      "detailed_category": "olympics",
      "topic": "Nigeria target flag football berths at LA 2028 Olympics",
      "content": [
        "Nigeria is targeting the Los Angeles 2028 Olympic Games after its men's and women's teams were both victorious at the inaugural African Flag Football Championship.The sport is a non-contact variant of American football, where players need to pull a flag off the person with the ball instead of tackling their opponent to the ground.Flag football will make its Olympic debut at LA 2028 and, as African champions, both Nigerian sides have earned direct qualification for next year's Flag Football World Championships.Oluwaseye Obatolu, the vice president of the Nigeria American Football Association (Nafa), described the nation's triumphs in Egypt on Saturday as \"deeply symbolic\".\"It was a moment of immense pride to be the first [African] nation, both men and women, to qualify for the World Championships,\" Obatolu told BBC Sport Africa.\"Our focus now is clear - we are not just attending the World Championships, we're going to compete. Our eyes are firmly set on Los Angeles 2028.\"The first African Flag Football Championship, which was organised by the International Federation of American Football (IFAF), featured a total of 11 teams from eight countries across the continent.",
        "The championship was the first in IFAF's new continental series for 2025 and a pivotal moment on the road to the sport's Olympic debut.Nigeria's men edged a thrilling final in Cairo, winning 13-12 to claim gold over the hosts.In the women's tournament, the West Africans delivered a commanding performance to defeat Morocco 26-12 to secure the title.\"For the players, it's a validation of years of dedication, often in the shadows without recognition,\" Obatolu added.\"This isn't just a win, it's the beginning of a movement for flag football in Africa.\"Tunisia and Egypt earned the bronze medal in the men's and women's tournaments respectively.\"To Nigeria American Football Association - your pride, effort and spirit led to this outstanding result,\" IFAF president Pierre Trochet said in a post on social media.\"Africa can be proud. Your champions will carry our community high!\"",
        "Nigeria's men and women have qualified for next year's Flag Football World Championships",
        "Nigeria is targeting the Los Angeles 2028 Olympic Games after its men's and women's teams were both victorious at the inaugural African Flag Football Championship.",
        "The sport is a non-contact variant of American football, where players need to pull a flag off the person with the ball instead of tackling their opponent to the ground.",
        "Flag football will make its Olympic debut at LA 2028 and, as African champions, both Nigerian sides have earned direct qualification for next year's Flag Football World Championships.",
        "Oluwaseye Obatolu, the vice president of the Nigeria American Football Association (Nafa), described the nation's triumphs in Egypt on Saturday as \"deeply symbolic\".",
        "\"It was a moment of immense pride to be the first [African] nation, both men and women, to qualify for the World Championships,\" Obatolu told BBC Sport Africa.",
        "\"Our focus now is clear - we are not just attending the World Championships, we're going to compete. Our eyes are firmly set on Los Angeles 2028.\"",
        "The first African Flag Football Championship, which was organised by the International Federation of American Football (IFAF), featured a total of 11 teams from eight countries across the continent.",
        "The championship was the first in IFAF's new continental series for 2025 and a pivotal moment on the road to the sport's Olympic debut.",
        "Nigeria's men edged a thrilling final in Cairo, winning 13-12 to claim gold over the hosts.",
        "In the women's tournament, the West Africans delivered a commanding performance to defeat Morocco 26-12 to secure the title.",
        "\"For the players, it's a validation of years of dedication, often in the shadows without recognition,\" Obatolu added.",
        "\"This isn't just a win, it's the beginning of a movement for flag football in Africa.\"",
        "Tunisia and Egypt earned the bronze medal in the men's and women's tournaments respectively.",
        "\"To Nigeria American Football Association - your pride, effort and spirit led to this outstanding result,\" IFAF president Pierre Trochet said in a post on social media.",
        "\"Africa can be proud. Your champions will carry our community high!\"",
        "NFL flag vote sees Olympic 'Dream Team' move closer",
        "Flag Football: Get to know the newest Olympic sport"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/olympics/articles/ckg3r4wvjzdo",
      "main_category": "sport",
      "detailed_category": "olympics",
      "topic": "Olympic great Chusovitina, 50, wins World Challenge Cup silver",
      "content": [
        "Uzbekistan's Oksana Chusovitina marked her 50th birthday with a silver medal in the vault at the Gymnastics World Challenge Cup - 33 years after she became an Olympic champion.Chusovitina was part of a Unified Team of athletes from post-Soviet nations that won the team all-around gold at the 1992 Barcelona Games, and has competed at eight Olympics in total.Three decades later the Uzbek, who is also a three-time world champion, is still winning medals in a sport in which most retire in their twenties.Competing in her native country at the International Gymnastics Federation's World Challenge Cup in Tashkent one day after her birthday, Chusovitina took vault silver behind Bulgaria's Valentina Georgieva - who, at 18, is 32 years her junior.Until Paris 2024, Chusovitina had competed at every summer Olympic Games since 1992.She was looking to equal the record - set by Georgian shooter Nino Salukvadze, who is the only Olympian to have competed in nine consecutive Games - for most Olympic appearances in a row last year in Paris.However, injury ruled her out of the Asian Championships, meaning she was unable to qualify.",
        "Chusovitina was inducted into the International Gymnastics Hall of Fame in 2017, and eight years later she remains the only member to still be competing after their induction.She explained before the Tokyo Games why she had not yet retired: \"I could have stopped at 25, 19, or 30, but I didn't. I realised with age I didn't get worse, I only got better, like fine wine.\" She had made it clear in February that she was targeting her home event. \"In June, on my 50th birthday, we will have a competition here in Tashkent. It will be a World Challenge Cup, and I really want to compete there so I'm keeping my fingers crossed,\" she said. Earlier this month she withdrew from the Asian Championships during the final of the vault in order to ensure she could compete in Tashkent.",
        "After her team gold in Barcelona, she represented Uzbekistan at the next three Games but, after moving to Germany when her son was diagnosed with leukaemia, she gained citizenship and switched allegiances.Her second Olympic medal was a silver in the vault while representing Germany at the 2008 Beijing Games.She represented Germany at the 2012 Games in London then switched back to Uzbekistan for the 2016 Rio Olympics - and qualified for the delayed Games in Tokyo in 2021.Chusovitina did briefly retire after the Tokyo Games, but returned to the sport just 67 days later.Speaking about the decision in 2023, she said: \"I just realised, I felt that I can do this. Why should I leave the sport if it brings me joy?\".Previously this season she had won gold at the Baku World Cup and bronze at the Cottbus World Cup.By the time athletes head out to the United States for the 2028 Games in Los Angeles, Chusovitina will be 53 years of age, but she has not ruled out a ninth trip to the Olympics.\"My number one goal is to get to Los Angeles,\" she said before this week's competition. \"But there is so much time before then, so I'm not thinking that far ahead. I go step by step, from one competition to the next. If it happens, it happens. If not, then no. But I will try, and I will give it everything I've got.\"",
        "Oksana Chusovitina competed at eight consecutive Olympic Games",
        "Uzbekistan's Oksana Chusovitina marked her 50th birthday with a silver medal in the vault at the Gymnastics World Challenge Cup - 33 years after she became an Olympic champion.",
        "Chusovitina was part of a Unified Team of athletes from post-Soviet nations that won the team all-around gold at the 1992 Barcelona Games, and has competed at eight Olympics in total.",
        "Three decades later the Uzbek, who is also a three-time world champion, is still winning medals in a sport in which most retire in their twenties.",
        "Competing in her native country at the International Gymnastics Federation's World Challenge Cup in Tashkent one day after her birthday, Chusovitina took vault silver behind Bulgaria's Valentina Georgieva - who, at 18, is 32 years her junior.",
        "Until Paris 2024, Chusovitina had competed at every summer Olympic Games since 1992.",
        "She was looking to equal the record - set by Georgian shooter Nino Salukvadze, who is the only Olympian to have competed in nine consecutive Games - for most Olympic appearances in a row last year in Paris.",
        "However, injury ruled her out of the Asian Championships, meaning she was unable to qualify.",
        "Chusovitina was inducted into the International Gymnastics Hall of Fame in 2017, and eight years later she remains the only member to still be competing after their induction.",
        "She explained before the Tokyo Games why she had not yet retired: \"I could have stopped at 25, 19, or 30, but I didn't. I realised with age I didn't get worse, I only got better, like fine wine.\"",
        "She had made it clear in February that she was targeting her home event.",
        "\"In June, on my 50th birthday, we will have a competition here in Tashkent. It will be a World Challenge Cup, and I really want to compete there so I'm keeping my fingers crossed,\" she said.",
        "Earlier this month she withdrew from the Asian Championships during the final of the vault in order to ensure she could compete in Tashkent.",
        "Oksana Chusovitina competed at the 1992 Barcelona Olympics - many gymnasts who have now retired from the sport had not even been born by then",
        "After her team gold in Barcelona, she represented Uzbekistan at the next three Games but, after moving to Germany when her son was diagnosed with leukaemia, she gained citizenship and switched allegiances.",
        "Her second Olympic medal was a silver in the vault while representing Germany at the 2008 Beijing Games.",
        "She represented Germany at the 2012 Games in London then switched back to Uzbekistan for the 2016 Rio Olympics - and qualified for the delayed Games in Tokyo in 2021.",
        "Chusovitina did briefly retire after the Tokyo Games, but returned to the sport just 67 days later.",
        "Speaking about the decision in 2023, she said: \"I just realised, I felt that I can do this. Why should I leave the sport if it brings me joy?\".",
        "Previously this season she had won gold at the Baku World Cup and bronze at the Cottbus World Cup.",
        "By the time athletes head out to the United States for the 2028 Games in Los Angeles, Chusovitina will be 53 years of age, but she has not ruled out a ninth trip to the Olympics.",
        "\"My number one goal is to get to Los Angeles,\" she said before this week's competition.",
        "\"But there is so much time before then, so I'm not thinking that far ahead. I go step by step, from one competition to the next. If it happens, it happens. If not, then no. But I will try, and I will give it everything I've got.\""
      ]
    },
    {
      "url": "https://www.bbc.com/sport/athletics/articles/cm2623g5364o",
      "main_category": "sport",
      "detailed_category": "olympics",
      "topic": "Ingebrigtsen's father cleared of abuse of Olympic champion",
      "content": [
        "Gjert Ingebrigtsen, the father and former trainer of Norwegian athletics star Jakob Ingebrigtsen, has been cleared of abusing the two-time Olympic champion, but found guilty of violence against his daughter Ingrid.In the climax of a trial that has gripped Norway, the court announced that there was insufficient evidence of Jakob's claims that his father had overseen a childhood of fear and intimidation marked by violence and threats.However, Gjert was found guilty of hitting Ingrid, now 19, in the face with a towel during a row in 2022.Gjert has been given a suspended prison sentence of 15 days for the incident and fined 10,000 Norwegian Kroner (£745). Prosecutors had sought a two-and-half-year jail sentence against the 59-year-old.Jakob, 24, won 1500m gold at the delayed Tokyo Olympics in 2021 before winning the 5,000m title at the Paris Games of 2024. He also has two world titles over the longer distance. He formally severed coaching ties from Gjert in 2022.",
        "In a 31-page verdict, the court said there was no indication of the fear Jakob claimed Gjert inspired in a long-running television documentary following the family, or a recording made of an argument during a training camp in St Moritz in 2019.\"Jakob shows no signs of fear or submission in relation to the defendant,\" the court said of the latter. \"He stands his ground and retaliates against the defendant's verbal abuse.\"Violence in close relationships can occur in secret and remain hidden from the outside world.\"However, the explanations and recordings reviewed in the preceding paragraphs are difficult to reconcile with the prosecution's claim that the defendant subjected Jakob to continuous and repeated abuse throughout the period from 2008 to 2018.\"Even though Jakob and his brothers and spouses have given credible statements, the total weight of the statements and other evidence reviewed means that the court must conclude that there is reasonable doubt about the defendant's guilt.\"Gjert oversaw a training regime that propelled Jakob and his older brothers Henrik and Filip – both European champions – onto the world stage.",
        "However, in October 2023, the three brothers wrote a joint article accusing Gjert of being\" very aggressive and controlling\" and using \"physical violence and threats as part of their upbringing.\"Jakob claimed that his father had punched and kicked him while he was still in primary school and threatened to beat him to death during one argument.Jakob, Henrik and Filip said they decided to publicly accuse their father after he hit their younger sister Ingrid in the face with a towel during a row in 2022 over whether she could go out with friends.While admitting that he was a strict father with a \"traditional and patriarchal\" style of parenting, Gjert had denied that the charges against him, saying he was \"over-protective\" of his seven children.\"This case has no winners, and today's verdict shows that all those affected have been exposed to an enormous burden that should have been avoided,\" said Gjert's lawyer John Christian Elden.",
        "Gjert Ingebrigtsen masterminded his sons' early careers before their relationship disintegrated",
        "Gjert Ingebrigtsen, the father and former trainer of Norwegian athletics star Jakob Ingebrigtsen, has been cleared of abusing the two-time Olympic champion, but found guilty of violence against his daughter Ingrid.",
        "In the climax of a trial that has gripped Norway, the court announced that there was insufficient evidence of Jakob's claims that his father had overseen a childhood of fear and intimidation marked by violence and threats.",
        "However, Gjert was found guilty of hitting Ingrid, now 19, in the face with a towel during a row in 2022.",
        "Gjert has been given a suspended prison sentence of 15 days for the incident and fined 10,000 Norwegian Kroner (£745). Prosecutors had sought a two-and-half-year jail sentence against the 59-year-old.",
        "Jakob, 24, won 1500m gold at the delayed Tokyo Olympics in 2021 before winning the 5,000m title at the Paris Games of 2024. He also has two world titles over the longer distance.",
        "He formally severed coaching ties from Gjert in 2022.",
        "'The tumult in the Ingebrigtsen fairytale was never far from the surface'",
        "My upbringing was characterised by fear - Ingebrigtsen",
        "Ingebrigtsen's father just 'overly protective' as he denies abuse",
        "In a 31-page verdict, the court said there was no indication of the fear Jakob claimed Gjert inspired in a long-running television documentary following the family, or a recording made of an argument during a training camp in St Moritz in 2019.",
        "\"Jakob shows no signs of fear or submission in relation to the defendant,\" the court said of the latter.",
        "\"He stands his ground and retaliates against the defendant's verbal abuse.",
        "\"Violence in close relationships can occur in secret and remain hidden from the outside world.",
        "\"However, the explanations and recordings reviewed in the preceding paragraphs are difficult to reconcile with the prosecution's claim that the defendant subjected Jakob to continuous and repeated abuse throughout the period from 2008 to 2018.",
        "\"Even though Jakob and his brothers and spouses have given credible statements, the total weight of the statements and other evidence reviewed means that the court must conclude that there is reasonable doubt about the defendant's guilt.\"",
        "Gjert oversaw a training regime that propelled Jakob and his older brothers Henrik and Filip – both European champions – onto the world stage.",
        "Ingebrigtsen is ranked as number one in the world over 1500m and number two over 5,000m by World Athletics",
        "However, in October 2023, the three brothers wrote a joint article accusing Gjert of being\" very aggressive and controlling\" and using \"physical violence and threats as part of their upbringing.\"",
        "Jakob claimed that his father had punched and kicked him while he was still in primary school and threatened to beat him to death during one argument.",
        "Jakob, Henrik and Filip said they decided to publicly accuse their father after he hit their younger sister Ingrid in the face with a towel during a row in 2022 over whether she could go out with friends.",
        "While admitting that he was a strict father with a \"traditional and patriarchal\" style of parenting, Gjert had denied that the charges against him, saying he was \"over-protective\" of his seven children.",
        "\"This case has no winners, and today's verdict shows that all those affected have been exposed to an enormous burden that should have been avoided,\" said Gjert's lawyer John Christian Elden."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/olympics/articles/ce397891knzo",
      "main_category": "sport",
      "detailed_category": "olympics",
      "topic": "What will Trump travel ban mean for sport?",
      "content": [
        "The United States is gearing up to host the world's two biggest sporting events in the next three years, the 2026 Fifa World Cup and 2028 Olympic Games.They are events which ordinarily see a host nation attract hundreds of thousands of visitors from across the globe.So will a new travel ban issued by US President Donald Trump have an impact on the tournaments? And what about the ban's effect on the wider world of sport?The policy places full restrictions on citizens of 12 countries entering the United States, as well as partial constraints on seven others as part of an immigration crackdown he says is needed over security threats.However, the order contains an exemption that could apply to participants in the 2026 Fifa World Cup and 2028 Olympics.Organisers of the Los Angeles 2028 Olympics say they have \"great confidence\" that the ban will not disrupt the summer Games or the preparations for them.Speaking after a meeting with the International Olympic Committee's (IOC) co-ordination commission, LA28 chair and president Casey Wasserman said: \"It was very clear in the directive that the Olympics require special consideration, and I want to thank the federal government for recognising that.\"It's very clear that the federal government understands that's an environment that they will be accommodating and provide for.\"And so we have great confidence that that will only continue.\"BBC Sport takes a closer look at the ban and its potential impact.",
        "Passport-holders from 12 nations are now outright banned from entering the United States. They are: Afghanistan, Myanmar, Chad, Republic of the Congo, Equatorial Guinea, Eritrea, Haiti, Iran, Libya, Somalia, Sudan and Yemen.Seven more countries - Burundi, Cuba, Laos, Sierra Leone, Togo, Turkmenistan and Venezuela - face significant but not full restrictions on travel.Section four of the travel ban includes a clear exemption for sports stars travelling to those competitions  - and other \"major\" sporting events.It says \"any athlete or member of an athletic team, including coaches, persons performing a necessary support role, and immediate relatives, traveling for the World Cup, Olympics, or other major sporting event as determined by the secretary of state\" can still travel to the US.\"Two hundred and six countries are preparing to come to the Games,\" said Nicole Hoevertsz, an IOC vice president who chairs the LA28 coordination commission.\"The federal government has given us that guarantee … to make sure that these participants will be able to enter the country… We are very confident that this is going to be accomplished.\"As well as the 2028 Olympic and Paralympic Games in Los Angeles, the USA will also co-host the Fifa World Cup in 2026, alongside Canada and Mexico.",
        "The text means that those participating in the two major global sports events the US will host during Trump's second term will still be able to travel. But the lack of detail around other sporting events throws open a series of important, and as yet unanswered, questions.The State Department has offered no further clarification or measurement criteria for what Secretary of State Marco Rubio will or will not consider a \"major sporting event\".\"I think people from around the world, and Americans going to these events, would want to see actions like this,\" said US state department spokesperson Tommy Pigott at a press briefing on Thursday afternoon.\"This is part of what it means to host an event. We take security concerns extremely seriously, we want people to be able to go to the World Cup and do so safely.\"The Concacaf Gold Cup, for example, begins in the USA on 15 June and Haiti are due to participate. But given the travel ban does not list the Gold Cup (which features North America, Central America and Caribbean nations) as among the exempted major events, their participation is now in doubt.The phrasing 'World Cup' is also unclear. The revamped Fifa Club World Cup, featuring 32 of the world's best club teams, will take place in the USA from 14 June to 13 July. 10 players from countries under travel restriction are on the books of the competing clubs, but whether the tournament is included in the exemption or not has not yet been clarified.Furthermore, track and field athletes often travel to the USA to participate in training camps in preparation for major meets. Though the exemptions make clear that athletes from the affected countries can travel to the Olympics in 2028, it makes no mention of their ability to attend camps in the time before then.The BBC has contacted the US State department for a response.",
        "Fans from the restricted countries have not been given an exemption for major sports events.Iran, for example, have already qualified for the 2026 World Cup, while the likes of Haiti, Sudan and Venezuela also stand a chance of qualifying.There have already been concerns over the length of time the citizens of some countries were being made to wait for US travel visas to be processed and granted. And now fans of all of those teams will be unable to travel to the tournament, as things stand. It could be argued that the restriction means those teams will suffer a competitive disadvantage, given their rivals will be able to draw on support from the stands.When asked if he was worried that ticket sales for the LA Games could be affected, Wasserman said \"no\".However, Ronan Evain, executive director of Football Supporters Europe, says, \"We're particularly concerned about the potential for selective enforcement and discrimination against fans based on our perceived political views or national origin.\"Fifa must obtain the necessary guarantees to ensure fans from all over the world are able to safely travel and attend the games.\"",
        "The proclamation does not make clear what will happen to athletes who are citizens of barred countries but currently work in the USA.The NBA, MLB and MLS all feature players who are citizens of countries now placed on the travel ban list – how those players can continue to play in the USA is uncertain.In football, for example, nine Venezuelans are currently on the books of clubs in Major League Soccer. Three of them – Ronald Hernandez of Philadelphia Union, David Martinez of Los Angeles FC, Josef Martinez of San Jose Earthquakes – are due to take part in international fixtures abroad over the next week.By the time they return to the USA, travel restrictions on Venezuelans will be in place. It is not clear whether the three, and other athletes employed by US teams across all sports, will be allowed to return after travelling abroad to compete or visit family.The involvement of seven top Afghan cricketers in Major League Cricket is also uncertain. An MLC spokesperson told BBC Sport they were \"continuing to monitor the situation and are working with the relevant authorities to minimise travel disruptions for overseas players. We continue to attract some of the best players from around the world to come over to the US to showcase their talent.\"The BBC has contacted the NBA, MLB and MLS.",
        "During his first term in office, Trump enacted a sweeping travel ban on some countries, most of which had majority Muslim populations. At the time, the MLS Players Union said it was \"deepy concerned\" about members that may be impacted and that it was \"extremely disappointed\".Trump's anti-immigration policies have also prevented some athletes from other nations taking part in scheduled events held in the USA.In 2017 the Tibetan women's soccer team were denied US visas to attend the Dallas Cup in Texas. In 2019 nine players from the Guatemalan Under-15 national soccer team were denied entry to participate in the Under-15 Concacaf Championship, and Cuba captain Yordan Santa Cruz was denied a visa for the 2019 Gold Cup.In 2017 football's world governing body Fifa warned Trump that travel bans could hinder the USA's joint bid for the 2026 World Cup. Fifa president Gianni Infantino said: \"It's obvious when it comes to Fifa competitions, any team, including the supporters and officials of that team, who qualify for a World Cup need to have access to the country, otherwise there is no World Cup. The requirements will be clear.\"That ban was eventually overturned by Trump's successor Joe Biden in 2021.Earlier this year Zambia's women's team withdrew four United States-based players from their squad for an upcoming tournament in China because of \"travel measures\" introduced by Trump.In April there were concerns that Duke University basketball star Khaman Maluach could face possible deportation after the US revoked all visas of South Sudanese passport-holders and he was advised to not leave the country in case he could not re-enter.",
        "In the years since that climbdown, Infantino appears to have been keen to cosy up to Trump.The Fifa president attended Trump's inauguration in January and was seen applauding and laughing during the Republican's speech alongside tech billionaires including Elon Musk, Mark Zuckerberg and Jeff Bezos.The speech - given by Trump after he was sworn in for his second term as president – included negative comments about neighbouring Canada and Mexico, the USA's World Cup co-hosts.During the week of the inauguration, Infantino made a series of glowing social media posts about Trump, including writing \"Donald Trump and I share a great friendship\" in an Instagram caption. In total, Infantino posted about Trump nine times in less than a week.Infantino then accompanied Trump on the latter's state visit to Saudi Arabia, before drawing the ire of Uefa and other continental bodies by delaying the start of the Fifa congress in Paraguay in order to hold a private meeting with Trump.The BBC has put questions about the travel ban to Fifa and the IOC.",
        "This video can not be played",
        "Watch: President Trump announces travel ban from \"high-risk regions\"",
        "The United States is gearing up to host the world's two biggest sporting events in the next three years, the 2026 Fifa World Cup and 2028 Olympic Games.",
        "They are events which ordinarily see a host nation attract hundreds of thousands of visitors from across the globe.",
        "So will a new travel ban issued by US President Donald Trump have an impact on the tournaments? And what about the ban's effect on the wider world of sport?",
        "The policy places full restrictions on citizens of 12 countries entering the United States, as well as partial constraints on seven others as part of an immigration crackdown he says is needed over security threats.",
        "However, the order contains an exemption that could apply to participants in the 2026 Fifa World Cup and 2028 Olympics.",
        "Organisers of the Los Angeles 2028 Olympics say they have \"great confidence\" that the ban will not disrupt the summer Games or the preparations for them.",
        "Speaking after a meeting with the International Olympic Committee's (IOC) co-ordination commission, LA28 chair and president Casey Wasserman said: \"It was very clear in the directive that the Olympics require special consideration, and I want to thank the federal government for recognising that.",
        "\"It's very clear that the federal government understands that's an environment that they will be accommodating and provide for.",
        "\"And so we have great confidence that that will only continue.\"",
        "BBC Sport takes a closer look at the ban and its potential impact.",
        "What we know about Trump's latest travel ban",
        "How countries responded to Trump's travel ban",
        "Passport-holders from 12 nations are now outright banned from entering the United States. They are: Afghanistan, Myanmar, Chad, Republic of the Congo, Equatorial Guinea, Eritrea, Haiti, Iran, Libya, Somalia, Sudan and Yemen.",
        "Seven more countries - Burundi, Cuba, Laos, Sierra Leone, Togo, Turkmenistan and Venezuela - face significant but not full restrictions on travel.",
        "Section four of the travel ban includes a clear exemption for sports stars travelling to those competitions  - and other \"major\" sporting events.",
        "It says \"any athlete or member of an athletic team, including coaches, persons performing a necessary support role, and immediate relatives, traveling for the World Cup, Olympics, or other major sporting event as determined by the secretary of state\" can still travel to the US.",
        "\"Two hundred and six countries are preparing to come to the Games,\" said Nicole Hoevertsz, an IOC vice president who chairs the LA28 coordination commission.",
        "\"The federal government has given us that guarantee … to make sure that these participants will be able to enter the country… We are very confident that this is going to be accomplished.\"",
        "As well as the 2028 Olympic and Paralympic Games in Los Angeles, the USA will also co-host the Fifa World Cup in 2026, alongside Canada and Mexico.",
        "The text means that those participating in the two major global sports events the US will host during Trump's second term will still be able to travel. But the lack of detail around other sporting events throws open a series of important, and as yet unanswered, questions.",
        "The State Department has offered no further clarification or measurement criteria for what Secretary of State Marco Rubio will or will not consider a \"major sporting event\".",
        "\"I think people from around the world, and Americans going to these events, would want to see actions like this,\" said US state department spokesperson Tommy Pigott at a press briefing on Thursday afternoon.",
        "\"This is part of what it means to host an event. We take security concerns extremely seriously, we want people to be able to go to the World Cup and do so safely.\"",
        "The Concacaf Gold Cup, for example, begins in the USA on 15 June and Haiti are due to participate. But given the travel ban does not list the Gold Cup (which features North America, Central America and Caribbean nations) as among the exempted major events, their participation is now in doubt.",
        "The phrasing 'World Cup' is also unclear. The revamped Fifa Club World Cup, featuring 32 of the world's best club teams, will take place in the USA from 14 June to 13 July. 10 players from countries under travel restriction are on the books of the competing clubs, but whether the tournament is included in the exemption or not has not yet been clarified.",
        "Furthermore, track and field athletes often travel to the USA to participate in training camps in preparation for major meets. Though the exemptions make clear that athletes from the affected countries can travel to the Olympics in 2028, it makes no mention of their ability to attend camps in the time before then.",
        "The BBC has contacted the US State department for a response.",
        "Haiti failed to get out of the group stage at the 2023 Concacaf Gold Cup, which was hosted in Canada and the United States",
        "Fans from the restricted countries have not been given an exemption for major sports events.",
        "Iran, for example, have already qualified for the 2026 World Cup, while the likes of Haiti, Sudan and Venezuela also stand a chance of qualifying.",
        "There have already been concerns over the length of time the citizens of some countries were being made to wait for US travel visas to be processed and granted. And now fans of all of those teams will be unable to travel to the tournament, as things stand. It could be argued that the restriction means those teams will suffer a competitive disadvantage, given their rivals will be able to draw on support from the stands.",
        "When asked if he was worried that ticket sales for the LA Games could be affected, Wasserman said \"no\".",
        "However, Ronan Evain, executive director of Football Supporters Europe, says, \"We're particularly concerned about the potential for selective enforcement and discrimination against fans based on our perceived political views or national origin.",
        "\"Fifa must obtain the necessary guarantees to ensure fans from all over the world are able to safely travel and attend the games.\"",
        "The proclamation does not make clear what will happen to athletes who are citizens of barred countries but currently work in the USA.",
        "The NBA, MLB and MLS all feature players who are citizens of countries now placed on the travel ban list – how those players can continue to play in the USA is uncertain.",
        "In football, for example, nine Venezuelans are currently on the books of clubs in Major League Soccer. Three of them – Ronald Hernandez of Philadelphia Union, David Martinez of Los Angeles FC, Josef Martinez of San Jose Earthquakes – are due to take part in international fixtures abroad over the next week.",
        "By the time they return to the USA, travel restrictions on Venezuelans will be in place. It is not clear whether the three, and other athletes employed by US teams across all sports, will be allowed to return after travelling abroad to compete or visit family.",
        "The involvement of seven top Afghan cricketers in Major League Cricket is also uncertain. An MLC spokesperson told BBC Sport they were \"continuing to monitor the situation and are working with the relevant authorities to minimise travel disruptions for overseas players. We continue to attract some of the best players from around the world to come over to the US to showcase their talent.\"",
        "The BBC has contacted the NBA, MLB and MLS.",
        "During his first term in office, Trump enacted a sweeping travel ban on some countries, most of which had majority Muslim populations. At the time, the MLS Players Union said it was \"deepy concerned\" about members that may be impacted and that it was \"extremely disappointed\".",
        "Trump's anti-immigration policies have also prevented some athletes from other nations taking part in scheduled events held in the USA.",
        "In 2017 the Tibetan women's soccer team were denied US visas to attend the Dallas Cup in Texas. In 2019 nine players from the Guatemalan Under-15 national soccer team were denied entry to participate in the Under-15 Concacaf Championship, and Cuba captain Yordan Santa Cruz was denied a visa for the 2019 Gold Cup.",
        "In 2017 football's world governing body Fifa warned Trump that travel bans could hinder the USA's joint bid for the 2026 World Cup. Fifa president Gianni Infantino said: \"It's obvious when it comes to Fifa competitions, any team, including the supporters and officials of that team, who qualify for a World Cup need to have access to the country, otherwise there is no World Cup. The requirements will be clear.\"",
        "That ban was eventually overturned by Trump's successor Joe Biden in 2021.",
        "Earlier this year Zambia's women's team withdrew four United States-based players from their squad for an upcoming tournament in China because of \"travel measures\" introduced by Trump.",
        "In April there were concerns that Duke University basketball star Khaman Maluach could face possible deportation after the US revoked all visas of South Sudanese passport-holders and he was advised to not leave the country in case he could not re-enter.",
        "This video can not be played",
        "Watch: South Sudan refugee becomes NBA hopeful",
        "In the years since that climbdown, Infantino appears to have been keen to cosy up to Trump.",
        "The Fifa president attended Trump's inauguration in January and was seen applauding and laughing during the Republican's speech alongside tech billionaires including Elon Musk, Mark Zuckerberg and Jeff Bezos.",
        "The speech - given by Trump after he was sworn in for his second term as president – included negative comments about neighbouring Canada and Mexico, the USA's World Cup co-hosts.",
        "During the week of the inauguration, Infantino made a series of glowing social media posts about Trump, including writing \"Donald Trump and I share a great friendship\" in an Instagram caption. In total, Infantino posted about Trump nine times in less than a week.",
        "Infantino then accompanied Trump on the latter's state visit to Saudi Arabia, before drawing the ire of Uefa and other continental bodies by delaying the start of the Fifa congress in Paraguay in order to hold a private meeting with Trump.",
        "The BBC has put questions about the travel ban to Fifa and the IOC."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/boxing/articles/c5yqwpg9dn3o",
      "main_category": "sport",
      "detailed_category": "olympics",
      "topic": "World Boxing sorry for naming Khelif in rule change",
      "content": [
        "World Boxing has apologised after Olympic champion Imane Khelif was named in the governing body's announcement of mandatory sex testing.It released its new policy last week, and singled out the Algerian, saying Khelif will not be allowed to compete in the female category of its competitions until the fighter undergoes the test.But World Boxing has told BBC Sport its president Boris van der Vorst has since written to the Algerian Boxing Federation to apologise after acknowledging that \"the athlete's privacy should have been protected\".Khelif, 26, won women's welterweight gold at the Paris Olympics last year amid a row over gender eligibility.Khelif, along with Taiwanese fighter Lin Yu-ting, was disqualified from the 2023 World Championships by previous world governing body the International Boxing Association (IBA) for allegedly failing gender eligibility tests.Khelif was cleared to compete in Paris by the International Olympic Committee (IOC), which stripped the IBA of its status as the sport's amateur world governing body in June 2023 over concerns over how it was run.The IOC said competitors were eligible for the women's division in Paris if their passports said they were female.",
        "Khelif had been set to make a competitive comeback in Eindhoven from 5-10 June.But on Friday, World Boxing said mandatory sex testing would be introduced next month \"to ensure the safety of all participants and deliver a competitive level playing field for men and women.\"It added: \"In light of plans to introduce this policy and the particular circumstances surrounding some boxers that competed at the Paris 2024 Olympic Games, World Boxing has written to the Algerian Boxing Federation to inform it that Imane Khelif will not be allowed to participate in the female category at the Eindhoven Box Cup or any World Boxing event until Imane Khelif undergoes sex testing.\"This decision reflects concerns over the safety and wellbeing of all boxers, including Imane Khelif, and aims to protect the mental and physical health of all participants in light of some of the reactions that have been expressed in relation to the boxer's potential participation at the Eindhoven Box Cup.\"World Boxing also published a letter it had sent to both Khelif and the Algerian Boxing Federation, claiming that the new eligibility rules were developed \"with the express purpose of safeguarding athletes in combat sports\" given the \"physical risks associated with Olympic-style boxing\".It also said in the letter that in \"the event the athlete's sex certification is challenged by the athlete's federation or by World Boxing\" the athlete shall be \"ineligible to compete until the dispute is resolved\".World Boxing was granted provisional recognition as the sport's international governing federation by the IOC in February 2025, and the Algerian Boxing Federation joined it in September.Khelif has always competed in the women's division and there is no suggestion the fighter identifies as anything other than a woman.Some reports took the IBA stating that Khelif has XY chromosomes to speculate that the fighter might have differences of sexual development (DSD), like runner Caster Semenya.However, the BBC has not been able to confirm whether this is or is not the case.The IOC made it clear last year this is \"not a transgender case\".In a statement on Tuesday, the IOC said it \"has always made it clear that eligibility criteria are the responsibility of the respective International Federation. The factors that matter to sports performance are unique to each sport, discipline, and/or event.\"We await the full details of how sex testing will be implemented in a safe, fair and legally enforceable way.\"World Boxing has said that its new policy is in the final stages of development, and will mean that \"all athletes over the age of 18 that want to participate in a World Boxing owned or sanctioned competition will need to undergo a PCR (polymerase chain reaction) genetic test to determine their sex at birth and their eligibility to compete.\"",
        "Imane Khelif won welterweight gold at the Olympic Games in Paris last year",
        "World Boxing has apologised after Olympic champion Imane Khelif was named in the governing body's announcement of mandatory sex testing.",
        "It released its new policy last week, and singled out the Algerian, saying Khelif will not be allowed to compete in the female category of its competitions until the fighter undergoes the test.",
        "But World Boxing has told BBC Sport its president Boris van der Vorst has since written to the Algerian Boxing Federation to apologise after acknowledging that \"the athlete's privacy should have been protected\".",
        "Khelif, 26, won women's welterweight gold at the Paris Olympics last year amid a row over gender eligibility.",
        "Khelif, along with Taiwanese fighter Lin Yu-ting, was disqualified from the 2023 World Championships by previous world governing body the International Boxing Association (IBA) for allegedly failing gender eligibility tests.",
        "Khelif was cleared to compete in Paris by the International Olympic Committee (IOC), which stripped the IBA of its status as the sport's amateur world governing body in June 2023 over concerns over how it was run.",
        "The IOC said competitors were eligible for the women's division in Paris if their passports said they were female.",
        "What does science tell us about boxing’s gender row?",
        "Khelif required to take sex test for World Boxing fights",
        "Boxing controversy - what we know and what we don't",
        "Khelif had been set to make a competitive comeback in Eindhoven from 5-10 June.",
        "But on Friday, World Boxing said mandatory sex testing would be introduced next month \"to ensure the safety of all participants and deliver a competitive level playing field for men and women.\"",
        "It added: \"In light of plans to introduce this policy and the particular circumstances surrounding some boxers that competed at the Paris 2024 Olympic Games, World Boxing has written to the Algerian Boxing Federation to inform it that Imane Khelif will not be allowed to participate in the female category at the Eindhoven Box Cup or any World Boxing event until Imane Khelif undergoes sex testing.",
        "\"This decision reflects concerns over the safety and wellbeing of all boxers, including Imane Khelif, and aims to protect the mental and physical health of all participants in light of some of the reactions that have been expressed in relation to the boxer's potential participation at the Eindhoven Box Cup.\"",
        "World Boxing also published a letter it had sent to both Khelif and the Algerian Boxing Federation, claiming that the new eligibility rules were developed \"with the express purpose of safeguarding athletes in combat sports\" given the \"physical risks associated with Olympic-style boxing\".",
        "It also said in the letter that in \"the event the athlete's sex certification is challenged by the athlete's federation or by World Boxing\" the athlete shall be \"ineligible to compete until the dispute is resolved\".",
        "World Boxing was granted provisional recognition as the sport's international governing federation by the IOC in February 2025, and the Algerian Boxing Federation joined it in September.",
        "Khelif has always competed in the women's division and there is no suggestion the fighter identifies as anything other than a woman.",
        "Some reports took the IBA stating that Khelif has XY chromosomes to speculate that the fighter might have differences of sexual development (DSD), like runner Caster Semenya.",
        "However, the BBC has not been able to confirm whether this is or is not the case.",
        "The IOC made it clear last year this is \"not a transgender case\".",
        "In a statement on Tuesday, the IOC said it \"has always made it clear that eligibility criteria are the responsibility of the respective International Federation. The factors that matter to sports performance are unique to each sport, discipline, and/or event.",
        "\"We await the full details of how sex testing will be implemented in a safe, fair and legally enforceable way.\"",
        "World Boxing has said that its new policy is in the final stages of development, and will mean that \"all athletes over the age of 18 that want to participate in a World Boxing owned or sanctioned competition will need to undergo a PCR (polymerase chain reaction) genetic test to determine their sex at birth and their eligibility to compete.\""
      ]
    },
    {
      "url": "https://www.bbc.com/sport/american-football/articles/cgq3ez7j80eo",
      "main_category": "sport",
      "detailed_category": "olympics",
      "topic": "Mahomes to leave Olympic flag football to 'the younger guys'",
      "content": [
        "Kansas City Chiefs quarterback Patrick Mahomes has ruled out playing flag football at the Los Angeles 2028 Olympics.NFL team owners agreed last week to allow NFL players to participate in flag football's Olympic debut.Mahomes, 29, had previously said he \"definitely wants to\" play but this week the NFL's two-time Most Valuable Player said he will leave representing the United States to \"the younger guys\".The three-time Super Bowl winner would turn 33 shortly after the LA Games take place in July 2028.Speaking during the Chiefs' off-season organised team activities (OTAs), Mahomes said: \"I'll probably leave that to the younger guys. I'll be a little older by the time that comes around.\"It's awesome. Honestly, just to be able to showcase the NFL to the whole world through flag football.\"",
        "Last week's vote opened up the possibility of there being another 'Dream Team', like the US men's basketball team at the 1992 Games.The Barcelona Olympics were the first to feature NBA players and Team USA's gold-medal winners are still regarded as one of the best teams ever.The six qualifying nations for flag football at LA 2028 will feature 10 players per team.Each nation may select one player per NFL team so, in theory, Team USA could be made up of 10 NFL players from 10 different teams.",
        "Patrick Mahomes has led Kansas City to three Super Bowl wins in the past six years",
        "Kansas City Chiefs quarterback Patrick Mahomes has ruled out playing flag football at the Los Angeles 2028 Olympics.",
        "NFL team owners agreed last week to allow NFL players to participate in flag football's Olympic debut.",
        "Mahomes, 29, had previously said he \"definitely wants to\" play but this week the NFL's two-time Most Valuable Player said he will leave representing the United States to \"the younger guys\".",
        "The three-time Super Bowl winner would turn 33 shortly after the LA Games take place in July 2028.",
        "Speaking during the Chiefs' off-season organised team activities (OTAs), Mahomes said: \"I'll probably leave that to the younger guys. I'll be a little older by the time that comes around.",
        "\"It's awesome. Honestly, just to be able to showcase the NFL to the whole world through flag football.\"",
        "How Taylor Swift is inspiring girls to follow Olympic dream",
        "Could there be an NFL Dream Team at LA 2028?",
        "Flag Football: Get to know the newest Olympic sport",
        "Last week's vote opened up the possibility of there being another 'Dream Team', like the US men's basketball team at the 1992 Games.",
        "The Barcelona Olympics were the first to feature NBA players and Team USA's gold-medal winners are still regarded as one of the best teams ever.",
        "The six qualifying nations for flag football at LA 2028 will feature 10 players per team.",
        "Each nation may select one player per NFL team so, in theory, Team USA could be made up of 10 NFL players from 10 different teams.",
        "NFL fixtures and results",
        "Get American Football news sent straight to your phone"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/rugby-union/articles/c5yxwd3r44do",
      "main_category": "sport",
      "detailed_category": "olympics",
      "topic": "Players' union 'immensely disappointed' as Ireland men's sevens cut",
      "content": [
        "Rugby Players Ireland chief executive Simon Keogh says the organisation is \"immensely disappointed\" by the decision to cut the Ireland men's sevens team at the end of the 2024-25 season. On Wednesday, the Irish Rugby Football Union (IRFU) confirmed the cessation of the men's sevens programme as \"part of a broader strategic effort to ensure long-term financial sustainability\". In November, the IRFU's financial results showed an 18m euro (£15.1m) deficit for the 2023-24 season. The women's programme, however, is unaffected and will remain a \"key development pathway\" for the women's XVs game, the union added.\"Through adversity, these individuals have continued to represent Ireland with pride and commitment, and they deserve every assistance as they take the next step in their professional careers, on or off the pitch,\" said Keogh. \"We must also pay tribute to all those who have gone before them. In recent seasons, the Irish Men's Sevens have scaled unprecedented heights, earning great respect on the global stage. \"This news will be disheartening to a group that worked tirelessly to bring Ireland to the top tier of Sevens rugby.\"Keogh added that Rugby Players Ireland's main priority remains the players' \"ongoing fair treatment and wellbeing\".",
        "In its statement on Wednesday, the IRFU said a review concluded that the men's sevens programme \"does not contribute as a development pathway for the XVs game\", adding that the provincial academy structures are offering \"greater development opportunities\". \"The financial situation we face is challenging, and it's crucial that we take decisive action to secure the long-term success of Irish Rugby,\" said IRFU high performance director David Humphreys. \"While the decision to end the men's sevens programme is a difficult one, it is necessary in order to ensure that our resources are focused on the areas that will have the greatest impact on the future of the game in Ireland. \"We are committed to making sure that this transition is handled with the utmost respect for all those who have contributed to the success of the sevens programme.\"The men's sevens side played their last tournament in Los Angles earlier this month, finishing 11th and suffering relegation in the World SVNS Series.They reached two Olympic Games in Tokyo in 2021 and in Paris last summer, finishing 10th in Japan and sixth in France.Ulster trio Nick Timoney, Robert Baloucoune and Zac Ward all played for Ireland's sevens side as did established Ireland 15s international Tadgh Beirne.Ward, alongside Leinster and Ireland 15s international Hugo Keenan, featured in the sevens Olympics squad in Paris.IRFU CEO Kevin Potts said that he was \"very proud\" of everything the sevens side has achieved.\"We would like to thank everyone who has contributed to the success of the men's sevens programme, especially in achieving qualification for the Tokyo and Paris Olympic games.\"Their unwavering dedication, hard work and skill played a vital role in elevating the profile of sevens rugby in Ireland.\"",
        "Ireland were knocked out in the quarter-finals of the Rugby Sevens at last summer's Olympics in Paris",
        "Rugby Players Ireland chief executive Simon Keogh says the organisation is \"immensely disappointed\" by the decision to cut the Ireland men's sevens team at the end of the 2024-25 season.",
        "On Wednesday, the Irish Rugby Football Union (IRFU) confirmed the cessation of the men's sevens programme as \"part of a broader strategic effort to ensure long-term financial sustainability\".",
        "In November, the IRFU's financial results showed an 18m euro (£15.1m) deficit for the 2023-24 season.",
        "The women's programme, however, is unaffected and will remain a \"key development pathway\" for the women's XVs game, the union added.",
        "\"Through adversity, these individuals have continued to represent Ireland with pride and commitment, and they deserve every assistance as they take the next step in their professional careers, on or off the pitch,\" said Keogh.",
        "\"We must also pay tribute to all those who have gone before them. In recent seasons, the Irish Men's Sevens have scaled unprecedented heights, earning great respect on the global stage.",
        "\"This news will be disheartening to a group that worked tirelessly to bring Ireland to the top tier of Sevens rugby.\"",
        "Keogh added that Rugby Players Ireland's main priority remains the players' \"ongoing fair treatment and wellbeing\".",
        "Ireland 15s and Leinster star Hugo Keenan is one of a number of established Irish internationals to play for the sevens side",
        "In its statement on Wednesday, the IRFU said a review concluded that the men's sevens programme \"does not contribute as a development pathway for the XVs game\", adding that the provincial academy structures are offering \"greater development opportunities\".",
        "\"The financial situation we face is challenging, and it's crucial that we take decisive action to secure the long-term success of Irish Rugby,\" said IRFU high performance director David Humphreys.",
        "\"While the decision to end the men's sevens programme is a difficult one, it is necessary in order to ensure that our resources are focused on the areas that will have the greatest impact on the future of the game in Ireland.",
        "\"We are committed to making sure that this transition is handled with the utmost respect for all those who have contributed to the success of the sevens programme.\"",
        "The men's sevens side played their last tournament in Los Angles earlier this month, finishing 11th and suffering relegation in the World SVNS Series.",
        "They reached two Olympic Games in Tokyo in 2021 and in Paris last summer, finishing 10th in Japan and sixth in France.",
        "Ulster trio Nick Timoney, Robert Baloucoune and Zac Ward all played for Ireland's sevens side as did established Ireland 15s international Tadgh Beirne.",
        "Ward, alongside Leinster and Ireland 15s international Hugo Keenan, featured in the sevens Olympics squad in Paris.",
        "IRFU CEO Kevin Potts said that he was \"very proud\" of everything the sevens side has achieved.",
        "\"We would like to thank everyone who has contributed to the success of the men's sevens programme, especially in achieving qualification for the Tokyo and Paris Olympic games.",
        "\"Their unwavering dedication, hard work and skill played a vital role in elevating the profile of sevens rugby in Ireland.\""
      ]
    },
    {
      "url": "https://www.bbc.com/sport/hockey/articles/cp8dnp2ly7do",
      "main_category": "sport",
      "detailed_category": "olympics",
      "topic": "GB's Olympic champion Pearne-Webb retires",
      "content": [
        "Great Britain's Olympic champion and captain Hollie Pearne-Webb has announced her retirement from hockey.Pearne-Webb scored Team GB's winning goal in a shootout against the Netherlands at the Rio 2016 Games to secure a first Olympic title for the women's team.The 34-year-old, who made her senior debut in 2013, also captained the side to Olympic bronze at Tokyo 2020.Pearne-Webb, who led England to Commonwealth Games gold in 2022, said taking the decision to retire had been \"incredibly tough\" and her time in the sport had been \"the honour of a lifetime\".",
        "\"It's hard to put into words just how much this sport has given me,\" Pearne-Webb said.\"What started as a dream when I was just eight years old - to one day play for my country at the Olympics - became a journey that's been greater than anything I could have imagined.\"One of the greatest honours has been leading England and Great Britain over the past six years. Captaining this team at two Olympic Games and a home Commonwealth Games has been an immense privilege. \"Walking the team out last summer in Paris, in front of friends and family, was a truly special moment and one I'll never forget.\"Pearne-Webb amassed 274 combined caps, including appearances at three Olympic Games.Five years after scoring the gold medal-winning goal in Rio, Pearne-Webb captained GB to another Olympic podium when they beat India 4-3 to win bronze in Tokyo. One year later she led England's women to a first Commonwealth Games gold, beating Australia in the final in Birmingham.Great Britain reached the quarter-finals at the Paris Games last year, losing to eventual champions the Netherlands.\"I'll always be proud to have worn the shirt, and I'll always be a supporter of the incredible players coming through,\" said Pearne-Webb.\"Hockey has shown me that anything is possible - and I'll forever be thankful for that.\"Thank you, hockey. It's been the honour of a lifetime.\"",
        "Hollie Pearne-Webb has ended her 12-year senior international career",
        "Great Britain's Olympic champion and captain Hollie Pearne-Webb has announced her retirement from hockey.",
        "Pearne-Webb scored Team GB's winning goal in a shootout against the Netherlands at the Rio 2016 Games to secure a first Olympic title for the women's team.",
        "The 34-year-old, who made her senior debut in 2013, also captained the side to Olympic bronze at Tokyo 2020.",
        "Pearne-Webb, who led England to Commonwealth Games gold in 2022, said taking the decision to retire had been \"incredibly tough\" and her time in the sport had been \"the honour of a lifetime\".",
        "\"It's hard to put into words just how much this sport has given me,\" Pearne-Webb said.",
        "\"What started as a dream when I was just eight years old - to one day play for my country at the Olympics - became a journey that's been greater than anything I could have imagined.",
        "\"One of the greatest honours has been leading England and Great Britain over the past six years. Captaining this team at two Olympic Games and a home Commonwealth Games has been an immense privilege.",
        "\"Walking the team out last summer in Paris, in front of friends and family, was a truly special moment and one I'll never forget.\"",
        "Pearne-Webb amassed 274 combined caps, including appearances at three Olympic Games.",
        "Five years after scoring the gold medal-winning goal in Rio, Pearne-Webb captained GB to another Olympic podium when they beat India 4-3 to win bronze in Tokyo.",
        "One year later she led England's women to a first Commonwealth Games gold, beating Australia in the final in Birmingham.",
        "Great Britain reached the quarter-finals at the Paris Games last year, losing to eventual champions the Netherlands.",
        "\"I'll always be proud to have worn the shirt, and I'll always be a supporter of the incredible players coming through,\" said Pearne-Webb.",
        "\"Hockey has shown me that anything is possible - and I'll forever be thankful for that.",
        "\"Thank you, hockey. It's been the honour of a lifetime.\"",
        "Hollie Pearne-Webb won two Olympic medals, three Commonwealth Games medals and three medals at European Championships"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/olympics/articles/cvg5deg250yo",
      "main_category": "sport",
      "detailed_category": "olympics",
      "topic": "LA28 Olympic opening ceremony to be held in two stadiums",
      "content": [
        "Los Angeles will become the first city to incorporate two stadiums into an Olympics opening ceremony when it hosts the Games in 2028.Both the Los Angeles Memorial Coliseum and the SoFi Stadium will host the event on 14 July 2028, organisers of LA28 have confirmed.The Coliseum, which was used at the 1932 and 1984 Olympics, also hosts the closing ceremony on 30 July and becomes the first venue to hold events across three Games.The SoFi Stadium, home to NFL sides the Los Angeles Rams and Los Angeles Chargers, will host the Paralympics opening ceremony on 15 August with the event closing at the Coliseum on 27 August.\"The venues selected for the 2028 opening and closing ceremonies will highlight Los Angeles' rich sporting history and cutting-edge future, showcasing the very best that LA has to offer on the world stage,\" LA28 chair Casey Wasserman said.\"These two extraordinary venues will create an unforgettable experience, welcoming fans from across the globe to an Olympic and Paralympic Games like never before and concluding what will go down as one of the most-incredible Games in history.\"Details of the opening ceremony, including how the two stadiums will be used, are yet to be confirmed.The Coliseum, which is home to Collegiate American football side the USC Trojans, will hold the track and field events during the first week at the Olympics.The SoFi Stadium is set to host the swimming competitions in week two.A number of sports have been reinstated at the Olympics in Los Angeles following an absence from the Games, including cricket, lacrosse and squash, while flag football will make its debut.",
        "The Los Angeles Memorial Coliseum was used at the 1932 and 1984 Games",
        "Los Angeles will become the first city to incorporate two stadiums into an Olympics opening ceremony when it hosts the Games in 2028.",
        "Both the Los Angeles Memorial Coliseum and the SoFi Stadium will host the event on 14 July 2028, organisers of LA28 have confirmed.",
        "The Coliseum, which was used at the 1932 and 1984 Olympics, also hosts the closing ceremony on 30 July and becomes the first venue to hold events across three Games.",
        "The SoFi Stadium, home to NFL sides the Los Angeles Rams and Los Angeles Chargers, will host the Paralympics opening ceremony on 15 August with the event closing at the Coliseum on 27 August.",
        "\"The venues selected for the 2028 opening and closing ceremonies will highlight Los Angeles' rich sporting history and cutting-edge future, showcasing the very best that LA has to offer on the world stage,\" LA28 chair Casey Wasserman said.",
        "\"These two extraordinary venues will create an unforgettable experience, welcoming fans from across the globe to an Olympic and Paralympic Games like never before and concluding what will go down as one of the most-incredible Games in history.\"",
        "Details of the opening ceremony, including how the two stadiums will be used, are yet to be confirmed.",
        "The Coliseum, which is home to Collegiate American football side the USC Trojans, will hold the track and field events during the first week at the Olympics.",
        "The SoFi Stadium is set to host the swimming competitions in week two.",
        "A number of sports have been reinstated at the Olympics in Los Angeles following an absence from the Games, including cricket, lacrosse and squash, while flag football will make its debut."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/olympics/articles/c3evgzwdx11o",
      "main_category": "sport",
      "detailed_category": "olympics",
      "topic": "IOC replaces swimmer's medals destroyed in LA fires",
      "content": [
        "Olympic champion swimmer Gary Hall Jr has been presented with replicas of the 10 medals he won across three Games after the originals were destroyed during the Los Angeles wildfires.The 50-year-old American received the medals from International Olympic Committee President Thomas Bach during a ceremony in Lausanne.\"Thank you for the medals,\" Hall Jr said. \"Never before have 10 Olympic medals been replaced, probably because no one has lost 10 medals before. \"I will do a better job at taking care of these.\"The realisation through this process, that outweighs any sense of loss, is this word solidarity and what it means, which cannot be taken away.\"Hall won five gold, three silver and two bronze medals while competing for the United States at the 1996, 2000 and 2004 Olympic Games in Atlanta, Sydney and Athens respectively.But as the wildfires that killed at least 29 people and destroyed large areas of Los Angeles took hold in January, he was forced to abandon his Pacific Palisades home and leave the medals behind.\"When we were reading your tragic story of losing your house and all your possessions and all your worldly properties, this was going straight to our heart,\" Bach said.Los Angeles will host the next summer Olympics in 2028.",
        "Gary Hall Jr swam for the USA at the Atlanta, Sydney and Athens Olympics",
        "Olympic champion swimmer Gary Hall Jr has been presented with replicas of the 10 medals he won across three Games after the originals were destroyed during the Los Angeles wildfires.",
        "The 50-year-old American received the medals from International Olympic Committee President Thomas Bach during a ceremony in Lausanne.",
        "\"Thank you for the medals,\" Hall Jr said. \"Never before have 10 Olympic medals been replaced, probably because no one has lost 10 medals before.",
        "\"I will do a better job at taking care of these.",
        "\"The realisation through this process, that outweighs any sense of loss, is this word solidarity and what it means, which cannot be taken away.\"",
        "Hall won five gold, three silver and two bronze medals while competing for the United States at the 1996, 2000 and 2004 Olympic Games in Atlanta, Sydney and Athens respectively.",
        "But as the wildfires that killed at least 29 people and destroyed large areas of Los Angeles took hold in January, he was forced to abandon his Pacific Palisades home and leave the medals behind.",
        "\"When we were reading your tragic story of losing your house and all your possessions and all your worldly properties, this was going straight to our heart,\" Bach said.",
        "Los Angeles will host the next summer Olympics in 2028."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/boxing/articles/cwynzjjzqngo",
      "main_category": "sport",
      "detailed_category": "olympics",
      "topic": "Olympic medallist Richardson turns professional",
      "content": [
        "Olympic bronze medallist Lewis Richardson has turned professional, ending months of deliberation about his future. The 27-year-old was Britain's only boxing medallist in Paris last year, winning two bouts before losing to Mexico's Marco Verde on a 3-2 split decision in the light-middleweight semi-finals.Richardson, from Colchester, has joined Frank Warren's Queensberry Promotions stable after GB Boxing confirmed on Thursday that he was no longer a member of their World Class Programme.The date and venue of his first professional bout has yet to be confirmed.\"My inspiration as a professional is to go all the way, to win a world title. I remember watching the likes of Joe Calzaghe, Richie Woodhall and in more recent years, of course, the likes of Tyson Fury,\" Richardson said in a Queensberry video. \"Years and years of experience, Frank has. It gives you goosebumps knowing you are joining a very illustrious group of fighters.\"Promoter Warren said he had signed Richardson because he was an \"A-star amateur\" who will make his mark on the pro ranks very quickly.",
        "Richardson originally took up boxing as a way of keeping fit for football, but became a national schoolboy champion in 2012.His amateur career was interrupted by stress fractures in his back but he achieved a medal double in 2022, winning silver at the European Championships in Armenia and bronze at the Commonwealth Games in Birmingham.He followed that with more success in Paris but said last November that he wanted more time to \"navigate my path\" between turning pro or aiming for the 2028 Los Angeles Olympics.In a post on X, GB Boxing said: \"We thank you for your commitment to the WCP since joining us back in January 2018.\"Wishing you all the very best for the future, forever a part of the GB Boxing family.\"",
        "Lewis Richardson's Olympic bronze followed a European silver and Commonwealth Games bronze in 2022",
        "Olympic bronze medallist Lewis Richardson has turned professional, ending months of deliberation about his future.",
        "The 27-year-old was Britain's only boxing medallist in Paris last year, winning two bouts before losing to Mexico's Marco Verde on a 3-2 split decision in the light-middleweight semi-finals.",
        "Richardson, from Colchester, has joined Frank Warren's Queensberry Promotions stable after GB Boxing confirmed on Thursday that he was no longer a member of their World Class Programme.",
        "The date and venue of his first professional bout has yet to be confirmed.",
        "\"My inspiration as a professional is to go all the way, to win a world title. I remember watching the likes of Joe Calzaghe, Richie Woodhall and in more recent years, of course, the likes of Tyson Fury,\" Richardson said in a Queensberry video.",
        "\"Years and years of experience, Frank has. It gives you goosebumps knowing you are joining a very illustrious group of fighters.\"",
        "Promoter Warren said he had signed Richardson because he was an \"A-star amateur\" who will make his mark on the pro ranks very quickly.",
        "Richardson still 'navigating path' to pro ranks",
        "Paris medallist Richardson plans early pro switch",
        "Lewis Richardson lands a right jab on Marco Verde during their Olympic semi-final bout",
        "Richardson originally took up boxing as a way of keeping fit for football, but became a national schoolboy champion in 2012.",
        "His amateur career was interrupted by stress fractures in his back but he achieved a medal double in 2022, winning silver at the European Championships in Armenia and bronze at the Commonwealth Games in Birmingham.",
        "He followed that with more success in Paris but said last November that he wanted more time to \"navigate my path\" between turning pro or aiming for the 2028 Los Angeles Olympics.",
        "In a post on X, GB Boxing said: \"We thank you for your commitment to the WCP since joining us back in January 2018.",
        "\"Wishing you all the very best for the future, forever a part of the GB Boxing family.\"",
        "Boxing schedule and results 2025",
        "Watch every Born to Brawl episode",
        "Notifications, social media and more with BBC Sport"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/olympics/articles/cn4jgl2kn3vo",
      "main_category": "sport",
      "detailed_category": "olympics",
      "topic": "Biles undecided on competing at LA 2028",
      "content": [
        "Simone Biles has said she is unsure if she will compete at the 2028 Olympics in Los Angeles.The American is the world's most-decorated gymnast and has won seven Olympic gold medals, with three of those coming at the 2024 Games in Paris.The 28-year-old won gold in the team, all-around and vault competitions in the French capital after she had withdrawn from a number of events from the previous Olympics in Tokyo with the 'twisties' - a disorientating mental block.\"I have accomplished so much in my sport. For me to come back, I would really need to be excited by it,\" Biles told French sports newspaper L'Equipe., external\"You're going to tell me that the perspective of the Games in Los Angeles is fascinating. And I will be there, whether on the apparatus or in the stands, I still haven't decided.\"Biles previously said she felt like a failure following a disappointing Tokyo Olympics in which she was aiming for six gold medals but instead left with a silver and bronze.She added that \"2028 seems so far away\" and \"my body ages\". \"I felt it in Paris,\" said Biles, who was crowned Sportswoman of the Year for a record-equalling fourth time at the Laureus World Sports Awards.\"At the end of the competition, I went back to the village, I took the elevator and my body literally collapsed - I got sick for 10 days.\"So, to be honest, I don't know. We'll see.\"",
        "Biles has seven Olympic gold medals and 23 World Championship golds",
        "Simone Biles has said she is unsure if she will compete at the 2028 Olympics in Los Angeles.",
        "The American is the world's most-decorated gymnast and has won seven Olympic gold medals, with three of those coming at the 2024 Games in Paris.",
        "The 28-year-old won gold in the team, all-around and vault competitions in the French capital after she had withdrawn from a number of events from the previous Olympics in Tokyo with the 'twisties' - a disorientating mental block.",
        "\"I have accomplished so much in my sport. For me to come back, I would really need to be excited by it,\" Biles told French sports newspaper L'Equipe., external",
        "\"You're going to tell me that the perspective of the Games in Los Angeles is fascinating. And I will be there, whether on the apparatus or in the stands, I still haven't decided.\"",
        "Biles previously said she felt like a failure following a disappointing Tokyo Olympics in which she was aiming for six gold medals but instead left with a silver and bronze.",
        "She added that \"2028 seems so far away\" and \"my body ages\".",
        "\"I felt it in Paris,\" said Biles, who was crowned Sportswoman of the Year for a record-equalling fourth time at the Laureus World Sports Awards.",
        "\"At the end of the competition, I went back to the village, I took the elevator and my body literally collapsed - I got sick for 10 days.",
        "\"So, to be honest, I don't know. We'll see.\""
      ]
    },
    {
      "url": "https://www.bbc.com/sport/cricket/articles/c0jzdqqjejwo",
      "main_category": "sport",
      "detailed_category": "olympics",
      "topic": "Talks over GB cricket team for LA 2028 Olympics",
      "content": [
        "Discussions are taking place about the formation of a Great Britain cricket team that could compete at the Los Angeles 2028 Olympic Games.The talks between the England and Wales Cricket Board (ECB) and Cricket Scotland to establish a Team GB side have begun as the sport prepares to make its return to the Games.Cricket Scotland chief executive Trudy Lindblade told BBC Radio 4: \"We have a really good working relationship with the ECB, so we have been in talks with them and [we're] in the process of establishing a Team GB cricket entity.\"That's what's required by the British Olympic Association (BOA) for a British team to compete at the Olympic Games.\"The ECB has confirmed those discussions to BBC Sport.Olympic cricket events at LA 2028 will be played as six-team T20 tournaments for both men and women, the International Olympic Committee announced last week.\"So it's really interesting, the six teams for us, we would have an opportunity through the GB concept,\" Lindblade said.Participating teams will be able to field squads of up to 15 players, but the qualification process has not yet been confirmed.\"There's a lot to come in terms of how qualification takes place, not just for those six teams but how - if a GB team were to qualify - we have selection within that,\" Lindblade added.\"So, exciting times, and we'll continue to liaise with the ECB and our colleagues at LA 2028 and ICC. It will be interesting.\"Cricket's only previous appearance at the Olympics was at Paris 1900.On that occasion, Great Britain won by 158 runs against France in a one-off final, after the Netherlands and Belgium withdrew.The BOA said in August it hopes to enter a men's football team into the 2028 Games, uniting the England, Scotland, Wales and Northern Ireland Football Associations to field a first Team GB men's Olympic side since London 2012.England were the nominated nation to attempt to qualify on behalf of Team GB for the women's football competition at the Paris 2024 Games, but they fell short in their Nations League campaign.",
        "LA 2028 will be the first Olympic Games to feature cricket since 1900",
        "Discussions are taking place about the formation of a Great Britain cricket team that could compete at the Los Angeles 2028 Olympic Games.",
        "The talks between the England and Wales Cricket Board (ECB) and Cricket Scotland to establish a Team GB side have begun as the sport prepares to make its return to the Games.",
        "Cricket Scotland chief executive Trudy Lindblade told BBC Radio 4: \"We have a really good working relationship with the ECB, so we have been in talks with them and [we're] in the process of establishing a Team GB cricket entity.",
        "\"That's what's required by the British Olympic Association (BOA) for a British team to compete at the Olympic Games.\"",
        "The ECB has confirmed those discussions to BBC Sport.",
        "Olympic cricket events at LA 2028 will be played as six-team T20 tournaments for both men and women, the International Olympic Committee announced last week.",
        "\"So it's really interesting, the six teams for us, we would have an opportunity through the GB concept,\" Lindblade said.",
        "Participating teams will be able to field squads of up to 15 players, but the qualification process has not yet been confirmed.",
        "\"There's a lot to come in terms of how qualification takes place, not just for those six teams but how - if a GB team were to qualify - we have selection within that,\" Lindblade added.",
        "\"So, exciting times, and we'll continue to liaise with the ECB and our colleagues at LA 2028 and ICC. It will be interesting.\"",
        "Cricket's only previous appearance at the Olympics was at Paris 1900.",
        "On that occasion, Great Britain won by 158 runs against France in a one-off final, after the Netherlands and Belgium withdrew.",
        "The BOA said in August it hopes to enter a men's football team into the 2028 Games, uniting the England, Scotland, Wales and Northern Ireland Football Associations to field a first Team GB men's Olympic side since London 2012.",
        "England were the nominated nation to attempt to qualify on behalf of Team GB for the women's football competition at the Paris 2024 Games, but they fell short in their Nations League campaign.",
        "Get cricket news sent straight to your phone"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/olympics/articles/ceqryqrg7djo",
      "main_category": "sport",
      "detailed_category": "olympics",
      "topic": "Fairground to host cricket at LA 2028 Olympics",
      "content": [
        "The cricket tournament at the Olympic Games in Los Angeles in 2028 will be played at a temporary stadium in Pomona, a southern Californian city about an hour's drive from the athletes' village.A source close to the LA 2028 organising committee told BBC Sport that a number of potential venues were explored during the planning stage.That included holding the event in a city on the East Coast of the United States, such as New York, where time zones would be more appealing to the sizable television market in India.However, it was said to be a \"priority\" for organisers to keep the six-team event at a venue within Los Angeles County which also met financial and logistical criteria.A desire for cricket's top players to stay at the athletes' village, based at the University of California, and rub shoulders with fellow Olympians meant other venues were overlooked. That included the Oakland Coliseum, the former home of the Oakland Athletics baseball team, which is being adapted for cricket and will host games in Major League Cricket - the country's T20 franchise league - later this year.The site chosen for the event in Pomona is the Fairgrounds, officially know as Fairplex, which has held the Los Angeles County Fair since 1922 and is a year-round venue for concerts, trade shows, sports and cultural events.A purpose-built cricket stadium will be constructed on the site for the Games and then disassembled after the event has finished, in a similar manner to the ground used in New York for last year's T20 World Cup.LA 2028 officials are understood to have visited the Fairplex two months ago for a final inspection before an agreement was reached with the non-profit organisation who administer the 500-acre site.",
        "Fairplex has an existing grandstand, which was built in 1932 and holds 8,000 spectators. It is set to be renovated this year, but it is not yet certain if this will be incorporated into stadium plans.The site has previously held concerts for between 40,000 and 60,000 people.The International Cricket Council (ICC), International Olympic Committee (IOC) and LA 2028 organising committee worked together over the choice of the venue.However, it is understood LA 2028 organisers and the IOC had the final say. ICC chair Jay Shah said he \"looked forward to collaborating\" with the IOC to make \"cricket a huge success there\".\"It will be a fantastic opportunity to expand traditional boundaries when it features in the Olympics in the fast-paced, exciting T20 format that should appeal to new audiences,\" said Shah.The prospect of a temporary venue for matches will once again raise concerns over the use of drop-in pitches.For the 2024 T20 World Cup, which was co-hosted by the United States, an eye-catching 34,000-seat pop-up stadium was built in New York.However, the drop-in pitches at the Nassau County International Cricket Stadium in Eisenhower Park came under intense scrutiny after they played poorly.  Cricket's only previous appearance at the Olympics was at Paris 1900, when Great Britain won by 158 runs against France in a one-off final, after the Netherlands and Belgium withdrew.The England and Wales Cricket Board is understood to have held preliminary talks with Cricket Scotland about plans to field a TeamGB side, with the ICC set to determine the qualification process for the Games.",
        "American rapper Snoop Dogg performed at the official handover for LA 2028",
        "The cricket tournament at the Olympic Games in Los Angeles in 2028 will be played at a temporary stadium in Pomona, a southern Californian city about an hour's drive from the athletes' village.",
        "A source close to the LA 2028 organising committee told BBC Sport that a number of potential venues were explored during the planning stage.",
        "That included holding the event in a city on the East Coast of the United States, such as New York, where time zones would be more appealing to the sizable television market in India.",
        "However, it was said to be a \"priority\" for organisers to keep the six-team event at a venue within Los Angeles County which also met financial and logistical criteria.",
        "A desire for cricket's top players to stay at the athletes' village, based at the University of California, and rub shoulders with fellow Olympians meant other venues were overlooked.",
        "That included the Oakland Coliseum, the former home of the Oakland Athletics baseball team, which is being adapted for cricket and will host games in Major League Cricket - the country's T20 franchise league - later this year.",
        "The site chosen for the event in Pomona is the Fairgrounds, officially know as Fairplex, which has held the Los Angeles County Fair since 1922 and is a year-round venue for concerts, trade shows, sports and cultural events.",
        "A purpose-built cricket stadium will be constructed on the site for the Games and then disassembled after the event has finished, in a similar manner to the ground used in New York for last year's T20 World Cup.",
        "LA 2028 officials are understood to have visited the Fairplex two months ago for a final inspection before an agreement was reached with the non-profit organisation who administer the 500-acre site.",
        "Cricket at LA 2028 will be six-team T20 tournament",
        "US cricket awaits its authentic Donald Duck moment",
        "Fairplex has an existing grandstand, which was built in 1932 and holds 8,000 spectators. It is set to be renovated this year, but it is not yet certain if this will be incorporated into stadium plans.",
        "The site has previously held concerts for between 40,000 and 60,000 people.",
        "The International Cricket Council (ICC), International Olympic Committee (IOC) and LA 2028 organising committee worked together over the choice of the venue.",
        "However, it is understood LA 2028 organisers and the IOC had the final say.",
        "ICC chair Jay Shah said he \"looked forward to collaborating\" with the IOC to make \"cricket a huge success there\".",
        "\"It will be a fantastic opportunity to expand traditional boundaries when it features in the Olympics in the fast-paced, exciting T20 format that should appeal to new audiences,\" said Shah.",
        "The prospect of a temporary venue for matches will once again raise concerns over the use of drop-in pitches.",
        "For the 2024 T20 World Cup, which was co-hosted by the United States, an eye-catching 34,000-seat pop-up stadium was built in New York.",
        "However, the drop-in pitches at the Nassau County International Cricket Stadium in Eisenhower Park came under intense scrutiny after they played poorly.",
        "Cricket's only previous appearance at the Olympics was at Paris 1900, when Great Britain won by 158 runs against France in a one-off final, after the Netherlands and Belgium withdrew.",
        "The England and Wales Cricket Board is understood to have held preliminary talks with Cricket Scotland about plans to field a TeamGB side, with the ICC set to determine the qualification process for the Games."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/olympics/articles/c798plqe19po",
      "main_category": "sport",
      "detailed_category": "olympics",
      "topic": "Brisbane to build 63,000-seater stadium for 2032 Games",
      "content": [
        "A new 63,000-seater stadium will be built in Brisbane as the centrepiece of the 2032 Olympic and Paralympic Games, the Queensland government has announced. The multi-sport arena, to be built in the Victoria Park area of Brisbane, will host the opening and closing ceremonies, as well as the athletics. The plans will see the new stadium become Brisbane's home for cricket, with the famous Gabba stadium to be demolished following the Games. The decision, announced by Queensland Premier David Crisafulli, comes following numerous pledges before the 2024 state elections that a new stadium would not be built. \"I have to own that, and I will. I am sorry, it's my decision, and I accept that decision,\" said Crisafulli.",
        "The government had toyed with plans to redevelop the Gabba - which was built in 1895 and has staged 67 men's Test matches - but those plans were scrapped following a 100-day review into planning for 2032.Cricket, which is being held in Los Angeles in 2028 and is likely to be retained in 2032, could be played at the Gabba before the arena is torn down. \"Wouldn't it be amazing to see the Australian cricket team win gold at an Olympic final? The Gabba's swansong,\" Crisafulli said. \"The Gabba is at its end of life. It hasn't been well maintained, and we do need a stadium to host this great show, and there is an opportunity for legacy play.\"Queensland Cricket backed the plans, with chief executive Terry Svenson saying the arena had been a \"wonderful venue\" but its challenges were \"well documented\". A new 25,000-seater national aquatic centre will be built in Spring Hill near the main stadium, while a new 20,000-seater arena is planned near the main athletes village. The rowing will be held in Queensland's Fitzroy River, which is known to host saltwater crocodiles but the government says the waters are safe.\"If it's good enough for central Queensland kids, I reckon it's good enough for Pierre from Paris,\" said Crisafulli. The Brisbane Queensland Tennis Centre will receive significant upgrades in order to host tennis events.",
        "Speaking to BBC World Service, ABC reporter Arianna Levy said the plans to build a stadium in Victoria Park are controversial because the site holds \"cultural significance\" to Aboriginal people. \"It really has come as a political backflip,\" said Levy on Tuesday.\"It's been really polarising for a lot of the community here in Queensland.\"The main stadium in Victoria Park, which will host 63,000 seats, it's one of the few green sites across Brisbane and it holds cultural significance to the Indigenous people of Brisbane, the Turrbal people. They call the place the Barrambin. \"It was a native camping ground and food-gathering place. It had First Nations people from across Queensland gather all over the place for corroboree, which is the traditional dance for First Nations people. \"There were protests today. There were communities that were against the development of the park to turn it into a stadium. We do imagine in the days to come there will be fallout from community groups and stakeholders that feel like this plan is not the best plan going forward.\"",
        "An artist's impression of the new stadium to be built in Brisbane",
        "A new 63,000-seater stadium will be built in Brisbane as the centrepiece of the 2032 Olympic and Paralympic Games, the Queensland government has announced.",
        "The multi-sport arena, to be built in the Victoria Park area of Brisbane, will host the opening and closing ceremonies, as well as the athletics.",
        "The plans will see the new stadium become Brisbane's home for cricket, with the famous Gabba stadium to be demolished following the Games.",
        "The decision, announced by Queensland Premier David Crisafulli, comes following numerous pledges before the 2024 state elections that a new stadium would not be built.",
        "\"I have to own that, and I will. I am sorry, it's my decision, and I accept that decision,\" said Crisafulli.",
        "The government had toyed with plans to redevelop the Gabba - which was built in 1895 and has staged 67 men's Test matches - but those plans were scrapped following a 100-day review into planning for 2032.",
        "Cricket, which is being held in Los Angeles in 2028 and is likely to be retained in 2032, could be played at the Gabba before the arena is torn down.",
        "\"Wouldn't it be amazing to see the Australian cricket team win gold at an Olympic final? The Gabba's swansong,\" Crisafulli said.",
        "\"The Gabba is at its end of life. It hasn't been well maintained, and we do need a stadium to host this great show, and there is an opportunity for legacy play.\"",
        "Queensland Cricket backed the plans, with chief executive Terry Svenson saying the arena had been a \"wonderful venue\" but its challenges were \"well documented\".",
        "A new 25,000-seater national aquatic centre will be built in Spring Hill near the main stadium, while a new 20,000-seater arena is planned near the main athletes village.",
        "The rowing will be held in Queensland's Fitzroy River, which is known to host saltwater crocodiles but the government says the waters are safe.",
        "\"If it's good enough for central Queensland kids, I reckon it's good enough for Pierre from Paris,\" said Crisafulli.",
        "The Brisbane Queensland Tennis Centre will receive significant upgrades in order to host tennis events.",
        "The Gabba first staged a Test match in 1931",
        "Speaking to BBC World Service, ABC reporter Arianna Levy said the plans to build a stadium in Victoria Park are controversial because the site holds \"cultural significance\" to Aboriginal people.",
        "\"It really has come as a political backflip,\" said Levy on Tuesday.",
        "\"It's been really polarising for a lot of the community here in Queensland.",
        "\"The main stadium in Victoria Park, which will host 63,000 seats, it's one of the few green sites across Brisbane and it holds cultural significance to the Indigenous people of Brisbane, the Turrbal people. They call the place the Barrambin.",
        "\"It was a native camping ground and food-gathering place. It had First Nations people from across Queensland gather all over the place for corroboree, which is the traditional dance for First Nations people.",
        "\"There were protests today. There were communities that were against the development of the park to turn it into a stadium. We do imagine in the days to come there will be fallout from community groups and stakeholders that feel like this plan is not the best plan going forward.\""
      ]
    },
    {
      "url": "https://www.bbc.com/sport/golf/articles/c62xwy07py9o",
      "main_category": "sport",
      "detailed_category": "olympics",
      "topic": "LA 2028 to feature Olympic mixed-team golf event",
      "content": [
        "A mixed-team golf event will be held at the Olympic Games in Los Angeles following approval by the International Olympic Committee executive board.Organisers have said it will contested as 36-hole competition across two 18-hole rounds - foursomes and fourball - with a maximum of one team per country.Teams will be comprised of one male and one female athlete from the individual men's and women's competitions being held at the Games.The group event will take place in between the men's and the women's competitions at the Riviera Country Club.Golf returned to the Olympics at Rio 2016 after an absence of over a century, and LA 2028 will see the first team competition since St Louis Games of 1904.International Golf Federation executive director Antony Scanlon said: \"We're excited to bring even more attention to our sport through this additional format.\"The athletes were very enthusiastic about their desire to play with their compatriots, and we look forward to watching them compete together in Los Angeles.\"TeamGB's Justin Rose won gold in the men's individual event in Rio just under a decade ago while Tommy Fleetwood picked up the silver medal at Paris 2024.Golf is one of six sports - joining archery, athletics (4x100m mixed relay), gymnastics, rowing coastal beach sprint and table tennis - to add a mixed-gender competition for LA 2028.",
        "Golf was first played at the Olympic Games in Paris in 1900",
        "A mixed-team golf event will be held at the Olympic Games in Los Angeles following approval by the International Olympic Committee executive board.",
        "Organisers have said it will contested as 36-hole competition across two 18-hole rounds - foursomes and fourball - with a maximum of one team per country.",
        "Teams will be comprised of one male and one female athlete from the individual men's and women's competitions being held at the Games.",
        "The group event will take place in between the men's and the women's competitions at the Riviera Country Club.",
        "Golf returned to the Olympics at Rio 2016 after an absence of over a century, and LA 2028 will see the first team competition since St Louis Games of 1904.",
        "International Golf Federation executive director Antony Scanlon said: \"We're excited to bring even more attention to our sport through this additional format.",
        "\"The athletes were very enthusiastic about their desire to play with their compatriots, and we look forward to watching them compete together in Los Angeles.\"",
        "TeamGB's Justin Rose won gold in the men's individual event in Rio just under a decade ago while Tommy Fleetwood picked up the silver medal at Paris 2024.",
        "Golf is one of six sports - joining archery, athletics (4x100m mixed relay), gymnastics, rowing coastal beach sprint and table tennis - to add a mixed-gender competition for LA 2028."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/cricket/articles/cvg9dl0vnp7o",
      "main_category": "sport",
      "detailed_category": "olympics",
      "topic": "Cricket at LA 2028 will be six-team T20 tournament",
      "content": [
        "Cricket's return to the Olympic Games in Los Angeles 2028 will be as a six-team T20 tournament for both genders, the International Olympic Committee has announced.Participating teams will be able to field squads of up to 15 players after the IOC allocated quotas of 90 athletes per gender for the event.The IOC has yet to reveal how teams will qualify for LA 2028, but it is understood organisers are keen to utilise cricket as a way to increase India's interest in the Olympics.India are the current T20 World Cup holders, were a draw for fans at the 2024 World Cup which the United States co-hosted and represent a commercial opportunity for the IOC with sponsors.Before she was elected, IOC president Kirsty Coventry met with International Cricket Council chairman Jay Shah in Dubai at the recent Champions Trophy where LA 2028 was discussed. Cricket's only previous appearance at the Olympics was at Paris 1900, when Great Britain won by 158 runs against France in a one-off final, after the Netherlands and Belgium withdrew.The England and Wales Cricket Board is understood to have held preliminary talks with Cricket Scotland about plans to field a TeamGB side.",
        "Paul Collingwood was part of the Olympic torch relay in Durham before the London 2012 Olympic Games while an England cricketer",
        "Cricket's return to the Olympic Games in Los Angeles 2028 will be as a six-team T20 tournament for both genders, the International Olympic Committee has announced.",
        "Participating teams will be able to field squads of up to 15 players after the IOC allocated quotas of 90 athletes per gender for the event.",
        "The IOC has yet to reveal how teams will qualify for LA 2028, but it is understood organisers are keen to utilise cricket as a way to increase India's interest in the Olympics.",
        "India are the current T20 World Cup holders, were a draw for fans at the 2024 World Cup which the United States co-hosted and represent a commercial opportunity for the IOC with sponsors.",
        "Before she was elected, IOC president Kirsty Coventry met with International Cricket Council chairman Jay Shah in Dubai at the recent Champions Trophy where LA 2028 was discussed.",
        "Cricket's only previous appearance at the Olympics was at Paris 1900, when Great Britain won by 158 runs against France in a one-off final, after the Netherlands and Belgium withdrew.",
        "The England and Wales Cricket Board is understood to have held preliminary talks with Cricket Scotland about plans to field a TeamGB side.",
        "Kohli rules out T20 comeback for LA 2028 Olympics",
        "Get cricket news sent straight to your phone",
        "US cricket awaits its authentic Donald Duck moment"
      ]
    }
  ]
}