{
  "scraped_at": "2025-10-27T18:56:59.774546",
  "total_articles": 8,
  "category": "cycling",
  "articles_per_category": 100,
  "articles": [
    {
      "url": "https://www.bbc.com/sport/cycling/articles/cqjwqz95xxlo",
      "main_category": "sport",
      "detailed_category": "cycling",
      "topic": "Finucane wins keirin silver after sprint disappointment",
      "content": [
        "Great Britain's Emma Finucane bounced back from sprint disappointment to win keirin silver at the Track Cycling World Championships in Chile.Finucane, 22, reached the quarter-finals in the sprint event on Friday but an error saw the two-time defending champion miss out on a spot in the semi-finals.The three-time Olympic medallist put that frustration behind her to finish second behind Japan's Mina Sato in the keirin.\"I'm really proud,\" Finucane said.\"After the sprint, I was really gutted and it took me a while to process it, but I think bouncing back and doing four rides that I didn't think even six months ago that I was capable of doing, I've grown so much and we'll keep working on it.\"I can take a lot [from this World Championships]. They say the highs when you're winning things is sweet, but you can only feel that when you get the sour.\"It's year one of the cycle, I've so much more growing [to do].\"The keirin remains the only sprint event in which Finucane - who in 2024 became the first British woman since 1964 to win three medals at the same Olympics - is yet to claim a major gold.Her silver was one of four for the British team on the final day of the Championships in Santiago.",
        "Earlier in the day, Anna Morris picked up her third medal of the Championships with a perfectly-timed final sprint in the women's points race.Morris added to her individual pursuit gold and bronze in the team pursuit.\"I'm really, really happy. I wasn't sure when it finished - I thought it was top five but my coach told me I was second,\" Morris said.\"It has been a solid week on the whole.\"Meanwhile, Matt Richardson - who switched allegiance from Australia to Great Britain last year - also took home a silver medal on the final day after coming up short against long-time rival Harrie Lavreysen of the Netherlands in the men's sprint final.Lavreysen won the first race by 0.094secs and was 0.050secs clear of Richardson in the second to seal his seventh consecutive world championship gold in the event.In the men's madison, Mark Stewart and Josh Tarling placed second behind Belgian duo Lindsay de Vylder and Fabio van den Bossche, amassing 73 points - eight fewer than the champions - in the 200-lap race.That took Great Britain's final medal haul to 14 - winning four gold, eight silver and two bronze - but they finished second to the Netherlands in the overall table.Speaking to BBC Sport, GB sprint coach and seven-time Olympic champion Sir Jason Kenny said: \"We've missed out on some medals that we felt we could have been competitive for, but we've come away with a really good haul with some new medallists, so it's really exciting.\"The fact that we were on the podium more than ever shows that we were competitive across the board, and it's really positive.\"Next year's World Championships will go towards Olympic qualification so things will start getting really serious, and I think given the age profile of the team - and the fact that we are so competitive in so many events - is a really good place to start the Olympic journey.\"",
        "This video can not be played",
        "Finucane wins silver for GB in women's keirin",
        "Great Britain's Emma Finucane bounced back from sprint disappointment to win keirin silver at the Track Cycling World Championships in Chile.",
        "Finucane, 22, reached the quarter-finals in the sprint event on Friday but an error saw the two-time defending champion miss out on a spot in the semi-finals.",
        "The three-time Olympic medallist put that frustration behind her to finish second behind Japan's Mina Sato in the keirin.",
        "\"I'm really proud,\" Finucane said.",
        "\"After the sprint, I was really gutted and it took me a while to process it, but I think bouncing back and doing four rides that I didn't think even six months ago that I was capable of doing, I've grown so much and we'll keep working on it.",
        "\"I can take a lot [from this World Championships]. They say the highs when you're winning things is sweet, but you can only feel that when you get the sour.",
        "\"It's year one of the cycle, I've so much more growing [to do].\"",
        "The keirin remains the only sprint event in which Finucane - who in 2024 became the first British woman since 1964 to win three medals at the same Olympics - is yet to claim a major gold.",
        "Her silver was one of four for the British team on the final day of the Championships in Santiago.",
        "This video can not be played",
        "Morris sprints 'like a champion' to take silver in women's points race",
        "Earlier in the day, Anna Morris picked up her third medal of the Championships with a perfectly-timed final sprint in the women's points race.",
        "Morris added to her individual pursuit gold and bronze in the team pursuit.",
        "\"I'm really, really happy. I wasn't sure when it finished - I thought it was top five but my coach told me I was second,\" Morris said.",
        "\"It has been a solid week on the whole.\"",
        "Meanwhile, Matt Richardson - who switched allegiance from Australia to Great Britain last year - also took home a silver medal on the final day after coming up short against long-time rival Harrie Lavreysen of the Netherlands in the men's sprint final.",
        "Lavreysen won the first race by 0.094secs and was 0.050secs clear of Richardson in the second to seal his seventh consecutive world championship gold in the event.",
        "In the men's madison, Mark Stewart and Josh Tarling placed second behind Belgian duo Lindsay de Vylder and Fabio van den Bossche, amassing 73 points - eight fewer than the champions - in the 200-lap race.",
        "That took Great Britain's final medal haul to 14 - winning four gold, eight silver and two bronze - but they finished second to the Netherlands in the overall table.",
        "Speaking to BBC Sport, GB sprint coach and seven-time Olympic champion Sir Jason Kenny said: \"We've missed out on some medals that we felt we could have been competitive for, but we've come away with a really good haul with some new medallists, so it's really exciting.",
        "\"The fact that we were on the podium more than ever shows that we were competitive across the board, and it's really positive.",
        "\"Next year's World Championships will go towards Olympic qualification so things will start getting really serious, and I think given the age profile of the team - and the fact that we are so competitive in so many events - is a really good place to start the Olympic journey.\""
      ]
    },
    {
      "url": "https://www.bbc.com/sport/cycling/articles/crl2j6gnj41o",
      "main_category": "sport",
      "detailed_category": "cycling",
      "topic": "'A thrill' - GB win two more golds at Worlds",
      "content": [
        "Great Britain claimed two more gold medals at the Track World Championships as Katie Archibald and Maddie Leech won the women's madison before Anna Morris defended her individual pursuit title.Archibald, 31, and Leech, 22, delivered a dominant performance to win by six points over France's Victoire Berteau and Marion Borras, while Italy's Chiara Consonni and Vittoria Guazzini took bronze with 20 points after a crash ended the Netherlands' challenge.\"The track's been running really fast this week and I've been so excited for this race,\" two-time Olympic champion Archibald said.\"The only thing I've been scared about is how much it was going to hurt. Everything else has been just a thrill and an opportunity so I was glad to welcome the pain and take home the jersey.\"There's nine years between us. Maddie was 13 years old when the first women's madison title was contended. \"She's grown up with this event as a reality which hasn't always been the case and it feels pretty cool to be next to somebody on that journey.\"Morris, who won individual pursuit gold at last year's world championships in Denmark, beat Great Britain team-mate Josie Knight by 2.317 seconds in a comfortable final display in Santiago, Chile.Knight, 28, was the fastest qualifier for much of the session until the final race of qualifying, when Morris set up an all-British final.\"It's a new experience warming up with the person you're going to race against,\" Morris said.\"We've both trained really hard for this so it was just nice that we could both go out and leave it all on the track and if either won we were both going to be really happy for each other.\"Knight, Morris and Leech all added to their bronze secured in the team pursuit.In the men's sprint quarter-finals, Matt Richardson delivered a strong qualifying time of 9.210 seconds to be seeded first and set up a semi-final with Australia's Leigh Hoffman.",
        "This video can not be played",
        "'Super ride' from GB wins gold in women's madison",
        "Great Britain claimed two more gold medals at the Track World Championships as Katie Archibald and Maddie Leech won the women's madison before Anna Morris defended her individual pursuit title.",
        "Archibald, 31, and Leech, 22, delivered a dominant performance to win by six points over France's Victoire Berteau and Marion Borras, while Italy's Chiara Consonni and Vittoria Guazzini took bronze with 20 points after a crash ended the Netherlands' challenge.",
        "\"The track's been running really fast this week and I've been so excited for this race,\" two-time Olympic champion Archibald said.",
        "\"The only thing I've been scared about is how much it was going to hurt. Everything else has been just a thrill and an opportunity so I was glad to welcome the pain and take home the jersey.",
        "\"There's nine years between us. Maddie was 13 years old when the first women's madison title was contended.",
        "\"She's grown up with this event as a reality which hasn't always been the case and it feels pretty cool to be next to somebody on that journey.\"",
        "Morris, who won individual pursuit gold at last year's world championships in Denmark, beat Great Britain team-mate Josie Knight by 2.317 seconds in a comfortable final display in Santiago, Chile.",
        "Knight, 28, was the fastest qualifier for much of the session until the final race of qualifying, when Morris set up an all-British final.",
        "\"It's a new experience warming up with the person you're going to race against,\" Morris said.",
        "\"We've both trained really hard for this so it was just nice that we could both go out and leave it all on the track and if either won we were both going to be really happy for each other.\"",
        "Knight, Morris and Leech all added to their bronze secured in the team pursuit.",
        "In the men's sprint quarter-finals, Matt Richardson delivered a strong qualifying time of 9.210 seconds to be seeded first and set up a semi-final with Australia's Leigh Hoffman.",
        "This video can not be played",
        "Great Britain win gold and silver in the Women's Individual Pursuit",
        "Richardson wins 'bittersweet' first medal for GB",
        "Tarling and Charlton win world track golds for GB"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/cycling/articles/cgjd876364zo",
      "main_category": "sport",
      "detailed_category": "cycling",
      "topic": "Tarling and Charlton win world track golds for GB",
      "content": [
        "Josh Tarling and Josh Charlton won gold medals for Great Britain at the Track World Championships.Tarling delivered a first British gold of the championship in Chile by winning the men's points race, amassing 750 points over the 40km event to beat American Peter Moore (675) to the title.Charlton, 22, then doubled the gold tally, winning GB's first world title in the individual pursuit since Bradley Wiggins in 2008.A good start saw 21-year-old Tarling take points in the opening sprint, then secure maximum points in sprint three before he powered clear to gain a lap.That gave him the lead and he continued to accumulate points, including the maximum again in sprint 11, to win gold in style.Track Worlds debutant Tarling becomes the first British man to win the points race title since Jonathan Dibben in 2016.\"I didn't know how [my first World Championships] would be or how it would feel , so not knowing was scary,\" Tarling said.\"It felt pretty good. I think it was good that I got those early points in so I knew the legs were there.\"Charlton, who took silver on his championships debut last year, dominated this time around as he upgraded to gold - finishing more than three seconds clear of Denmark's Rasmus Pederson.Elsewhere, Joe Truman took bronze in the men's 1km time trial - behind the Dutch duo of Harrie Lavreysen and Jeffrey Hoogland - to match his achievement from 12 months ago.Britain's overall medal tally is now up to seven after three days of action.Katie Archibald won silver in the women's elimination race, while GB claimed women's team pursuit bronze on Thursday, having secured silver medals in both the men's and women's team sprints on the opening day.",
        "This video can not be played",
        "GB's Tarling wins first track world title with points race victory",
        "Josh Tarling and Josh Charlton won gold medals for Great Britain at the Track World Championships.",
        "Tarling delivered a first British gold of the championship in Chile by winning the men's points race, amassing 750 points over the 40km event to beat American Peter Moore (675) to the title.",
        "Charlton, 22, then doubled the gold tally, winning GB's first world title in the individual pursuit since Bradley Wiggins in 2008.",
        "A good start saw 21-year-old Tarling take points in the opening sprint, then secure maximum points in sprint three before he powered clear to gain a lap.",
        "That gave him the lead and he continued to accumulate points, including the maximum again in sprint 11, to win gold in style.",
        "Track Worlds debutant Tarling becomes the first British man to win the points race title since Jonathan Dibben in 2016.",
        "\"I didn't know how [my first World Championships] would be or how it would feel , so not knowing was scary,\" Tarling said.",
        "\"It felt pretty good. I think it was good that I got those early points in so I knew the legs were there.\"",
        "Charlton, who took silver on his championships debut last year, dominated this time around as he upgraded to gold - finishing more than three seconds clear of Denmark's Rasmus Pederson.",
        "Elsewhere, Joe Truman took bronze in the men's 1km time trial - behind the Dutch duo of Harrie Lavreysen and Jeffrey Hoogland - to match his achievement from 12 months ago.",
        "Britain's overall medal tally is now up to seven after three days of action.",
        "Katie Archibald won silver in the women's elimination race, while GB claimed women's team pursuit bronze on Thursday, having secured silver medals in both the men's and women's team sprints on the opening day.",
        "This video can not be played",
        "Charlton wins individual pursuit world title"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/cycling/articles/c205xy3y20xo",
      "main_category": "sport",
      "detailed_category": "cycling",
      "topic": "Archibald wins silver as GB take team pursuit bronze",
      "content": [
        "2025 World Track Cycling ChampionshipsDate: 22-26 October Venue: Santiago, ChileCoverage: Watch coverage across BBC TV, the Red Button, BBC iPlayer & BBC Sport website & app.",
        "Katie Archibald won a silver medal in the women's elimination race while Great Britain claimed bronze in the women's team pursuit at the Track World Championships.Two-time Olympic champion Archibald was competing in the elimination for the first time in a World Championships and the race took three attempts to get started because of crashes.With the riders having been whittled down to four in Santiago, Chile, Archibald made a last-ditch sprint to knock out Victoire Berteau of France and secure her 16th world medal overall.Belgium's Helene Hesters then bowed out, leaving a match sprint with Ireland's Lara Gillespie, who opened a gap as she pushed for the line and Archibald could not catch the European champion from taking her first world title. \"I'm really happy to get to that point to contend when it's a different race in the final two [laps, the match sprint],\" said Archibald. \"I just didn't have the legs.\"Gillespie said: \"It's really special and I'm so proud of my country and our small team here. It took focus and composure and I kept believing.\"",
        "Archibald helped GB win team pursuit gold at the past two World Championships. The 31-year-old Scot was not in the squad for the first time since 2017 but aims to be in the team at the 2028 Olympics.Anna Morris, Josie Knight, Jess Roberts and Meg Barker qualified second fastest but were beaten by Germany in the first round, before Maddie Leech replaced Roberts as GB comfortably beat Belgium for bronze.In the sprint events, Emma Finucane made it through to the women's quarter-finals by beating GB team-mate Lauren Bell.But in the deciding race at that stage with Russian Iana Burlakova, Finucane was relegated for dropping into the sprinter's lane, knocking the two-time defending champion out of the competition.Matt Richardson and Harry Ledingham-Horn were knocked out in the men's keirin quarter-finals, before Dutch star Harrie Lavreysen extended his record for world titles to 18.",
        "This video can not be played",
        "GB's Archibald wins elimination silver at World Track Cycling Championships",
        "2025 World Track Cycling Championships",
        "Date: 22-26 October Venue: Santiago, Chile",
        "Coverage: Watch coverage across BBC TV, the Red Button, BBC iPlayer & BBC Sport website & app.",
        "Katie Archibald won a silver medal in the women's elimination race while Great Britain claimed bronze in the women's team pursuit at the Track World Championships.",
        "Two-time Olympic champion Archibald was competing in the elimination for the first time in a World Championships and the race took three attempts to get started because of crashes.",
        "With the riders having been whittled down to four in Santiago, Chile, Archibald made a last-ditch sprint to knock out Victoire Berteau of France and secure her 16th world medal overall.",
        "Belgium's Helene Hesters then bowed out, leaving a match sprint with Ireland's Lara Gillespie, who opened a gap as she pushed for the line and Archibald could not catch the European champion from taking her first world title.",
        "\"I'm really happy to get to that point to contend when it's a different race in the final two [laps, the match sprint],\" said Archibald. \"I just didn't have the legs.\"",
        "Gillespie said: \"It's really special and I'm so proud of my country and our small team here. It took focus and composure and I kept believing.\"",
        "Archibald helped GB win team pursuit gold at the past two World Championships. The 31-year-old Scot was not in the squad for the first time since 2017 but aims to be in the team at the 2028 Olympics.",
        "Anna Morris, Josie Knight, Jess Roberts and Meg Barker qualified second fastest but were beaten by Germany in the first round, before Maddie Leech replaced Roberts as GB comfortably beat Belgium for bronze.",
        "In the sprint events, Emma Finucane made it through to the women's quarter-finals by beating GB team-mate Lauren Bell.",
        "But in the deciding race at that stage with Russian Iana Burlakova, Finucane was relegated for dropping into the sprinter's lane, knocking the two-time defending champion out of the competition.",
        "Matt Richardson and Harry Ledingham-Horn were knocked out in the men's keirin quarter-finals, before Dutch star Harrie Lavreysen extended his record for world titles to 18.",
        "Richardson wins 'bittersweet' first medal for GB",
        "'High school to Hogwarts' - will GB magic bring Richardson gold?"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/cycling/articles/cy0kynlw484o",
      "main_category": "sport",
      "detailed_category": "cycling",
      "topic": "Richardson wins 'bittersweet' first medal for GB",
      "content": [
        "2025 World Track Cycling ChampionshipsDate: 22-26 October Venue: Santiago, ChileCoverage: Watch coverage across BBC TV, the Red Button, BBC iPlayer & BBC Sport website & app.",
        "Matt Richardson claimed his first medal for Great Britain as they won silver in the men's and women's team sprint at the Track World Championships.Both teams were beaten to gold by the Netherlands on the opening day in Santiago, Chile, with defending world champion Emma Finucane leading debutants Iona Moir and Rhianna Parris-Smith in the women's trio.Richardson changed his allegiance from Australia to the country of his birth after winning three medals at the 2024 Olympics.\"Coming away with a silver medal is bittersweet for me,\" said the 26-year-old.\"My first medal at a world championships in a GB skinsuit is going to feel amazing. I wish it was the top step, but I can't come away too mad about that.\"Richardson was joined by Joe Truman and Harry Ledingham-Horn in the men's qualifying line-up and they placed second behind the Netherlands, the two-time defending champions.GB then beat Germany in round one and Hamish Turnbull replaced Ledingham-Horn for the final.GB led as Richardson peeled off following the second lap but Jeffrey Hoogland managed to close the gap on the final lap, crossing the line 0.37 seconds before Turnbull.Richardson, who secured his sixth world medal overall, added: \"We're a fresh line-up, so each time we step on the track we're learning a little bit about each other.\"Truman added: \"It's the closest we've ever been to the Dutch and it's a really positive first step in the cycle [to LA 2028].\"",
        "Finucane has helped GB win a medal in the women's event at the past three world championships, claiming gold in Denmark last year.She also won individual gold at the past two worlds and led a new-look trio in Chile, which qualified fastest ahead of the Netherlands.GB then beat Colombia in round one before being beaten in the final by the Dutch, by 0.26secs.\"I'm so proud of these two,\" said Finucane, who won three medals at Paris 2024. \"It's their first world championships and to go out there in the gold medal ride-off, be composed, feel the pressure - we couldn't have asked for more.\"Maddie Leech is making her worlds debut in Chile and finished sixth in the women's scratch race.Finucane will begin her title defence in the women's sprint on Thursday while GB aim for a second straight gold in the women's team pursuit final.Katie Archibald will contest the women's elimination race, Mark Stewart will feature in the men's scratch and Richardson and Ledingham-Horn will compete in the men's keirin.",
        "This video can not be played",
        "GB beaten to world gold by Netherlands in women's & men's sprints",
        "2025 World Track Cycling Championships",
        "Date: 22-26 October Venue: Santiago, Chile",
        "Coverage: Watch coverage across BBC TV, the Red Button, BBC iPlayer & BBC Sport website & app.",
        "Matt Richardson claimed his first medal for Great Britain as they won silver in the men's and women's team sprint at the Track World Championships.",
        "Both teams were beaten to gold by the Netherlands on the opening day in Santiago, Chile, with defending world champion Emma Finucane leading debutants Iona Moir and Rhianna Parris-Smith in the women's trio.",
        "Richardson changed his allegiance from Australia to the country of his birth after winning three medals at the 2024 Olympics.",
        "\"Coming away with a silver medal is bittersweet for me,\" said the 26-year-old.",
        "\"My first medal at a world championships in a GB skinsuit is going to feel amazing. I wish it was the top step, but I can't come away too mad about that.\"",
        "Richardson was joined by Joe Truman and Harry Ledingham-Horn in the men's qualifying line-up and they placed second behind the Netherlands, the two-time defending champions.",
        "GB then beat Germany in round one and Hamish Turnbull replaced Ledingham-Horn for the final.",
        "GB led as Richardson peeled off following the second lap but Jeffrey Hoogland managed to close the gap on the final lap, crossing the line 0.37 seconds before Turnbull.",
        "Richardson, who secured his sixth world medal overall, added: \"We're a fresh line-up, so each time we step on the track we're learning a little bit about each other.\"",
        "Truman added: \"It's the closest we've ever been to the Dutch and it's a really positive first step in the cycle [to LA 2028].\"",
        "Finucane has helped GB win a medal in the women's event at the past three world championships, claiming gold in Denmark last year.",
        "She also won individual gold at the past two worlds and led a new-look trio in Chile, which qualified fastest ahead of the Netherlands.",
        "GB then beat Colombia in round one before being beaten in the final by the Dutch, by 0.26secs.",
        "\"I'm so proud of these two,\" said Finucane, who won three medals at Paris 2024. \"It's their first world championships and to go out there in the gold medal ride-off, be composed, feel the pressure - we couldn't have asked for more.\"",
        "Maddie Leech is making her worlds debut in Chile and finished sixth in the women's scratch race.",
        "Finucane will begin her title defence in the women's sprint on Thursday while GB aim for a second straight gold in the women's team pursuit final.",
        "Katie Archibald will contest the women's elimination race, Mark Stewart will feature in the men's scratch and Richardson and Ledingham-Horn will compete in the men's keirin.",
        "'High school to Hogwarts' - will GB magic bring Richardson gold?",
        "How to follow Track Cycling World Championships on BBC"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/cycling/articles/c0l7pzg01kdo",
      "main_category": "sport",
      "detailed_category": "cycling",
      "topic": "'High school to Hogwarts' - will GB magic bring Richardson gold?",
      "content": [
        "2025 World Track Cycling ChampionshipsDate: 22-26 October Venue: Santiago, ChileCoverage: Watch coverage across BBC TV, the Red Button, BBC iPlayer & BBC Sport website & app.",
        "Matt Richardson didn't swap Australia for Manchester for the weather, nor the lifestyle and certainly not for the traffic.Instead, he did it solely for the \"magic\" of British Cycling.\"A way I can probably describe it is the Australian programme is like high school and the British programme is like Hogwarts,\" he says.Little more than a year ago, the 26-year-old track cyclist - a three-time Olympic medallist at last year's Games - sent shockwaves through the sport when he announced he was changing allegiance from Australia to Great Britain, the country of his birth.The transition was tough at the start, landing on British soil at the start of 2025 when the weather was getting \"colder, greyer and darker\", but the sprinter quickly found his home at British Cycling's high-tech HQ.\"It's incredible with all this magic going on. It's a crazy place to be. I remember my first couple of weeks there and being like 'wow',\" he tells BBC Sport.\"People talk about no stones unturned and that's the definition of this place. I feel so fortunate to [have experienced] two completely different programmes, and I think having that is a real strength, applying two different mindsets or philosophies to try to find the fastest way to do things.\"It's a case of so far, so good for Richardson since the swap. In August he made history as the first cyclist to go under the nine-second barrier in the flying 200m, setting a new world record of 8.941 seconds in Konya, Turkey, before lowering that mark to 8.857 the next day.He is matter of fact about his achievement.\"It was a just a simple day,\" he says. \"I rocked up to the velodrome, did a warm-up, did a little bit of an activation and then rode faster than anybody else in history and that was basically it.\"",
        "Next up for Richardson and the rest of a 22-strong British squad is the World Championships in Santiago, Chile, from Wednesday.He has five world medals to his name but, as is the case at the Olympics, he has never won an individual gold at that level. Dutchman Harrie Lavreysen - a five-time Olympic champion and 16-time world champion - has always beaten him to the line.Asked if the switch to GB will aid him closing the gap on his \"biggest rival\", Richardson said: \"I think so.\"Based on my training times in the last year, I haven't got any slower. I have had everything at my fingertips to make me the best athlete I possibly can be. \"Has it made me a better cyclist? Yes. Has it given me a slight edge to where I was a year on? Yes.\"Whether that results in me beating Harrie, I don't know.\"I always go to win everything I compete in. I don't put this much effort in in training to come second.\"I do come second quite a lot, but it's not my main ambition. My ambition is to win absolutely everything.\"",
        "Joining Richardson in Chile is team-mate and girlfriend Emma Finucane, who in Paris became the first British woman since 1964 to win three medals at the same Olympics.The first of those was the women's team sprint gold alongside Katy Marchant and Sophie Capewell, Britain's first in the event.After the Games and last year's Worlds, where she defended her individual sprint title and won team sprint gold, she flew to Perth, Australia, with Richardson for two months for a \"complete switch-off\".She swapped her bike for a surfboard and \"felt so present\", but by the time she came home she found herself missing cycling and was \"ready to go again\".Finucane will ride all three sprint events this week and is confident she can retain her individual rainbow jersey. The chaotic keirin is the only sprint event she has yet to win a major gold in, a target she maintains going into Santiago.In the team sprint, things are more uncertain. Marchant has recently had her second child, while Capewell has chosen not to compete this year.It means Finucane, at 22, will be the most experienced head on the team, riding alongside championship debutants Rhianna Parris-Smith and Iona Moir.\"Getting used to a new team is a new challenge,\" Finucane says. We get on well. The dynamic is different, but that's what's exciting, that we have that depth.\"There are about eight girls on the programme now, whereas a few years ago it was just Katy. That internal competition is how we won the Olympics.\"We have girls that can step up to a world-class level and will slot in. Just because Katy and Sophie are gone doesn't mean the team is any less good.\"",
        "Matt Richardson has five World Championship medals",
        "2025 World Track Cycling Championships",
        "Date: 22-26 October Venue: Santiago, Chile",
        "Coverage: Watch coverage across BBC TV, the Red Button, BBC iPlayer & BBC Sport website & app.",
        "Matt Richardson didn't swap Australia for Manchester for the weather, nor the lifestyle and certainly not for the traffic.",
        "Instead, he did it solely for the \"magic\" of British Cycling.",
        "\"A way I can probably describe it is the Australian programme is like high school and the British programme is like Hogwarts,\" he says.",
        "Little more than a year ago, the 26-year-old track cyclist - a three-time Olympic medallist at last year's Games - sent shockwaves through the sport when he announced he was changing allegiance from Australia to Great Britain, the country of his birth.",
        "The transition was tough at the start, landing on British soil at the start of 2025 when the weather was getting \"colder, greyer and darker\", but the sprinter quickly found his home at British Cycling's high-tech HQ.",
        "\"It's incredible with all this magic going on. It's a crazy place to be. I remember my first couple of weeks there and being like 'wow',\" he tells BBC Sport.",
        "\"People talk about no stones unturned and that's the definition of this place. I feel so fortunate to [have experienced] two completely different programmes, and I think having that is a real strength, applying two different mindsets or philosophies to try to find the fastest way to do things.\"",
        "It's a case of so far, so good for Richardson since the swap. In August he made history as the first cyclist to go under the nine-second barrier in the flying 200m, setting a new world record of 8.941 seconds in Konya, Turkey, before lowering that mark to 8.857 the next day.",
        "He is matter of fact about his achievement.",
        "\"It was a just a simple day,\" he says. \"I rocked up to the velodrome, did a warm-up, did a little bit of an activation and then rode faster than anybody else in history and that was basically it.\"",
        "Next up for Richardson and the rest of a 22-strong British squad is the World Championships in Santiago, Chile, from Wednesday.",
        "He has five world medals to his name but, as is the case at the Olympics, he has never won an individual gold at that level. Dutchman Harrie Lavreysen - a five-time Olympic champion and 16-time world champion - has always beaten him to the line.",
        "Asked if the switch to GB will aid him closing the gap on his \"biggest rival\", Richardson said: \"I think so.",
        "\"Based on my training times in the last year, I haven't got any slower. I have had everything at my fingertips to make me the best athlete I possibly can be.",
        "\"Has it made me a better cyclist? Yes. Has it given me a slight edge to where I was a year on? Yes.",
        "\"Whether that results in me beating Harrie, I don't know.",
        "\"I always go to win everything I compete in. I don't put this much effort in in training to come second.",
        "\"I do come second quite a lot, but it's not my main ambition. My ambition is to win absolutely everything.\"",
        "Emma Finucane won three medals at last year's Paris Olympics",
        "Joining Richardson in Chile is team-mate and girlfriend Emma Finucane, who in Paris became the first British woman since 1964 to win three medals at the same Olympics.",
        "The first of those was the women's team sprint gold alongside Katy Marchant and Sophie Capewell, Britain's first in the event.",
        "After the Games and last year's Worlds, where she defended her individual sprint title and won team sprint gold, she flew to Perth, Australia, with Richardson for two months for a \"complete switch-off\".",
        "She swapped her bike for a surfboard and \"felt so present\", but by the time she came home she found herself missing cycling and was \"ready to go again\".",
        "Finucane will ride all three sprint events this week and is confident she can retain her individual rainbow jersey. The chaotic keirin is the only sprint event she has yet to win a major gold in, a target she maintains going into Santiago.",
        "In the team sprint, things are more uncertain. Marchant has recently had her second child, while Capewell has chosen not to compete this year.",
        "It means Finucane, at 22, will be the most experienced head on the team, riding alongside championship debutants Rhianna Parris-Smith and Iona Moir.",
        "\"Getting used to a new team is a new challenge,\" Finucane says. We get on well. The dynamic is different, but that's what's exciting, that we have that depth.",
        "\"There are about eight girls on the programme now, whereas a few years ago it was just Katy. That internal competition is how we won the Olympics.",
        "\"We have girls that can step up to a world-class level and will slot in. Just because Katy and Sophie are gone doesn't mean the team is any less good.\""
      ]
    },
    {
      "url": "https://www.bbc.com/sport/cycling/articles/cq50gd40q09o",
      "main_category": "sport",
      "detailed_category": "cycling",
      "topic": "GB win two more world golds on final day",
      "content": [
        "Great Britain won two more gold medals on the final day of action at the Para-cycling Track World Championships in Rio de Janeiro.Elizabeth Jordan and pilot Dannielle Khan claimed victory in the women's B sprint gold medal race against Australia's Jess Gallagher and Jacquie Mengler-Mohr, while Sophie Unwin and Jenny Holl won the bronze medal.Like Jordan and Khan, James Ball and pilot Steffan Lloyd also secured their second gold of the championship as they triumphed over Australian rivals Kane Perris and Luke Zaccaria in the men's B sprint final.GB were denied a third gold in Sunday's final event by just two-hundredths of a second as Kadeena Cox, Finlay Graham and Jody Cundy took silver behind Australia in the mixed C1-5 750m team sprint.",
        "That took Graham's total medal haul in Brazil to five, after he earlier won a silver medal in the men's C3 10km scratch race.There was also a silver for Archie Atkinson, who earned his third medal in Rio in finishing a close runner-up to Frenchman Gatien Le Rousseau in the men's C4 elimination race.Those successes ensured the British team, who topped the para-cycling track programme at last year's Paralympic Games in Paris, finished second in the medal table behind Australia.GB amassed an overall medal tally of 23, including nine golds, eight silvers and six bronzes.",
        "Gold (nine): Elizabeth Jordan and Dannielle Khan (women's B 1km time trial, women's B sprint); James Ball and Steffan Lloyd (men's B 1km time trial, men's B sprint); Jody Cundy (men's C4 sprint, men's C4 1km time trial); Stephen Bate and Christopher Latham (men's tandem individual pursuit); Archie Atkinson (men's C4 10km scratch); Sophie Unwin and Jenny Holl (women's B individual pursuit)Silver (eight):Fin Graham (men's C3 elimination, men's C3 10km scratch); Archie Atkinson (men's C4 1km time trial, men's C4 elimination); Kadeena Cox (women's C4 sprint, women's C4 1km time trial); Blaine Hunt (men's C5 1km time trial); Kadeena Cox, Fin Graham, Jody Cundy (mixed C1-5 750m team sprint)Bronze (six):Fin Graham (men's C3 1km time trial, men's C3 match sprint); Matthew Robertson (men's C2 10km scratch); Elizabeth Jordan and Dannielle Khan (women's B individual pursuit); Sophie Unwin and Jenny Holl (women's B sprint); Elizabeth Jordan, Danni Khan, James Ball, Steffan Lloyd (team tandem sprint)",
        "Elizabeth Jordan and pilot Dannielle Khan won the women's B sprint world title without losing a race",
        "Great Britain won two more gold medals on the final day of action at the Para-cycling Track World Championships in Rio de Janeiro.",
        "Elizabeth Jordan and pilot Dannielle Khan claimed victory in the women's B sprint gold medal race against Australia's Jess Gallagher and Jacquie Mengler-Mohr, while Sophie Unwin and Jenny Holl won the bronze medal.",
        "Like Jordan and Khan, James Ball and pilot Steffan Lloyd also secured their second gold of the championship as they triumphed over Australian rivals Kane Perris and Luke Zaccaria in the men's B sprint final.",
        "GB were denied a third gold in Sunday's final event by just two-hundredths of a second as Kadeena Cox, Finlay Graham and Jody Cundy took silver behind Australia in the mixed C1-5 750m team sprint.",
        "That took Graham's total medal haul in Brazil to five, after he earlier won a silver medal in the men's C3 10km scratch race.",
        "There was also a silver for Archie Atkinson, who earned his third medal in Rio in finishing a close runner-up to Frenchman Gatien Le Rousseau in the men's C4 elimination race.",
        "Those successes ensured the British team, who topped the para-cycling track programme at last year's Paralympic Games in Paris, finished second in the medal table behind Australia.",
        "GB amassed an overall medal tally of 23, including nine golds, eight silvers and six bronzes.",
        "Elizabeth Jordan and Dannielle Khan (women's B 1km time trial, women's B sprint); James Ball and Steffan Lloyd (men's B 1km time trial, men's B sprint); Jody Cundy (men's C4 sprint, men's C4 1km time trial); Stephen Bate and Christopher Latham (men's tandem individual pursuit); Archie Atkinson (men's C4 10km scratch); Sophie Unwin and Jenny Holl (women's B individual pursuit)",
        "Fin Graham (men's C3 elimination, men's C3 10km scratch); Archie Atkinson (men's C4 1km time trial, men's C4 elimination); Kadeena Cox (women's C4 sprint, women's C4 1km time trial); Blaine Hunt (men's C5 1km time trial); Kadeena Cox, Fin Graham, Jody Cundy (mixed C1-5 750m team sprint)",
        "Fin Graham (men's C3 1km time trial, men's C3 match sprint); Matthew Robertson (men's C2 10km scratch); Elizabeth Jordan and Dannielle Khan (women's B individual pursuit); Sophie Unwin and Jenny Holl (women's B sprint); Elizabeth Jordan, Danni Khan, James Ball, Steffan Lloyd (team tandem sprint)"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/articles/c051p0lzdy1o",
      "main_category": "sport",
      "detailed_category": "cycling",
      "topic": "Bate signs off with world gold amid GB success",
      "content": [
        "Two-time Paralympic champion Stephen Bate secured a golden finish to his 12-year career by winning the men's tandem individual pursuit title at the Para-cycling Track World Championships in Rio de Janeiro.Bate and pilot Christopher Latham achieved victory by catching Italian rivals Lorenzo Bernard and pilot Paolo Toto in an impressive display.It ensured Bate ended his career as a five-time world champion across road and track events, and a five-time Paralympic medallist.It was in Rio nine years ago where he and then-pilot Adam Duggleby achieved a golden Paralympic double in the individual pursuit and road time trial events.Partnered by Latham on his return to the Brazilian capital, with whom he won individual pursuit silver at his final Paralympic Games in Paris last summer, Bate signed off in style on another hugely successful day for the British team.That was one of three gold medals won by the British team on Saturday, as 21-year-old Archie Atkinson regained the men's C4 10km scratch race title.Elizabeth Jordan and pilot Dannielle Khan also triumphed, retaining their women's B 1km time trial title.Finlay Graham made it three medals in as many days as he clinched silver in the men's C3 elimination race.There was also silver for Kadeena Cox in the women's C4 Sprint Race.Those successes took GB's tally to seven golds, five silver and five bronze medals overall.",
        "Stephen Bate has won his fifth world title",
        "Two-time Paralympic champion Stephen Bate secured a golden finish to his 12-year career by winning the men's tandem individual pursuit title at the Para-cycling Track World Championships in Rio de Janeiro.",
        "Bate and pilot Christopher Latham achieved victory by catching Italian rivals Lorenzo Bernard and pilot Paolo Toto in an impressive display.",
        "It ensured Bate ended his career as a five-time world champion across road and track events, and a five-time Paralympic medallist.",
        "It was in Rio nine years ago where he and then-pilot Adam Duggleby achieved a golden Paralympic double in the individual pursuit and road time trial events.",
        "Partnered by Latham on his return to the Brazilian capital, with whom he won individual pursuit silver at his final Paralympic Games in Paris last summer, Bate signed off in style on another hugely successful day for the British team.",
        "That was one of three gold medals won by the British team on Saturday, as 21-year-old Archie Atkinson regained the men's C4 10km scratch race title.",
        "Elizabeth Jordan and pilot Dannielle Khan also triumphed, retaining their women's B 1km time trial title.",
        "Finlay Graham made it three medals in as many days as he clinched silver in the men's C3 elimination race.",
        "There was also silver for Kadeena Cox in the women's C4 Sprint Race.",
        "Those successes took GB's tally to seven golds, five silver and five bronze medals overall.",
        "Unwin & Holl win GB's third gold on day two in Rio"
      ]
    }
  ]
}