{
  "scraped_at": "2025-10-27T18:56:59.769546",
  "total_articles": 17,
  "category": "canoeing",
  "articles_per_category": 100,
  "articles": [
    {
      "url": "https://www.bbc.com/sport/athletics/articles/ce84ldrx8j7o",
      "main_category": "sport",
      "detailed_category": "canoeing",
      "topic": "GB's Clarke wins fourth kayak cross world title",
      "content": [
        "Great Britain's Joe Clarke said he was \"stuck for words\" after claiming a fourth consecutive kayak cross world title in Australia.The 32-year-old took time out of the sport after finishing with a silver medal at the 2024 Olympic Games in Paris. He missed the early part of the season following the birth of his second child and says he struggled to \"find his feet\" in the subsequent World Cup events.Clarke won silver in the men's individual time trials and bronze in the team kayak earlier in the Canoe Slalom World Championships in Sydney, but showed his class in the kayak cross, continuing his remarkable run after winning the three previous editions of the event.\"It was a dream to come here to retain that title after getting silver in the Games last year,\" said Clarke, who finished well clear of France's Mathurin Madore in second place and Czech canoeist Matyas Novak in third.  \"To compete on the biggest stage at the Olympics is massive but then I actually took some time off afterwards, so I've been working towards this.\"I have kind of been finding my feet the second half of the season, but it seems like I found them now.\"I came today with a point to prove and I think I've done that. To take a fourth world title, I'm stuck for words.\"",
        "This video can not be played",
        "GB's Clarke wins 'incredible' fourth consecutive kayak world title",
        "Great Britain's Joe Clarke said he was \"stuck for words\" after claiming a fourth consecutive kayak cross world title in Australia.",
        "The 32-year-old took time out of the sport after finishing with a silver medal at the 2024 Olympic Games in Paris.",
        "He missed the early part of the season following the birth of his second child and says he struggled to \"find his feet\" in the subsequent World Cup events.",
        "Clarke won silver in the men's individual time trials and bronze in the team kayak earlier in the Canoe Slalom World Championships in Sydney, but showed his class in the kayak cross, continuing his remarkable run after winning the three previous editions of the event.",
        "\"It was a dream to come here to retain that title after getting silver in the Games last year,\" said Clarke, who finished well clear of France's Mathurin Madore in second place and Czech canoeist Matyas Novak in third.",
        "\"To compete on the biggest stage at the Olympics is massive but then I actually took some time off afterwards, so I've been working towards this.",
        "\"I have kind of been finding my feet the second half of the season, but it seems like I found them now.",
        "\"I came today with a point to prove and I think I've done that. To take a fourth world title, I'm stuck for words.\"",
        "Joe Clarke followed up the three previous kayak cross world titles he won in Bratislava (2021), Augsburg (2022) and London (2023)",
        "Woods wins K1 silver at World Championships",
        "Britain's Westley wins World Championship silver",
        "Clarke wins second medal to take GB tally to four"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/canoeing/articles/cx23xy5np59o",
      "main_category": "sport",
      "detailed_category": "canoeing",
      "topic": "Woods wins K1 silver at World Championships",
      "content": [
        "Great Britain's Kimberley Woods claimed K1 silver in the Canoe Slalom World Championships.The 30-year-old raced through the bottom half of the course in Penrith, Australia to finish behind Poland's Klaudia Zwolinska. Woods, who won bronze in the kayak cross and K1 at the 2024 Olympics, picked up a touch on gate 12 but managed to push Australia's Katie Ekhardt into third. A two-second penalty is incurred for touching one or both poles of a gate with any part of the paddler, boat or paddle.\"I think that touch is going to haunt me for a little bit,\" said Woods. \"It was very slight but overall I'm thrilled with that.\"I wanted to go out there, give it my best. I really attacked it and I'm really pleased with how I reset after the touch.\"Woods, the six-time world champion, returns to action on Saturday for the kayak cross.",
        "Kimberley Woods is an eight-time European champion",
        "Great Britain's Kimberley Woods claimed K1 silver in the Canoe Slalom World Championships.",
        "The 30-year-old raced through the bottom half of the course in Penrith, Australia to finish behind Poland's Klaudia Zwolinska.",
        "Woods, who won bronze in the kayak cross and K1 at the 2024 Olympics, picked up a touch on gate 12 but managed to push Australia's Katie Ekhardt into third.",
        "A two-second penalty is incurred for touching one or both poles of a gate with any part of the paddler, boat or paddle.",
        "\"I think that touch is going to haunt me for a little bit,\" said Woods.",
        "\"It was very slight but overall I'm thrilled with that.",
        "\"I wanted to go out there, give it my best. I really attacked it and I'm really pleased with how I reset after the touch.\"",
        "Woods, the six-time world champion, returns to action on Saturday for the kayak cross."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/canoeing/articles/clyqpy84e44o",
      "main_category": "sport",
      "detailed_category": "canoeing",
      "topic": "Britain's Westley wins World Championship silver",
      "content": [
        "Great Britain's Ryan Westley clinched the third individual Canoe Slalom World Championship medal of his career by winning silver in the men's C1 in Sydney.The 32-year-old finished 0.9 seconds behind France's Nicolas Green to add to the silver he won in Rio in 2018 and the bronze he earned in London in 2015.\"Everything went really well,\" said Westley.\"Unfortunately, there was one other guy on the start line who was a bit better than me but there's not much I can do about that.\"I really enjoyed my final run. I took a little bit of time at the top but once that happened, I felt really locked in.\"It was a second medal of the championships for Westley, who claimed a C1 team silver alongside team-mates Adam Burgess and Luc Royle.",
        "Ryan Westley finished runner-up to France's Nicolas Green",
        "Great Britain's Ryan Westley clinched the third individual Canoe Slalom World Championship medal of his career by winning silver in the men's C1 in Sydney.",
        "The 32-year-old finished 0.9 seconds behind France's Nicolas Green to add to the silver he won in Rio in 2018 and the bronze he earned in London in 2015.",
        "\"Everything went really well,\" said Westley.",
        "\"Unfortunately, there was one other guy on the start line who was a bit better than me but there's not much I can do about that.",
        "\"I really enjoyed my final run. I took a little bit of time at the top but once that happened, I felt really locked in.\"",
        "It was a second medal of the championships for Westley, who claimed a C1 team silver alongside team-mates Adam Burgess and Luc Royle."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/canoeing/articles/crkjpm0j5r7o",
      "main_category": "sport",
      "detailed_category": "canoeing",
      "topic": "Clarke wins second medal to take GB tally to four",
      "content": [
        "Joe Clarke won his second medal of the Canoe Slalom World Championships to take Great Britain's tally to four.Clarke won men's kayak team bronze alongside Ben Haylett and Jonny Dickson on day three of the Championships in Sydney, Australia.France claimed gold by just 0.06 seconds ahead of Japan, with Great Britain a further 0.04 seconds back in third.Clarke, 32, opened the medal tally for Britain with a silver in the individual time trials on Monday.\"I was able to push up and get the guys in and set the tone for the run. It was a great run, but there were such tight margins in it,\" said Clarke.On Tuesday, the men's team of Adam Burgess, Ryan Westley and Luc Royle claimed silver in the men's C1, finishing 0.79 seconds behind France.The women's team picked up a bronze in the same discipline after a nervy wait at the end of the race.The British trio of Kimberley Woods, Ellis Miller and Bethan Forrow initially finished eighth after a 50-second penalty that was later removed. They then had to wait for an inquiry from fourth-placed Slovakia to be completed before they could celebrate their medal.\"After the mishap at the top, we thought we pulled it back really well,\" Miller said.\"To be told we now have a bronze medal, we are really happy.\"",
        "Great Britain have won two silver and two bronze medals so far at the Championships",
        "Joe Clarke won his second medal of the Canoe Slalom World Championships to take Great Britain's tally to four.",
        "Clarke won men's kayak team bronze alongside Ben Haylett and Jonny Dickson on day three of the Championships in Sydney, Australia.",
        "France claimed gold by just 0.06 seconds ahead of Japan, with Great Britain a further 0.04 seconds back in third.",
        "Clarke, 32, opened the medal tally for Britain with a silver in the individual time trials on Monday.",
        "\"I was able to push up and get the guys in and set the tone for the run. It was a great run, but there were such tight margins in it,\" said Clarke.",
        "On Tuesday, the men's team of Adam Burgess, Ryan Westley and Luc Royle claimed silver in the men's C1, finishing 0.79 seconds behind France.",
        "The women's team picked up a bronze in the same discipline after a nervy wait at the end of the race.",
        "The British trio of Kimberley Woods, Ellis Miller and Bethan Forrow initially finished eighth after a 50-second penalty that was later removed.",
        "They then had to wait for an inquiry from fourth-placed Slovakia to be completed before they could celebrate their medal.",
        "\"After the mishap at the top, we thought we pulled it back really well,\" Miller said.",
        "\"To be told we now have a bronze medal, we are really happy.\""
      ]
    },
    {
      "url": "https://www.bbc.com/sport/canoeing/articles/cn95d2jp23lo",
      "main_category": "sport",
      "detailed_category": "canoeing",
      "topic": "GB's Woods wins double gold at canoe World Cup final",
      "content": [
        "Great Britain's Kimberley Woods sealed a gold double at the Canoe Slalom World Cup final in Augsburg, Germany.Woods won the canoe event on Saturday 24 hours after triumphing in the women's kayak single (K1).She finished ahead of Brazilian runner-up Ana Satila and third-placed French paddler Doriane Delassus to claim the canoe title.\"It's my last race as a 29-year-old but I've still got it in my so-called old age,\" said Woods, who turns 30 on Monday. \"I'm pretty buzzed with that. Gold seems to be my colour at the minute – so I'm feeling pretty confident.\"On Friday, she won the final stage of the kayak season with Germany's Elena Lilik securing silver while fellow Briton Lois Leaver took bronze. Woods had made it back-to-back gold medals a week after breaking through for her first K1 World Cup title and in doing so leapfrogged to the top of the overall standings.She finished on 289 points with Leaver (262) in second and Evy Leibfarth of the USA (260) in third.\"Hopefully I've not peaked too early before the World Championships but I've got a lot of confidence now going into next month's race,\" Woods said.",
        "Kimberley Woods won two bronze medals at the Paris 2024 Olympic Games",
        "Great Britain's Kimberley Woods sealed a gold double at the Canoe Slalom World Cup final in Augsburg, Germany.",
        "Woods won the canoe event on Saturday 24 hours after triumphing in the women's kayak single (K1).",
        "She finished ahead of Brazilian runner-up Ana Satila and third-placed French paddler Doriane Delassus to claim the canoe title.",
        "\"It's my last race as a 29-year-old but I've still got it in my so-called old age,\" said Woods, who turns 30 on Monday.",
        "\"I'm pretty buzzed with that. Gold seems to be my colour at the minute – so I'm feeling pretty confident.\"",
        "On Friday, she won the final stage of the kayak season with Germany's Elena Lilik securing silver while fellow Briton Lois Leaver took bronze.",
        "Woods had made it back-to-back gold medals a week after breaking through for her first K1 World Cup title and in doing so leapfrogged to the top of the overall standings.",
        "She finished on 289 points with Leaver (262) in second and Evy Leibfarth of the USA (260) in third.",
        "\"Hopefully I've not peaked too early before the World Championships but I've got a lot of confidence now going into next month's race,\" Woods said."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/rowing/articles/cj0yg2nm2d7o",
      "main_category": "sport",
      "detailed_category": "canoeing",
      "topic": "Four golds as GB are third at Canoe Sprint Worlds",
      "content": [
        "Hope Gordon and Charlotte Henshaw won two medals apiece as Great Britain finished third in the medal table at the Canoe Sprint World Championships.Henshaw, 38, had won the women's VL3 gold at four of the past five editions, with Gordon winning it in 2023.And this time 30-year-old Scot, who also represented GB in cross-country skiing at the 2022 Winter Paralympics, got the better of her rival by two-and-a-half seconds for her second world title.Three-time Paralympic champion Henshaw did win her 11th world gold though, continuing her dominance of the KL2 event with a seventh straight title.Gordon also won a bronze medal at the event in Milan finishing third as her Welsh team-mate and Paralympic champion Laura Sugar triumphed in the KL3 event.GB claimed a total of four golds in Italy, along with one silver and four bronze.The other gold was won by David Phillipson in the men's KL2 event, claiming his first international event after taking world and Paralympic silver in 2024.Ed Clifton won bronze in the men's VL2 final, as did Emily Lewis (women K1) and Jeanette Chippington (women's VL2) in their respective events.",
        "Hope Gordon (left) won VL3 silver at the 2024 Paralympics while team-mate Charlotte Henshaw (right) won gold",
        "Hope Gordon and Charlotte Henshaw won two medals apiece as Great Britain finished third in the medal table at the Canoe Sprint World Championships.",
        "Henshaw, 38, had won the women's VL3 gold at four of the past five editions, with Gordon winning it in 2023.",
        "And this time 30-year-old Scot, who also represented GB in cross-country skiing at the 2022 Winter Paralympics, got the better of her rival by two-and-a-half seconds for her second world title.",
        "Three-time Paralympic champion Henshaw did win her 11th world gold though, continuing her dominance of the KL2 event with a seventh straight title.",
        "Gordon also won a bronze medal at the event in Milan finishing third as her Welsh team-mate and Paralympic champion Laura Sugar triumphed in the KL3 event.",
        "GB claimed a total of four golds in Italy, along with one silver and four bronze.",
        "The other gold was won by David Phillipson in the men's KL2 event, claiming his first international event after taking world and Paralympic silver in 2024.",
        "Ed Clifton won bronze in the men's VL2 final, as did Emily Lewis (women K1) and Jeanette Chippington (women's VL2) in their respective events.",
        "Sugar eyes more glory at Para-canoe worlds"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/canoeing/articles/cr5rl85ejzlo",
      "main_category": "sport",
      "detailed_category": "canoeing",
      "topic": "Sugar eyes more glory at Para-canoe worlds",
      "content": [
        "Double Paralympic champion Laura Sugar is chasing more glory at this week's 2025 ICF Para-canoe World Championships in Milan.Wales' Sugar, 34, has back-to-back Paralympic titles to her name but says the buzz of competition still drives her.Sugar, a four-time world champion, will line up against the best in the world at the Milan event, which runs from 20-24 August as part of the Canoe Sprint World Championships.\"I like racing and I like competing so I'm never going to shy away from doing that,\" she said.",
        "Since winning her second successive Paralympic KL3 gold in Paris, Sugar has faced a year of change, which has seen the arrival of a new performance director and coach at Paddle UK.\"It's been a very different year. Quite a few of us have had time out, then we lost a performance director and lost our coach,\" she said.\"So it's been very up and down. But I like racing. No matter what shape I'm in, if I can go and race, I will.\"Despite the changes behind the scenes, Sugar won gold at this year's European Championships in Racice, Czech Republic.",
        "Former Welsh hockey international Sugar says the focus now is on defending her world title. \"I'm a competitor so as long as I've got a chance and I'm on that start line, I will do my best,\" she added. \"There's some real quality in the KL3 – at the Europeans, second to sixth was separated by just half a second. \"On the day you can finish anywhere and that's the excitement. I just want to be on that start line, give it everything, and hope the speed is there.\"",
        "Laura Sugar used to compete in Para-athletics, where she won multiple European medals in the 100m and 200m",
        "Double Paralympic champion Laura Sugar is chasing more glory at this week's 2025 ICF Para-canoe World Championships in Milan.",
        "Wales' Sugar, 34, has back-to-back Paralympic titles to her name but says the buzz of competition still drives her.",
        "Sugar, a four-time world champion, will line up against the best in the world at the Milan event, which runs from 20-24 August as part of the Canoe Sprint World Championships.",
        "\"I like racing and I like competing so I'm never going to shy away from doing that,\" she said.",
        "Since winning her second successive Paralympic KL3 gold in Paris, Sugar has faced a year of change, which has seen the arrival of a new performance director and coach at Paddle UK.",
        "\"It's been a very different year. Quite a few of us have had time out, then we lost a performance director and lost our coach,\" she said.",
        "\"So it's been very up and down. But I like racing. No matter what shape I'm in, if I can go and race, I will.\"",
        "Despite the changes behind the scenes, Sugar won gold at this year's European Championships in Racice, Czech Republic.",
        "Sugar adds Euro gold to world and Paralympic titles",
        "Henshaw and Sugar retain Paralympic titles",
        "Former Welsh hockey international Sugar says the focus now is on defending her world title.",
        "\"I'm a competitor so as long as I've got a chance and I'm on that start line, I will do my best,\" she added.",
        "\"There's some real quality in the KL3 – at the Europeans, second to sixth was separated by just half a second.",
        "\"On the day you can finish anywhere and that's the excitement. I just want to be on that start line, give it everything, and hope the speed is there.\""
      ]
    },
    {
      "url": "https://www.bbc.com/sport/canoeing/articles/cy0wvp2eqpxo",
      "main_category": "sport",
      "detailed_category": "canoeing",
      "topic": "How ex-Tiger Gough 'learned to live again' on water",
      "content": [
        "Taylor Gough was a professional rugby player when he died and was revived three times following a car crash.Five years on from the incident that left him paralysed from the chest down, the former Leicester Tigers forward is now one of Europe's finest para-canoeists.For 25-year-old Gough, sport has been his saviour time and time again in recent years.The physical demands and punishment he took on the rugby pitch, as he rose through Tigers' academy to reach the periphery of the Premiership club's first team, helped him come through the crash that left him with severe spinal injuries.\"They say if I wasn't a rugby player, or my body wasn't used to taking the impact it was, I would have been dead,\" Gough told BBC East Midlands Today.\"I died three times, and they brought me back. I'm very lucky to be here.\"What he endured in a burgeoning rugby career is what saved him.What did not survive, though, was that very career and all the dreams he had to establish himself as a player for England's most successful club.It was 10 days after the crash that Gough woke from a coma. And when he did, he couldn't move.He reflects on the \"deep dark hole\" he found himself in after that, as he grappled with the \"loss of identity\".\"All I knew was rugby,\" he said.\"I didn't see the point of life any more because I couldn't do what I loved. Everything I knew was taken away from me.\"",
        "Gough credits family and friends for helping \"drag him\" from the \"pit of self pity\" he was in.Among those who rallied around the then 20-year-old following the crash was Matt Hampson, a fellow former Leicester Tigers forward who came through a life-changing accident of his own in 2005.Hampson was left paralysed from the neck down when a scrum collapsed in an England Under-21 training session.And in the two decades since, his mantra of \"get busy living\" has defined how he used his personal setback to set up a foundation in his name, as well as a state-of-the-art facility that offers support to others in a similar situation.\"Matt has been like a big brother to me,\" Gough said. \"Whenever I've needed him, he has been there and offered support.\"And so, there is little wonder why Gough echoes Hampson's motto when explaining that sport has helped him to \"learn to live again\".Unsurprisingly wheelchair rugby was among one of the earliest activities Gough tried, but it is on the water that he has thrived.Gough made his international debut in June and claimed a bronze medal in the men's VL1 final of the Para-canoe European Championships in Racice, Czech Republic.\"I felt completely lost, but now I have found my way through life and found purpose again, which is so important,\" he said.\"It gives me drive to continue and to pursue everything I want to get out of life. \"When you are on the water, it is quite freeing. I'm the same as everyone else, I'm paddling the boat.\"I've seen the podium now and I want more of the podium. And I want it on a bigger scale.\"Gough has aspirations to now go on to compete at the World Championships and feature at the Paralympic Games in the future.And he will approach those global events with medals on his mind, as he tries to match what his fiancee Kylie Grimes has already accomplished.The 34-year-old became the first woman to win a Paralympic gold medal in Wheelchair Rugby when GB won the event in Tokyo in 2021.\"She has put me on the best path to get that gold, because I can't let her have a gold and me not have one!\" Gough said with a smile.\"She has been there, done it, gone to three [Paralympic] Games and got gold. So she know how it all works. \"Her work ethic and drive is exactly the same as mine - she is like me, just a female version. We go together very well, she supports everything I do and she just wants the best for me.\"",
        "Taylor Gough was left paralysed from the chest down by a road crash in 2020",
        "Taylor Gough was a professional rugby player when he died and was revived three times following a car crash.",
        "Five years on from the incident that left him paralysed from the chest down, the former Leicester Tigers forward is now one of Europe's finest para-canoeists.",
        "For 25-year-old Gough, sport has been his saviour time and time again in recent years.",
        "The physical demands and punishment he took on the rugby pitch, as he rose through Tigers' academy to reach the periphery of the Premiership club's first team, helped him come through the crash that left him with severe spinal injuries.",
        "\"They say if I wasn't a rugby player, or my body wasn't used to taking the impact it was, I would have been dead,\" Gough told BBC East Midlands Today.",
        "\"I died three times, and they brought me back. I'm very lucky to be here.\"",
        "What he endured in a burgeoning rugby career is what saved him.",
        "What did not survive, though, was that very career and all the dreams he had to establish himself as a player for England's most successful club.",
        "It was 10 days after the crash that Gough woke from a coma. And when he did, he couldn't move.",
        "He reflects on the \"deep dark hole\" he found himself in after that, as he grappled with the \"loss of identity\".",
        "\"All I knew was rugby,\" he said.",
        "\"I didn't see the point of life any more because I couldn't do what I loved. Everything I knew was taken away from me.\"",
        "'Reality hit, the paralysis is permanent'",
        "Leicester Tigers offer support to Gough",
        "GB top Para-canoe medal table at Euro Championships",
        "Gough credits family and friends for helping \"drag him\" from the \"pit of self pity\" he was in.",
        "Among those who rallied around the then 20-year-old following the crash was Matt Hampson, a fellow former Leicester Tigers forward who came through a life-changing accident of his own in 2005.",
        "Hampson was left paralysed from the neck down when a scrum collapsed in an England Under-21 training session.",
        "And in the two decades since, his mantra of \"get busy living\" has defined how he used his personal setback to set up a foundation in his name, as well as a state-of-the-art facility that offers support to others in a similar situation.",
        "\"Matt has been like a big brother to me,\" Gough said. \"Whenever I've needed him, he has been there and offered support.\"",
        "And so, there is little wonder why Gough echoes Hampson's motto when explaining that sport has helped him to \"learn to live again\".",
        "Unsurprisingly wheelchair rugby was among one of the earliest activities Gough tried, but it is on the water that he has thrived.",
        "Gough made his international debut in June and claimed a bronze medal in the men's VL1 final of the Para-canoe European Championships in Racice, Czech Republic.",
        "\"I felt completely lost, but now I have found my way through life and found purpose again, which is so important,\" he said.",
        "\"It gives me drive to continue and to pursue everything I want to get out of life.",
        "\"When you are on the water, it is quite freeing. I'm the same as everyone else, I'm paddling the boat.",
        "\"I've seen the podium now and I want more of the podium. And I want it on a bigger scale.\"",
        "Gough has aspirations to now go on to compete at the World Championships and feature at the Paralympic Games in the future.",
        "And he will approach those global events with medals on his mind, as he tries to match what his fiancee Kylie Grimes has already accomplished.",
        "The 34-year-old became the first woman to win a Paralympic gold medal in Wheelchair Rugby when GB won the event in Tokyo in 2021.",
        "\"She has put me on the best path to get that gold, because I can't let her have a gold and me not have one!\" Gough said with a smile.",
        "\"She has been there, done it, gone to three [Paralympic] Games and got gold. So she know how it all works.",
        "\"Her work ethic and drive is exactly the same as mine - she is like me, just a female version. We go together very well, she supports everything I do and she just wants the best for me.\""
      ]
    },
    {
      "url": "https://www.bbc.com/sport/canoeing/articles/c5y7ejlgyd5o",
      "main_category": "sport",
      "detailed_category": "canoeing",
      "topic": "GB's Leaver claims another bronze after Burgess gold",
      "content": [
        "Great Britain's Lois Leaver claimed bronze at the Canoe Slalom World Cup event in Prague on Saturday to add to Adam Burgess' gold.Leaver clinched third in the women's kayak final by just 0.1 seconds, despite the 23-year-old Scot picking up a penalty.American Evy Leibfarth claimed gold ahead of Camille Prigent of France, while Leaver has now won bronze in all three of this year's World Cup events so far.Burgess won the men's C1 silver at this year's opener in Spain at the start of this month and the Olympic silver medallist topped that by clinching gold on Friday.The short course format made its debut in the Czech Republic, featuring 12 gates rather than the usual 21, and Burgess triumphed after missing out on the final last time out in Spain.The 32-year-old, who helped GB win the C1 team gold at last month's European Championships, beat Slovenia's Ziga Lin Hocevar while Olympic champion Nicolas Gestin of France claimed bronze.There is one round left in the World Cup series, which takes place in Tacen, Slovenia, from 29-31 August, before the final is held in Augsburg, Germany, from 4-7 September.",
        "Lois Leaver won her first Canoe Slalom World Cup medal in Spain earlier this month",
        "Great Britain's Lois Leaver claimed bronze at the Canoe Slalom World Cup event in Prague on Saturday to add to Adam Burgess' gold.",
        "Leaver clinched third in the women's kayak final by just 0.1 seconds, despite the 23-year-old Scot picking up a penalty.",
        "American Evy Leibfarth claimed gold ahead of Camille Prigent of France, while Leaver has now won bronze in all three of this year's World Cup events so far.",
        "Burgess won the men's C1 silver at this year's opener in Spain at the start of this month and the Olympic silver medallist topped that by clinching gold on Friday.",
        "The short course format made its debut in the Czech Republic, featuring 12 gates rather than the usual 21, and Burgess triumphed after missing out on the final last time out in Spain.",
        "The 32-year-old, who helped GB win the C1 team gold at last month's European Championships, beat Slovenia's Ziga Lin Hocevar while Olympic champion Nicolas Gestin of France claimed bronze.",
        "There is one round left in the World Cup series, which takes place in Tacen, Slovenia, from 29-31 August, before the final is held in Augsburg, Germany, from 4-7 September.",
        "GB's Westley wins canoe slalom gold in Pau"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/canoeing/articles/c9w1lx870ggo",
      "main_category": "sport",
      "detailed_category": "canoeing",
      "topic": "GB top Para-canoe medal table at Euro Championships",
      "content": [
        "Great Britain's Para-canoe team added a further three medals on the final day of the European Championships to finish top of the medal table.The team finished with nine medals in all - four golds, four silvers and one bronze - seven medals clear of any other country. Laura Sugar raced to victory in the women's KL3 200m event, finishing 1.747 seconds ahead of France's Nelia Barbosa. The win means Sugar has now added the European title to her Paralympic and World Championship crowns. Ed Clifton added silver by finishing behind Portugal's Norberto Mourao in the men's VL2 200m event, while Stuart Wood finished runner-up in the VL3 200m. Charlotte Henshaw won two of Great Britain's six medals on Saturday, winning the KL2 and taking silver in the VL3. Henshaw, who claimed two golds at Paris 2024, was beaten in the VL3 final by compatriot Hope Gordon, who won by half a length. Paralympic silver medallist David Phillipson, 36, held off Italy's Christian Volpi to win the KL2 final in a time of 41.516 seconds. Jonny Young claimed KL3 silver, while Taylor Gough earned a bronze in the VL1 final on his international debut.",
        "Laura Sugar competed in Para-athletics before switching to Para-canoeing",
        "Great Britain's Para-canoe team added a further three medals on the final day of the European Championships to finish top of the medal table.",
        "The team finished with nine medals in all - four golds, four silvers and one bronze - seven medals clear of any other country.",
        "Laura Sugar raced to victory in the women's KL3 200m event, finishing 1.747 seconds ahead of France's Nelia Barbosa.",
        "The win means Sugar has now added the European title to her Paralympic and World Championship crowns.",
        "Ed Clifton added silver by finishing behind Portugal's Norberto Mourao in the men's VL2 200m event, while Stuart Wood finished runner-up in the VL3 200m.",
        "Charlotte Henshaw won two of Great Britain's six medals on Saturday, winning the KL2 and taking silver in the VL3.",
        "Henshaw, who claimed two golds at Paris 2024, was beaten in the VL3 final by compatriot Hope Gordon, who won by half a length.",
        "Paralympic silver medallist David Phillipson, 36, held off Italy's Christian Volpi to win the KL2 final in a time of 41.516 seconds.",
        "Jonny Young claimed KL3 silver, while Taylor Gough earned a bronze in the VL1 final on his international debut."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/canoeing/articles/c9w1l7794ldo",
      "main_category": "sport",
      "detailed_category": "canoeing",
      "topic": "Sugar adds Euro gold to world and Paralympic titles",
      "content": [
        "Welsh Para-canoeist Laura Sugar has added the KL3 European title to her Olympic and World Championship crowns.The 34-year-old achieved the feat for Great Britain at the ECA Canoe Sprint and Paracanoe European Championships in Racice, Czechia.The win was part of a table-topping medal tally of nine for the British team.Sugar beat French rival Nelia Barbossa by 1.747 seconds while Spain's Maria Jimenez won bronze and previous title-holder Araceli Menduina, also of Spain, was fifth.Sugar secured a hat-trick of world titles at the Para-canoe World Championships in Duisburg, Germany in 2023.The following year, she added Paralympic gold in Paris, again defending her status.",
        "Laura Sugar represented Wales at hockey before switching to Parasport",
        "Welsh Para-canoeist Laura Sugar has added the KL3 European title to her Olympic and World Championship crowns.",
        "The 34-year-old achieved the feat for Great Britain at the ECA Canoe Sprint and Paracanoe European Championships in Racice, Czechia.",
        "The win was part of a table-topping medal tally of nine for the British team.",
        "Sugar beat French rival Nelia Barbossa by 1.747 seconds while Spain's Maria Jimenez won bronze and previous title-holder Araceli Menduina, also of Spain, was fifth.",
        "Sugar secured a hat-trick of world titles at the Para-canoe World Championships in Duisburg, Germany in 2023.",
        "The following year, she added Paralympic gold in Paris, again defending her status."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/canoeing/articles/c3wdgjw5vleo",
      "main_category": "sport",
      "detailed_category": "canoeing",
      "topic": "GB's Westley wins canoe slalom gold in Pau",
      "content": [
        "Great Britain's Ryan Westley claimed his first career canoe slalom World Cup gold with victory in the men's C1 in Pau, France.The 31-year-old's run of 97.74s was just enough to hold off France's Yohann Senechault and Spain's Miquel Trave who finished second and third respectively.\"I saw what those lads were putting down, listened to the commentary and I didn't really think I had it in me so it left me no option to just go for it,\" Westley said.\"I crossed the finish line and didn't expect to see green. I'm buzzing.\"It is his first World Cup gold having previously won two silvers and three bronzes.Australia's Olympic champion Jessica Fox won the 35th gold of her career in the women's C1 final.The victory for Westley comes after compatriot Lois Leaver earned bronze in the women's K1 on Friday.It was a second successive medal for Leaver after she won bronze in kayak cross at the first World Cup leg of the season in La Seu d'Urgell in Spain last weekend.",
        "Westley's victory came at the second canoe slalom world cup of the season",
        "Great Britain's Ryan Westley claimed his first career canoe slalom World Cup gold with victory in the men's C1 in Pau, France.",
        "The 31-year-old's run of 97.74s was just enough to hold off France's Yohann Senechault and Spain's Miquel Trave who finished second and third respectively.",
        "\"I saw what those lads were putting down, listened to the commentary and I didn't really think I had it in me so it left me no option to just go for it,\" Westley said.",
        "\"I crossed the finish line and didn't expect to see green. I'm buzzing.\"",
        "It is his first World Cup gold having previously won two silvers and three bronzes.",
        "Australia's Olympic champion Jessica Fox won the 35th gold of her career in the women's C1 final.",
        "The victory for Westley comes after compatriot Lois Leaver earned bronze in the women's K1 on Friday.",
        "It was a second successive medal for Leaver after she won bronze in kayak cross at the first World Cup leg of the season in La Seu d'Urgell in Spain last weekend."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/canoeing/articles/c4gr3pnd5e3o",
      "main_category": "sport",
      "detailed_category": "canoeing",
      "topic": "Burgess wins first World Cup silver in six years",
      "content": [
        "Great Britain's Adam Burgess claimed a first C1 World Cup silver since 2019 after a \"pretty special\" run in the heats.The 32-year-old saw off competition from Olympic champion Nicolas Gestin to finish in second, behind Slovenia's Luka Bozic.Burgess produced a stunning run during the heats in north-east Spain to move to the top of the standings. The Stoke-born paddler was last to compete in the finals, but produced a penalty-free run to the start the season in emphatic fashion. Burgess won Olympic silver in the individual canoe at the Paris Games, having agonisingly missed out on a medal by 0.16 seconds at Tokyo 2020.\"I'm always there or thereabouts, and we have done a lot of work to try and bring out those runs in the final, and I guess today, my worst run was the final, but that heat was something pretty special,\" said Burgess. \"It was great to come close to it again there.\"",
        "Adam Burgess won Olympic silver in Paris in 2024",
        "Great Britain's Adam Burgess claimed a first C1 World Cup silver since 2019 after a \"pretty special\" run in the heats.",
        "The 32-year-old saw off competition from Olympic champion Nicolas Gestin to finish in second, behind Slovenia's Luka Bozic.",
        "Burgess produced a stunning run during the heats in north-east Spain to move to the top of the standings.",
        "The Stoke-born paddler was last to compete in the finals, but produced a penalty-free run to the start the season in emphatic fashion.",
        "Burgess won Olympic silver in the individual canoe at the Paris Games, having agonisingly missed out on a medal by 0.16 seconds at Tokyo 2020.",
        "\"I'm always there or thereabouts, and we have done a lot of work to try and bring out those runs in the final, and I guess today, my worst run was the final, but that heat was something pretty special,\" said Burgess.",
        "\"It was great to come close to it again there.\""
      ]
    },
    {
      "url": "https://www.bbc.com/sport/rowing/articles/c0715154kmeo",
      "main_category": "sport",
      "detailed_category": "canoeing",
      "topic": "'I'm being forced to choose between Olympics and OnlyFans'",
      "content": [
        "A British canoeist has been banned from competing and says he is being forced to choose between his Olympic dream and his OnlyFans account. Kurts Adams Rozentals, who competes in the individual canoe slalom, was suspended in April by governing body Paddle UK following \"allegations\" about his posts on social media.Paddle UK removed Rozentals from their World Class Programme - UK Sport's lottery-funded initiative to put athletes on the course for the Olympics - pending an investigation. While Paddle UK have refused to clarify the nature of the allegations, Rozentals suspects it is due to him creating content on subscription website OnlyFans, which is known for hosting adult content. \"I have been posting videos (on Instagram) that are consciously made to be edgy in order to drive conversions to my 'spicy content page' (on OnlyFans), to fund this ultimate dream of going to the Olympics,\" Rozentals told BBC Sport.Rozentals, who has more than 10,000 'likes' on OnlyFans, has posted 39 videos and over 100 photos on the website. He says he has earned more than £100,000 since creating his OnlyFans account in January.He said he received a call from a Paddle UK representative last month to tell him that he was suspended from competing and could no longer contact any of the staff or athletes on the programme.\"I kind of froze and I couldn't believe the words I was hearing because this is what I put my life into this is everything I do,\" Rozentals added. \"My personality at this point, my identity, is sport and I want to be a professional athlete chasing my Olympic dream.\"",
        "Rozentals created his own OnlyFans account in January 2025 in order to help fund his training programme and he posts videos and pictures on his Instagram account to drive viewers towards the content. Each athlete on Paddle UK's programme receives an annual grant of £16,000 to support their training.But Rozentals says the programme's funding is nowhere near enough.\"I don't know how much you need but it's certainly not £16,000,\" said Rozentals. \"When you have to cover rent, travel, food... and most athletes who train full-time are all living in London. \"They're very fortunate to have parent backing - I wasn't. I never had the ability to move to London because of financial struggles so I was always doing the travel from the East Midlands, where I live, to London, back-and-forth, back-and-forth.\"Rozentals, who won individual C1 silver at the World Under-23 Championships in 2023, is awaiting the outcome of the investigation.PaddleUK say Rozentals' ban is not disciplinary action, but an \"interim action\" and a \"neutral act designed to protect all parties\" and to \"safeguard other athletes, staff, and volunteers due to the nature of the allegation\".\"The investigation has been referred to independent investigation service Sport Integrity,\" the governing body said.It added: \"Paddle UK is committed to ensuring a safe and open environment for all, and interim action under the Athlete Disciplinary Policy is only taken where necessary and proportionate.\"Paddle UK's Athlete Disciplinary Policy lists \"offensive use of social media\" and \"indecent, offensive or immoral behaviour\" as examples of gross misconduct that could lead to de-selection.Asked if he will stop posting on OnlyFans in order to preserve his place on the programme, Rozentals says he should not have to choose between financial security and his Olympic dream.\"This is the hardest decision that I've ever faced in my life,\" said Rozentals.\"I came to the realisation about why I started doing this last winter after years of struggle, years of living on the edge, my mum working 90 hours-a-week, having bailiffs at the door.\"I'm going to find a way where we don't have to struggle, where my mum can enjoy her life and I'm able to put everything into this sport because when you're thinking about how to pay the rent this month and you're standing at the start line, that's not very conducive [to performing well]. \"It's a tough decision but unless something changes in the way athletes are paid I don't see a way of working with Paddle UK\".",
        "Olympic gold medallist Jack Laugher created his own OnlyFans account in 2024 to \"make ends meet\".The diver won bronze for Great Britain in the men's synchronised 3m springboard in Paris last summer after silver and bronze in Rio eight years earlier. \"There's nothing left to the imagination when you just wear trunks all the time and he just posts pictures of himself as you would see him if he was in a competition,\" Laugher's father said.\"It makes extra money for him and he's pleased to have the opportunity, but it's nothing that you couldn't show your grandma.\"Funding body UK Sport said it would not comment on an ongoing investigation but added: \"Our Athlete Performance Award (APA) is designed as a contribution towards an athlete's living and basic sporting costs.\"In March, we announced an increase in the value of APAs at all levels. They form just one element of the support package on offer for funded athletes in Olympic and Paralympic sport.\"",
        "By BBC Sport's Ask Me Anything teamOnlyFans is an online platform where people create content (photos, videos and live streams), which can be monetised.Users can pay for monthly subscriptions, tips and pay-per-view for the service, which is known for hosting sexually explicit material, although it is not exclusively a platform for adult content.Creators are paid around 80% of the fees.In 2023, OnlyFans had 220 million users and more than two million creators worldwide.Singer Kate Nash said last year that she created content on the app because it's \"a really difficult time for artists to tour\".",
        "Kurts Adams Rozentals joined the World Class Programme in 2022",
        "A British canoeist has been banned from competing and says he is being forced to choose between his Olympic dream and his OnlyFans account.",
        "Kurts Adams Rozentals, who competes in the individual canoe slalom, was suspended in April by governing body Paddle UK following \"allegations\" about his posts on social media.",
        "Paddle UK removed Rozentals from their World Class Programme - UK Sport's lottery-funded initiative to put athletes on the course for the Olympics - pending an investigation.",
        "While Paddle UK have refused to clarify the nature of the allegations, Rozentals suspects it is due to him creating content on subscription website OnlyFans, which is known for hosting adult content.",
        "\"I have been posting videos (on Instagram) that are consciously made to be edgy in order to drive conversions to my 'spicy content page' (on OnlyFans), to fund this ultimate dream of going to the Olympics,\" Rozentals told BBC Sport.",
        "Rozentals, who has more than 10,000 'likes' on OnlyFans, has posted 39 videos and over 100 photos on the website.",
        "He says he has earned more than £100,000 since creating his OnlyFans account in January.",
        "He said he received a call from a Paddle UK representative last month to tell him that he was suspended from competing and could no longer contact any of the staff or athletes on the programme.",
        "\"I kind of froze and I couldn't believe the words I was hearing because this is what I put my life into this is everything I do,\" Rozentals added.",
        "\"My personality at this point, my identity, is sport and I want to be a professional athlete chasing my Olympic dream.\"",
        "Canoeist wins 125-mile race for third year in row",
        "Christie back at full tilt after lung cancer scare",
        "Canoeist Clifton 'inspired' by Paralympics debut",
        "Rozentals created his own OnlyFans account in January 2025 in order to help fund his training programme and he posts videos and pictures on his Instagram account to drive viewers towards the content.",
        "Each athlete on Paddle UK's programme receives an annual grant of £16,000 to support their training.",
        "But Rozentals says the programme's funding is nowhere near enough.",
        "\"I don't know how much you need but it's certainly not £16,000,\" said Rozentals.",
        "\"When you have to cover rent, travel, food... and most athletes who train full-time are all living in London.",
        "\"They're very fortunate to have parent backing - I wasn't. I never had the ability to move to London because of financial struggles so I was always doing the travel from the East Midlands, where I live, to London, back-and-forth, back-and-forth.\"",
        "Rozentals, who won individual C1 silver at the World Under-23 Championships in 2023, is awaiting the outcome of the investigation.",
        "PaddleUK say Rozentals' ban is not disciplinary action, but an \"interim action\" and a \"neutral act designed to protect all parties\" and to \"safeguard other athletes, staff, and volunteers due to the nature of the allegation\".",
        "\"The investigation has been referred to independent investigation service Sport Integrity,\" the governing body said.",
        "It added: \"Paddle UK is committed to ensuring a safe and open environment for all, and interim action under the Athlete Disciplinary Policy is only taken where necessary and proportionate.\"",
        "Paddle UK's Athlete Disciplinary Policy lists \"offensive use of social media\" and \"indecent, offensive or immoral behaviour\" as examples of gross misconduct that could lead to de-selection.",
        "Asked if he will stop posting on OnlyFans in order to preserve his place on the programme, Rozentals says he should not have to choose between financial security and his Olympic dream.",
        "\"This is the hardest decision that I've ever faced in my life,\" said Rozentals.",
        "\"I came to the realisation about why I started doing this last winter after years of struggle, years of living on the edge, my mum working 90 hours-a-week, having bailiffs at the door.",
        "\"I'm going to find a way where we don't have to struggle, where my mum can enjoy her life and I'm able to put everything into this sport because when you're thinking about how to pay the rent this month and you're standing at the start line, that's not very conducive [to performing well].",
        "\"It's a tough decision but unless something changes in the way athletes are paid I don't see a way of working with Paddle UK\".",
        "Olympic gold medallist Jack Laugher created his own OnlyFans account in 2024 to \"make ends meet\".",
        "The diver won bronze for Great Britain in the men's synchronised 3m springboard in Paris last summer after silver and bronze in Rio eight years earlier.",
        "\"There's nothing left to the imagination when you just wear trunks all the time and he just posts pictures of himself as you would see him if he was in a competition,\" Laugher's father said.",
        "\"It makes extra money for him and he's pleased to have the opportunity, but it's nothing that you couldn't show your grandma.\"",
        "Funding body UK Sport said it would not comment on an ongoing investigation but added: \"Our Athlete Performance Award (APA) is designed as a contribution towards an athlete's living and basic sporting costs.",
        "\"In March, we announced an increase in the value of APAs at all levels. They form just one element of the support package on offer for funded athletes in Olympic and Paralympic sport.\"",
        "By BBC Sport's Ask Me Anything team",
        "OnlyFans is an online platform where people create content (photos, videos and live streams), which can be monetised.",
        "Users can pay for monthly subscriptions, tips and pay-per-view for the service, which is known for hosting sexually explicit material, although it is not exclusively a platform for adult content.",
        "Creators are paid around 80% of the fees.",
        "In 2023, OnlyFans had 220 million users and more than two million creators worldwide.",
        "Singer Kate Nash said last year that she created content on the app because it's \"a really difficult time for artists to tour\"."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/canoeing/articles/cddy1pg36peo",
      "main_category": "sport",
      "detailed_category": "canoeing",
      "topic": "Christie back at full tilt after lung cancer scare",
      "content": [
        "World champion paddler Kerry Christie has revealed the best season of her career came while juggling long-running health problems and a cancer scare.The 21-year-old has established herself as Great Britain's leading female in wildwater canoeing, thanks to a rapid rise through the ranks.But just six months after becoming European under-23 kayak champion, the Leicestershire paddler's ambitions were tempered by health concerns when she began to cough up blood.\"I started coughing up blood at the beginning of 2023 and had various doctors appointments and went to A&E to try and figure out what was causing this,\" she told BBC Sport.After several months of tests, Christie's fears grew when she was referred to the lung cancer unit at a Nottingham hospital in August 2023.\"They had discovered a lump in one of my lungs and I had to have MRI scans, biopsies and bronchoscopies, which all came up with nothing.\"",
        "While tests struggled to find the cause, a lung biopsy did, at least, rule out cancer.\"I can't quite tell you how relieved I was,\" she said. \"I really love canoeing and I was scared that I might have to stop and give up training for a bit, which I would have absolutely hated.\"It's part of who I am and I wouldn't have been me if I had to stop, so I was extremely happy to find out it wasn't something horrible and scary like cancer.\"Despite what was going on behind the scenes, on the water Christie  continued to prosper in 2023.Honours that season included, remarkably, three golds among a five-medal haul at that summer's Junior and Under-23 Wildwater Canoeing World Championships in the Czech Republic.It was Great Britain's first world title at this level for 13 years - yet, still, concerns and uncertainty over her health remained.\"Come the beginning of 2024, I was still coughing blood and this was affecting my training,\" she said.\"I felt tired a lot of the time and was constantly being disrupted by hospital appointments and coughing blood in the middle of sessions.\"",
        "Two rounds of antibiotics finally did the trick, leading doctors to believe it was an infection, although Christie still doesn't know for certain the definitive cause.By the end of March, and for the first time in 16 months, she was free to train and race without anxiety over her health.\"It worked wonders. I felt so relieved and it just made me emotionally better,\" she said. \"I could now put more of myself back into training and paddling. \"I didn't have to worry about what was wrong with me and whether it was affecting my training, and then therefore my results later in the season.\"With the weight lifted - and despite a second successive pre-season having been dogged by health problems - Christie raced to the best season of her career.It culminated in a senior silver medal in the women's K1 classic at the 2024 World Championships - Great Britain's first medal in that event in 14 years - swiftly followed by a canoe pairs world title with sister Emma.",
        "Her elation was mixed with a debt of gratitude.\"The hospital was really great so I went back to say thank you to the doctor and her team and everyone that helped me so much,\" she said.\"Without them fixing me I wouldn't have been able to achieve all that I did.\"With winter training behind her, Christie now faces the British trials next month ahead of a busy international schedule which includes the European Championships and Sprint World Championships.But her main target will come at the Under-23 Wildwater World Championships in Slovenia at the start of July.\"My main goals are to win the classic race and make the sprint final, and I'd also like to be top five in the classic at senior Euros,\" she said.",
        "Christie became a triple world champion shortly before a lump was discovered in her lung",
        "World champion paddler Kerry Christie has revealed the best season of her career came while juggling long-running health problems and a cancer scare.",
        "The 21-year-old has established herself as Great Britain's leading female in wildwater canoeing, thanks to a rapid rise through the ranks.",
        "But just six months after becoming European under-23 kayak champion, the Leicestershire paddler's ambitions were tempered by health concerns when she began to cough up blood.",
        "\"I started coughing up blood at the beginning of 2023 and had various doctors appointments and went to A&E to try and figure out what was causing this,\" she told BBC Sport.",
        "After several months of tests, Christie's fears grew when she was referred to the lung cancer unit at a Nottingham hospital in August 2023.",
        "\"They had discovered a lump in one of my lungs and I had to have MRI scans, biopsies and bronchoscopies, which all came up with nothing.\"",
        "While tests struggled to find the cause, a lung biopsy did, at least, rule out cancer.",
        "\"I can't quite tell you how relieved I was,\" she said. \"I really love canoeing and I was scared that I might have to stop and give up training for a bit, which I would have absolutely hated.",
        "\"It's part of who I am and I wouldn't have been me if I had to stop, so I was extremely happy to find out it wasn't something horrible and scary like cancer.\"",
        "Despite what was going on behind the scenes, on the water Christie  continued to prosper in 2023.",
        "Honours that season included, remarkably, three golds among a five-medal haul at that summer's Junior and Under-23 Wildwater Canoeing World Championships in the Czech Republic.",
        "It was Great Britain's first world title at this level for 13 years - yet, still, concerns and uncertainty over her health remained.",
        "\"Come the beginning of 2024, I was still coughing blood and this was affecting my training,\" she said.",
        "\"I felt tired a lot of the time and was constantly being disrupted by hospital appointments and coughing blood in the middle of sessions.\"",
        "The family behind GB's wildwater canoeing success",
        "Two rounds of antibiotics finally did the trick, leading doctors to believe it was an infection, although Christie still doesn't know for certain the definitive cause.",
        "By the end of March, and for the first time in 16 months, she was free to train and race without anxiety over her health.",
        "\"It worked wonders. I felt so relieved and it just made me emotionally better,\" she said.",
        "\"I could now put more of myself back into training and paddling.",
        "\"I didn't have to worry about what was wrong with me and whether it was affecting my training, and then therefore my results later in the season.\"",
        "With the weight lifted - and despite a second successive pre-season having been dogged by health problems - Christie raced to the best season of her career.",
        "It culminated in a senior silver medal in the women's K1 classic at the 2024 World Championships - Great Britain's first medal in that event in 14 years - swiftly followed by a canoe pairs world title with sister Emma.",
        "Kerry (right) and her sister Emma won Great Britain's first senior world championship gold in eight years last season",
        "Her elation was mixed with a debt of gratitude.",
        "\"The hospital was really great so I went back to say thank you to the doctor and her team and everyone that helped me so much,\" she said.",
        "\"Without them fixing me I wouldn't have been able to achieve all that I did.\"",
        "With winter training behind her, Christie now faces the British trials next month ahead of a busy international schedule which includes the European Championships and Sprint World Championships.",
        "But her main target will come at the Under-23 Wildwater World Championships in Slovenia at the start of July.",
        "\"My main goals are to win the classic race and make the sprint final, and I'd also like to be top five in the classic at senior Euros,\" she said."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/canoeing/articles/cgj4n65g25eo",
      "main_category": "sport",
      "detailed_category": "canoeing",
      "topic": "Canoeist Clifton 'inspired' by Paralympics debut",
      "content": [
        "Para-canoeist Ed Clifton hopes a full four-year cycle of training and competition can turn him into a medal contender at the next Paralympics.Clifton finished seventh for GB in the VL2 final in Paris last month after switching to the water from athletics field sports.He lost the use of his legs after damaging his spine in a holiday fall from a balcony and only took up canoeing in 2021.\"It (Paris) was a mad experience, especially in the village; it's not like anything that I've been to before. Being around people of different disabilities, it's quite inspiring,\" he told BBC Essex.",
        "\"It'll be nice to have a cycle of a full four years now. It'll be a chance to get a bit more experience and I should get a bit faster.\"There are plenty more Paralympics ahead hopefully and fingers crossed, I've got to work towards it, but that's the plan.\"Rather than a kayak, Clifton competes in a Va'a boat.\"It has got an outrigger on it and it's a single bladed boat, we only paddle on one side, so that is a little bit different,\" he said.Clifton played rugby regularly before his accident and after spending six months at the Stoke Mandeville spinal injury unit, he was keen to find a new way of  maintaining his sporting interest.It led him to athletics and he was good enough to represent Great Britain in 2019 in F56 throwing events.\"I was doing javelin, discus and shot for a few years to a semi-decent standard, and then saw canoeing on the telly and thought I'd give it a go.\"There was another GB athlete [Stewart Clark] in Chelmsford that I met in a gym, and he invited me to come paddle with him in Chelmsford. He trained me, and it all kicked off from there really.\"It's a lot different to athletics and throwing. It gave me a bit more opportunity to be out and mix with different people, be out and about basically.\"Slater also finished seventh in his first international para-canoeing event, the Poznan World Cup, in 2022 and was ninth at last year's World Championships.He came through a qualifying event in Hungary to reach the Paralympics, but had to wait for his chance in Paris with the para-canoeing among the later events in the schedule.\"We weren't at the opening (ceremony). We didn't go into the village until a week later because our competition was on last. I tried not to watch too much (on TV) or get too excited.\"In the final, I wasn't really happy with my performance, but I couldn't be happier with getting there and having the experience of being at the Paralympics,\" he added.\"It makes you hungry to do it again.\"",
        "Ed Clifton trains in Nottingham four days a week, year round",
        "Para-canoeist Ed Clifton hopes a full four-year cycle of training and competition can turn him into a medal contender at the next Paralympics.",
        "Clifton finished seventh for GB in the VL2 final in Paris last month after switching to the water from athletics field sports.",
        "He lost the use of his legs after damaging his spine in a holiday fall from a balcony and only took up canoeing in 2021.",
        "\"It (Paris) was a mad experience, especially in the village; it's not like anything that I've been to before. Being around people of different disabilities, it's quite inspiring,\" he told BBC Essex.",
        "Listen to BBC Essex Sports Extra",
        "\"It'll be nice to have a cycle of a full four years now. It'll be a chance to get a bit more experience and I should get a bit faster.",
        "\"There are plenty more Paralympics ahead hopefully and fingers crossed, I've got to work towards it, but that's the plan.\"",
        "Rather than a kayak, Clifton competes in a Va'a boat.",
        "\"It has got an outrigger on it and it's a single bladed boat, we only paddle on one side, so that is a little bit different,\" he said.",
        "Clifton played rugby regularly before his accident and after spending six months at the Stoke Mandeville spinal injury unit, he was keen to find a new way of  maintaining his sporting interest.",
        "It led him to athletics and he was good enough to represent Great Britain in 2019 in F56 throwing events.",
        "\"I was doing javelin, discus and shot for a few years to a semi-decent standard, and then saw canoeing on the telly and thought I'd give it a go.",
        "\"There was another GB athlete [Stewart Clark] in Chelmsford that I met in a gym, and he invited me to come paddle with him in Chelmsford. He trained me, and it all kicked off from there really.",
        "\"It's a lot different to athletics and throwing. It gave me a bit more opportunity to be out and mix with different people, be out and about basically.\"",
        "Slater also finished seventh in his first international para-canoeing event, the Poznan World Cup, in 2022 and was ninth at last year's World Championships.",
        "He came through a qualifying event in Hungary to reach the Paralympics, but had to wait for his chance in Paris with the para-canoeing among the later events in the schedule.",
        "\"We weren't at the opening (ceremony). We didn't go into the village until a week later because our competition was on last. I tried not to watch too much (on TV) or get too excited.",
        "\"In the final, I wasn't really happy with my performance, but I couldn't be happier with getting there and having the experience of being at the Paralympics,\" he added.",
        "\"It makes you hungry to do it again.\""
      ]
    },
    {
      "url": "https://www.bbc.com/sport/canoeing/articles/cy433gdqn77o",
      "main_category": "sport",
      "detailed_category": "canoeing",
      "topic": "GB's Dickson & Franklin win World Cup golds",
      "content": [
        "Great Britain enjoyed its most successful day of kayak cross racing at a World Cup, with four medals in Ivrea, including golds for Mallory Franklin and Jonny Dickson. Dickson won the men's event following a late charge at the Italian venue, while fellow GB canoeist Sam Leaver finished third and Britain's Olympic silver medallist Joe Clarke was fourth. Franklin edged out team-mate Kimberley Woods, who claimed silver in the women's final, pushing Australia's Olympic champion Noemie Fox into third. \"It was a real battle with Kim [Woods] - I had to fight,\" said Franklin, 30, who was overall World Cup kayak cross champion in 2022. \"It is pretty tough [racing Woods] because I want her to do well as well, but to get ahead was really nice and to come away winning it is obviously amazing.\"",
        "Woods, who also claimed canoe slalom (C1) silver on Saturday, moved top of the women's overall standings in kayak cross with one round of the World Cup series remaining.Dickson looked to be out of contention in the men's final but capitalised after a coming together between GB team-mate Leaver and France's Gael Adisson, who ended up with silver.\"I think in that final I knew I had a pretty good chance because anything can happen - I went from third to first in the last gate,\" he said.",
        "Great Britain's Jonny Dickson won the men's event and Mallory Franklin edged out team-mate Kimberley Woods (pictured)",
        "Great Britain enjoyed its most successful day of kayak cross racing at a World Cup, with four medals in Ivrea, including golds for Mallory Franklin and Jonny Dickson.",
        "Dickson won the men's event following a late charge at the Italian venue, while fellow GB canoeist Sam Leaver finished third and Britain's Olympic silver medallist Joe Clarke was fourth.",
        "Franklin edged out team-mate Kimberley Woods, who claimed silver in the women's final, pushing Australia's Olympic champion Noemie Fox into third.",
        "\"It was a real battle with Kim [Woods] - I had to fight,\" said Franklin, 30, who was overall World Cup kayak cross champion in 2022.",
        "\"It is pretty tough [racing Woods] because I want her to do well as well, but to get ahead was really nice and to come away winning it is obviously amazing.\"",
        "Woods, who also claimed canoe slalom (C1) silver on Saturday, moved top of the women's overall standings in kayak cross with one round of the World Cup series remaining.",
        "Dickson looked to be out of contention in the men's final but capitalised after a coming together between GB team-mate Leaver and France's Gael Adisson, who ended up with silver.",
        "\"I think in that final I knew I had a pretty good chance because anything can happen - I went from third to first in the last gate,\" he said."
      ]
    }
  ]
}