{
  "scraped_at": "2025-10-27T18:56:59.816546",
  "total_articles": 7,
  "category": "table-tennis",
  "articles_per_category": 100,
  "articles": [
    {
      "url": "https://www.bbc.com/sport/table-tennis/articles/c04ed5k57y1o",
      "main_category": "sport",
      "detailed_category": "table-tennis",
      "topic": "Welsh Para-table tennis legend Robinson retires",
      "content": [
        "Welsh Paralympic champion Neil Robinson is retiring after a career in which he represented Great Britain in 11 Paralympic Games, seven as an athlete and four as a coach.Bridgend-born Robinson, 66, won gold with the men's C3 team as well as a silver in the singles competion at the 1992 Barcelona Paralympics.He also won medals in Atlanta, Sydney and Athens, before retiring after the Beijing games and starting his coaching career at London 2012.\"This is a very difficult decision given my long-term involvement with British Para Table Tennis [BPTT],\" said Robinson, \"but I feel the time has come to retire and have the flexibility to spend more quality time with my family, even more so now that my wife Karen and I are grandparents. \"I love the sport of table tennis so I intend to stay involved and to continue working with BPTT when required and I will look at helping to develop established and new players individually.\"",
        "Robinson was training to work as an electrician in the Merchant Navy when he was a passenger in a car accident at the age of 18 that left him requiring a wheelchair.After taking up table tennis during rehab he went on to become one of Britain's most successful Paralympians, winning seven medals across seven games. Robinson was also a European champion and world number one, and in 2012 he received an MBE in the Queen's New Year's Honours List for his services to the sport.Having switched to coaching, and with several Welsh players in the British squad, Robinson set up a centre at the Welsh Institute of Sport in Cardiff where the Welsh players could benefit from top quality coaching on a full-time basis.\"This was really important,\" said BPTT performance director Gorazd Vecko.\"When we started with the new structure the Welsh players came to Sheffield for a training camp, and for the rest of the time there was no coaching in Wales at the highest level. \"When I look back, I think that Neil was a huge part of every medal that was achieved by a wheelchair player from Wales over the last 15 years.\"Robinson coached Paul Davies to a bronze medal in London and also Tom Matthews to bronze in Tokyo 2021.Although he was not in the corner when another of his players, Rob Davies, won gold in Rio, that remains one of his highlights alongside his own playing acheivements.\"I am very proud to have had a positive influence in the lives of the athletes that I have been involved with and contributed to some of their life changing moments,\" said Robinson. \"There have been many memorable moments at the Paralympics Games - the standout moments for me as an athlete are in Barcelona 1992 where I won gold and silver medals, and Atlanta 1996 in achieving silver and bronze medals.\"As a coach, again there are several amazing memories - coaching Paul Davies to an unexpected singles bronze medal at the 'home games' in London 2012 and years of preparing Rob Davies to achieve his singles gold in Rio 2016. \"The circumstances surrounding Tokyo 2021 and then coaching Paul Karabardak, Tom Matthews and Megan Shackleton to their first Paralympic medals was really special to me. \"I am extremely proud to have won seven Paralympic medals as an athlete but working closely with and helping athletes achieve their Paralympic dreams gives me a greater feeling of satisfaction.\"",
        "Neil Robinson competed in seven successive Paralympic games",
        "Welsh Paralympic champion Neil Robinson is retiring after a career in which he represented Great Britain in 11 Paralympic Games, seven as an athlete and four as a coach.",
        "Bridgend-born Robinson, 66, won gold with the men's C3 team as well as a silver in the singles competion at the 1992 Barcelona Paralympics.",
        "He also won medals in Atlanta, Sydney and Athens, before retiring after the Beijing games and starting his coaching career at London 2012.",
        "\"This is a very difficult decision given my long-term involvement with British Para Table Tennis [BPTT],\" said Robinson, \"but I feel the time has come to retire and have the flexibility to spend more quality time with my family, even more so now that my wife Karen and I are grandparents.",
        "\"I love the sport of table tennis so I intend to stay involved and to continue working with BPTT when required and I will look at helping to develop established and new players individually.\"",
        "Robinson was training to work as an electrician in the Merchant Navy when he was a passenger in a car accident at the age of 18 that left him requiring a wheelchair.",
        "After taking up table tennis during rehab he went on to become one of Britain's most successful Paralympians, winning seven medals across seven games.",
        "Robinson was also a European champion and world number one, and in 2012 he received an MBE in the Queen's New Year's Honours List for his services to the sport.",
        "Having switched to coaching, and with several Welsh players in the British squad, Robinson set up a centre at the Welsh Institute of Sport in Cardiff where the Welsh players could benefit from top quality coaching on a full-time basis.",
        "\"This was really important,\" said BPTT performance director Gorazd Vecko.",
        "\"When we started with the new structure the Welsh players came to Sheffield for a training camp, and for the rest of the time there was no coaching in Wales at the highest level.",
        "\"When I look back, I think that Neil was a huge part of every medal that was achieved by a wheelchair player from Wales over the last 15 years.\"",
        "Robinson coached Paul Davies to a bronze medal in London and also Tom Matthews to bronze in Tokyo 2021.",
        "Although he was not in the corner when another of his players, Rob Davies, won gold in Rio, that remains one of his highlights alongside his own playing acheivements.",
        "\"I am very proud to have had a positive influence in the lives of the athletes that I have been involved with and contributed to some of their life changing moments,\" said Robinson.",
        "\"There have been many memorable moments at the Paralympics Games - the standout moments for me as an athlete are in Barcelona 1992 where I won gold and silver medals, and Atlanta 1996 in achieving silver and bronze medals.",
        "\"As a coach, again there are several amazing memories - coaching Paul Davies to an unexpected singles bronze medal at the 'home games' in London 2012 and years of preparing Rob Davies to achieve his singles gold in Rio 2016.",
        "\"The circumstances surrounding Tokyo 2021 and then coaching Paul Karabardak, Tom Matthews and Megan Shackleton to their first Paralympic medals was really special to me.",
        "\"I am extremely proud to have won seven Paralympic medals as an athlete but working closely with and helping athletes achieve their Paralympic dreams gives me a greater feeling of satisfaction.\""
      ]
    },
    {
      "url": "https://www.bbc.com/sport/table-tennis/articles/c3dvdnedx0eo",
      "main_category": "sport",
      "detailed_category": "table-tennis",
      "topic": "How will a smaller Commonwealth Games affect Team Wales?",
      "content": [
        "Fewer sports, fewer athletes, fewer medals. The Commonwealth Games is changing - and almost everyone involved accepts it has to.But what impact will the slimmed-down version in Glasgow in 2026 have on Team Wales?",
        "Wales finished eighth in the medal table two years ago in Birmingham.But almost a quarter of its medallists from the 2022 Games would now not be able to compete.The loss of table tennis, rhythmic gymnastics, squash and triathlon would have cost Wales nine of its 38 medal-winners.Non Stanford is a former world champion triathlete who went to the Rio Olympics, but her silver in the mixed team event in Birmingham was one of the highlights of her career.\"I think it will have a really big effect,\" she told BBC Sport Wales. \"The Commonwealth Games allow some of our developing athletes to experience a major Games.\"The only time I got to race in a Welsh tri suit was at a Commonwealth Games. So it’s a big disappointment.\"",
        "That sentiment from Stanford explains the unique position the Commonwealth Games hold in Welsh sport.They are both a pathway and a pinnacle - the chance to get experience of a major international event, whilst at the same time giving athletes an unrivalled opportunity to compete in the red of Wales.In 2022 a relatively unknown teenage cyclist called Emma Finucane won two bronze medals for Wales in the velodrome.It set her on a path to become an Olympic gold medallist and three-time world champion.",
        "Another triple cycling world champion - Anna Morris - credits the Commonwealth Games for giving her the platform that led to her first call-up by British Cycling.But despite concerns the Commonwealths had more recently become a 'mini-Olympics', they are not just a stepping stone to the greatest show on earth.For so many athletes in Wales, they are the highest peak they can reach. Certainly whilst donning the dragon.Some feel so strongly about it that I have heard numerous Olympians and Paralympians speak of being unsatisfied with their career achievements until they have done it for Wales.At the 2018 Games in Australia, I asked one Welsh gold medallist if they were looking forward to hearing the anthem on the podium. \"Yeah\", she said, \"and I'm going to sing it too.\"The Games just bring out something different in Welsh athletes, which explains why there is still overwhelming positivity that they are going ahead in Glasgow at all.",
        "But there is still huge disappointment amongst the other sports excluded.Squash was on a real high after it was confirmed as being part of the next Olympic Games in Los Angeles.It also brought Team Wales a Commonwealth silver medal in 2022 - thanks to Joel Makin - and bronze in 2018 from Tesni Evans.But it has become one of the big casualties from the 2026 event.Squash Wales said it was \"incredibly disappointed, particularly given our previous success\" and expressed concerns over future funding.Sport Wales have attempted to ease concerns over funding, insisting there will be no major funding implications following the decision to reduce the number of sports at the Games.Only a small percentage of funding is based on performances at a Commonwealth Games - so they claim future funding should not be affected greatly either.",
        "Table tennis is also out.The sport which gave rise to Anna Hursey, Wales' youngest international athlete.The Cardiff teenager made global headlines in 2018, when Team Wales selected her for the Gold Coast Games when she was just 11-years-old.She went to her second Games in Birmingham in 2022 and won bronze in the women's doubles alongside Charlotte Carey.In the summer she became the first Welsh table tennis player to go to an Olympic Games - and praised the experience she was able to get representing Wales along the way.Table Tennis Wales are yet to publicly comment on the sport not making the cut for Glasgow.",
        "Hockey's exclusion led to a strong reaction from the game's boss in Wales.Chief executive Paul Whapham said it was \"deeply disappointing\" and would have a wide-reaching impact.\"This decision is especially disheartening given the lack of use of the 2014 Glasgow legacy venue,\" he continued, \"which was specifically built to host world-class hockey events.\"The exclusion not only impacts our athletes, but also the wider hockey community, who cherish the sport’s place on the international stage. \"We will continue to advocate for hockey’s rightful inclusion and remain committed to growing the sport both in Wales and globally.\"",
        "At Birmingham 2022, 75-year-old Gordon Llewellyn won a silver medal in the lawn bowls.Three days later Anna Hursey - 59 years his junior - won her bronze in the table tennis.It is a unique event and Commonwealth Games Wales are delighted it will live on.\"We are grateful\", admits its chair, Gareth Davies.\"All credit to Commonwealth Games Scotland for stepping up to the mark to secure the event.\"You've got to feel for the sports who will miss out on these Games, but we need to restructure the model because countries can't afford to stage the glitzy events we've seen over the years.\"This model could be a precursor for future events, which then perhaps brings different countries in to host a future Games.\"Although Davies did stop short of saying Wales could be a future host.",
        "The last time Glasgow hosted the Commonwealths, a certain Geraint Thomas took the gold in the men's road race.Even with a Tour de France yellow jersey and two Olympic gold medals, he still ranks that win as one of his career highlights.Road cycling will not be held in Glasgow in 2026. Mountain biking also does not make the cut.But the sport's governing body, Beicio Cymru, is keen to point out the good news of having track cycling in the programme.And that seems to be the overriding theme in Wales: focus on the positives.Because given how close we came to no host at all, in 2026 it is this or nothing.And nothing would be so much worse.",
        "Charlotte Carey and Anna Hursey won table tennis bronze for Wales at Birmingham 2022 - but their sport will not be at the 2026 event in Glasgow",
        "Fewer sports, fewer athletes, fewer medals.",
        "The Commonwealth Games is changing - and almost everyone involved accepts it has to.",
        "But what impact will the slimmed-down version in Glasgow in 2026 have on Team Wales?",
        "Wales finished eighth in the medal table two years ago in Birmingham.",
        "But almost a quarter of its medallists from the 2022 Games would now not be able to compete.",
        "The loss of table tennis, rhythmic gymnastics, squash and triathlon would have cost Wales nine of its 38 medal-winners.",
        "Non Stanford is a former world champion triathlete who went to the Rio Olympics, but her silver in the mixed team event in Birmingham was one of the highlights of her career.",
        "\"I think it will have a really big effect,\" she told BBC Sport Wales.",
        "\"The Commonwealth Games allow some of our developing athletes to experience a major Games.",
        "\"The only time I got to race in a Welsh tri suit was at a Commonwealth Games. So it’s a big disappointment.\"",
        "This video can not be played",
        "Commonwealth Games: Triathlon relay silver 'icing on cake' for Non Stanford",
        "That sentiment from Stanford explains the unique position the Commonwealth Games hold in Welsh sport.",
        "They are both a pathway and a pinnacle - the chance to get experience of a major international event, whilst at the same time giving athletes an unrivalled opportunity to compete in the red of Wales.",
        "In 2022 a relatively unknown teenage cyclist called Emma Finucane won two bronze medals for Wales in the velodrome.",
        "It set her on a path to become an Olympic gold medallist and three-time world champion.",
        "Emma Finucane (left) won bronze in the women's team sprint and individual sprint at the 2022 Commonwealth Games - before going on to become Olympic and world champion",
        "Another triple cycling world champion - Anna Morris - credits the Commonwealth Games for giving her the platform that led to her first call-up by British Cycling.",
        "But despite concerns the Commonwealths had more recently become a 'mini-Olympics', they are not just a stepping stone to the greatest show on earth.",
        "For so many athletes in Wales, they are the highest peak they can reach. Certainly whilst donning the dragon.",
        "Some feel so strongly about it that I have heard numerous Olympians and Paralympians speak of being unsatisfied with their career achievements until they have done it for Wales.",
        "At the 2018 Games in Australia, I asked one Welsh gold medallist if they were looking forward to hearing the anthem on the podium.",
        "\"Yeah\", she said, \"and I'm going to sing it too.\"",
        "The Games just bring out something different in Welsh athletes, which explains why there is still overwhelming positivity that they are going ahead in Glasgow at all.",
        "Will Glasgow be last leg or clever rebirth for Commonwealths?",
        "Scotland agrees to host Commonwealth Games in 2026",
        "But there is still huge disappointment amongst the other sports excluded.",
        "Squash was on a real high after it was confirmed as being part of the next Olympic Games in Los Angeles.",
        "It also brought Team Wales a Commonwealth silver medal in 2022 - thanks to Joel Makin - and bronze in 2018 from Tesni Evans.",
        "But it has become one of the big casualties from the 2026 event.",
        "Squash Wales said it was \"incredibly disappointed, particularly given our previous success\" and expressed concerns over future funding.",
        "Sport Wales have attempted to ease concerns over funding, insisting there will be no major funding implications following the decision to reduce the number of sports at the Games.",
        "Only a small percentage of funding is based on performances at a Commonwealth Games - so they claim future funding should not be affected greatly either.",
        "Anna Hursey represented Wales aged 11 at the 2018 Games",
        "Table tennis is also out.",
        "The sport which gave rise to Anna Hursey, Wales' youngest international athlete.",
        "The Cardiff teenager made global headlines in 2018, when Team Wales selected her for the Gold Coast Games when she was just 11-years-old.",
        "She went to her second Games in Birmingham in 2022 and won bronze in the women's doubles alongside Charlotte Carey.",
        "In the summer she became the first Welsh table tennis player to go to an Olympic Games - and praised the experience she was able to get representing Wales along the way.",
        "Table Tennis Wales are yet to publicly comment on the sport not making the cut for Glasgow.",
        "Sarah Jones has been to two Olympic Games with Great Britain and three Commonwealths with Wales",
        "Hockey's exclusion led to a strong reaction from the game's boss in Wales.",
        "Chief executive Paul Whapham said it was \"deeply disappointing\" and would have a wide-reaching impact.",
        "\"This decision is especially disheartening given the lack of use of the 2014 Glasgow legacy venue,\" he continued, \"which was specifically built to host world-class hockey events.",
        "\"The exclusion not only impacts our athletes, but also the wider hockey community, who cherish the sport’s place on the international stage.",
        "\"We will continue to advocate for hockey’s rightful inclusion and remain committed to growing the sport both in Wales and globally.\"",
        "At Birmingham 2022, 75-year-old Gordon Llewellyn won a silver medal in the lawn bowls.",
        "Three days later Anna Hursey - 59 years his junior - won her bronze in the table tennis.",
        "It is a unique event and Commonwealth Games Wales are delighted it will live on.",
        "\"We are grateful\", admits its chair, Gareth Davies.",
        "\"All credit to Commonwealth Games Scotland for stepping up to the mark to secure the event.",
        "\"You've got to feel for the sports who will miss out on these Games, but we need to restructure the model because countries can't afford to stage the glitzy events we've seen over the years.",
        "\"This model could be a precursor for future events, which then perhaps brings different countries in to host a future Games.\"",
        "Although Davies did stop short of saying Wales could be a future host.",
        "Geraint Thomas won the men's road race in Glasgow back in 2014.",
        "The last time Glasgow hosted the Commonwealths, a certain Geraint Thomas took the gold in the men's road race.",
        "Even with a Tour de France yellow jersey and two Olympic gold medals, he still ranks that win as one of his career highlights.",
        "Road cycling will not be held in Glasgow in 2026. Mountain biking also does not make the cut.",
        "But the sport's governing body, Beicio Cymru, is keen to point out the good news of having track cycling in the programme.",
        "And that seems to be the overriding theme in Wales: focus on the positives.",
        "Because given how close we came to no host at all, in 2026 it is this or nothing.",
        "And nothing would be so much worse."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/table-tennis/articles/cyvpllmm8pjo",
      "main_category": "sport",
      "detailed_category": "table-tennis",
      "topic": "GB's Bayley beaten in final after controversial penalty",
      "content": [
        "Will Bayley says he was \"devastated\" to lose the final of the men's S7 table tennis singles following a controversial umpiring decision in the deciding game.The British athlete was penalised a point by umpire Darek Mikita in the fifth game after Bayley was judged to have kicked the ball in frustration due to missing a shot.The 36-year-old says he often uses his feet to retrieve balls due to difficulties moving his limbs, and that he has never been penalised for this previously.Bayley went on to lose a thrilling final to Yan Shuo of China 11-8 12-14 11-7 7-11 11-9.\"I'm just devastated, it hasn't really sunk in 100%,\" said Bayley. \"I felt I was the better player today without sounding bitter, I felt good today.\"",
        "On using his feet to help retrieve balls between points, he said: \"Especially when I'm tired, my legs aren't that good so I kick the ball into the barrier to pick it up, it's a lot easier.\"I automatically do it, I was still doing it after I got red-carded - then I started running after the ball because I didn't want him to fault me. I wasn't doing it with thinking, I do it in training, I'm on autopilot. I have never had an umpire say anything about it in my life.\"On whether the penalty affected him, Bayley added: \"Big time. I was 3-1 up in that [fifth] game, another and it's 4-1. I felt it was important - it's a game to 11, it's quick. But somehow I have to find a way to accept that. \"I have to look at the video [of the match] as well, I don't know what he was talking about for a lot of the issues.\"Bayley had been initially yellow-carded in the second game by Mikita for misbehaviour on court. International Table Tennis Federation rules state if the player gets a second yellow for an infringement, their opponent is awarded a point.That proved to be key in deciding the outcome as Shuo defeated Bayley in the S7 singles final for the second successive Paralympics.Bayley has reached the final of the previous four Games, but only won one - at Rio 2016 - while now having to settle for three silvers.",
        "After being penalised a point, Bayley engaged in a long debate with Mikita and also spoke to an off-court official before having to accept the penalty.He also spoke to the umpire afterwards. Asked what he told Mikita, Bayley said: \"I said, I've never seen anything like it. It's the Paralympic final. It's difficult to take, I'm gutted and I'm emotional, it's difficult to talk logically.\"Bayley resolved to return for the next Paralympics and go for gold in Los Angeles in 2028.\"I'm good enough to win a Paralympic Games - 100% [will go for LA 2028], I just need to get over this loss, I'm sure I will in a few weeks,\" he added.Earlier on Friday, Rob Davies claimed silver in the men's singles MS1.The Welshman, 40, won gold at Rio 2016 but was unable to defend his title in Tokyo five years later because of a shoulder injury.In Friday's final, Cuba's Yunier Fernandez won a close first game before wrapping up a 14-12 11-7 11-4 victory.Medals won by Bayley and Davies added to the three bronze medals won by ParalympicsGB in Para-table tennis earlier in the Games - those for Felicity Pickard and Bly Twomey in the women's doubles WD14, Billy Shilton and Paul Karabardak in the men's doubles MD14 and Twomey in the women's singles WS7.",
        "Will Bayley was furious after being given a red card early in the deciding fifth game",
        "Will Bayley says he was \"devastated\" to lose the final of the men's S7 table tennis singles following a controversial umpiring decision in the deciding game.",
        "The British athlete was penalised a point by umpire Darek Mikita in the fifth game after Bayley was judged to have kicked the ball in frustration due to missing a shot.",
        "The 36-year-old says he often uses his feet to retrieve balls due to difficulties moving his limbs, and that he has never been penalised for this previously.",
        "Bayley went on to lose a thrilling final to Yan Shuo of China 11-8 12-14 11-7 7-11 11-9.",
        "\"I'm just devastated, it hasn't really sunk in 100%,\" said Bayley. \"I felt I was the better player today without sounding bitter, I felt good today.\"",
        "What's happening and when at the Paris Paralympics?",
        "Paris 2024 Paralympics medal table",
        "All you need to know about the Paris Paralympics",
        "On using his feet to help retrieve balls between points, he said: \"Especially when I'm tired, my legs aren't that good so I kick the ball into the barrier to pick it up, it's a lot easier.",
        "\"I automatically do it, I was still doing it after I got red-carded - then I started running after the ball because I didn't want him to fault me. I wasn't doing it with thinking, I do it in training, I'm on autopilot. I have never had an umpire say anything about it in my life.\"",
        "On whether the penalty affected him, Bayley added: \"Big time. I was 3-1 up in that [fifth] game, another and it's 4-1. I felt it was important - it's a game to 11, it's quick. But somehow I have to find a way to accept that.",
        "\"I have to look at the video [of the match] as well, I don't know what he was talking about for a lot of the issues.\"",
        "Bayley had been initially yellow-carded in the second game by Mikita for misbehaviour on court. International Table Tennis Federation rules state if the player gets a second yellow for an infringement, their opponent is awarded a point.",
        "That proved to be key in deciding the outcome as Shuo defeated Bayley in the S7 singles final for the second successive Paralympics.",
        "Bayley has reached the final of the previous four Games, but only won one - at Rio 2016 - while now having to settle for three silvers.",
        "Bayley looked devastated as he sat courtside following the conclusion of the final",
        "Sport-by-sport guide to Paris 2024 Paralympics",
        "Paralympics 2024: What you need to know about classification",
        "Paralympics 2024: Who has been selected for the GB team?",
        "After being penalised a point, Bayley engaged in a long debate with Mikita and also spoke to an off-court official before having to accept the penalty.",
        "He also spoke to the umpire afterwards. Asked what he told Mikita, Bayley said: \"I said, I've never seen anything like it. It's the Paralympic final. It's difficult to take, I'm gutted and I'm emotional, it's difficult to talk logically.\"",
        "Bayley resolved to return for the next Paralympics and go for gold in Los Angeles in 2028.",
        "\"I'm good enough to win a Paralympic Games - 100% [will go for LA 2028], I just need to get over this loss, I'm sure I will in a few weeks,\" he added.",
        "Earlier on Friday, Rob Davies claimed silver in the men's singles MS1.",
        "The Welshman, 40, won gold at Rio 2016 but was unable to defend his title in Tokyo five years later because of a shoulder injury.",
        "In Friday's final, Cuba's Yunier Fernandez won a close first game before wrapping up a 14-12 11-7 11-4 victory.",
        "Medals won by Bayley and Davies added to the three bronze medals won by ParalympicsGB in Para-table tennis earlier in the Games - those for Felicity Pickard and Bly Twomey in the women's doubles WD14, Billy Shilton and Paul Karabardak in the men's doubles MD14 and Twomey in the women's singles WS7.",
        "Paris 2024 Paralympics"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/table-tennis/articles/c0e8z1dq09jo",
      "main_category": "sport",
      "detailed_category": "table-tennis",
      "topic": "Improvements have 'showed' this year  - Shilton",
      "content": [
        "Para-table tennis player Billy Shilton said work to improve his game has \"showed\" this season, as he heads to the Paralympics hoping to win another medal. Shilton won bronze in Tokyo in the men’s class 8 team event three years ago after being selected for his first Games as a wildcard.Yet the 25-year-old qualified for the Paris Games this spring with two gold-medal victories and another six medals this season, and is also the current world champion in the class 14 doubles.\"Every day I'm trying to do everything I can to improve and I think it's definitely showed this season,\" Shilton told BBC Radio Gloucestershire.\"The last couple of years were tough for me, I wasn't finding the level that I was training in matches and I found that quite difficult, but I stuck to the game plan and everything's started to come into motion now.\"",
        "Shilton from Stonehouse, Gloucestershire, reached the quarter-finals of the singles events in Tokyo on his last Paralympics outing and has also won multiple European medals during his career.  This year he has taken singles gold at the Costa Brava Spanish Open and gold in the men's class 14 doubles at the Czech Open.He also collected two silvers in the US Open and four more bronze medals before his Paralympics campaign begins on 29 August.The team event in which he won bronze in Tokyo has been replaced with the doubles classification in Paris, an event where Shilton won the world title alongside Paul Karabardak in November 2022. The tournament was the duo's second together and Shilton believes things have only got better since. They are seeded fifth in Paris.\"We've played two, three years together as a pair and we're going from strength to strength, every tournament we're improving,\" Shilton said.\"I've been working hard the last three years after Tokyo. I sat down with my coaches and we laid out the position I needed to be in a few months before Paris and I think that's paid off.\"Shilton has Charcot-Marie-Tooth disease (CMT), a group of inherited conditions that damage nerves outside the brain and spine, and found his start in the sport at a local club. His dad and two brothers now all play as well. \"I wasn't the hugest fan of table tennis at the time, I was loving football when I was a young age,\" Shilton said. \"But my disability started to deteriorate and I needed to find something else. Since then I've absolutely loved it.\"",
        "Billy Shilton is the world champion in the para-table tennis class 14 doubles and a Toyko Games bronze medallist",
        "Para-table tennis player Billy Shilton said work to improve his game has \"showed\" this season, as he heads to the Paralympics hoping to win another medal.",
        "Shilton won bronze in Tokyo in the men’s class 8 team event three years ago after being selected for his first Games as a wildcard.",
        "Yet the 25-year-old qualified for the Paris Games this spring with two gold-medal victories and another six medals this season, and is also the current world champion in the class 14 doubles.",
        "\"Every day I'm trying to do everything I can to improve and I think it's definitely showed this season,\" Shilton told BBC Radio Gloucestershire.",
        "\"The last couple of years were tough for me, I wasn't finding the level that I was training in matches and I found that quite difficult, but I stuck to the game plan and everything's started to come into motion now.\"",
        "Paralympics 2024: A guide to Para-table tennis at the Paris Games",
        "All you need to know about the Paris Paralympics",
        "Shilton from Stonehouse, Gloucestershire, reached the quarter-finals of the singles events in Tokyo on his last Paralympics outing and has also won multiple European medals during his career.",
        "This year he has taken singles gold at the Costa Brava Spanish Open and gold in the men's class 14 doubles at the Czech Open.",
        "He also collected two silvers in the US Open and four more bronze medals before his Paralympics campaign begins on 29 August.",
        "The team event in which he won bronze in Tokyo has been replaced with the doubles classification in Paris, an event where Shilton won the world title alongside Paul Karabardak in November 2022.",
        "The tournament was the duo's second together and Shilton believes things have only got better since. They are seeded fifth in Paris.",
        "\"We've played two, three years together as a pair and we're going from strength to strength, every tournament we're improving,\" Shilton said.",
        "\"I've been working hard the last three years after Tokyo. I sat down with my coaches and we laid out the position I needed to be in a few months before Paris and I think that's paid off.\"",
        "Shilton has Charcot-Marie-Tooth disease (CMT), a group of inherited conditions that damage nerves outside the brain and spine, and found his start in the sport at a local club.",
        "His dad and two brothers now all play as well.",
        "\"I wasn't the hugest fan of table tennis at the time, I was loving football when I was a young age,\" Shilton said.",
        "\"But my disability started to deteriorate and I needed to find something else. Since then I've absolutely loved it.\"",
        "Billy Shilton: 'ever thankful to the doctor'"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/table-tennis/articles/cx2xnw9qejpo",
      "main_category": "sport",
      "detailed_category": "table-tennis",
      "topic": "Judge ready to revel in Paralympics experience with beloved family",
      "content": [
        "\"If your goal is complicated and what you are trying to achieve is difficult, you are bound to encounter adversity. \"If you have that attitude, the blows and disappointments become easier to survive and you can hopefully enjoy the highs all the more.\"Colin Judge had to deal with adversity from day one of his life after being born with only one limb, his left arm. The Dublin table tennis player will carry the Ireland tricolour with that one arm at the Paralympics opening ceremony on Wednesday after being chosen for the country's flagbearing role along with sprint athlete Orla Comerford.At Place de La Concorde, the 29-year-old will look to pick out proud parents Michelle and Brian and brother Niall in the crowd, along with his aunt Anna and other family members and friends determined to squeeze every drop out of the Paris Games experience after none of them could join him in Tokyo three years ago amid the Covid-19 restrictions. Colin's beloved grandmother Patricia Butler, who turned 91 recently, won't be in Paris but will proudly watch every moment on television in county Donegal alongside another of his aunts Assumpta.\"My family supported me from the day I was born. I can’t even imagine how difficult it was back then,\" Judge told BBC Sport Northern Ireland.\" \"They did an incredible job of setting me up in life and I’ve so much to be grateful to my mum and dad.\"",
        "His parents' love and unwavering support from his extended family as everybody in his life pulled hard for him, in turn fostered a resilience that is the very essence of his being. \"Failure is a reality. I learned that at a young age when my mum used to put my shirt and tie on the bed every morning,\" recalled Judge.\"I always tried and failed to put it on but from the age of eight I was able to dress myself.  \"I figured out so many different ways that didn’t work and then I found a way that did. That’s the main message I would give to kids.\"Judge loved sport from an early age but couldn't find a suitable sporting outlet before, on his own initiative, an email to UCD table tennis club when he was aged 13 opened up a whole new vista in his life.Many school children, able-bodied and disabled, and indeed adults have heard the message of fortitude and hope he gives during talks at schools and businesses throughout Ireland.\"I try and give people the belief my parents gave me that if you work hard at something you can achieve it no matter what it is,\" said Judge.In tandem with his table tennis prowess, he excelled academically at St Michael's College in Dublin and University College Dublin as his mathematical ability enabled him to become an actuary, with KPMG having been among his employers before he concentrated fully on table tennis.",
        "That decision to commit fully to chasing his dream of becoming a Paralympian, ironically, came after he had received the biggest blow of his table tennis career in 2018.That was when he was re-classified from class two to class three in Paralympic table tennis, which dropped him from fifth in the world rankings to outside the top 30 in his new class.\"I had just won the European Championship but went from being pretty much guaranteed to qualify for Tokyo and having a really good medal chance to looking very unlikely to qualify,\" he said.\"I knew I couldn’t compete unless I became a much better table tennis player so I moved to a club in Germany and then based myself in Slovakia for a year. \"A lot of athletes were very disappointed the Games were postponed by a year but it gave me more time to practise and when crunch time came around I got one of the last places for Tokyo.\"Judge will forever be grateful for the support he received from Slovakian Paralympian Boris Travnicek, who put him up in his apartment in addition to driving him to tournaments all over central and eastern Europe that they both were competing in.\"I had a few sponsors. It was quite cheap to live in Slovakia and Boris was very generous,\" he said. \"My family and friends obviously helped as well. I had a GoFundMe and Anna, my aunt in particular, my mum and dad and a lot of my extended family and friends supported me. I also got a UCD scholarship. I didn't have a lot of money but enough to cover my expenses.\"",
        "A tough first-round draw in Tokyo meant an early exit but he immediately resolved to still be around for Paris 2024 so that he could sample the kind of atmosphere that enthralled him when he attended London 2012 along with his father.Once again the draw is going to be crucial with his non seed ranking of 10th meaning he could again face one of the medal favourites - including China's Feng Panfeng, who has never lost during his career and is regarded as the best Paralympic table tennis player.\"He’s one of my idols so I probably wouldn’t want to play him in the first round,\" said Judge, whose competition will begin on either 1 or 2 September.\"But after that I can beat anyone on my day.\" The Irishman goes into the Games after a hugely encouraging display in his final warm-up tournament when finishing runner-up at the Czech Open. Being chosen as one of Ireland's flagbearers has only heightened the excitement levels and his parents' sense of pride and he is determined to lap up every moment. \"If it goes well, there’s nobody else I’d rather share the success with but if it doesn’t go well and I’m disappointed, there are no two other people I’d rather have by my side,\" said Judge, who added that he could prolong his sporting career into the LA Games in 2028.",
        "Dubliner Colin Judge will compete at his second Paralympics in Paris and says he could prolong his table tennis career until the LA Games in 2028",
        "\"If your goal is complicated and what you are trying to achieve is difficult, you are bound to encounter adversity.",
        "\"If you have that attitude, the blows and disappointments become easier to survive and you can hopefully enjoy the highs all the more.\"",
        "Colin Judge had to deal with adversity from day one of his life after being born with only one limb, his left arm.",
        "The Dublin table tennis player will carry the Ireland tricolour with that one arm at the Paralympics opening ceremony on Wednesday after being chosen for the country's flagbearing role along with sprint athlete Orla Comerford.",
        "At Place de La Concorde, the 29-year-old will look to pick out proud parents Michelle and Brian and brother Niall in the crowd, along with his aunt Anna and other family members and friends determined to squeeze every drop out of the Paris Games experience after none of them could join him in Tokyo three years ago amid the Covid-19 restrictions.",
        "Colin's beloved grandmother Patricia Butler, who turned 91 recently, won't be in Paris but will proudly watch every moment on television in county Donegal alongside another of his aunts Assumpta.",
        "\"My family supported me from the day I was born. I can’t even imagine how difficult it was back then,\" Judge told BBC Sport Northern Ireland.\"",
        "\"They did an incredible job of setting me up in life and I’ve so much to be grateful to my mum and dad.\"",
        "His parents' love and unwavering support from his extended family as everybody in his life pulled hard for him, in turn fostered a resilience that is the very essence of his being.",
        "\"Failure is a reality. I learned that at a young age when my mum used to put my shirt and tie on the bed every morning,\" recalled Judge.",
        "\"I always tried and failed to put it on but from the age of eight I was able to dress myself.",
        "\"I figured out so many different ways that didn’t work and then I found a way that did. That’s the main message I would give to kids.\"",
        "Judge loved sport from an early age but couldn't find a suitable sporting outlet before, on his own initiative, an email to UCD table tennis club when he was aged 13 opened up a whole new vista in his life.",
        "Many school children, able-bodied and disabled, and indeed adults have heard the message of fortitude and hope he gives during talks at schools and businesses throughout Ireland.",
        "\"I try and give people the belief my parents gave me that if you work hard at something you can achieve it no matter what it is,\" said Judge.",
        "In tandem with his table tennis prowess, he excelled academically at St Michael's College in Dublin and University College Dublin as his mathematical ability enabled him to become an actuary, with KPMG having been among his employers before he concentrated fully on table tennis.",
        "Colin Judge will be Ireland's flagbearer along with track and field sprinter Orla Comerford during the Paralympics opening ceremony in Paris on Wednesday",
        "That decision to commit fully to chasing his dream of becoming a Paralympian, ironically, came after he had received the biggest blow of his table tennis career in 2018.",
        "That was when he was re-classified from class two to class three in Paralympic table tennis, which dropped him from fifth in the world rankings to outside the top 30 in his new class.",
        "\"I had just won the European Championship but went from being pretty much guaranteed to qualify for Tokyo and having a really good medal chance to looking very unlikely to qualify,\" he said.",
        "\"I knew I couldn’t compete unless I became a much better table tennis player so I moved to a club in Germany and then based myself in Slovakia for a year.",
        "\"A lot of athletes were very disappointed the Games were postponed by a year but it gave me more time to practise and when crunch time came around I got one of the last places for Tokyo.\"",
        "Judge will forever be grateful for the support he received from Slovakian Paralympian Boris Travnicek, who put him up in his apartment in addition to driving him to tournaments all over central and eastern Europe that they both were competing in.",
        "\"I had a few sponsors. It was quite cheap to live in Slovakia and Boris was very generous,\" he said.",
        "\"My family and friends obviously helped as well. I had a GoFundMe and Anna, my aunt in particular, my mum and dad and a lot of my extended family and friends supported me. I also got a UCD scholarship. I didn't have a lot of money but enough to cover my expenses.\"",
        "A tough first-round draw in Tokyo meant an early exit but he immediately resolved to still be around for Paris 2024 so that he could sample the kind of atmosphere that enthralled him when he attended London 2012 along with his father.",
        "Once again the draw is going to be crucial with his non seed ranking of 10th meaning he could again face one of the medal favourites - including China's Feng Panfeng, who has never lost during his career and is regarded as the best Paralympic table tennis player.",
        "\"He’s one of my idols so I probably wouldn’t want to play him in the first round,\" said Judge, whose competition will begin on either 1 or 2 September.",
        "\"But after that I can beat anyone on my day.\"",
        "The Irishman goes into the Games after a hugely encouraging display in his final warm-up tournament when finishing runner-up at the Czech Open.",
        "Being chosen as one of Ireland's flagbearers has only heightened the excitement levels and his parents' sense of pride and he is determined to lap up every moment.",
        "\"If it goes well, there’s nobody else I’d rather share the success with but if it doesn’t go well and I’m disappointed, there are no two other people I’d rather have by my side,\" said Judge, who added that he could prolong his sporting career into the LA Games in 2028."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/table-tennis/articles/c24pz6vnje7o",
      "main_category": "sport",
      "detailed_category": "table-tennis",
      "topic": "The Paralympic table tennis love story",
      "content": [
        "Paris is renowned for its association with love and romance, having inspired countless novels, films and songs over the years.Now, as the city prepares to host the Paralympic Games, an African love story is set to shine in the French capital with the promise of gold.The protagonists poised to compete for medals are Christiana and Kayode Alabi, the power couple of Para-table tennis from Nigeria.Both are the continent's top-ranked players in their class, with Christiana winning silver at the 2022 Commonwealth Games and her husband securing two gold medals at the African Para Championships last year.Their journey together began in 2017, during national trials for the Commonwealth Games, and Kayode recalls their first meeting with fondness.\"It was her first time at the camp and she looked very beautiful and quiet,\" he told BBC Sport Africa.Christiana, however, was not immediately won over.\"He came to me, we talked, but then I was not giving him much attention,\" she said.",
        "Despite the initial hesitation and distance between them - Christiana was based in Asaba, a seven-hour journey from Lagos where Kayode lived - the couple maintained their connection through phone calls.In 2019, Christiana moved to Lagos to be with Kayode and further her career. \"Things were tough in Asaba and I was struggling to continue,\" Christiana, who is a wheelchair user, explained.\"Kayode encouraged me to join him so we could train together.\"Their marriage in 2022 faced external criticism, with some questioning the viability of their relationship.\"While our families supported us, others saw it as unusual for two people with disabilities to be together,\" Christiana recalled.Against these odds, their relationship has flourished both professionally and personally.\"Christiana has been my coach at many tournaments,\" Kayode said.\"We listen to each other and work well together, which is why we're heading to the Paralympics as a team.”Kayode will play in the men's class 6 singles as well as men's and mixed doubles events, while Christiana will compete in the women's class 5 singles.\"We practise together five times a week,\" Christiana said.\"He's passed on his knowledge of the game to me, and we've grown both as athletes and partners.\"",
        "The Alabis' tale is particularly compelling because of the barriers they face in Nigeria.Both were affected by polio as children, which is why Christiana uses a wheelchair, while Kayode lost the use of his right leg and requires support to walk.\"I was the only child with a disability in my community, which made life very difficult,\" Christiana revealed.\"My disability made it hard to make friends and I was very shy, rarely mingling with others.\"Although Kayode had a similar experience, he did find support in his friends. \"Some friends would take turns to carry me on their back,\" he said.\"It was tough to keep up with transport to school or training. I was always the last person to get on the bus because I waited for the crowd to thin out first.\"As adults, the couple still find their daily lives marked by significant obstacles.\"Navigating from our home to the training ground is extremely challenging,\" said Kayode.\"Finding a bus that can accommodate my wife's wheelchair is not easy.\"According to the Nigerian National Development Plan 2021-2025, more than 96% of people with disabilities in the country lack access to assistive devices.When it comes to public infrastructure - which includes things like buildings, transportation and roads - 98.5% remains inaccessible.Despite these hurdles, Christiana finds solace in their mutual support.\"We help each other out.\"Kayode is very caring. If I need something and don't want to go out, he'll take care of it for me. Financially, we manage well.\"",
        "The couple have ramped up their training regime in their determination to excel at the Paralympics.Their rigorous preparation incorporated weekly gym sessions to build strength and endurance. Beyond that, the Alabis dedicate time at home to video analysis of their practice sessions.They have driven each other on, with Christiana the first to seal her spot at the Games via the African qualifying event in Egypt last September.\"It was my wife who qualified while I was still in the semi-final,\" Kayode recalled.\"That motivated me to put in even more effort so that we both could qualify.\"Christiana, reflecting on their joint achievement, expresses her gratitude and ambition.\"I'm glad that we made it together,\" she said.\"My expectation is to get to the top, bring honour to Nigeria, my family and my husband, who has been training me all along.\"Their daily routine is a testament to their dedication.Each morning begins with a two-hour training session. After a midday break, they return for an additional session in the evening.This disciplined schedule reflects their commitment to not only supporting each other but also to achieving their shared goal of success.As the Alabis finalise their preparations for Paris 2024, this Paralympic love story is set to inspire those watching in Nigeria and around the world.",
        "This video can not be played",
        "Christiana and Kayode Alabi go into the Paralympics as the top-ranked African players in their respective classes",
        "Paris is renowned for its association with love and romance, having inspired countless novels, films and songs over the years.",
        "Now, as the city prepares to host the Paralympic Games, an African love story is set to shine in the French capital with the promise of gold.",
        "The protagonists poised to compete for medals are Christiana and Kayode Alabi, the power couple of Para-table tennis from Nigeria.",
        "Both are the continent's top-ranked players in their class, with Christiana winning silver at the 2022 Commonwealth Games and her husband securing two gold medals at the African Para Championships last year.",
        "Their journey together began in 2017, during national trials for the Commonwealth Games, and Kayode recalls their first meeting with fondness.",
        "\"It was her first time at the camp and she looked very beautiful and quiet,\" he told BBC Sport Africa.",
        "Christiana, however, was not immediately won over.",
        "\"He came to me, we talked, but then I was not giving him much attention,\" she said.",
        "All you need to know about the Paris Paralympics",
        "Husnah Kukundakwe: I hope others will feel courage to join in",
        "Despite the initial hesitation and distance between them - Christiana was based in Asaba, a seven-hour journey from Lagos where Kayode lived - the couple maintained their connection through phone calls.",
        "In 2019, Christiana moved to Lagos to be with Kayode and further her career.",
        "\"Things were tough in Asaba and I was struggling to continue,\" Christiana, who is a wheelchair user, explained.",
        "\"Kayode encouraged me to join him so we could train together.\"",
        "Their marriage in 2022 faced external criticism, with some questioning the viability of their relationship.",
        "\"While our families supported us, others saw it as unusual for two people with disabilities to be together,\" Christiana recalled.",
        "Against these odds, their relationship has flourished both professionally and personally.",
        "\"Christiana has been my coach at many tournaments,\" Kayode said.",
        "\"We listen to each other and work well together, which is why we're heading to the Paralympics as a team.”",
        "Kayode will play in the men's class 6 singles as well as men's and mixed doubles events, while Christiana will compete in the women's class 5 singles.",
        "\"We practise together five times a week,\" Christiana said.",
        "\"He's passed on his knowledge of the game to me, and we've grown both as athletes and partners.\"",
        "The couple have a tennis table in their living room, which they use for practice when they cannot attend training sessions",
        "The Alabis' tale is particularly compelling because of the barriers they face in Nigeria.",
        "Both were affected by polio as children, which is why Christiana uses a wheelchair, while Kayode lost the use of his right leg and requires support to walk.",
        "\"I was the only child with a disability in my community, which made life very difficult,\" Christiana revealed.",
        "\"My disability made it hard to make friends and I was very shy, rarely mingling with others.\"",
        "Although Kayode had a similar experience, he did find support in his friends.",
        "\"Some friends would take turns to carry me on their back,\" he said.",
        "\"It was tough to keep up with transport to school or training. I was always the last person to get on the bus because I waited for the crowd to thin out first.\"",
        "As adults, the couple still find their daily lives marked by significant obstacles.",
        "\"Navigating from our home to the training ground is extremely challenging,\" said Kayode.",
        "\"Finding a bus that can accommodate my wife's wheelchair is not easy.\"",
        "According to the Nigerian National Development Plan 2021-2025, more than 96% of people with disabilities in the country lack access to assistive devices.",
        "When it comes to public infrastructure - which includes things like buildings, transportation and roads - 98.5% remains inaccessible.",
        "Despite these hurdles, Christiana finds solace in their mutual support.",
        "\"We help each other out.",
        "\"Kayode is very caring. If I need something and don't want to go out, he'll take care of it for me. Financially, we manage well.\"",
        "Christiana won a silver medal at the 2022 Commonwealth Games in Birmingham competing as Ifechukwude Ikpeoyi",
        "The couple have ramped up their training regime in their determination to excel at the Paralympics.",
        "Their rigorous preparation incorporated weekly gym sessions to build strength and endurance.",
        "Beyond that, the Alabis dedicate time at home to video analysis of their practice sessions.",
        "They have driven each other on, with Christiana the first to seal her spot at the Games via the African qualifying event in Egypt last September.",
        "\"It was my wife who qualified while I was still in the semi-final,\" Kayode recalled.",
        "\"That motivated me to put in even more effort so that we both could qualify.\"",
        "Christiana, reflecting on their joint achievement, expresses her gratitude and ambition.",
        "\"I'm glad that we made it together,\" she said.",
        "\"My expectation is to get to the top, bring honour to Nigeria, my family and my husband, who has been training me all along.\"",
        "Their daily routine is a testament to their dedication.",
        "Each morning begins with a two-hour training session. After a midday break, they return for an additional session in the evening.",
        "This disciplined schedule reflects their commitment to not only supporting each other but also to achieving their shared goal of success.",
        "As the Alabis finalise their preparations for Paris 2024, this Paralympic love story is set to inspire those watching in Nigeria and around the world."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/table-tennis/articles/c3geezdjpxqo",
      "main_category": "sport",
      "detailed_category": "table-tennis",
      "topic": "Paralympics 2024: A guide to Para-table tennis at the Paris Games",
      "content": [
        "Dates: 29 August-7 SeptemberVenue: South Paris Arena 4Gold medals on offer: 31",
        "The sport follows the rules set by the International Table Tennis Federation with only slight modifications to the serving laws for athletes competing in wheelchairs. Each player aims to hit the ball over the net on to the opponent's half of the table and wins the point if they fail to return it successfully.A match is played over the best of five sets, with each won by the first player to reach 11 points. If the score in a set reaches 10-10, though, a player must establish a two-point lead to win it. The server changes every two points.Competitions take the form of preliminary rounds followed by knockout stages.For Paris, team events have been revamped and replaced by men's and women's pairs and mixed doubles events.Athletes with a range of impairments can take part in the sport and there are 11 different classifications: 1-5 for those competing in wheelchairs, 6-10 for those who play standing and 11 for standing athletes with a learning disability.Athletes are assessed and allocated a number between 1 and 10, depending on their functional ability - reach, muscle strength, locomotive restrictions, balance and ability to grip the bat. In the wheelchair category, those competing in class 1 have the highest level of impairment with class 6 being for standing athletes with the highest level of impairment.",
        "Rio gold medallists Will Bayley and Rob Davies lead the British team's hopes.Bayley, who appeared on Strictly Come Dancing in 2019, recovered from a serious knee injury sustained on the programme to win class 6 silver in Tokyo but wants to be back on the top of the podium again while Davies missed Tokyo through injury.And there will be lots of interest in 14-year-old Bly Twomey who trains alongside Bayley in Brighton and who only made her international debut last year but has already enjoyed plenty of success.",
        "China have been the trailblazers for many years and one of their many stars, Liu Jing, will be aiming to win a history-making fifth successive singles title when she competes in the women's C1-2 event. Liu has also won five team medals since making her debut in Beijing in 2008 but will face a tough challenge from Korea's Seo Su-yeon.But for longevity, it is Slovakia’s Jan Riapos and Spain’s Jose Manuel Ruiz Reyes who are the stars with both set to make their eighth Paralympic appearance, having made their debuts in Atlanta in 1996.Riapos has four golds a silver and a bronze from his class 2 events while Ruiz Reyes  has three silvers and two bronzes in class 10.And Brazil's Bruna Alexandre and Melissa Tapper of Australia come to the Paralympics having already experienced the Paris competition atmosphere by representing their nations at the Olympics.",
        "Table tennis was part of the Paralympic movement before it was played at the Olympics. It was one of the sports included in the first Paralympic Games in Rome in 1960 but it was the Seoul Games in 1988 when it made its Olympic debut.",
        "Seven - two silver (Will Bayley and Bayley/Paul Karabardak) and five bronze (Karabardak, Thomas Matthews, Jack Hunter-Spivey, Ross Wilson/Aaron McKibbin/Billy Shilton and Megan Shackleton/Sue Bailey)",
        "China play a shot on their way to one of their 16 golds in Tokyo",
        "Dates: 29 August-7 September",
        "Venue: South Paris Arena 4",
        "Gold medals on offer: 31",
        "The sport follows the rules set by the International Table Tennis Federation with only slight modifications to the serving laws for athletes competing in wheelchairs. Each player aims to hit the ball over the net on to the opponent's half of the table and wins the point if they fail to return it successfully.",
        "A match is played over the best of five sets, with each won by the first player to reach 11 points. If the score in a set reaches 10-10, though, a player must establish a two-point lead to win it. The server changes every two points.",
        "Competitions take the form of preliminary rounds followed by knockout stages.",
        "For Paris, team events have been revamped and replaced by men's and women's pairs and mixed doubles events.",
        "Athletes with a range of impairments can take part in the sport and there are 11 different classifications: 1-5 for those competing in wheelchairs, 6-10 for those who play standing and 11 for standing athletes with a learning disability.",
        "Athletes are assessed and allocated a number between 1 and 10, depending on their functional ability - reach, muscle strength, locomotive restrictions, balance and ability to grip the bat. In the wheelchair category, those competing in class 1 have the highest level of impairment with class 6 being for standing athletes with the highest level of impairment.",
        "Rio gold medallists Will Bayley and Rob Davies lead the British team's hopes.",
        "Bayley, who appeared on Strictly Come Dancing in 2019, recovered from a serious knee injury sustained on the programme to win class 6 silver in Tokyo but wants to be back on the top of the podium again while Davies missed Tokyo through injury.",
        "And there will be lots of interest in 14-year-old Bly Twomey who trains alongside Bayley in Brighton and who only made her international debut last year but has already enjoyed plenty of success.",
        "China have been the trailblazers for many years and one of their many stars, Liu Jing, will be aiming to win a history-making fifth successive singles title when she competes in the women's C1-2 event.",
        "Liu has also won five team medals since making her debut in Beijing in 2008 but will face a tough challenge from Korea's Seo Su-yeon.",
        "But for longevity, it is Slovakia’s Jan Riapos and Spain’s Jose Manuel Ruiz Reyes who are the stars with both set to make their eighth Paralympic appearance, having made their debuts in Atlanta in 1996.",
        "Riapos has four golds a silver and a bronze from his class 2 events while Ruiz Reyes  has three silvers and two bronzes in class 10.",
        "And Brazil's Bruna Alexandre and Melissa Tapper of Australia come to the Paralympics having already experienced the Paris competition atmosphere by representing their nations at the Olympics.",
        "Table tennis was part of the Paralympic movement before it was played at the Olympics. It was one of the sports included in the first Paralympic Games in Rome in 1960 but it was the Seoul Games in 1988 when it made its Olympic debut.",
        "Seven - two silver (Will Bayley and Bayley/Paul Karabardak) and five bronze (Karabardak, Thomas Matthews, Jack Hunter-Spivey, Ross Wilson/Aaron McKibbin/Billy Shilton and Megan Shackleton/Sue Bailey)"
      ]
    }
  ]
}