{
  "scraped_at": "2025-10-27T18:56:59.811546",
  "total_articles": 12,
  "category": "shooting",
  "articles_per_category": 100,
  "articles": [
    {
      "url": "https://www.bbc.com/sport/shooting/articles/clyrly4e3nqo",
      "main_category": "sport",
      "detailed_category": "shooting",
      "topic": "Llewellin takes skeet title at European Championships",
      "content": [
        "Britain's Ben Llewellin became the men's skeet European champion after claiming gold at the competition in Chateauroux, France.The Welshman held off the challenge of Tammaro Cassandro to beat the Italian, with Ireland's Jack Fairclough finishing fifth.Llewellin also claimed bronze in the skeet men's team event alongside Mitchell Brooker-Smith and Arran Eccleston.In the women's skeet, Amber Rutter took silver for Britain behind winner Lucie Anastassiou of France.",
        "Ben Llewellin has claimed skeet individual gold and team bronze at the European Championship",
        "Britain's Ben Llewellin became the men's skeet European champion after claiming gold at the competition in Chateauroux, France.",
        "The Welshman held off the challenge of Tammaro Cassandro to beat the Italian, with Ireland's Jack Fairclough finishing fifth.",
        "Llewellin also claimed bronze in the skeet men's team event alongside Mitchell Brooker-Smith and Arran Eccleston.",
        "In the women's skeet, Amber Rutter took silver for Britain behind winner Lucie Anastassiou of France.",
        "Missing Tokyo by one shot fuels Llewellin's fire"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/shooting/articles/c89ewww4v8po",
      "main_category": "sport",
      "detailed_category": "shooting",
      "topic": "McIntosh ditches retirement plan to erase Olympic demons",
      "content": [
        "\"I think it's probably the biggest disappointment I have ever had to deal with in my life.\"Seonaid McIntosh still carries the scars with her from two failed attempts to live up to her world number one ranking at the Olympics.They are not visible. But, after reversing her plan to retire after Paris 2024, she knows there is a chance they may never heal despite targeting a third attempt to medal in Los Angeles.\"I may get to the firing point and realise that I have not got over it all and I have just suppressed it all for a third time,\" the 29-year-old Scottish shooter told BBC Scotland.",
        "Big things have been expected of McIntosh at the Olympics since she won the 50m prone rifle world title in 2018 and the World Cup final the following year.World Cup and European titles have followed, but returning empty handed from Paris after failing to reach the final in any of the three disciplines she contested still rankles.\"I think most of it is out of my system, there is always going to be a little bit that stays,\" McIntosh said.\"It felt like that was the second time it had happened – it all conspired against me for Tokyo [Olympics in 2021] and the same thing happened for Paris, so that disappointment was, I think, doubled almost because of that.\"I am not sure if I am completely over it yet. We will find out when I go back to training, or even when we get to LA.\"McIntosh revealed that, prior to Paris \"I was absolutely adamant I was going to retire\" after it, regardless of how she got on.Amid her despair in France, a chat with her partner prompted a change of heart and the decision to have another go at trying to turn her Olympic medal dreams into reality.\"He turned to me and he said 'I know this isn't necessarily the right time for this, and obviously take time to make the decision, but if you want to go back for another games, given everything that has just happened, I will totally understand and I will 100% support you',\" she recalled. \"I was then like 'I don't think I could give it up at this point given what has just happened, I think I have to try again', because that was twice in a row I had got to the games as world number one and fluffed it up or something has happened.\"Even for my own sanity, I couldn't retire at this point in time and then be content with what has happened.\"",
        "McIntosh has still to return to training, although she hopes to do so in September, after two lots of surgery - to deal with a troublesome hip injury and a problem with her jaw.With rheumatoid arthritis and Chron's disease, the Edinburgh shooter is well used to dealing with physical issues.As she targets Los Angeles 2028, she admits finding a way of dealing with what affected her in each of the last two Olympics could be the biggest challenge.\"So now that it has happened twice, I have that worry, is this a pattern? Is it going to happen a third time?\" she said. \"I think this three years up until LA is going to be really different for me because I think I am going to have that fight with myself constantly.\"I think I am going to have that in the back of my head yapping at me being like, even if you go into this last one being the best you have ever been, and being world number one again, you are going to have a crisis of confidence when you get there and it is not going to matter.\"McIntosh does have time on her side with the qualification window for the LA games not opening until near the end of next year.\"Obviously I am going to be a wee bit rusty when I go back, but I think, technically, I am still one of the best shooters in the world,\" she added. \"I think the bit that is going to separate me is trying to figure out that psychology side of things.\"That is going to be theme for the next few years - either quietening that little voice or getting it to say something else I suppose.\"",
        "Seonaid McIntosh (centre) had been expecting to medal in Paris",
        "\"I think it's probably the biggest disappointment I have ever had to deal with in my life.\"",
        "Seonaid McIntosh still carries the scars with her from two failed attempts to live up to her world number one ranking at the Olympics.",
        "They are not visible. But, after reversing her plan to retire after Paris 2024, she knows there is a chance they may never heal despite targeting a third attempt to medal in Los Angeles.",
        "\"I may get to the firing point and realise that I have not got over it all and I have just suppressed it all for a third time,\" the 29-year-old Scottish shooter told BBC Scotland.",
        "Work starts to upgrade Scotstoun for Glasgow 2026",
        "Guernsey shooter Guillou wins two World Masters medals",
        "Pregnant GB shooter Mwandumba's twin aims",
        "Big things have been expected of McIntosh at the Olympics since she won the 50m prone rifle world title in 2018 and the World Cup final the following year.",
        "World Cup and European titles have followed, but returning empty handed from Paris after failing to reach the final in any of the three disciplines she contested still rankles.",
        "\"I think most of it is out of my system, there is always going to be a little bit that stays,\" McIntosh said.",
        "\"It felt like that was the second time it had happened – it all conspired against me for Tokyo [Olympics in 2021] and the same thing happened for Paris, so that disappointment was, I think, doubled almost because of that.",
        "\"I am not sure if I am completely over it yet. We will find out when I go back to training, or even when we get to LA.\"",
        "McIntosh revealed that, prior to Paris \"I was absolutely adamant I was going to retire\" after it, regardless of how she got on.",
        "Amid her despair in France, a chat with her partner prompted a change of heart and the decision to have another go at trying to turn her Olympic medal dreams into reality.",
        "\"He turned to me and he said 'I know this isn't necessarily the right time for this, and obviously take time to make the decision, but if you want to go back for another games, given everything that has just happened, I will totally understand and I will 100% support you',\" she recalled.",
        "\"I was then like 'I don't think I could give it up at this point given what has just happened, I think I have to try again', because that was twice in a row I had got to the games as world number one and fluffed it up or something has happened.",
        "\"Even for my own sanity, I couldn't retire at this point in time and then be content with what has happened.\"",
        "McIntosh has still to return to training, although she hopes to do so in September, after two lots of surgery - to deal with a troublesome hip injury and a problem with her jaw.",
        "With rheumatoid arthritis and Chron's disease, the Edinburgh shooter is well used to dealing with physical issues.",
        "As she targets Los Angeles 2028, she admits finding a way of dealing with what affected her in each of the last two Olympics could be the biggest challenge.",
        "\"So now that it has happened twice, I have that worry, is this a pattern? Is it going to happen a third time?\" she said.",
        "\"I think this three years up until LA is going to be really different for me because I think I am going to have that fight with myself constantly.",
        "\"I think I am going to have that in the back of my head yapping at me being like, even if you go into this last one being the best you have ever been, and being world number one again, you are going to have a crisis of confidence when you get there and it is not going to matter.\"",
        "McIntosh does have time on her side with the qualification window for the LA games not opening until near the end of next year.",
        "\"Obviously I am going to be a wee bit rusty when I go back, but I think, technically, I am still one of the best shooters in the world,\" she added. \"I think the bit that is going to separate me is trying to figure out that psychology side of things.",
        "\"That is going to be theme for the next few years - either quietening that little voice or getting it to say something else I suppose.\""
      ]
    },
    {
      "url": "https://www.bbc.com/sport/shooting/articles/cy8dezw6179o",
      "main_category": "sport",
      "detailed_category": "shooting",
      "topic": "Guernsey shooter Guillou wins two World Masters medals",
      "content": [
        "Guernsey shooter Paul Guillou says winning a gold and a silver medal at the World Masters Games is one of his finest achievements in the sport.The multiple Island Games medallist won the Men's Over 60's 10m air pistol and was second in the 10m air rifle at the event in Taiwan.Guillou won team gold in the air rifle at the Island Games in 2023 as well as three silver medals and a bronze. \"It definitely ranks well up there,\" he told BBC Radio Guernsey.\"It was the World Masters Games so I was up against people who had been potentially very, very good in their younger days.\"The person who won the rifle event had competed in a world event in 1994, so it was good to be able to rub shoulders with people who have been at that level.\"Guillou won the air pistol by two points but was 2.6 points off gold in the rifle event.He only took up the sport at the age of 45, with his wife, but has become one of Guernsey's top marksmen over the past few years, representing the island at five Island Games going back to 2011. With shooting not being included in the programme of sports at this summer's Island Games in Orkney, Guillou said competing at the event in Taiwan - where there were more than 25,000 competitors across a range of sports - was a great chance to test himself. \"I like to participate at a high level,\" he explained.\"I took part in the British Open in February, I didn't shoot as well as I wanted to, but I do like to compete at a the top level that I can.\"Given there was no shooting in the forthcoming Island Games, why not go to the World Games.\"",
        "Paul Guillou shows off his World Games medals back in Guernsey",
        "Guernsey shooter Paul Guillou says winning a gold and a silver medal at the World Masters Games is one of his finest achievements in the sport.",
        "The multiple Island Games medallist won the Men's Over 60's 10m air pistol and was second in the 10m air rifle at the event in Taiwan.",
        "Guillou won team gold in the air rifle at the Island Games in 2023 as well as three silver medals and a bronze.",
        "\"It definitely ranks well up there,\" he told BBC Radio Guernsey.",
        "\"It was the World Masters Games so I was up against people who had been potentially very, very good in their younger days.",
        "\"The person who won the rifle event had competed in a world event in 1994, so it was good to be able to rub shoulders with people who have been at that level.\"",
        "Guillou won the air pistol by two points but was 2.6 points off gold in the rifle event.",
        "He only took up the sport at the age of 45, with his wife, but has become one of Guernsey's top marksmen over the past few years, representing the island at five Island Games going back to 2011.",
        "With shooting not being included in the programme of sports at this summer's Island Games in Orkney, Guillou said competing at the event in Taiwan - where there were more than 25,000 competitors across a range of sports - was a great chance to test himself.",
        "\"I like to participate at a high level,\" he explained.",
        "\"I took part in the British Open in February, I didn't shoot as well as I wanted to, but I do like to compete at a the top level that I can.",
        "\"Given there was no shooting in the forthcoming Island Games, why not go to the World Games.\""
      ]
    },
    {
      "url": "https://www.bbc.com/sport/shooting/articles/c3d8p07kerpo",
      "main_category": "sport",
      "detailed_category": "shooting",
      "topic": "Pregnant GB shooter Mwandumba's twin aims",
      "content": [
        "Success in shooting requires steady hands, steely focus and the ability to block out all external distractions - but what about internal ones?For two-time English champion Ruth Mwandumba we are not talking about feeling peckish, or a little poorly; rather pregnancy and the prospect of being kicked by not only one or two feet at a time, but potentially four, and as many arms.\"Twins, yeah, a massive shock,\" said the smiling GB athlete, who is competing at the European Rifle Shooting Championships while six months pregnant.\"It's definitely a strange one [to compete] and not a normal thing people do!\"I've had some rough training sessions ahead of the Europeans and some days where every shot felt like I was climbing Mount Everest because I was in so much pain and doubt was creeping into my mind.\"But, sometimes it's about showing up, pushing through and embracing that struggle; I also need to remember to not be too hard on myself because I am growing two humans inside me right now.\"",
        "Mwandumba confesses that little can prepare you for the news that \"you have two in there\" but, on reflection, she feels her mind may have been preparing her in the days ahead of the first scan.\"Weirdly, I had a dream that the sonographer found more than one baby, so even though it was a surprise, I feel my body trying to warn me, so I feel like part of me knew deep down, inside, like intuition,\" she told BBC Sport.When prompted to reflect on her use of the word 'dream' rather than 'nightmare', she clarifies, while laughing; \"No actually you're right, it was a nightmare!\"I woke up going, 'that can't be happening, it's not happening, right?'\"The 29-year-old has also endured a tricky pregnancy, with nausea and vomiting extending into her second trimester.\"The whole pregnancy in general was a bit of a shock because I struggle quite badly with endometriosis,\" she revealed.\"It took four years of experiencing extreme pelvic pain, as well as really, really intense periods, before I was first officially diagnosed in 2017 and I've had two surgeries since.\"Endometriosis is a condition in which tissue, similar to the lining of the uterus, grows outside the uterus, and can cause infertility.She had \"difficult conversations\" with healthcare providers who warned her she might not be able to conceive naturally.\"It was almost scary to be discussing the possibility, at the age of 22-23, that I might not be able to have kids in the future.\"So, to have had those conversations and then all of a sudden be expecting twins, never mind just one, was a huge shock,\" said Mwandumba, who thought she might need IVF but ultimately did not require it.\"I think it's great to show it's not all doom-and-gloom and despite the negative experiences you can still get a beautiful experience at the end.\"",
        "UK Sport recently released enhanced pregnancy guidance, pledging to \"increase and improve support\" for female athletes.Mwandumba's British team-mate Amber Rutter was one of the first to receive this additional assistance in the lead up to the Paris 2024 Olympic Games, where she ultimately won silver, three months after becoming a mother.\"British Shooting have been so supportive from the beginning and I think the experience with Amber before the Olympics means they can use a lot of the same support and resources,\" said Mwandumba, who was a travelling reserve for the Paris 2024 Games.While optimistic about the future, one area of concern is becoming a parent and bringing black children into the world.The shooter, who has Malawian heritage, has been a prominent figure in the push for greater diversity in the sport, launching the #TargetChange initiative in 2022, while she has also previously spoken about her own concerns around racism in the UK.\"I think we're still very much in a scary world, and it definitely is something that scares me,\" she said.\"Change might be slow, but it is happening and I'll always be open with them about how they might be viewed or how they might approach certain situations, but hopefully by the time they are teenagers, things will be a bit different.\"Well before her children reach their teen years though, Mwandumba is hoping to not only return to the sport, but become an Olympian.She was the reserve to Seonaid McIntosh in the 10m air rifle event at the 2024 Games and has set her sights on the Los Angeles Olympics in 2028.\"Once upon a time, I felt as though pregnancy within elite sport automatically meant retirement, and obviously we're at a point now where that's not the case,\" said Mwandumba.\"So many people have been successful at their sport, gotten pregnant, had a family, then come back and have still managed to be just as successful, if not more so and I think that's so inspiring to those of us who are going through the journey.\"It's definitely motivated me to because my plan is to come back and still hopefully aim for those major competitions, with the Olympics the long-term goal.\"To do it with my twins watching on, would be all the more special.\"",
        "Ruth Mwandumba dreamt she was having twins before a scan confirmed that was the case",
        "Success in shooting requires steady hands, steely focus and the ability to block out all external distractions - but what about internal ones?",
        "For two-time English champion Ruth Mwandumba we are not talking about feeling peckish, or a little poorly; rather pregnancy and the prospect of being kicked by not only one or two feet at a time, but potentially four, and as many arms.",
        "\"Twins, yeah, a massive shock,\" said the smiling GB athlete, who is competing at the European Rifle Shooting Championships while six months pregnant.",
        "\"It's definitely a strange one [to compete] and not a normal thing people do!",
        "\"I've had some rough training sessions ahead of the Europeans and some days where every shot felt like I was climbing Mount Everest because I was in so much pain and doubt was creeping into my mind.",
        "\"But, sometimes it's about showing up, pushing through and embracing that struggle; I also need to remember to not be too hard on myself because I am growing two humans inside me right now.\"",
        "Mwandumba confesses that little can prepare you for the news that \"you have two in there\" but, on reflection, she feels her mind may have been preparing her in the days ahead of the first scan.",
        "\"Weirdly, I had a dream that the sonographer found more than one baby, so even though it was a surprise, I feel my body trying to warn me, so I feel like part of me knew deep down, inside, like intuition,\" she told BBC Sport.",
        "When prompted to reflect on her use of the word 'dream' rather than 'nightmare', she clarifies, while laughing; \"No actually you're right, it was a nightmare!",
        "\"I woke up going, 'that can't be happening, it's not happening, right?'\"",
        "The 29-year-old has also endured a tricky pregnancy, with nausea and vomiting extending into her second trimester.",
        "\"The whole pregnancy in general was a bit of a shock because I struggle quite badly with endometriosis,\" she revealed.",
        "\"It took four years of experiencing extreme pelvic pain, as well as really, really intense periods, before I was first officially diagnosed in 2017 and I've had two surgeries since.\"",
        "Endometriosis is a condition in which tissue, similar to the lining of the uterus, grows outside the uterus, and can cause infertility.",
        "She had \"difficult conversations\" with healthcare providers who warned her she might not be able to conceive naturally.",
        "\"It was almost scary to be discussing the possibility, at the age of 22-23, that I might not be able to have kids in the future.",
        "\"So, to have had those conversations and then all of a sudden be expecting twins, never mind just one, was a huge shock,\" said Mwandumba, who thought she might need IVF but ultimately did not require it.",
        "\"I think it's great to show it's not all doom-and-gloom and despite the negative experiences you can still get a beautiful experience at the end.\"",
        "UK Sport recently released enhanced pregnancy guidance, pledging to \"increase and improve support\" for female athletes.",
        "Mwandumba's British team-mate Amber Rutter was one of the first to receive this additional assistance in the lead up to the Paris 2024 Olympic Games, where she ultimately won silver, three months after becoming a mother.",
        "\"British Shooting have been so supportive from the beginning and I think the experience with Amber before the Olympics means they can use a lot of the same support and resources,\" said Mwandumba, who was a travelling reserve for the Paris 2024 Games.",
        "While optimistic about the future, one area of concern is becoming a parent and bringing black children into the world.",
        "The shooter, who has Malawian heritage, has been a prominent figure in the push for greater diversity in the sport, launching the #TargetChange initiative in 2022, while she has also previously spoken about her own concerns around racism in the UK.",
        "\"I think we're still very much in a scary world, and it definitely is something that scares me,\" she said.",
        "\"Change might be slow, but it is happening and I'll always be open with them about how they might be viewed or how they might approach certain situations, but hopefully by the time they are teenagers, things will be a bit different.\"",
        "Well before her children reach their teen years though, Mwandumba is hoping to not only return to the sport, but become an Olympian.",
        "She was the reserve to Seonaid McIntosh in the 10m air rifle event at the 2024 Games and has set her sights on the Los Angeles Olympics in 2028.",
        "\"Once upon a time, I felt as though pregnancy within elite sport automatically meant retirement, and obviously we're at a point now where that's not the case,\" said Mwandumba.",
        "\"So many people have been successful at their sport, gotten pregnant, had a family, then come back and have still managed to be just as successful, if not more so and I think that's so inspiring to those of us who are going through the journey.",
        "\"It's definitely motivated me to because my plan is to come back and still hopefully aim for those major competitions, with the Olympics the long-term goal.",
        "\"To do it with my twins watching on, would be all the more special.\""
      ]
    },
    {
      "url": "https://www.bbc.com/sport/articles/cj656x4le9ro",
      "main_category": "sport",
      "detailed_category": "shooting",
      "topic": "Bhaker named BBC Indian Sportswoman of the Year",
      "content": [
        "Olympic shooter Manu Bhaker has been named BBC Indian Sportswoman of the Year for 2024 after a global public vote.The 22-year-old was recognised for her historic achievement in becoming the first Indian woman to win two medals at a single Olympic Games.Bhaker became the first Indian woman to win an OIympic medal in shooting when she won bronze in the women's 10m air pistol in Paris. Two days later she won a second bronze - alongside Sarabjot Singh in the mixed 10m air pistol. Bhaker has previously won the BBC's ISWOTY Emerging Athlete of the Year award.On accepting her latest award, Bhaker said: \"I have had a journey of ups and downs. I hope I can inspire women, all athletes and people with big dreams.\"Your journey doesn't end if you are struggling. You write your own story.\"",
        "Her fellow shooter Avani Lekhara was presented with the BBC ISWOTY Para-sportswoman of the Year award.The 23-year-old is the first Indian woman to win three Paralympic medals, with gold in Paris following a gold and bronze at Tokyo 2020.Indian President Droupadi Murmu said: \"I appreciate the entire team of the BBC for the praiseworthy initiative of organising BBC Indian Sportswoman of the Year. \"The extraordinary athletes who have been recognised through this initiative have not only excelled in their sports but have also inspired young women to pursue their dreams fearlessly.\"BBC director general Tim Davie, who hosted the awards ceremony, said: \"Manu Bhaker's historic Olympic performance is a defining moment for Indian sports. Her journey from a promising young shooter to a record-breaking Olympian inspires athletes across the country and beyond.\"We are also honoured to celebrate Avani Lekhara as the Para-sportswoman of the Year. Her resilience and record-breaking success continue to pave the way for greater inclusion and excellence in Para-sports.\"The BBC's commitment to audiences in India makes our relationship here a special one, and we are proud to celebrate the achievements of India's incredible sportswomen.\"",
        "Archer Sheetal Devi won the Emerging Athlete Award after becoming India's youngest Paralympic medallist.The 18-year-old added a bronze medal at the Paris Games to two golds and one silver at the 2022 Asian Para Games, and a silver at the World Para Archery Championships.Mithali Raj was given the Lifetime Achievement Award for her record 18-year captaincy of the Indian women's cricket team.Raj, 42, led the team from 2004 to 2022 and is the longest-serving captain in international cricket history.",
        "The Collective Newsroom produced and managed the fifth edition of BBC ISWOTY.Rupa Jha, CEO of Collective Newsroom, said: \"I am delighted to see the impact these awards have been bringing to Indian women in sports - amplifying their achievements, breaking barriers, and inspiring future generations. \"These awards are not just about recognition but about creating a lasting impact on the sporting landscape of India and beyond.\"This year's theme - Champions' Champions - highlighted the unsung heroes who have supported and shaped medal-winning athletes. A special documentary featuring the guide runners of blind athletes is available on the BBC's six Indian language platforms as well on its English outlets.",
        "This video can not be played",
        "Shooter Manu Bhaker wins BBC Indian Sportswoman of the Year award",
        "Olympic shooter Manu Bhaker has been named BBC Indian Sportswoman of the Year for 2024 after a global public vote.",
        "The 22-year-old was recognised for her historic achievement in becoming the first Indian woman to win two medals at a single Olympic Games.",
        "Bhaker became the first Indian woman to win an OIympic medal in shooting when she won bronze in the women's 10m air pistol in Paris.",
        "Two days later she won a second bronze - alongside Sarabjot Singh in the mixed 10m air pistol.",
        "Bhaker has previously won the BBC's ISWOTY Emerging Athlete of the Year award.",
        "On accepting her latest award, Bhaker said: \"I have had a journey of ups and downs. I hope I can inspire women, all athletes and people with big dreams.",
        "\"Your journey doesn't end if you are struggling. You write your own story.\"",
        "Her fellow shooter Avani Lekhara was presented with the BBC ISWOTY Para-sportswoman of the Year award.",
        "The 23-year-old is the first Indian woman to win three Paralympic medals, with gold in Paris following a gold and bronze at Tokyo 2020.",
        "Indian President Droupadi Murmu said: \"I appreciate the entire team of the BBC for the praiseworthy initiative of organising BBC Indian Sportswoman of the Year.",
        "\"The extraordinary athletes who have been recognised through this initiative have not only excelled in their sports but have also inspired young women to pursue their dreams fearlessly.\"",
        "BBC director general Tim Davie, who hosted the awards ceremony, said: \"Manu Bhaker's historic Olympic performance is a defining moment for Indian sports. Her journey from a promising young shooter to a record-breaking Olympian inspires athletes across the country and beyond.",
        "\"We are also honoured to celebrate Avani Lekhara as the Para-sportswoman of the Year. Her resilience and record-breaking success continue to pave the way for greater inclusion and excellence in Para-sports.",
        "\"The BBC's commitment to audiences in India makes our relationship here a special one, and we are proud to celebrate the achievements of India's incredible sportswomen.\"",
        "This video can not be played",
        "ISWOTY winner: Avani Lekhara is Para-sportswoman of the year",
        "Archer Sheetal Devi won the Emerging Athlete Award after becoming India's youngest Paralympic medallist.",
        "The 18-year-old added a bronze medal at the Paris Games to two golds and one silver at the 2022 Asian Para Games, and a silver at the World Para Archery Championships.",
        "Mithali Raj was given the Lifetime Achievement Award for her record 18-year captaincy of the Indian women's cricket team.",
        "Raj, 42, led the team from 2004 to 2022 and is the longest-serving captain in international cricket history.",
        "This video can not be played",
        "Para-archer Sheetal Devi wins BBC ISWOTY Emerging Athlete award",
        "The Collective Newsroom produced and managed the fifth edition of BBC ISWOTY.",
        "Rupa Jha, CEO of Collective Newsroom, said: \"I am delighted to see the impact these awards have been bringing to Indian women in sports - amplifying their achievements, breaking barriers, and inspiring future generations.",
        "\"These awards are not just about recognition but about creating a lasting impact on the sporting landscape of India and beyond.\"",
        "This year's theme - Champions' Champions - highlighted the unsung heroes who have supported and shaped medal-winning athletes.",
        "A special documentary featuring the guide runners of blind athletes is available on the BBC's six Indian language platforms as well on its English outlets.",
        "This video can not be played",
        "Cricketer Mithali Raj is BBC ISWOTY Lifetime Achievement award winner"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/olympics/articles/cly4v3epzggo",
      "main_category": "sport",
      "detailed_category": "shooting",
      "topic": "Vote now for the BBC Indian Sportswoman of the Year",
      "content": [
        "The nominees for the fifth edition of BBC Indian Sportswoman of the Year have been announced.The five contenders are golfer Aditi Ashok, shooters Manu Bhaker and Avani Lekhara, cricketer Smriti Mandhana and wrestler Vinesh Phogat.The award honours the contributions of Indian sportswomen in 2024 and celebrates the achievements of all women involved in sport in the country.You can vote for your Indian Sportswoman of the Year on any of the BBC's Indian Language websites, or on the BBC Sport website.Head here to vote for your BBC Indian Sportswoman of the YearA panel selected by the BBC compiled the shortlist of the five Indian sportswomen. The jury includes some of the most authoritative sports journalists, experts and writers across India.The sportswoman with the most public votes will be the BBC Indian Sportswoman of the Year, with results broadcast on the BBC Indian Language sites and the BBC Sport website.Voting will remain open to the public until Friday, 31 January 2025 at 18:00 GMT (23:30 IST) and the winner will be announced on Monday, 17 February 2025 at a ceremony in Delhi. All of the terms and conditions and privacy notice are on the BBC News website.At the ceremony, the BBC will also honour three other sportswomen nominated by the jury in the categories: BBC Emerging Player of the Year award, to recognise the achievements of a young athlete; BBC Lifetime Achievement award, to celebrate a sports veteran for their unparalleled contribution to sports; and BBC Para Sportswoman of the Year award, to highlight excellence in para-sports.",
        "Ashok, 26, is the first Indian female golfer to qualify for three consecutive Olympic Games.At the age of 18, she finished 41st at Rio 2016, and then five years later in Tokyo, she finished just one shot shy of claiming a bronze medal. This was India's best performance in Olympic golf to date.At the 2024 Games in Paris, she finished in 29th place.Ashok is the first Indian player to win a title on the Ladies European Tour (LET) and has accumulated five victories so far. She has played for eight consecutive seasons on the LPGA Tour in the United States, registering 11 top ten finishes.She is also the recipient of one of India's highest sports honours, the Arjuna Award.",
        "Manu Bhaker (Shooting)",
        "Manu Bhaker, 22, is the first Indian woman to win two medals at one Olympic Games. She won two bronze medals in Air Pistol shooting at Paris 2024.At Tokyo 2020 luck eluded her as her pistol malfunctioned and she missed out on the finals. A reunion with longtime coach Jaspal Rana paid off, enabling her to claim those two medals in the French capital.In 2018, at the age of 16, Manu became the youngest Indian to win a gold medal at the Shooting World Cup.She has also been awarded the Khel Ratna, India's highest sports honour.",
        "Avani Lekhara (Para Shooting)",
        "Avani Lekhara, 23, is the first Indian woman to win three Paralympic medals. At Paris 2024, she won gold in the 10m Air Rifle event, following up a gold and a bronze medal from the Tokyo Games.Lekhara was introduced to shooting during a summer vacation from school in 2015.In her 12 years of competition, she has won gold, silver and bronze medals at World Cups, and brought home a further gold at the Asian Para Games in 2023.For her remarkable achievements, Lekhara has been recognized with the civilian honour, Padma Shri, and the highest sports honour, Khel Ratna.",
        "Smriti Mandhana (Cricket)",
        "Smriti Mandhana, 28, is rightly considered one of the best batters in women's cricket.In 2024, she scored a record 1659 runs, the highest ever total in women's international cricket in a calendar year. This included four ODI centuries - again a record for a female cricketer.She was the captain of the Royal Challengers Bangalore (RCB) team that won the 2024 Women's Premier League.Mandhana was the winner of ICC Women's cricketer award in 2022 and 2018 and has received the Arjuna Award - one of India's highest sports honours.",
        "Vinesh Phogat (Wrestling)",
        "Wrestler Vinesh Phogat is a three-time Olympian and a multiple medal winner for India across World Championships, Asian Games, and Commonwealth Games.She became the first Indian woman wrestler to reach an Olympic final at Paris 2024, but soon after her semi-final win, she was disqualified after failing a weigh-in ahead of the gold medal showdown.The 30-year old was a prominent face of protests against the former Chief of Wrestling Federation of India, Brij Bhushan Singh. He has been accused of sexually harassing female wrestlers. Singh denies all charges.In 2024, Phogat became a legislator from the Haryana state representing Congress party.",
        "The BBC Indian Sportswoman Of The Year award was established in 2019 to honour and celebrate the achievements of female athletes in India. The inaugural edition featured then Sports Minister Kiren Rijiju as chief guest and badminton player PV Sindhu was adjudged the winner.The winner of the 2020 edition was world chess champion Koneru Humpy, while weightlifter Mirabai Chanu won the 2021 and 2022 awards.Athletes PT Usha and Anju Bobby George, weightlifter Karnam Malleswari and hockey player Pritam Siwach have been the previous winners of the Lifetime Achievement award.The BBC Indian Para-Sportswoman of the year award was introduced in the last edition as part of our commitment to diversity and inclusion. The first winner of that award was table tennis player Bhavina Patel.The jury has nominated five Indian sportswomen who had an outstanding calendar year, from 1 October 2023 to 30 September 2024.",
        "The nominees for the fifth edition of BBC Indian Sportswoman of the Year have been announced.",
        "The five contenders are golfer Aditi Ashok, shooters Manu Bhaker and Avani Lekhara, cricketer Smriti Mandhana and wrestler Vinesh Phogat.",
        "The award honours the contributions of Indian sportswomen in 2024 and celebrates the achievements of all women involved in sport in the country.",
        "You can vote for your Indian Sportswoman of the Year on any of the BBC's Indian Language websites, or on the BBC Sport website.",
        "Head here to vote for your BBC Indian Sportswoman of the Year",
        "A panel selected by the BBC compiled the shortlist of the five Indian sportswomen. The jury includes some of the most authoritative sports journalists, experts and writers across India.",
        "The sportswoman with the most public votes will be the BBC Indian Sportswoman of the Year, with results broadcast on the BBC Indian Language sites and the BBC Sport website.",
        "Voting will remain open to the public until Friday, 31 January 2025 at 18:00 GMT (23:30 IST) and the winner will be announced on Monday, 17 February 2025 at a ceremony in Delhi.",
        "All of the terms and conditions and privacy notice are on the BBC News website.",
        "At the ceremony, the BBC will also honour three other sportswomen nominated by the jury in the categories: BBC Emerging Player of the Year award, to recognise the achievements of a young athlete; BBC Lifetime Achievement award, to celebrate a sports veteran for their unparalleled contribution to sports; and BBC Para Sportswoman of the Year award, to highlight excellence in para-sports.",
        "This video can not be played",
        "Ashok, 26, is the first Indian female golfer to qualify for three consecutive Olympic Games.",
        "At the age of 18, she finished 41st at Rio 2016, and then five years later in Tokyo, she finished just one shot shy of claiming a bronze medal. This was India's best performance in Olympic golf to date.",
        "At the 2024 Games in Paris, she finished in 29th place.",
        "Ashok is the first Indian player to win a title on the Ladies European Tour (LET) and has accumulated five victories so far. She has played for eight consecutive seasons on the LPGA Tour in the United States, registering 11 top ten finishes.",
        "She is also the recipient of one of India's highest sports honours, the Arjuna Award.",
        "Manu Bhaker (Shooting)",
        "This video can not be played",
        "Manu Bhaker, 22, is the first Indian woman to win two medals at one Olympic Games. She won two bronze medals in Air Pistol shooting at Paris 2024.",
        "At Tokyo 2020 luck eluded her as her pistol malfunctioned and she missed out on the finals. A reunion with longtime coach Jaspal Rana paid off, enabling her to claim those two medals in the French capital.",
        "In 2018, at the age of 16, Manu became the youngest Indian to win a gold medal at the Shooting World Cup.",
        "She has also been awarded the Khel Ratna, India's highest sports honour.",
        "Avani Lekhara (Para Shooting)",
        "This video can not be played",
        "Avani Lekhara, 23, is the first Indian woman to win three Paralympic medals.",
        "At Paris 2024, she won gold in the 10m Air Rifle event, following up a gold and a bronze medal from the Tokyo Games.",
        "Lekhara was introduced to shooting during a summer vacation from school in 2015.",
        "In her 12 years of competition, she has won gold, silver and bronze medals at World Cups, and brought home a further gold at the Asian Para Games in 2023.",
        "For her remarkable achievements, Lekhara has been recognized with the civilian honour, Padma Shri, and the highest sports honour, Khel Ratna.",
        "Smriti Mandhana (Cricket)",
        "This video can not be played",
        "Smriti Mandhana, 28, is rightly considered one of the best batters in women's cricket.",
        "In 2024, she scored a record 1659 runs, the highest ever total in women's international cricket in a calendar year. This included four ODI centuries - again a record for a female cricketer.",
        "She was the captain of the Royal Challengers Bangalore (RCB) team that won the 2024 Women's Premier League.",
        "Mandhana was the winner of ICC Women's cricketer award in 2022 and 2018 and has received the Arjuna Award - one of India's highest sports honours.",
        "Vinesh Phogat (Wrestling)",
        "This video can not be played",
        "Wrestler Vinesh Phogat is a three-time Olympian and a multiple medal winner for India across World Championships, Asian Games, and Commonwealth Games.",
        "She became the first Indian woman wrestler to reach an Olympic final at Paris 2024, but soon after her semi-final win, she was disqualified after failing a weigh-in ahead of the gold medal showdown.",
        "The 30-year old was a prominent face of protests against the former Chief of Wrestling Federation of India, Brij Bhushan Singh. He has been accused of sexually harassing female wrestlers. Singh denies all charges.",
        "In 2024, Phogat became a legislator from the Haryana state representing Congress party.",
        "The BBC Indian Sportswoman Of The Year award was established in 2019 to honour and celebrate the achievements of female athletes in India.",
        "The inaugural edition featured then Sports Minister Kiren Rijiju as chief guest and badminton player PV Sindhu was adjudged the winner.",
        "The winner of the 2020 edition was world chess champion Koneru Humpy, while weightlifter Mirabai Chanu won the 2021 and 2022 awards.",
        "Athletes PT Usha and Anju Bobby George, weightlifter Karnam Malleswari and hockey player Pritam Siwach have been the previous winners of the Lifetime Achievement award.",
        "The BBC Indian Para-Sportswoman of the year award was introduced in the last edition as part of our commitment to diversity and inclusion. The first winner of that award was table tennis player Bhavina Patel.",
        "The jury has nominated five Indian sportswomen who had an outstanding calendar year, from 1 October 2023 to 30 September 2024.",
        "Hodgkinson wins Sports Personality of the Year 2024"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/shooting/articles/cly2643lp6lo",
      "main_category": "sport",
      "detailed_category": "shooting",
      "topic": "Olympian Rutter 'devastated' after belongings stolen",
      "content": [
        "Olympic medallist Amber Rutter says having her belongings stolen as she travelled home after being honoured with a UK Sport award has left her \"truly devastated\".The 27-year-old, who won skeet silver at Paris 2024, was recognised with an athlete comeback/breakthrough award in Manchester.But Rutter's possessions were stolen on her train journey to Reading - including the award and an item of personal significance - and she has asked for help to get them back.Rutter posted on X: \"Just had all my belongings stolen on my train back from Manchester Piccadilly to Reading, including my cartridge necklace that was given to me from my grandad when I was 12 years old and only took off as I broke the chain last night.\"The five-time world medallist added: \"I'm truly devastated. If anyone is able to help in any way I would be truly grateful.\"Rutter, one of Britain's most successful shooters, considered quitting the sport after she tested positive for Covid the night before she was supposed to fly to the Tokyo Olympics, where she was one of the favourites to take gold.But she travelled to Paris, three months after giving birth to her son, to win her first Olympic medal.After winning the UK Sport award, Rutter posted: \"This recognition means so much to me after such a whirlwind career of challenges, perseverance and incredible highs. As always, thank you to everyone who has supported me along the way.\"",
        "Amber Rutter won Olympic silver in Paris after being forced to miss the Tokyo Games",
        "Olympic medallist Amber Rutter says having her belongings stolen as she travelled home after being honoured with a UK Sport award has left her \"truly devastated\".",
        "The 27-year-old, who won skeet silver at Paris 2024, was recognised with an athlete comeback/breakthrough award in Manchester.",
        "But Rutter's possessions were stolen on her train journey to Reading - including the award and an item of personal significance - and she has asked for help to get them back.",
        "Rutter posted on X: \"Just had all my belongings stolen on my train back from Manchester Piccadilly to Reading, including my cartridge necklace that was given to me from my grandad when I was 12 years old and only took off as I broke the chain last night.\"",
        "The five-time world medallist added: \"I'm truly devastated. If anyone is able to help in any way I would be truly grateful.\"",
        "Rutter, one of Britain's most successful shooters, considered quitting the sport after she tested positive for Covid the night before she was supposed to fly to the Tokyo Olympics, where she was one of the favourites to take gold.",
        "But she travelled to Paris, three months after giving birth to her son, to win her first Olympic medal.",
        "After winning the UK Sport award, Rutter posted: \"This recognition means so much to me after such a whirlwind career of challenges, perseverance and incredible highs. As always, thank you to everyone who has supported me along the way.\""
      ]
    },
    {
      "url": "https://www.bbc.com/sport/shooting/articles/c39lyd18jp9o",
      "main_category": "sport",
      "detailed_category": "shooting",
      "topic": "British trio withdraw from World Cup Final due to 'visa complications'",
      "content": [
        "Great Britain shooting trio Ben Llewellin, Matt Coward-Holley and Nathan Hales have had to withdraw from the 2024 ISSF World Cup Final in New Delhi, India, due to \"visa complications\".British Shooting confirmed the set-back in a statement released on Sunday.\"We regret to announce that... Matt Coward-Holley, Nathan Hales, and Ben Llewellin have had to withdraw... unfortunately, this decision was made due to visa complications that could not be resolved in time for their participation,\" British Shooting said.\"Our athletes have worked tirelessly throughout the season and were looking forward to competing at this prestigious event, where they had qualified based on their outstanding performances in 2024.\"British Shooting shares their disappointment and will continue to support them as they refocus their efforts on future competitions.\"The event is talking place from 13-18 October.",
        "Ben Llewellin had been set to compete in the men's skeet event",
        "Great Britain shooting trio Ben Llewellin, Matt Coward-Holley and Nathan Hales have had to withdraw from the 2024 ISSF World Cup Final in New Delhi, India, due to \"visa complications\".",
        "British Shooting confirmed the set-back in a statement released on Sunday.",
        "\"We regret to announce that... Matt Coward-Holley, Nathan Hales, and Ben Llewellin have had to withdraw... unfortunately, this decision was made due to visa complications that could not be resolved in time for their participation,\" British Shooting said.",
        "\"Our athletes have worked tirelessly throughout the season and were looking forward to competing at this prestigious event, where they had qualified based on their outstanding performances in 2024.",
        "\"British Shooting shares their disappointment and will continue to support them as they refocus their efforts on future competitions.\"",
        "The event is talking place from 13-18 October."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/shooting/articles/c3gvnz1xg79o",
      "main_category": "sport",
      "detailed_category": "shooting",
      "topic": "Paralympics 2024: A guide to Shooting Para-sport at the Paris Games",
      "content": [
        "Dates: 30 August-5 SeptemberVenue: Chateauroux Shooting CentreGold medals on offer: 13",
        "Shooting events at the Paralympics are held in both pistol and rifle.Of the 13 Paralympic shooting events, seven are mixed while there are three competitions each for men and women.Air pistol is shot over 10 metres (male and female), 25m and 50m (both mixed events):P1 - Men's 10m air pistol SH1P2 - Women's 10m air pistol SH1P3 - Mixed 25m pistol SH1P4 - Mixed 50m pistol SH1In rifle there are 10m events in both standing and prone positions plus prone and three-position events (standing, prone and kneeling) over 50m:R1 - Men's 10m air rifle standing SH1R2 - Women's 10m air rifle standing SH1R3 - Mixed 10m air rifle prone SH1R4 - Mixed 10m air rifle standing SH2R5 - Mixed 10m air rifle prone SH2R6 - Mixed 50m rifle prone SH1R7 - Men's 50m rifle 3 positions SH1R8 - Women's 50m rifle 3 positions SH1R9 - Mixed 50m rifle prone SH2Shooting uses a classification system which enables athletes from different impairment groups with the same level of functional ability to compete together.Pistol shooters compete in the SH1 category and will have upper and/or lower limb impairment.Rifle shooters compete in either the SH1 or SH2 category. SH1 athletes have lower limb impairments while SH2 have upper limb impairments which mean they use a shooting stand to support the rifle and may also have lower limb impairmentsIn qualification, each competitor takes a specified number of shots at the target - 120 in the three-position events and 60 in the remaining events - in a set time period. Qualifying for the three-position events takes a maximum of two hours and 45 minutes while the other events are around an hour to an hour and a quarter.The target consists of 10 concentric scoring rings, with the central ring worth 10 points and the outside ring worth one.Targets vary in size depending on the event. In the 10m air rifle event the whole target is 4.5cm in diameter and the central ring is just half a millimetre across.After the qualification round the eight top-scoring athletes go through to the final where all scores are reset to zero. The shots in the final are scored to one decimal place, with a top score of 10.9.After the first 12 shots, and every two shots thereafter, the lowest place shooter is eliminated until only two remain for the final two shots.",
        "Beijing gold medallist Matt Skelhon admitted that he found the experience of Tokyo tough to deal with and he struggled with his performance. But he has regrouped well and goes to France as the world and European champion in the R6 mixed 50m rifle prone SH1 event.Ryan Cockbill claimed a bronze medal in the R4 mixed 10m air rifle standing SH2 event at the 2022 Worlds and will aim to add to that while Tim Jeffrey, who reached three finals in Tokyo, will also aim for a first medal.And the squad's sole pistol shooter Issy Bailey will be aiming to impress at her third Games.",
        "China, Serbia and India filled the top three places in the sport's medal table at the Tokyo Games with Avani Lekhara becoming the first Indian woman to win Paralympic gold thanks to her victory in the R2 10m air rifle SH1 event.French hopes are high with Tanguy de la Forest a double world champion but the veteran, who will be competing in his sixth Games, has yet to win a Paralympic medal.His team-mates Cedric Fevre, Didier Richard and Pierre Guillaume-Sage will also be hoping to make home advantage count.And expect big performances from seasoned campaigners like Slovakia's Veronika Vadovicova, Sweden's Anna Benson and Korea's Jinho Park and Jangho Lee.",
        "The United Arab Emirates have only won five Paralympic gold medals since they made their Games debut in 1992 with shooter Abdullah Sultan Alaryani winning two of those along with three silver medals.Alaryani was a member of his country's shooting team before a car accident in 2001. He later moved to Para-sport and will be aiming to retain his R7 Men's 50m rifle 3 positions SH1 title in France.",
        "Slovakia's Veronika Vadovicova is one of the sport's most experienced campaigners",
        "Dates: 30 August-5 September",
        "Venue: Chateauroux Shooting Centre",
        "Gold medals on offer: 13",
        "Shooting events at the Paralympics are held in both pistol and rifle.",
        "Of the 13 Paralympic shooting events, seven are mixed while there are three competitions each for men and women.",
        "Air pistol is shot over 10 metres (male and female), 25m and 50m (both mixed events):",
        "P1 - Men's 10m air pistol SH1",
        "P2 - Women's 10m air pistol SH1",
        "P3 - Mixed 25m pistol SH1",
        "P4 - Mixed 50m pistol SH1",
        "In rifle there are 10m events in both standing and prone positions plus prone and three-position events (standing, prone and kneeling) over 50m:",
        "R1 - Men's 10m air rifle standing SH1",
        "R2 - Women's 10m air rifle standing SH1",
        "R3 - Mixed 10m air rifle prone SH1",
        "R4 - Mixed 10m air rifle standing SH2",
        "R5 - Mixed 10m air rifle prone SH2",
        "R6 - Mixed 50m rifle prone SH1",
        "R7 - Men's 50m rifle 3 positions SH1",
        "R8 - Women's 50m rifle 3 positions SH1",
        "R9 - Mixed 50m rifle prone SH2",
        "Shooting uses a classification system which enables athletes from different impairment groups with the same level of functional ability to compete together.",
        "Pistol shooters compete in the SH1 category and will have upper and/or lower limb impairment.",
        "Rifle shooters compete in either the SH1 or SH2 category. SH1 athletes have lower limb impairments while SH2 have upper limb impairments which mean they use a shooting stand to support the rifle and may also have lower limb impairments",
        "In qualification, each competitor takes a specified number of shots at the target - 120 in the three-position events and 60 in the remaining events - in a set time period. Qualifying for the three-position events takes a maximum of two hours and 45 minutes while the other events are around an hour to an hour and a quarter.",
        "The target consists of 10 concentric scoring rings, with the central ring worth 10 points and the outside ring worth one.",
        "Targets vary in size depending on the event. In the 10m air rifle event the whole target is 4.5cm in diameter and the central ring is just half a millimetre across.",
        "After the qualification round the eight top-scoring athletes go through to the final where all scores are reset to zero. The shots in the final are scored to one decimal place, with a top score of 10.9.",
        "After the first 12 shots, and every two shots thereafter, the lowest place shooter is eliminated until only two remain for the final two shots.",
        "Beijing gold medallist Matt Skelhon admitted that he found the experience of Tokyo tough to deal with and he struggled with his performance.",
        "But he has regrouped well and goes to France as the world and European champion in the R6 mixed 50m rifle prone SH1 event.",
        "Ryan Cockbill claimed a bronze medal in the R4 mixed 10m air rifle standing SH2 event at the 2022 Worlds and will aim to add to that while Tim Jeffrey, who reached three finals in Tokyo, will also aim for a first medal.",
        "And the squad's sole pistol shooter Issy Bailey will be aiming to impress at her third Games.",
        "China, Serbia and India filled the top three places in the sport's medal table at the Tokyo Games with Avani Lekhara becoming the first Indian woman to win Paralympic gold thanks to her victory in the R2 10m air rifle SH1 event.",
        "French hopes are high with Tanguy de la Forest a double world champion but the veteran, who will be competing in his sixth Games, has yet to win a Paralympic medal.",
        "His team-mates Cedric Fevre, Didier Richard and Pierre Guillaume-Sage will also be hoping to make home advantage count.",
        "And expect big performances from seasoned campaigners like Slovakia's Veronika Vadovicova, Sweden's Anna Benson and Korea's Jinho Park and Jangho Lee.",
        "The United Arab Emirates have only won five Paralympic gold medals since they made their Games debut in 1992 with shooter Abdullah Sultan Alaryani winning two of those along with three silver medals.",
        "Alaryani was a member of his country's shooting team before a car accident in 2001. He later moved to Para-sport and will be aiming to retain his R7 Men's 50m rifle 3 positions SH1 title in France."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/olympics/articles/cy0npjxw7k1o",
      "main_category": "sport",
      "detailed_category": "shooting",
      "topic": "Rutter wants apology after skeet final controversy",
      "content": [
        "Great Britain's Amber Rutter says \"some accountability needs to be taken\" and \"an apology\" given following the controversial end to the women's skeet final at the Paris Games.The 26-year-old was tied with Chile's Francisca Crovetto Chadid after three rounds of the four-round shoot-off, but she was called to have missed a shot which slow-motion replays appeared to show she hit.At the Olympics, shooting's version of a video assistant referee (VAR) or Hawkeye is not in use, and the judges did not overturn their decision when Rutter contested the call. The silver medallist said \"a poor and incorrect decision by all three referees\" had denied her the chance of competing for the gold medal. BBC Sport has contacted the International Shooting Sport Federation (ISSF) and International Olympic Committee (IOC) for comment. Writing on Instagram, external, Rutter said: \"There has been thousands of comments and images shared of me clearly hitting my final shot in the gold-medal match shoot-off.\"I feel like I owe it not just myself but the entire shooting community to highlight and address the matter.\"Every athlete, especially at the Games deserves to compete on a fair playing field.\"She added: \"We are at an elite level and these mistakes I believe should not even be a possibility.\" Rutter and Crovetto Chadid finished level on 55 shots from 60 targets in the final, resulting in a shoot-off to crown the new Olympic champion. After Rutter questioned the referees' call, 34-year-old Crovetto Chadid struck with both her next shots to clinch Chile's first ever shooting gold medal. In her Instagram post, Rutter highlighted the fact VAR had \"always\" been in place at previous ISSF competitions. \"At this point in time, I can't imagine a huge amount will be done, and that is not what I am looking for,\" she said. \"However, I do believe some accountability needs to be taken to acknowledge and an apology for the incorrect decision ultimately costing me an opportunity of winning an Olympic gold medal. And furthermore a plan to prevent something like this happening in the future.\"",
        "This video can not be played",
        "GB's Amber Rutter wins skeet silver medal after tense shoot-off loss to Chile's Francisca Crovetto Chadid",
        "Great Britain's Amber Rutter says \"some accountability needs to be taken\" and \"an apology\" given following the controversial end to the women's skeet final at the Paris Games.",
        "The 26-year-old was tied with Chile's Francisca Crovetto Chadid after three rounds of the four-round shoot-off, but she was called to have missed a shot which slow-motion replays appeared to show she hit.",
        "At the Olympics, shooting's version of a video assistant referee (VAR) or Hawkeye is not in use, and the judges did not overturn their decision when Rutter contested the call.",
        "The silver medallist said \"a poor and incorrect decision by all three referees\" had denied her the chance of competing for the gold medal.",
        "BBC Sport has contacted the International Shooting Sport Federation (ISSF) and International Olympic Committee (IOC) for comment.",
        "Writing on Instagram, external, Rutter said: \"There has been thousands of comments and images shared of me clearly hitting my final shot in the gold-medal match shoot-off.",
        "\"I feel like I owe it not just myself but the entire shooting community to highlight and address the matter.",
        "\"Every athlete, especially at the Games deserves to compete on a fair playing field.\"",
        "She added: \"We are at an elite level and these mistakes I believe should not even be a possibility.\"",
        "Rutter and Crovetto Chadid finished level on 55 shots from 60 targets in the final, resulting in a shoot-off to crown the new Olympic champion.",
        "After Rutter questioned the referees' call, 34-year-old Crovetto Chadid struck with both her next shots to clinch Chile's first ever shooting gold medal.",
        "In her Instagram post, Rutter highlighted the fact VAR had \"always\" been in place at previous ISSF competitions.",
        "\"At this point in time, I can't imagine a huge amount will be done, and that is not what I am looking for,\" she said.",
        "\"However, I do believe some accountability needs to be taken to acknowledge and an apology for the incorrect decision ultimately costing me an opportunity of winning an Olympic gold medal. And furthermore a plan to prevent something like this happening in the future.\"",
        "Team GB 'exhausted but happy' on return from Olympics",
        "How did Team GB win their Olympic medals?"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/olympics/articles/c17g0n15vqwo",
      "main_category": "sport",
      "detailed_category": "shooting",
      "topic": "Storms raged inside me during viral image - Dikec",
      "content": [
        "Turkish shooter Yusuf Dikec may have gone viral for his calm and casual demeanour at the Paris Olympics but what he was feeling inside was quite the opposite.Dikec's nonchalant pose, with his non-shooting hand casually tucked into his pocket, sparked a flurry of memes on social media as he won silver alongside Sevval Ilayda Tarhan in the mixed team 10-metre air pistol event.But the 51-year-old said: \"At that moment, everyone says I seemed very calm, but actually, storms were raging inside me.\"I think my shooting pose represented the Olympic spirit very well: the fair play, simplicity, clarity and naturalness. That's why it got so much attention.\"Dikec opted not to wear the high-tech gear of his shooting competitors, donning a simple yellow earplug and regular glasses instead.His pose has been emulated by fellow athletes, with Sweden's pole vault champion Armand Duplantis paying tribute after breaking his own world record at the Games.Turkey midfielder Irfan Can Kahveci also appeared to copy the celebration during Fenerbahce's 2-1 Champions League qualifying defeat by Lille on Tuesday.After securing his first Olympic medal, Dikec is aiming to go one better at the 2028 Olympics in Los Angeles and dethrone Serbian champions Zorana Arunovic and Damir Mikec.\"My partner and I will get the gold at the Los Angeles 2028 Games,\" said Dikec.\"I've only lent the gold medal until 2028.\"",
        "Dikec won his first Olympic medal in Paris",
        "Turkish shooter Yusuf Dikec may have gone viral for his calm and casual demeanour at the Paris Olympics but what he was feeling inside was quite the opposite.",
        "Dikec's nonchalant pose, with his non-shooting hand casually tucked into his pocket, sparked a flurry of memes on social media as he won silver alongside Sevval Ilayda Tarhan in the mixed team 10-metre air pistol event.",
        "But the 51-year-old said: \"At that moment, everyone says I seemed very calm, but actually, storms were raging inside me.",
        "\"I think my shooting pose represented the Olympic spirit very well: the fair play, simplicity, clarity and naturalness. That's why it got so much attention.\"",
        "Dikec opted not to wear the high-tech gear of his shooting competitors, donning a simple yellow earplug and regular glasses instead.",
        "His pose has been emulated by fellow athletes, with Sweden's pole vault champion Armand Duplantis paying tribute after breaking his own world record at the Games.",
        "Turkey midfielder Irfan Can Kahveci also appeared to copy the celebration during Fenerbahce's 2-1 Champions League qualifying defeat by Lille on Tuesday.",
        "After securing his first Olympic medal, Dikec is aiming to go one better at the 2028 Olympics in Los Angeles and dethrone Serbian champions Zorana Arunovic and Damir Mikec.",
        "\"My partner and I will get the gold at the Los Angeles 2028 Games,\" said Dikec.",
        "\"I've only lent the gold medal until 2028.\"",
        "Duplantis emulated Dikec's pose",
        "Today's Olympics guide",
        "Full Paris Olympics schedule",
        "BBC's Paris Olympics TV schedule"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/olympics/articles/cd199eyd775o",
      "main_category": "sport",
      "detailed_category": "shooting",
      "topic": "'Dream' silver for Rutter despite miss controversy",
      "content": [
        "Great Britain's Amber Rutter says it is a \"dream\" to come away with an Olympic silver medal, despite the controversial end to her gold medal bid in the women's skeet final.The 26-year-old finished tied on 55 shots from 60 targets with Chile's Francisca Crovetto Chadid.They went to a shoot-off and were still tied after three rounds but, in a moment of contention, Rutter was called to have missed a shot which slow motion replays appeared to show she hit.She contested the call, but shooting's version of a video assistant referee or Hawkeye is not in use at the Olympics and the judges did not overturn the decision.Crovetto Chadid, 34, struck with both her next shots to clinch her country's first ever shooting gold medal.",
        "BBC commentator Rory McAllister said it was \"a moment of controversy that will be talked about for days and weeks to come\".\"On the slow motion replay we saw the clay had been hit on the right-hand side by Amber Rutter, which is a hit,\" he added. \"You don't have to hit them in the middle.\"Former world champion Rutter won silver just over three months after giving birth to her first child, Tommy, and was surprised afterwards by her husband, who had brought their son to Paris.\"It is just a dream,\" she told BBC Sport. \"The fact that I'm able to be a mum and come away with a medal for my country, I am on top of the world right now.\"She was forced to miss the Tokyo Olympics in 2021 after contracting Covid-19 on the eve of the Games.\"The fact that I am able to be here, I believe everything happens for a reason,\" added Rutter. \"It really was to prove a point and come back here and really chase down those medals.\"The fact that I am here now, Tommy with me and with an Olympic medal, I don't know how it gets much better than this.\"It is Team GB's second shooting medal in Paris after Nathan Hales won gold by setting a new Games record in the men's trap shooting final.Austen Smith, of the United States, took the bronze with 45 shots.",
        "This video can not be played",
        "GB's Rutter wins skeet silver medal after tense shoot-off loss to Chile's Chadid",
        "Great Britain's Amber Rutter says it is a \"dream\" to come away with an Olympic silver medal, despite the controversial end to her gold medal bid in the women's skeet final.",
        "The 26-year-old finished tied on 55 shots from 60 targets with Chile's Francisca Crovetto Chadid.",
        "They went to a shoot-off and were still tied after three rounds but, in a moment of contention, Rutter was called to have missed a shot which slow motion replays appeared to show she hit.",
        "She contested the call, but shooting's version of a video assistant referee or Hawkeye is not in use at the Olympics and the judges did not overturn the decision.",
        "Crovetto Chadid, 34, struck with both her next shots to clinch her country's first ever shooting gold medal.",
        "BBC commentator Rory McAllister said it was \"a moment of controversy that will be talked about for days and weeks to come\".",
        "\"On the slow motion replay we saw the clay had been hit on the right-hand side by Amber Rutter, which is a hit,\" he added. \"You don't have to hit them in the middle.\"",
        "Former world champion Rutter won silver just over three months after giving birth to her first child, Tommy, and was surprised afterwards by her husband, who had brought their son to Paris.",
        "\"It is just a dream,\" she told BBC Sport. \"The fact that I'm able to be a mum and come away with a medal for my country, I am on top of the world right now.\"",
        "She was forced to miss the Tokyo Olympics in 2021 after contracting Covid-19 on the eve of the Games.",
        "\"The fact that I am able to be here, I believe everything happens for a reason,\" added Rutter. \"It really was to prove a point and come back here and really chase down those medals.",
        "\"The fact that I am here now, Tommy with me and with an Olympic medal, I don't know how it gets much better than this.\"",
        "It is Team GB's second shooting medal in Paris after Nathan Hales won gold by setting a new Games record in the men's trap shooting final.",
        "Austen Smith, of the United States, took the bronze with 45 shots.",
        "Amber Rutter hit 55 shots out of 60 to force a shoot-off",
        "Today's Olympics guide",
        "Full Paris Olympics schedule",
        "BBC's Paris Olympics TV schedule"
      ]
    }
  ]
}