{
  "scraped_at": "2025-10-27T18:56:59.795547",
  "total_articles": 8,
  "category": "horse-racing",
  "articles_per_category": 100,
  "articles": [
    {
      "url": "https://www.bbc.com/sport/horse-racing/articles/c9869dq5dq6o",
      "main_category": "sport",
      "detailed_category": "horse-racing",
      "topic": "Hawk Mountain gives O'Brien 12th Futurity win",
      "content": [
        "Hawk Mountain gave Aidan O'Brien a record-extending 12th victory in the Futurity Trophy Stakes at Doncaster in what was the final Group One race of the British Flat season.The first three finishers in the five-strong field were O'Brien horses, with the Irish trainer claiming his 23rd Group One winner of 2025. His most fancied horse - 7-4 favourite Benvenuto Cellini - fell away in the closing stages, leaving 18-5 Hawk Mountain to go neck and neck with 3-1 chance Action to finish. A final burst gave Hawk Mountain, ridden by Ronan Whelan, victory by half a length and boosted his chances for next year's Derby at Epsom. \"We thought he was a classy horse and next year we thought he could be a Guineas horse as well as a Derby horse,\" O'Brien told ITV Sport.\"So he has class and Ronan gave him a lovely ride.\"He's a big, powerful, strong horse with an unbelievable mind. So yes, delighted.\"",
        "Hawk Mountain is the first Aidan O'Brien-trained horse to win the Futurity Trophy Stakes since Auguste Rodin in 2022",
        "Hawk Mountain gave Aidan O'Brien a record-extending 12th victory in the Futurity Trophy Stakes at Doncaster in what was the final Group One race of the British Flat season.",
        "The first three finishers in the five-strong field were O'Brien horses, with the Irish trainer claiming his 23rd Group One winner of 2025.",
        "His most fancied horse - 7-4 favourite Benvenuto Cellini - fell away in the closing stages, leaving 18-5 Hawk Mountain to go neck and neck with 3-1 chance Action to finish.",
        "A final burst gave Hawk Mountain, ridden by Ronan Whelan, victory by half a length and boosted his chances for next year's Derby at Epsom.",
        "\"We thought he was a classy horse and next year we thought he could be a Guineas horse as well as a Derby horse,\" O'Brien told ITV Sport.",
        "\"So he has class and Ronan gave him a lovely ride.",
        "\"He's a big, powerful, strong horse with an unbelievable mind. So yes, delighted.\"",
        "Latest horse racing results"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/horse-racing/articles/cdjrgx2w90ko",
      "main_category": "sport",
      "detailed_category": "horse-racing",
      "topic": "Historic 200-1 win followed by 100-1 shock at Ascot",
      "content": [
        "Calandagan landed the big race on British Champions Day after Powerful Glory made history with a 200-1 victory and Cicero's Gift was another shock winner at 100-1.French challenger Calandagan, ridden by Mickael Barzalona for trainer Francis-Henri Graffard, won the Champion Stakes from Ombudsman at Ascot.The Richard Fahey-trained Powerful Glory, under Jamie Spencer, beat 2-1 favourite Lazzat into second in the Champions Sprint Stakes.Powerful Glory is the longest-priced winner of a top-level British Group One race, three months after Qirat set a record by winning the Sussex Stakes at Goodwood at 150-1.Spencer came with a late surge on his mount to triumph on Britain's richest race day, with 66-1 shot Quinault third in the 19-runner contest.\"I am lost for words,\" said Spencer.",
        "\"Powerful Glory is a good horse and travelled nicely. I thought I was going to be placed and all of a sudden I thought I actually have a chance.\"There was another big upset as Jason Watson rode 100-1 chance Cicero's Gift to victory in the Queen Elizabeth II Stakes for trainer Charlie Hills.A tearful Watson came home ahead of The Lion In Winter and Alakazi to claim his first Group One win since 2019.",
        "Much of the talk in the build-up to the Champion Stakes was around Ombudsman and Delacroix - meeting for the third time, with the score one apiece - and their trainers.Delacroix's trainer Aidan O'Brien had suggested John Gosden, who trains alongside son Thady, liked to \"whinge\" sometimes after races.Gosden, who had alluded to O'Brien fielding multiple runners in some big races, said his comments had \"irked\" his Irish counterpart.But they were both out of luck as 15-8 shot Calandagan, runner-up last year, prevailed by two and a quarter lengths from Ombudsman, with Almaqam third and Delacroix fourth.It was another big victory in the Aga Khan's colours for Graffard and Barzalona, who won the Prix de l'Arc de Triimphe with Daryz two weeks ago.\"He's a very good horse. It's a joy to ride in these colours and I'm very proud to be part of the team,\" said Barzalona.",
        "Powerful Glory had been well beaten in his two previous races this season, although had won on both starts last year, including the Group Two Mill Reef Stakes.\"I am not saying I thought he would come here and nearly win, but I knew he would do his best and, when I saw 200-1, I nearly had a bet and I don't bet,\" said Fahey.\"We have seen the real Powerful Glory today - and he has only had four starts.\"Powerful Glory, owned by Sheikh Rashid Dalmook Al Maktoum, earned nearly £320,000 on a day which boasts overall prize money of £4.35m.Earlier, Trawlerman beat stablemate Sweet William in a Long Distance Cup one-two for the Gosdens.Kalpana, ridden by Colin Keane, defended her Fillies and Mares Stakes title for trainer Andrew Balding.Meanwhile, Oisin Murphy was crowned champion jockey for a fifth time after a turbulent year.Murphy was fined £70,000 and given a 20-month driving ban for drink-driving after crashing a car into a tree in April.The jockey, who has well-documented alcohol issues, apologised for what happened.\"I certainly had a point to prove that I was able to do my job with things going on externally, and that's what motivated me and fuelled me to the championship title,\" he said.\"Like anyone with an addiction, you have to work very hard at it. And, unfortunately for me, I relapsed and I've had to pay the price for it since.\"",
        "Powerful Glory beat favourite Lazzat by a neck",
        "Calandagan landed the big race on British Champions Day after Powerful Glory made history with a 200-1 victory and Cicero's Gift was another shock winner at 100-1.",
        "French challenger Calandagan, ridden by Mickael Barzalona for trainer Francis-Henri Graffard, won the Champion Stakes from Ombudsman at Ascot.",
        "The Richard Fahey-trained Powerful Glory, under Jamie Spencer, beat 2-1 favourite Lazzat into second in the Champions Sprint Stakes.",
        "Powerful Glory is the longest-priced winner of a top-level British Group One race, three months after Qirat set a record by winning the Sussex Stakes at Goodwood at 150-1.",
        "Spencer came with a late surge on his mount to triumph on Britain's richest race day, with 66-1 shot Quinault third in the 19-runner contest.",
        "\"I am lost for words,\" said Spencer.",
        "\"Powerful Glory is a good horse and travelled nicely. I thought I was going to be placed and all of a sudden I thought I actually have a chance.\"",
        "There was another big upset as Jason Watson rode 100-1 chance Cicero's Gift to victory in the Queen Elizabeth II Stakes for trainer Charlie Hills.",
        "A tearful Watson came home ahead of The Lion In Winter and Alakazi to claim his first Group One win since 2019.",
        "Calandagan had won the King George at Ascot earlier in the year",
        "Much of the talk in the build-up to the Champion Stakes was around Ombudsman and Delacroix - meeting for the third time, with the score one apiece - and their trainers.",
        "Delacroix's trainer Aidan O'Brien had suggested John Gosden, who trains alongside son Thady, liked to \"whinge\" sometimes after races.",
        "Gosden, who had alluded to O'Brien fielding multiple runners in some big races, said his comments had \"irked\" his Irish counterpart.",
        "But they were both out of luck as 15-8 shot Calandagan, runner-up last year, prevailed by two and a quarter lengths from Ombudsman, with Almaqam third and Delacroix fourth.",
        "It was another big victory in the Aga Khan's colours for Graffard and Barzalona, who won the Prix de l'Arc de Triimphe with Daryz two weeks ago.",
        "\"He's a very good horse. It's a joy to ride in these colours and I'm very proud to be part of the team,\" said Barzalona.",
        "Powerful Glory had been well beaten in his two previous races this season, although had won on both starts last year, including the Group Two Mill Reef Stakes.",
        "\"I am not saying I thought he would come here and nearly win, but I knew he would do his best and, when I saw 200-1, I nearly had a bet and I don't bet,\" said Fahey.",
        "\"We have seen the real Powerful Glory today - and he has only had four starts.\"",
        "Powerful Glory, owned by Sheikh Rashid Dalmook Al Maktoum, earned nearly £320,000 on a day which boasts overall prize money of £4.35m.",
        "Earlier, Trawlerman beat stablemate Sweet William in a Long Distance Cup one-two for the Gosdens.",
        "Kalpana, ridden by Colin Keane, defended her Fillies and Mares Stakes title for trainer Andrew Balding.",
        "Meanwhile, Oisin Murphy was crowned champion jockey for a fifth time after a turbulent year.",
        "Murphy was fined £70,000 and given a 20-month driving ban for drink-driving after crashing a car into a tree in April.",
        "The jockey, who has well-documented alcohol issues, apologised for what happened.",
        "\"I certainly had a point to prove that I was able to do my job with things going on externally, and that's what motivated me and fuelled me to the championship title,\" he said.",
        "\"Like anyone with an addiction, you have to work very hard at it. And, unfortunately for me, I relapsed and I've had to pay the price for it since.\"",
        "Latest horse racing results"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/horse-racing/articles/c3060q6vrj6o",
      "main_category": "sport",
      "detailed_category": "horse-racing",
      "topic": "Outsider Gewan wins Dewhurst Stakes at Newmarket",
      "content": [
        "Fancied pair Gstaad and Distant Storm were beaten as 25-1 outsider Gewan won the Group One Dewhurst Stakes at Newmarket.Trained by Andrew Balding and ridden by James Doyle, Gewan drifted towards the near-side rail in the closing stages having been prominent throughout but was able to fight off favourite Gstaad (7-4) who finished second and Distant Storm (9-4) who came home in third.The win represents a return to form for Gewan, following a poor run when favourite at Doncaster in the Group Two Champagne Stakes last month.\"[I am] very lucky to get the ride on him,\" Doyle told ITV Sport.\"He did an impeccable job. Once he got that rail he stuck at it very well.\"Trainer Aidan O'Brien was seeking a record-breaking ninth win in the seven-furlong race with the market leader Gstaad or his stablemate Italy, but the latter only managed eighth.The Dewhurst is the leading race for two-year-old horses on the flat calendar and is used to provide pointers to next season's Classics - the 2,000 Guineas, the 1,000 Guineas, the Oaks, the Derby and the St Leger - which can only be contested by three-year-olds.Also at Newmarket, Beylerbeyi (7-1) went from last to first under Billy Loughnane to beat Dawn Rising (15-2) to victory in the Cesarewitch Handicap with Bunting (5-1) finishing third.",
        "Gewan (right) has won three of his four races",
        "Fancied pair Gstaad and Distant Storm were beaten as 25-1 outsider Gewan won the Group One Dewhurst Stakes at Newmarket.",
        "Trained by Andrew Balding and ridden by James Doyle, Gewan drifted towards the near-side rail in the closing stages having been prominent throughout but was able to fight off favourite Gstaad (7-4) who finished second and Distant Storm (9-4) who came home in third.",
        "The win represents a return to form for Gewan, following a poor run when favourite at Doncaster in the Group Two Champagne Stakes last month.",
        "\"[I am] very lucky to get the ride on him,\" Doyle told ITV Sport.",
        "\"He did an impeccable job. Once he got that rail he stuck at it very well.\"",
        "Trainer Aidan O'Brien was seeking a record-breaking ninth win in the seven-furlong race with the market leader Gstaad or his stablemate Italy, but the latter only managed eighth.",
        "The Dewhurst is the leading race for two-year-old horses on the flat calendar and is used to provide pointers to next season's Classics - the 2,000 Guineas, the 1,000 Guineas, the Oaks, the Derby and the St Leger - which can only be contested by three-year-olds.",
        "Also at Newmarket, Beylerbeyi (7-1) went from last to first under Billy Loughnane to beat Dawn Rising (15-2) to victory in the Cesarewitch Handicap with Bunting (5-1) finishing third.",
        "Latest horse racing results"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/horse-racing/articles/clyle4e4kj8o",
      "main_category": "sport",
      "detailed_category": "horse-racing",
      "topic": "I'd give up winners to hug family again - Lee",
      "content": [
        "For top jockey Graham Lee, riding horses and winning races was a way of life. But after a fall left him paralysed from the shoulders down, he realised what was truly important.In a new documentary, the Grand National-winning rider speaks powerfully about life since being unseated from his mount in the starting stalls at Newcastle Racecourse on 10 November 2023.\"I can remember hitting the ground and then I was gone,\" says the 49-year-old. \"The next 12 days I was in the RVI (hospital) in Newcastle and I can remember nothing, probably because of the drugs and medication I was on.\"My heart stopped, I flatlined. The place I went to when I flatlined, I was so relaxed, chilled, calm. When I came back round, there was six doctors and eight nurses round me.\"Life would never be the same. Lee suffered severe damage to his spinal cord in the fall, and is in a wheelchair.",
        "Despite modestly suggesting he had 'moderate' ability, Lee rode Amberleigh House to victory in the 2004 National at Aintree, and was leading jockey at the Cheltenham Festival the following year.He rode more than 1,000 winners over the jumps before switching to the Flat, and was on target to reach a similar number there, with big victories including the 2015 Gold Cup at Ascot on Trip To Paris.But he said those triumphs mean little after the accident, as he considers life now with his wife Becky and children Amy and Robbie.\"I don't mean to sound unthankful but I have lots of time to reflect,\" he tells the Racing TV programme, which will be aired on Sunday.\"I was very fortunate in my career to ride big winners but at the end of the day, it's only horses running around a field.\"I'd give up every winner I ever rode to get up out of this chair and hug my wife and hug Amy and hug Robbie.\"Our lives have changed hugely but I feel more bad for Becks and Amy and Robbie. Poor Becks' life, I've turned it upside down. Obviously I didn't mean to. She's an amazing lady and I've two amazing children, and I'm very lucky to have them.\"",
        "Even when he won the National, Lee was soon thinking about racing the next day.He wishes he had \"lived in the moment\" and says the accident has given him fresh perspective.\"I can't reach my ear. I can't reach my forehead. I can't give my wife a cuddle. When Rob plays a football match, I can't put my arm round him and say 'well done kidda' or watch Amy perform in her musical theatre and give her a hug and say 'that was class,'\" he says.\"I'm not moaning, it's just made me realise that when I was riding it was the be-all and end-all and I did it to the best of my ability. There's more to life, isn't there?\"Irishman Lee, who is based in North Yorkshire, is grateful for the support he has received from family, friends, colleagues and the Injured Jockeys' Fund (IJF).\"It's been really tough but the help we've had has been incredible,\" Becky tells the documentary. \"Anyone would do it for their partner, the father of their children. The IJF have been here anytime, night and day.\"Lee receives physiotherapy and other help at the Matt Hampson Foundation Get Busy Living Centre in Leicestershire. It was set up by former rugby player Hampson, who was also paralysed after an accident.\"Graham is just one of the nicest people in the world and he doesn't understand why people care about him,\" says Tilly Cumming - the foundation's clinical lead.\"I think it must be something that is very difficult to get your head round, when you are very driven and your job involves a lot of physicality - to have a high-level spinal injury that means all of that is taken away.\"Despite being told by a spinal-cord consultant that he will never walk again, Lee remains adamant it could be a possibility.\"Although he could be right, I'm not willing to accept that,\" he says. \"Hopefully science somewhere, some day, sooner rather than later - something will happen.\"The irony of being injured on the Flat, when there is a greater risk in jump races, is not lost on the former jockey.\"It's mad. There's no rules, when you think of the falls I took, which every jump jockey gets, and I had a lot of bad injuries,\" he adds.\"Bones heal, some bad head injuries which all healed, and then you get a fall on the Flat, not even in a race, in the stalls, and I've hit the deck from five feet, and this doesn't heal. And this is what is a complete mind warp.\"It's so difficult for me to get my head around what has happened. I never sat still. But the only good thing to come of my injury is I've met some incredible people, that I've never met before.\"We keep going, we keep hoping something will happen somewhere because if you don't have hope, you've got nothing.\"",
        "Graham Lee rode nearly 2,000 winners in his career",
        "For top jockey Graham Lee, riding horses and winning races was a way of life. But after a fall left him paralysed from the shoulders down, he realised what was truly important.",
        "In a new documentary, the Grand National-winning rider speaks powerfully about life since being unseated from his mount in the starting stalls at Newcastle Racecourse on 10 November 2023.",
        "\"I can remember hitting the ground and then I was gone,\" says the 49-year-old. \"The next 12 days I was in the RVI (hospital) in Newcastle and I can remember nothing, probably because of the drugs and medication I was on.",
        "\"My heart stopped, I flatlined. The place I went to when I flatlined, I was so relaxed, chilled, calm. When I came back round, there was six doctors and eight nurses round me.\"",
        "Life would never be the same. Lee suffered severe damage to his spinal cord in the fall, and is in a wheelchair.",
        "Lee's friend Niall Hannity - a broadcaster and former jockey - speaks to him for the documentary",
        "Despite modestly suggesting he had 'moderate' ability, Lee rode Amberleigh House to victory in the 2004 National at Aintree, and was leading jockey at the Cheltenham Festival the following year.",
        "He rode more than 1,000 winners over the jumps before switching to the Flat, and was on target to reach a similar number there, with big victories including the 2015 Gold Cup at Ascot on Trip To Paris.",
        "But he said those triumphs mean little after the accident, as he considers life now with his wife Becky and children Amy and Robbie.",
        "\"I don't mean to sound unthankful but I have lots of time to reflect,\" he tells the Racing TV programme, which will be aired on Sunday.",
        "\"I was very fortunate in my career to ride big winners but at the end of the day, it's only horses running around a field.",
        "\"I'd give up every winner I ever rode to get up out of this chair and hug my wife and hug Amy and hug Robbie.",
        "\"Our lives have changed hugely but I feel more bad for Becks and Amy and Robbie. Poor Becks' life, I've turned it upside down. Obviously I didn't mean to. She's an amazing lady and I've two amazing children, and I'm very lucky to have them.\"",
        "Galway-born Lee's riding career spanned more than 30 years, and included wins in the Scottish National, Galway Hurdle and Nunthorpe Stakes",
        "Even when he won the National, Lee was soon thinking about racing the next day.",
        "He wishes he had \"lived in the moment\" and says the accident has given him fresh perspective.",
        "\"I can't reach my ear. I can't reach my forehead. I can't give my wife a cuddle. When Rob plays a football match, I can't put my arm round him and say 'well done kidda' or watch Amy perform in her musical theatre and give her a hug and say 'that was class,'\" he says.",
        "\"I'm not moaning, it's just made me realise that when I was riding it was the be-all and end-all and I did it to the best of my ability. There's more to life, isn't there?\"",
        "Irishman Lee, who is based in North Yorkshire, is grateful for the support he has received from family, friends, colleagues and the Injured Jockeys' Fund (IJF).",
        "\"It's been really tough but the help we've had has been incredible,\" Becky tells the documentary. \"Anyone would do it for their partner, the father of their children. The IJF have been here anytime, night and day.\"",
        "Lee receives physiotherapy and other help at the Matt Hampson Foundation Get Busy Living Centre in Leicestershire. It was set up by former rugby player Hampson, who was also paralysed after an accident.",
        "\"Graham is just one of the nicest people in the world and he doesn't understand why people care about him,\" says Tilly Cumming - the foundation's clinical lead.",
        "\"I think it must be something that is very difficult to get your head round, when you are very driven and your job involves a lot of physicality - to have a high-level spinal injury that means all of that is taken away.\"",
        "Despite being told by a spinal-cord consultant that he will never walk again, Lee remains adamant it could be a possibility.",
        "\"Although he could be right, I'm not willing to accept that,\" he says. \"Hopefully science somewhere, some day, sooner rather than later - something will happen.\"",
        "The irony of being injured on the Flat, when there is a greater risk in jump races, is not lost on the former jockey.",
        "\"It's mad. There's no rules, when you think of the falls I took, which every jump jockey gets, and I had a lot of bad injuries,\" he adds.",
        "\"Bones heal, some bad head injuries which all healed, and then you get a fall on the Flat, not even in a race, in the stalls, and I've hit the deck from five feet, and this doesn't heal. And this is what is a complete mind warp.",
        "\"It's so difficult for me to get my head around what has happened. I never sat still. But the only good thing to come of my injury is I've met some incredible people, that I've never met before.",
        "\"We keep going, we keep hoping something will happen somewhere because if you don't have hope, you've got nothing.\""
      ]
    },
    {
      "url": "https://www.bbc.com/sport/horse-racing/articles/cly64lzndk3o",
      "main_category": "sport",
      "detailed_category": "horse-racing",
      "topic": "Bowen aims to top 100 wins at first Welsh Racing Festival",
      "content": [
        "When the tapes rise at Chepstow this Friday for the opening day of the inaugural Welsh Racing Festival, few families will feel the pride and anticipation more keenly than the Bowens.Three days of jump racing from 10-12 October - culminating in Sunday's Welsh Champion Hurdle - will mark horse racing's biggest weekend of the year in Wales.Fittingly, the spotlight will shine on a Welsh family dynasty enjoying an incredible season.At the top of the Jump Jockeys' Championship, defending champion Sean Bowen continues to set the pace with 100 winners - bringing up the century for the season on board Dominic's Fault at Lingfield on Monday - while younger brother James sits second on 43.Meanwhile, older brother Mickey, who took over the family's training licence from their father Peter last season, has surged into the lead in the Trainers' Championship, with 40 winners and more than £388,000 in prize money.It is a family dominance rarely seen in modern sport - three men, from one small corner of Pembrokeshire, rewriting the Welsh racing story.For Peter Bowen, who officially retired last season after training more than 1,000 winners, watching his sons flourish has been both surreal and deeply satisfying.\"For my family, this year has been more than I could have dreamed about,\" he says.\"It is so great that they are currently one and two. Hopefully it will stay that way for the rest of the season. And the start Mickey has had to his training career, well... you couldn't write it, could you?\"",
        "Bowen Sr, who handed the reins of his long-running yard in Little Newcastle near Haverfordwest to Mickey, says he always knew his eldest son would take naturally to training.\"I always felt Mickey had the talent. He's always been keen and he's always followed me around, since he was about three years old,\" he says.\"Somebody asked me if he's done his apprenticeship and I replied that he'd already done about 30 years of it!\"From the time he was a kid, you could tell he was the one who was going to be a trainer, because he was so into it even as a kid.\"Mickey's own riding career was cut short at 16 after a serious fall and medical advice to give up the saddle.That setback only accelerated his move into training, a shift that now looks inspired.\"It's just pleasing for me as a father that all three are in the jobs they have and they are all loving it,\" Bowen Sr says.\"When I look at how successful the whole family now are, I have to pinch myself every morning. I also realise how lucky we are to be doing what we love.\"If Mickey is the rising star of the training ranks, then Sean is already the headline act.At 26, he has secured a century of winners before the season's halfway point, and his strength, balance and race-craft have drawn high praise across the sport.",
        "Trainer Peter Scudamore - a seven-time champion jockey and one of the most respected voices in National Hunt racing - believes Sean's talent is exceptional.\"I was talking to Peter Scudamore the other day,\" says Peter Bowen.\"He said he had watched jockeys all his life and he told me he thinks Sean is the best he has ever seen.\"To come from someone like Peter Scudamore, that is a hell of an accolade.\"Peter believes both Sean and James possess a rare ability to \"win races they really should not be winning\", describing that as the mark of a true champion.\"They are also totally dedicated to what they do and spend a lot of time in the gym and running to be super-fit,\" he adds.\"All three of them have managed to stay really good friends and they must speak to each other about four times a day.\"This weekend's Welsh Racing Festival will showcase not only the Bowens' brilliance but also the growing ambition of the sport across Wales.Sean Bowen, preparing for several key rides at Chepstow, says the event represents a major step forward for the country's racing profile.\"We need to promote Welsh racing all we can, because we've got some brilliant trainers and brilliant jockeys and obviously some big owners now as well,\" he says.\"So, I think Welsh racing is thriving at the minute. Obviously, our biggest race at the moment is the Welsh Grand National.\"But this big festival meeting at Chepstow, where all the stars will start their season, is quite exciting.\"I know Chepstow have done a good job with promoting it all. A few owners are telling me about the good deals they've done with hotels and buses and different things, so they're making a good go of it and fair play to Chepstow Racecourse for that.\"For Sean, Chepstow's location is ideal - close enough to attract the top stables from England, while giving Welsh racing a central stage.\"Even though Chepstow is in Wales, it is quite close to a lot of the jumps trainers over the border, so it's not far for them to go,\" he says.\"A three-day festival is brilliant. A lot of people will enjoy staying over and will have a good time over the three days, so it's really exciting.\"As Welsh racing's flagship festival prepares to open, a family rooted in Pembrokeshire soil are reaching for the top of British jump racing.",
        "Welsh jockey Sean Bowen has ridden 100 winners before the season's halfway stage",
        "When the tapes rise at Chepstow this Friday for the opening day of the inaugural Welsh Racing Festival, few families will feel the pride and anticipation more keenly than the Bowens.",
        "Three days of jump racing from 10-12 October - culminating in Sunday's Welsh Champion Hurdle - will mark horse racing's biggest weekend of the year in Wales.",
        "Fittingly, the spotlight will shine on a Welsh family dynasty enjoying an incredible season.",
        "At the top of the Jump Jockeys' Championship, defending champion Sean Bowen continues to set the pace with 100 winners - bringing up the century for the season on board Dominic's Fault at Lingfield on Monday - while younger brother James sits second on 43.",
        "Meanwhile, older brother Mickey, who took over the family's training licence from their father Peter last season, has surged into the lead in the Trainers' Championship, with 40 winners and more than £388,000 in prize money.",
        "It is a family dominance rarely seen in modern sport - three men, from one small corner of Pembrokeshire, rewriting the Welsh racing story.",
        "For Peter Bowen, who officially retired last season after training more than 1,000 winners, watching his sons flourish has been both surreal and deeply satisfying.",
        "\"For my family, this year has been more than I could have dreamed about,\" he says.",
        "\"It is so great that they are currently one and two. Hopefully it will stay that way for the rest of the season. And the start Mickey has had to his training career, well... you couldn't write it, could you?\"",
        "Daryz pips Minnie Hauk to Arc win in photo finish",
        "Boiling Point wins Cambridgeshire in photo finish",
        "Cheltenham reduces crowd capacity and cuts price of a pint",
        "Bowen Sr, who handed the reins of his long-running yard in Little Newcastle near Haverfordwest to Mickey, says he always knew his eldest son would take naturally to training.",
        "\"I always felt Mickey had the talent. He's always been keen and he's always followed me around, since he was about three years old,\" he says.",
        "\"Somebody asked me if he's done his apprenticeship and I replied that he'd already done about 30 years of it!",
        "\"From the time he was a kid, you could tell he was the one who was going to be a trainer, because he was so into it even as a kid.\"",
        "Mickey's own riding career was cut short at 16 after a serious fall and medical advice to give up the saddle.",
        "That setback only accelerated his move into training, a shift that now looks inspired.",
        "\"It's just pleasing for me as a father that all three are in the jobs they have and they are all loving it,\" Bowen Sr says.",
        "\"When I look at how successful the whole family now are, I have to pinch myself every morning. I also realise how lucky we are to be doing what we love.\"",
        "If Mickey is the rising star of the training ranks, then Sean is already the headline act.",
        "At 26, he has secured a century of winners before the season's halfway point, and his strength, balance and race-craft have drawn high praise across the sport.",
        "Trainer Peter Scudamore - a seven-time champion jockey and one of the most respected voices in National Hunt racing - believes Sean's talent is exceptional.",
        "\"I was talking to Peter Scudamore the other day,\" says Peter Bowen.",
        "\"He said he had watched jockeys all his life and he told me he thinks Sean is the best he has ever seen.",
        "\"To come from someone like Peter Scudamore, that is a hell of an accolade.\"",
        "Peter believes both Sean and James possess a rare ability to \"win races they really should not be winning\", describing that as the mark of a true champion.",
        "\"They are also totally dedicated to what they do and spend a lot of time in the gym and running to be super-fit,\" he adds.",
        "\"All three of them have managed to stay really good friends and they must speak to each other about four times a day.\"",
        "This weekend's Welsh Racing Festival will showcase not only the Bowens' brilliance but also the growing ambition of the sport across Wales.",
        "Sean Bowen, preparing for several key rides at Chepstow, says the event represents a major step forward for the country's racing profile.",
        "\"We need to promote Welsh racing all we can, because we've got some brilliant trainers and brilliant jockeys and obviously some big owners now as well,\" he says.",
        "\"So, I think Welsh racing is thriving at the minute. Obviously, our biggest race at the moment is the Welsh Grand National.",
        "\"But this big festival meeting at Chepstow, where all the stars will start their season, is quite exciting.",
        "\"I know Chepstow have done a good job with promoting it all. A few owners are telling me about the good deals they've done with hotels and buses and different things, so they're making a good go of it and fair play to Chepstow Racecourse for that.\"",
        "For Sean, Chepstow's location is ideal - close enough to attract the top stables from England, while giving Welsh racing a central stage.",
        "\"Even though Chepstow is in Wales, it is quite close to a lot of the jumps trainers over the border, so it's not far for them to go,\" he says.",
        "\"A three-day festival is brilliant. A lot of people will enjoy staying over and will have a good time over the three days, so it's really exciting.\"",
        "As Welsh racing's flagship festival prepares to open, a family rooted in Pembrokeshire soil are reaching for the top of British jump racing.",
        "Latest horse racing results"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/horse-racing/articles/c5yk66gj31yo",
      "main_category": "sport",
      "detailed_category": "horse-racing",
      "topic": "Daryz pips Minnie Hauk to Arc win in photo finish",
      "content": [
        "Daryz came through with a pulsating late run to beat favourite Minnie Hauk in a photo finish to win the Prix de l'Arc de Triomphe at Longchamp. The Francis-Henri Graffard trained three-year-old had only made six starts before stepping up to the 1.5 mile distance for the first time. But jockey Mickael Barzalona timed the run to the line perfectly to bring home Europe's richest Group One race at 12-1. Aidan O'Brien's Minnie Hauk, ridden by Christophe Soumillon, was heavily backed at 9-4, and the winner of the Oaks and Irish Oaks made light of a tricky draw in stall one to make it to the head of the 17-strong field from two furlongs out. Esteemed trainer Andre Fabre, who was aiming for a record-extending ninth win, saw his highest-place runner Sosie come home third at 16-1, while 40-1 shot Giavellotto was fourth. Victory in the Arc completes an amazing transformation for Daryz, who finished last in the Juddmonte International at York in August.\"I think the defeat at York helped us to win today because my horse was, for the first time, very professional and mature,\" said Graffard, who won the race for the first time in the colours of the late Aga Khan.\"This race has an amazing reputation and it's true that when you win it, it's very, very special. I've experienced some big wins, but this one is very, very special, especially this year.\"Winning jockey Barzalona, 34, won the Derby on Pour Moi in 2011 as a 19-year-old and the Frenchman said it was a proud moment to join the list of jockeys to have also triumphed in the Arc. \"This kind of race you have been watching since you were very young and for sure to go into the circle of people who have won this race, and especially in these colours as well, is a big privilege,\" he told Sky Sports.  Byzantine Dream, Alohi Alii and Croix Du Nord had been tipped to end a 56-year wait for a first Japanese winner in the Arc, but heavy rain meant the going was not in their favour and they were never in the running.",
        "The Prix de l'Arc de Triomphe was first held at Longchamp in 1920",
        "Daryz came through with a pulsating late run to beat favourite Minnie Hauk in a photo finish to win the Prix de l'Arc de Triomphe at Longchamp.",
        "The Francis-Henri Graffard trained three-year-old had only made six starts before stepping up to the 1.5 mile distance for the first time.",
        "But jockey Mickael Barzalona timed the run to the line perfectly to bring home Europe's richest Group One race at 12-1.",
        "Aidan O'Brien's Minnie Hauk, ridden by Christophe Soumillon, was heavily backed at 9-4, and the winner of the Oaks and Irish Oaks made light of a tricky draw in stall one to make it to the head of the 17-strong field from two furlongs out.",
        "Esteemed trainer Andre Fabre, who was aiming for a record-extending ninth win, saw his highest-place runner Sosie come home third at 16-1, while 40-1 shot Giavellotto was fourth.",
        "Victory in the Arc completes an amazing transformation for Daryz, who finished last in the Juddmonte International at York in August.",
        "\"I think the defeat at York helped us to win today because my horse was, for the first time, very professional and mature,\" said Graffard, who won the race for the first time in the colours of the late Aga Khan.",
        "\"This race has an amazing reputation and it's true that when you win it, it's very, very special. I've experienced some big wins, but this one is very, very special, especially this year.\"",
        "Winning jockey Barzalona, 34, won the Derby on Pour Moi in 2011 as a 19-year-old and the Frenchman said it was a proud moment to join the list of jockeys to have also triumphed in the Arc.",
        "\"This kind of race you have been watching since you were very young and for sure to go into the circle of people who have won this race, and especially in these colours as well, is a big privilege,\" he told Sky Sports.",
        "Byzantine Dream, Alohi Alii and Croix Du Nord had been tipped to end a 56-year wait for a first Japanese winner in the Arc, but heavy rain meant the going was not in their favour and they were never in the running.",
        "Latest horse racing results"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/horse-racing/articles/c07vm2dp787o",
      "main_category": "sport",
      "detailed_category": "horse-racing",
      "topic": "Cheltenham reduces crowd capacity and cuts price of a pint",
      "content": [
        "Organisers of the Cheltenham Festival are to reduce capacity and the price of a pint following criticism from spectators.The four-day meeting in March is the showpiece of the jump racing calendar, but it has experienced a marked decline in attendances with punters unhappy about cost.A pint of draught beer or cider will be reduced by 30p to £7.50 at all the course's meetings this season.The Festival's final day, featuring the Cheltenham Gold Cup, was sold out this year but some people complained of overcrowding on that day.Daily capacity will be reduced from 68,500 to 66,000, although no attendance on the first three days in 2025 topped 56,000.The price of drinks, and particularly Guinness – with an estimated 265,000 pints sold during the week - has been a particular sore point among punters.\"We regularly benchmark our food and beverage prices alongside other major sports venues and comparable events,\" said course chief executive Guy Lavender.\"Despite being subject to the same increases in goods and services as all industries, we have taken the decision to reduce the price of draught beers and cider... for the 2025/26 season.\"He said the reduction would bring prices down to 2022 levels.For comparison, a pint of beer at this year's Wimbledon tennis was £8.45, while it would have set you back £7.75 at golf's Open Championship.",
        "Absent regulars have cited the cost of accommodation, tickets, travel and food and drink - plus overcrowding in previous years - as reasons for missing the meeting, which was extended to four days from three in 2005.Thousands have travelled to Spanish destinations, including Benidorm and Tenerife, to watch the action on big screens, saying a week in the sunshine is cheaper than attending the fixture.A year ago, organisers announced changes aimed at improving competition in races and the experience of racegoers, and further changes are likely.A new park-and-ride system, additional coaches and extra hardstanding areas at the course for car parking were introduced.",
        "Cheltenham says it will go back to promoting its second day, which it had renamed as 'Style Wednesday', as Ladies' Day for the first time since 2019.Two bars within the main grandstand, Cottage Rake and Mill House, will be refurbished and reopen at the Showcase meeting in October as one new bar named Prestbury View. A new covered food court will be introduced in the tented village.Investment has been committed to the PA system so racegoers can hear the commentary more clearly, with more live information and data on big screens.Additional discounted ticket windows will be available, offering the opportunity to buy early at a reduced rate for longer.There will be an expanded 'Room to Race' programme, aimed at offering accommodation at more affordable rates.Lifting of restrictions will be extended so racegoers can move more freely with drinks around the venue.",
        "The 'super early bird prices' for the 2026 Festival in the month after this year's meeting ranged from £35-£83 for each of the first three days, and £50-99 for the Friday.On the day, it will cost between £70 and £126 for Tuesday to Thursday and £89 to £149 for Gold Cup day.",
        "The total attendance for the week was significantly down on the record 280,000 that attended the first post-Covid meeting open to spectators in 2022.A crowd of 41,949 on the Wednesday was the lowest daily total since 1993.Crowds in 2025 (2024 in brackets and then 2022)Tuesday: 55,498 (60,181) 68,567Wednesday: 41,949 (46,771) 64,431Thursday: 53,366 (53,918) 73,754Friday: 68,026 (69,129) 73,875Total: 218,839 (229,999) 280,627",
        "More than 200,000 spectators attend the four-day Cheltenham Festival",
        "Organisers of the Cheltenham Festival are to reduce capacity and the price of a pint following criticism from spectators.",
        "The four-day meeting in March is the showpiece of the jump racing calendar, but it has experienced a marked decline in attendances with punters unhappy about cost.",
        "A pint of draught beer or cider will be reduced by 30p to £7.50 at all the course's meetings this season.",
        "The Festival's final day, featuring the Cheltenham Gold Cup, was sold out this year but some people complained of overcrowding on that day.",
        "Daily capacity will be reduced from 68,500 to 66,000, although no attendance on the first three days in 2025 topped 56,000.",
        "The price of drinks, and particularly Guinness – with an estimated 265,000 pints sold during the week - has been a particular sore point among punters.",
        "\"We regularly benchmark our food and beverage prices alongside other major sports venues and comparable events,\" said course chief executive Guy Lavender.",
        "\"Despite being subject to the same increases in goods and services as all industries, we have taken the decision to reduce the price of draught beers and cider... for the 2025/26 season.\"",
        "He said the reduction would bring prices down to 2022 levels.",
        "For comparison, a pint of beer at this year's Wimbledon tennis was £8.45, while it would have set you back £7.75 at golf's Open Championship.",
        "Cheltenham make changes to 'improve' Festival",
        "Leading stallion Wootton Bassett dies aged 17",
        "Absent regulars have cited the cost of accommodation, tickets, travel and food and drink - plus overcrowding in previous years - as reasons for missing the meeting, which was extended to four days from three in 2005.",
        "Thousands have travelled to Spanish destinations, including Benidorm and Tenerife, to watch the action on big screens, saying a week in the sunshine is cheaper than attending the fixture.",
        "A year ago, organisers announced changes aimed at improving competition in races and the experience of racegoers, and further changes are likely.",
        "A new park-and-ride system, additional coaches and extra hardstanding areas at the course for car parking were introduced.",
        "Cheltenham says it will go back to promoting its second day, which it had renamed as 'Style Wednesday', as Ladies' Day for the first time since 2019.",
        "Two bars within the main grandstand, Cottage Rake and Mill House, will be refurbished and reopen at the Showcase meeting in October as one new bar named Prestbury View. A new covered food court will be introduced in the tented village.",
        "Investment has been committed to the PA system so racegoers can hear the commentary more clearly, with more live information and data on big screens.",
        "Additional discounted ticket windows will be available, offering the opportunity to buy early at a reduced rate for longer.",
        "There will be an expanded 'Room to Race' programme, aimed at offering accommodation at more affordable rates.",
        "Lifting of restrictions will be extended so racegoers can move more freely with drinks around the venue.",
        "The 'super early bird prices' for the 2026 Festival in the month after this year's meeting ranged from £35-£83 for each of the first three days, and £50-99 for the Friday.",
        "On the day, it will cost between £70 and £126 for Tuesday to Thursday and £89 to £149 for Gold Cup day.",
        "The total attendance for the week was significantly down on the record 280,000 that attended the first post-Covid meeting open to spectators in 2022.",
        "A crowd of 41,949 on the Wednesday was the lowest daily total since 1993.",
        "Crowds in 2025 (2024 in brackets and then 2022)",
        "Tuesday: 55,498 (60,181) 68,567",
        "Wednesday: 41,949 (46,771) 64,431",
        "Thursday: 53,366 (53,918) 73,754",
        "Friday: 68,026 (69,129) 73,875",
        "Total: 218,839 (229,999) 280,627",
        "Latest horse racing results"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/horse-racing/articles/ckge1x43jp1o",
      "main_category": "sport",
      "detailed_category": "horse-racing",
      "topic": "Leading stallion Wootton Bassett dies aged 17",
      "content": [
        "A leading stallion who sired several of Europe's biggest race winners has died aged 17.Wootton Bassett's stud fee had climbed to an Australian record of 385,000 Australian dollars (£187,000).Owners Coolmore said he died on Tuesday from pneumonia.This season alone, the offspring of Wootton Bassett to have claimed big victories include multiple Group One-winning filly Whirl, Irish St Leger victor Al Riffa and Camille Pissarro, winner of the French Derby.Wootton Bassett, trained by Richard Fahey, was unbeaten in all five races as a two-year-old before being retired for a breeding career after losing all four contests the following season.His other successful sons have included 2016 French Derby and Irish Champion Stakes winner Almanzor and 2023 Derby runner-up King Of Steel, who won the Champion Stakes at Ascot in Frankie Dettori's final ride in Britain.Coolmore Australia said Wootton Bassett died after complication following 'choke' - an obstruction to the horse's oesophagus, the tube which carries food from the mouth to the stomach.\"Wootton Bassett, one of the world's great sires, has sadly passed away today at Coolmore Australia having suffered from choke and subsequently developing an acute pneumonia which deteriorated rapidly,\" said the stud business.\"Despite round-the-clock care from a dedicated team of vets, overseen by Dr Nathan Slovis from Hagyard Equine Medical Institute in Kentucky, he was unable to be saved.\"",
        "Wootton Bassett won all five races as a juvenile",
        "A leading stallion who sired several of Europe's biggest race winners has died aged 17.",
        "Wootton Bassett's stud fee had climbed to an Australian record of 385,000 Australian dollars (£187,000).",
        "Owners Coolmore said he died on Tuesday from pneumonia.",
        "This season alone, the offspring of Wootton Bassett to have claimed big victories include multiple Group One-winning filly Whirl, Irish St Leger victor Al Riffa and Camille Pissarro, winner of the French Derby.",
        "Wootton Bassett, trained by Richard Fahey, was unbeaten in all five races as a two-year-old before being retired for a breeding career after losing all four contests the following season.",
        "His other successful sons have included 2016 French Derby and Irish Champion Stakes winner Almanzor and 2023 Derby runner-up King Of Steel, who won the Champion Stakes at Ascot in Frankie Dettori's final ride in Britain.",
        "Coolmore Australia said Wootton Bassett died after complication following 'choke' - an obstruction to the horse's oesophagus, the tube which carries food from the mouth to the stomach.",
        "\"Wootton Bassett, one of the world's great sires, has sadly passed away today at Coolmore Australia having suffered from choke and subsequently developing an acute pneumonia which deteriorated rapidly,\" said the stud business.",
        "\"Despite round-the-clock care from a dedicated team of vets, overseen by Dr Nathan Slovis from Hagyard Equine Medical Institute in Kentucky, he was unable to be saved.\"",
        "Latest horse racing results"
      ]
    }
  ]
}