{
  "scraped_at": "2025-10-27T18:56:59.764546",
  "total_articles": 6,
  "category": "baseball",
  "articles_per_category": 100,
  "articles": [
    {
      "url": "https://www.bbc.com/sport/baseball/articles/cx2px1gr8e3o",
      "main_category": "sport",
      "detailed_category": "baseball",
      "topic": "Yamamoto helps Dodgers level World Series at 1-1",
      "content": [
        "Pitcher Yoshinobu Yamamoto and catcher Will Smith starred as the Los Angeles Dodgers beat the Toronto Blue Jays 5-1 to draw level at 1-1 in the best-of-seven World Series.Japanese right-hander Yamamoto needed only 105 pitches to record his second successive complete game of the postseason.Meanwhile, Smith led the Dodgers' offence with three runs batted in (RBI) as the Blue Jays had a night to forget.In contrast to the free-scoring opener, game two was a pitching duel for long stretches at Toronto's Rogers Centre.The Dodgers went ahead in the top of the first inning when Smith drove in Freddie Freeman, but were tied down after that by Blue Jays starting pitcher Kevin Gausman, who retired the next 17 Dodgers hitters he faced without allowing a baserunner.Though the Canadian side drew level in the bottom of the third inning when Alejandro Kirk's sacrifice fly scored George Springer, the game remained deadlocked until the top of the seventh when Smith and Max Muncy both lifted Gausman over the left-field fence with solo home runs to give the 2024 champions a two-run cushion.The Blue Jays fell apart in the top of the eighth as, with the bases loaded, the Dodgers scored on a wild pitch, before Smith recorded his third RBI of the evening to make it 5-1.And while the Dodgers' bullpen had taken a beating in game one, Yamamoto was able to give his relievers a night off as he pitched all nine innings without any late scares.The series now switches to Los Angeles for the next three games, with game three at Dodger Stadium on Monday evening.",
        "Game 1: Blue Jays 11-4 DodgersGame 2: Blue Jays 1-5 DodgersGame 3 (in LA): Monday, 27 OctoberGame 4 (in LA): Tuesday, 28 OctoberGame 5 (in LA): Wednesday, 29 OctoberGame 6* (in Toronto): Friday, 31 OctoberGame 7* (in Toronto): Saturday, 1 November*if required. Matches start 20:00 Eastern Time (early next morning UK time), Home team listed first",
        "Yamamoto is the first man to pitch back-to-back complete games in MLB's postseason since Curt Schilling in 2001, having also gone the distance against the Milwaukee Brewers in the National League Championship Series last week",
        "Pitcher Yoshinobu Yamamoto and catcher Will Smith starred as the Los Angeles Dodgers beat the Toronto Blue Jays 5-1 to draw level at 1-1 in the best-of-seven World Series.",
        "Japanese right-hander Yamamoto needed only 105 pitches to record his second successive complete game of the postseason.",
        "Meanwhile, Smith led the Dodgers' offence with three runs batted in (RBI) as the Blue Jays had a night to forget.",
        "In contrast to the free-scoring opener, game two was a pitching duel for long stretches at Toronto's Rogers Centre.",
        "The Dodgers went ahead in the top of the first inning when Smith drove in Freddie Freeman, but were tied down after that by Blue Jays starting pitcher Kevin Gausman, who retired the next 17 Dodgers hitters he faced without allowing a baserunner.",
        "Though the Canadian side drew level in the bottom of the third inning when Alejandro Kirk's sacrifice fly scored George Springer, the game remained deadlocked until the top of the seventh when Smith and Max Muncy both lifted Gausman over the left-field fence with solo home runs to give the 2024 champions a two-run cushion.",
        "The Blue Jays fell apart in the top of the eighth as, with the bases loaded, the Dodgers scored on a wild pitch, before Smith recorded his third RBI of the evening to make it 5-1.",
        "And while the Dodgers' bullpen had taken a beating in game one, Yamamoto was able to give his relievers a night off as he pitched all nine innings without any late scares.",
        "The series now switches to Los Angeles for the next three games, with game three at Dodger Stadium on Monday evening.",
        "Game 1: Blue Jays 11-4 Dodgers",
        "Game 2: Blue Jays 1-5 Dodgers",
        "Game 3 (in LA): Monday, 27 October",
        "Game 4 (in LA): Tuesday, 28 October",
        "Game 5 (in LA): Wednesday, 29 October",
        "Game 6* (in Toronto): Friday, 31 October",
        "Game 7* (in Toronto): Saturday, 1 November",
        "*if required. Matches start 20:00 Eastern Time (early next morning UK time), Home team listed first",
        "Will Smith (right), born and raised in Louisville, Kentucky, was a first-round draft pick in 2016 for the Dodgers, and has been their best batter in this World Series",
        "After conceding a run in the top of the first inning, Blue Jays starting pitcher Kevin Gausman retired the next 17 batters he faced - but then took the loss after giving up two home runs in the seventh inning"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/baseball/articles/cvgm74045mro",
      "main_category": "sport",
      "detailed_category": "baseball",
      "topic": "Blue Jays blow away Dodgers in World Series opener",
      "content": [
        "Addison Barger smashed the first grand slam by a pinch-hitter in World Series history as the Toronto Blue Jays blew away the Los Angeles Dodgers in the first game of the 'Fall Classic'.With an expectant crowd packed into Toronto's Rogers Centre for the first World Series game in Canada since 1993, the Blue Jays scored nine runs in the bottom of the sixth inning as they romped to an 11-4 win.Not even a home run from Japanese superstar Shohei Ohtani could spare the defending champions' blushes as their American League opponents drew first blood in the best-of-seven series.The Dodgers took an early lead as Enrique Hernandez drove in Teoscar Hernandez in the second inning, before Will Smith did the same for Mookie Betts in the third.But Toronto's Daulton Varsho tied the game at 2-2 with a two-run homer to centre field in the bottom of the fourth.The sixth-inning blowout came when Dodgers starting pitcher Blake Snell was taken out after hitting Varsho with a pitch to load the bases with no outs.Ernie Clement singled off reliever Emmet Sheehan to give Toronto the lead for he first time, Sheehan walked in a run, and a line drive from Andres Gimenez made it 5-2.Dodgers manager Dave Roberts then replaced Sheehan with Anthony Banda on the mound, but it backfired spectacularly as Barger's grand slam cleared the bases, before Alejandro Kirk added a two-run homer of his own to make it 11-2.Ohtani served notice of his ability with a two-run shot in the seventh, but it was too little, too late for the National League champions .Toronto had attempted to sign Ohtani, external before he moved across LA from the Angels to the Dodgers, but the home fans chanted \"We don't need him!\" as he came up to bat again in the ninth.Game two takes place on Saturday evening, also in Toronto, before the series switches to Los Angeles.",
        "Game 1: Blue Jays 11-4 DodgersGame 2 (in Toronto): Saturday, 25 OctoberGame 3 (in LA): Monday, 27 OctoberGame 4 (in LA): Tuesday, 28 OctoberGame 5* (in LA): Wednesday, 29 OctoberGame 6* (in Toronto): Friday, 31 OctoberGame 7* (in Toronto): Saturday, 1 November*if required. Matches start 20:00 Eastern Time (early next morning UK time), Home team listed first",
        "Addison Barger made his MLB debut in 2024, but began 2025 in the minor leagues before writing his name in World Series history with his pinch-hit grand slam",
        "Addison Barger smashed the first grand slam by a pinch-hitter in World Series history as the Toronto Blue Jays blew away the Los Angeles Dodgers in the first game of the 'Fall Classic'.",
        "With an expectant crowd packed into Toronto's Rogers Centre for the first World Series game in Canada since 1993, the Blue Jays scored nine runs in the bottom of the sixth inning as they romped to an 11-4 win.",
        "Not even a home run from Japanese superstar Shohei Ohtani could spare the defending champions' blushes as their American League opponents drew first blood in the best-of-seven series.",
        "The Dodgers took an early lead as Enrique Hernandez drove in Teoscar Hernandez in the second inning, before Will Smith did the same for Mookie Betts in the third.",
        "But Toronto's Daulton Varsho tied the game at 2-2 with a two-run homer to centre field in the bottom of the fourth.",
        "The sixth-inning blowout came when Dodgers starting pitcher Blake Snell was taken out after hitting Varsho with a pitch to load the bases with no outs.",
        "Ernie Clement singled off reliever Emmet Sheehan to give Toronto the lead for he first time, Sheehan walked in a run, and a line drive from Andres Gimenez made it 5-2.",
        "Dodgers manager Dave Roberts then replaced Sheehan with Anthony Banda on the mound, but it backfired spectacularly as Barger's grand slam cleared the bases, before Alejandro Kirk added a two-run homer of his own to make it 11-2.",
        "Ohtani served notice of his ability with a two-run shot in the seventh, but it was too little, too late for the National League champions .",
        "Toronto had attempted to sign Ohtani, external before he moved across LA from the Angels to the Dodgers, but the home fans chanted \"We don't need him!\" as he came up to bat again in the ninth.",
        "Game two takes place on Saturday evening, also in Toronto, before the series switches to Los Angeles.",
        "Dodgers v Blue Jays - five World Series talking points",
        "The $500m slugger who is taking Canada to the World Series",
        "Game 1: Blue Jays 11-4 Dodgers",
        "Game 2 (in Toronto): Saturday, 25 October",
        "Game 3 (in LA): Monday, 27 October",
        "Game 4 (in LA): Tuesday, 28 October",
        "Game 5* (in LA): Wednesday, 29 October",
        "Game 6* (in Toronto): Friday, 31 October",
        "Game 7* (in Toronto): Saturday, 1 November",
        "*if required. Matches start 20:00 Eastern Time (early next morning UK time), Home team listed first",
        "Shohei Ohtani, who joined the Dodgers on a $700m (£558m) contract in 2024, struck out in the first at-bat of the World Series. The game was effecively lost by the time he homered in the seventh inning",
        "Centre fielder Daulton Varsho hit the first home run of the 2025 World Series, and was then hit by a pitch to load the bases as the Blue Jays rallied in the bottom of the sixth inning",
        "The ceremonial first pitch was thrown out by former Blue Jays manager Cito Gaston, who led them to back-to-back World Series titles in 1992 and 1993"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/baseball/articles/cp3djd72qwjo",
      "main_category": "sport",
      "detailed_category": "baseball",
      "topic": "Dodgers v Blue Jays - five World Series talking points",
      "content": [
        "If the 2024 World Series was billed as a clash of the titans, the 2025 edition begins in Toronto on Friday with one remaining titan looking to crush a new opponent.The big-spending Los Angeles Dodgers have been a juggernaut of Major League Baseball in the past decade. After losing back-to-back World Series in 2017 and 2018, they triumphed in the Covid-shortened 2020 season, then overcame fellow behemoth, the New York Yankees, last year.And they have powered through the National League play-offs, losing only one of their 10 postseason games while breezing past the Cincinnati Reds 2-0, overcoming the Philadelphia Phillies 3-1 and sweeping the Milwaukee Brewers 4-0.Standing in their way are a rejuvenated Toronto Blue Jays team who vaulted over the Yankees and Boston Red Sox to win the American League East, before beating the Yankees again in the play-offs and coming from 2-0 and 3-2 down to pip the Seattle Mariners to the AL pennant.But will the Dodgers become the first team to win successive World Series since the Yankees in 1998, 1999 and 2000?Or will the Blue Jays - with home field advantage after winning one more regular season game than the Dodgers - claim their first title since they went back-to-back in 1992 and 1993?",
        "Game 1 (in Toronto): Friday, 24 OctoberGame 2 (in Toronto): Saturday, 25 OctoberGame 3 (in LA): Monday, 27 OctoberGame 4 (in LA): Tuesday, 28 OctoberGame 5* (in LA): Wednesday, 29 OctoberGame 6* (in Toronto): Friday, 31 OctoberGame 7* (in Toronto): Saturday, 1 November*if required. Matches start 20:00 Eastern Time (early next morning UK time)",
        "Shohei Ohtani is the face of baseball right now, ensuring that this World Series will be as closely followed in Japan as it will be in North America.The 31-year-old is a rare \"two-way\" player, operating at the elite level as both a pitcher and a hitter, in a sport where most players are guided to choose one discipline over the other while at college.Moving across Los Angeles from the Angels to the Dodgers as a free agent for the 2024 season, he signed a $700m (£558m) contract - turning down the Blue Jays, external among other suitors.While injury prevented him from pitching last year, he was unanimously voted as the National League's Most Valuable Player (MVP). Returning to the pitcher's mound in June, he posted impressive numbers again in 2025, including 55 home runs and 62 strikeouts, the first MLB player to pass 50 in both categories simultaneously.And he rewrote the record books in the play-offs, hitting three home runs and striking out 10 batters in the World Series-clinching game, a performance hailed as one of the greatest in history.A rare blemish came in last year's World Series where Ohtani only managed two hits from 19 at-bats, a disappointing personal showing in a winning team. But at his best, he looks unstoppable.",
        "Television loves a redemption story - and this one all started with a Sports Illustrated cover.In June 2014, the US magazine Sports Illustrated made a bold front-page prediction that the struggling Houston Astros, in the midst of rebuilding their roster, would win the 2017 World Series.The cover star they chose was rookie outfielder George Springer.",
        "Three years later, the prophecy was fulfilled. Houston beat the Dodgers in the 2017 'Fall Classic', with Springer the MVP after hitting home runs in five of the seven games.However, that success was later tarnished by an electronic sign-stealing scandal which left Springer, and other players involved, in the role of MLB's pantomime villains - particularly in the eyes of Dodgers fans after they also lost the 2018 World Series to a Boston Red Sox team who were themselves later found guilty of sign-stealing.Springer left Houston for Toronto in 2021 via free agency, but despite turning 36 this year he posted his highest seasonal batting average of his career (.309) and remains a key man as the Blue Jays' leadoff hitter, crashing a three-run homer in the decisive AL Championship Series game seven to enshrine him as one of MLB's best postseason performers of all time., externalWhile he will still be booed in LA, bringing a title to Toronto would cap a wonderful redemption arc.",
        "The Dodgers are hot favourites to win this series, not least because according to USA Today,, external their opening day payroll this season was $321m (£249m), dwarfing all but the New York Mets ($323m).That figure would be even higher if Ohtani were not deferring all but $2m of his $70m annual salary - and that deferred $68m is more than the entire wage bill of the lowest team on that list, the Miami Marlins ($67m).\"Before the season started, they said the Dodgers are ruining baseball,\" bullish manager Dave Roberts said after they reached the World Series. \"Let's get four more wins and really ruin baseball.\"However, a comfortable Dodgers win might strengthen the case for a salary cap - something MLB does not have, unlike the rest of the 'Big Four' US sports (American football, basketball and ice hockey).The players' union, naturally, bitterly opposes a cap. MLB and the team owners, naturally, would like one. Even the Yankees ownership have questioned how other teams can compete, external given the Dodgers' spending.And with the current collective bargaining agreement between owners and players due to expire in December 2026, the two sides seem as far apart as ever.Last time around, a rancorous three-month lockout delayed the start of the 2022 season, and there is already speculation over whether the start of the 2027 campaign could be affected by a lockout or even a strike.",
        "Founded as an expansion franchise to MLB in 1977, the Blue Jays have been a lone Canadian representative since the struggling Montreal Expos were bought by MLB and relocated to the US capital for 2005, becoming the Washington Nationals.Though Canada still maintains seven teams in ice hockey's NHL, its last Stanley Cup title came in 1993 via the Montreal Canadiens, the same year that the Blue Jays last won the World Series.Since then, the only Canadian 'Big Four' success was the Toronto Raptors' 2019 victory in basketball's NBA Finals.The Blue Jays have a local Canadian hero leading the charge this time - first baseman Vladimir Guerrero Jr, who was born in Montreal while his Hall of Fame father Vladimir was playing for the Expos.However, opposing him on first base for the Dodgers is Freddie Freeman, who holds dual Canadian-US citizenship as his parents hail from Ontario.As well as playing for Canada in two World Baseball Classic events, Freeman won World Series titles with the Atlanta Braves (2021) and the Dodgers (2024), when he was named MVP.",
        "So, have you heard the one about the little-known infielder from Millville, New Jersey, who moved teams seven times in two years after being designated for assignment, external at every franchise he has signed for?Yet, despite a measly .069 batting average in 2025, he is a guaranteed World Series champion, having played for both teams this year?Meet Clifton Lewis 'Buddy' Kennedy.Drafted out of high school by the Arizona Diamondbacks, he debuted in MLB in 2022, but by September 2023 he was on the move.Passing rapidly through the systems of the Oakland A's, St Louis Cardinals and Detroit Tigers, often flitting betwen the minor leagues with occasional call-ups to the majors, he began 2025 with the Philadelphia Phillies, but was released in July.Signing for the Blue Jays, he played only two games before moving to the injury-hit Dodgers in August. But after only one hit in 17 at-bats, he was let go again - and rejoined Toronto on a minor league contract.Kennedy did not make the postseason roster, but is eligible to receive a World Series ring (clubs have discretion as to who gets one) whoever triumphs this week.",
        "Freddie Freeman (left) is gunning for a third World Series title after winning with the Braves in 2021 and Dodgers in 2024, while Vladimir Guerrero Jr's (right) father played for the Texas Rangers in the 2010 edition",
        "If the 2024 World Series was billed as a clash of the titans, the 2025 edition begins in Toronto on Friday with one remaining titan looking to crush a new opponent.",
        "The big-spending Los Angeles Dodgers have been a juggernaut of Major League Baseball in the past decade. After losing back-to-back World Series in 2017 and 2018, they triumphed in the Covid-shortened 2020 season, then overcame fellow behemoth, the New York Yankees, last year.",
        "And they have powered through the National League play-offs, losing only one of their 10 postseason games while breezing past the Cincinnati Reds 2-0, overcoming the Philadelphia Phillies 3-1 and sweeping the Milwaukee Brewers 4-0.",
        "Standing in their way are a rejuvenated Toronto Blue Jays team who vaulted over the Yankees and Boston Red Sox to win the American League East, before beating the Yankees again in the play-offs and coming from 2-0 and 3-2 down to pip the Seattle Mariners to the AL pennant.",
        "But will the Dodgers become the first team to win successive World Series since the Yankees in 1998, 1999 and 2000?",
        "Or will the Blue Jays - with home field advantage after winning one more regular season game than the Dodgers - claim their first title since they went back-to-back in 1992 and 1993?",
        "The $500m slugger who is taking Canada to the World Series",
        "Game 1 (in Toronto): Friday, 24 October",
        "Game 2 (in Toronto): Saturday, 25 October",
        "Game 3 (in LA): Monday, 27 October",
        "Game 4 (in LA): Tuesday, 28 October",
        "Game 5* (in LA): Wednesday, 29 October",
        "Game 6* (in Toronto): Friday, 31 October",
        "Game 7* (in Toronto): Saturday, 1 November",
        "*if required. Matches start 20:00 Eastern Time (early next morning UK time)",
        "This video can not be played",
        "Monstrous home runs and 10 strike outs for superstar Ohtani",
        "Shohei Ohtani is the face of baseball right now, ensuring that this World Series will be as closely followed in Japan as it will be in North America.",
        "The 31-year-old is a rare \"two-way\" player, operating at the elite level as both a pitcher and a hitter, in a sport where most players are guided to choose one discipline over the other while at college.",
        "Moving across Los Angeles from the Angels to the Dodgers as a free agent for the 2024 season, he signed a $700m (£558m) contract - turning down the Blue Jays, external among other suitors.",
        "While injury prevented him from pitching last year, he was unanimously voted as the National League's Most Valuable Player (MVP). Returning to the pitcher's mound in June, he posted impressive numbers again in 2025, including 55 home runs and 62 strikeouts, the first MLB player to pass 50 in both categories simultaneously.",
        "And he rewrote the record books in the play-offs, hitting three home runs and striking out 10 batters in the World Series-clinching game, a performance hailed as one of the greatest in history.",
        "A rare blemish came in last year's World Series where Ohtani only managed two hits from 19 at-bats, a disappointing personal showing in a winning team. But at his best, he looks unstoppable.",
        "Dodgers' journey from 'best ever' to 'rock bottom'",
        "This video can not be played",
        "Springer home run sends Blue Jays to World Series for first time since 1993",
        "Television loves a redemption story - and this one all started with a Sports Illustrated cover.",
        "In June 2014, the US magazine Sports Illustrated made a bold front-page prediction that the struggling Houston Astros, in the midst of rebuilding their roster, would win the 2017 World Series.",
        "The cover star they chose was rookie outfielder George Springer.",
        "This article contains content provided by X. We ask for your permission before anything is loaded, as they may be using cookies and other technologies. You may want to read X’s cookie policy, external and privacy policy, external before accepting. To view this content choose ‘accept and continue’.",
        "Three years later, the prophecy was fulfilled. Houston beat the Dodgers in the 2017 'Fall Classic', with Springer the MVP after hitting home runs in five of the seven games.",
        "However, that success was later tarnished by an electronic sign-stealing scandal which left Springer, and other players involved, in the role of MLB's pantomime villains - particularly in the eyes of Dodgers fans after they also lost the 2018 World Series to a Boston Red Sox team who were themselves later found guilty of sign-stealing.",
        "Springer left Houston for Toronto in 2021 via free agency, but despite turning 36 this year he posted his highest seasonal batting average of his career (.309) and remains a key man as the Blue Jays' leadoff hitter, crashing a three-run homer in the decisive AL Championship Series game seven to enshrine him as one of MLB's best postseason performers of all time., external",
        "While he will still be booed in LA, bringing a title to Toronto would cap a wonderful redemption arc.",
        "This video can not be played",
        "Ohtani hits 100mph on his return to pitching",
        "The Dodgers are hot favourites to win this series, not least because according to USA Today,, external their opening day payroll this season was $321m (£249m), dwarfing all but the New York Mets ($323m).",
        "That figure would be even higher if Ohtani were not deferring all but $2m of his $70m annual salary - and that deferred $68m is more than the entire wage bill of the lowest team on that list, the Miami Marlins ($67m).",
        "\"Before the season started, they said the Dodgers are ruining baseball,\" bullish manager Dave Roberts said after they reached the World Series. \"Let's get four more wins and really ruin baseball.\"",
        "However, a comfortable Dodgers win might strengthen the case for a salary cap - something MLB does not have, unlike the rest of the 'Big Four' US sports (American football, basketball and ice hockey).",
        "The players' union, naturally, bitterly opposes a cap. MLB and the team owners, naturally, would like one. Even the Yankees ownership have questioned how other teams can compete, external given the Dodgers' spending.",
        "And with the current collective bargaining agreement between owners and players due to expire in December 2026, the two sides seem as far apart as ever.",
        "Last time around, a rancorous three-month lockout delayed the start of the 2022 season, and there is already speculation over whether the start of the 2027 campaign could be affected by a lockout or even a strike.",
        "This video can not be played",
        "Varsho makes 'crazy' behind-the-back catch for Blue Jays",
        "Founded as an expansion franchise to MLB in 1977, the Blue Jays have been a lone Canadian representative since the struggling Montreal Expos were bought by MLB and relocated to the US capital for 2005, becoming the Washington Nationals.",
        "Though Canada still maintains seven teams in ice hockey's NHL, its last Stanley Cup title came in 1993 via the Montreal Canadiens, the same year that the Blue Jays last won the World Series.",
        "Since then, the only Canadian 'Big Four' success was the Toronto Raptors' 2019 victory in basketball's NBA Finals.",
        "The Blue Jays have a local Canadian hero leading the charge this time - first baseman Vladimir Guerrero Jr, who was born in Montreal while his Hall of Fame father Vladimir was playing for the Expos.",
        "However, opposing him on first base for the Dodgers is Freddie Freeman, who holds dual Canadian-US citizenship as his parents hail from Ontario.",
        "As well as playing for Canada in two World Baseball Classic events, Freeman won World Series titles with the Atlanta Braves (2021) and the Dodgers (2024), when he was named MVP.",
        "Kennedy is on his third different team of 2025, having started with the Phillies, moved to the Blue Jays, then to the Dodgers, and back to the Blue Jays",
        "So, have you heard the one about the little-known infielder from Millville, New Jersey, who moved teams seven times in two years after being designated for assignment, external at every franchise he has signed for?",
        "Yet, despite a measly .069 batting average in 2025, he is a guaranteed World Series champion, having played for both teams this year?",
        "Meet Clifton Lewis 'Buddy' Kennedy.",
        "Drafted out of high school by the Arizona Diamondbacks, he debuted in MLB in 2022, but by September 2023 he was on the move.",
        "Passing rapidly through the systems of the Oakland A's, St Louis Cardinals and Detroit Tigers, often flitting betwen the minor leagues with occasional call-ups to the majors, he began 2025 with the Philadelphia Phillies, but was released in July.",
        "Signing for the Blue Jays, he played only two games before moving to the injury-hit Dodgers in August. But after only one hit in 17 at-bats, he was let go again - and rejoined Toronto on a minor league contract.",
        "Kennedy did not make the postseason roster, but is eligible to receive a World Series ring (clubs have discretion as to who gets one) whoever triumphs this week."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/baseball/articles/ckg4yklen55o",
      "main_category": "sport",
      "detailed_category": "baseball",
      "topic": "Blue Jays set up World Series meeting with Dodgers",
      "content": [
        "The Toronto Blue Jays reached their first World Series since 1993 after beating the Seattle Mariners in the deciding game seven of the American League Championship Series.Trailing 3-1, outfielder George Springer hit a three-run home run in the seventh inning as the only Canadian franchise in Major League Baseball (MLB) won the best-of-seven series 4-3 and will now face the Los Angeles Dodgers, who are the defending champions, in the 'Fall Classic'.\"I'm just so happy for our team, our city, our country,\" said Springer, a star of the Houston Astros team that won the 2017 World Series. \"This is such an unbelievable moment.\"Springer has now hit 23 post-season home runs, the third most in history behind Manny Ramirez (29) and Jose Altuve (27).\"There's probably not another person on planet Earth that I want up in that moment other than George Springer with his October magic,\" said Blue Jays manager John Schneider.Seattle, who had led the series 2-0 and 3-2, remain the only MLB franchise never to appear in a World Series.Mariners manager Dan Wilson said \"there's no question that it's going to sting\" following his side's defeat at Toronto's Rogers Centre, but praised their efforts this season.\"It's a special team. It's a shame that we had to come out on the wrong side of this one,\" he added.Toronto won the World Series on both previous visits in 1992 and 1993, and will host the Dodgers in game one on Friday.",
        "This video can not be played",
        "Springer home run sends Blue Jays to the World Series for the first time since 1993",
        "The Toronto Blue Jays reached their first World Series since 1993 after beating the Seattle Mariners in the deciding game seven of the American League Championship Series.",
        "Trailing 3-1, outfielder George Springer hit a three-run home run in the seventh inning as the only Canadian franchise in Major League Baseball (MLB) won the best-of-seven series 4-3 and will now face the Los Angeles Dodgers, who are the defending champions, in the 'Fall Classic'.",
        "\"I'm just so happy for our team, our city, our country,\" said Springer, a star of the Houston Astros team that won the 2017 World Series. \"This is such an unbelievable moment.\"",
        "Springer has now hit 23 post-season home runs, the third most in history behind Manny Ramirez (29) and Jose Altuve (27).",
        "\"There's probably not another person on planet Earth that I want up in that moment other than George Springer with his October magic,\" said Blue Jays manager John Schneider.",
        "Seattle, who had led the series 2-0 and 3-2, remain the only MLB franchise never to appear in a World Series.",
        "Mariners manager Dan Wilson said \"there's no question that it's going to sting\" following his side's defeat at Toronto's Rogers Centre, but praised their efforts this season.",
        "\"It's a special team. It's a shame that we had to come out on the wrong side of this one,\" he added.",
        "Toronto won the World Series on both previous visits in 1992 and 1993, and will host the Dodgers in game one on Friday.",
        "Ohtani rewrites history to send Dodgers to World Series"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/baseball/articles/cy40p88wzelo",
      "main_category": "sport",
      "detailed_category": "baseball",
      "topic": "Ohtani rewrites history to send Dodgers to World Series",
      "content": [
        "Shohei Ohtani delivered one of the greatest performances in baseball history as defending champions the Los Angeles Dodgers beat the Milwaukee Brewers to reach the World Series.Japan's Ohtani smashed three huge home runs and struck out 10 Brewers batters in a comprehensive 5-1 victory as the Dodgers swept the series 4-0.The 31-year-old's trifecta of home runs and 10 strikeouts in the same game is a Major League Baseball post-season record, highlighting a rare talent of excelling with bat and ball. Ohtani also became the first pitcher since the Boston Braves' Jim Tobin in 1942 to hit three home runs in the same game.\"It was really fun on both sides of the ball today,\" said Ohtani, who was awarded the Most Valuable Player award for his heroics.\"I'm taking this trophy and let's get four more wins. We won it as a team and this is really a team effort. I hope everybody in LA and Japan and all over the world could enjoy a really good sake [Japanese rice wine].\"Ohtani's entered the game at the Dodger Stadium on the back of an eight-game home run drought, but led from the front as he struck out three batters in the opening frame.He then starred with the bat in a performance which included a crushing 446 foot home run and a monster 469 foot hit which bounced out of the stadium.It marked another historic showing from Ohtani, who last year became the first player ever to record 50 home runs and 50 stolen bases in the same season.\"That was probably the greatest post-season performance of all time,\" said Dodgers manager Dave Roberts. \"There's a reason why he's the greatest player on the planet. It's kind of whatever you don't expect, expect him to do it.\"This is just a performance that I've just never seen. No-one's ever seen something like this. I'm still in awe right now of Shohei.\"The Dodgers' comfortable victory sets up a World Series showdown against the Toronto Blue Jays or Seattle Mariners, with the latter 3-2 up in the best-of-seven series.",
        "This video can not be played",
        "Three home runs and 10 strikeouts for superstar Ohtani",
        "Shohei Ohtani delivered one of the greatest performances in baseball history as defending champions the Los Angeles Dodgers beat the Milwaukee Brewers to reach the World Series.",
        "Japan's Ohtani smashed three huge home runs and struck out 10 Brewers batters in a comprehensive 5-1 victory as the Dodgers swept the series 4-0.",
        "The 31-year-old's trifecta of home runs and 10 strikeouts in the same game is a Major League Baseball post-season record, highlighting a rare talent of excelling with bat and ball.",
        "Ohtani also became the first pitcher since the Boston Braves' Jim Tobin in 1942 to hit three home runs in the same game.",
        "\"It was really fun on both sides of the ball today,\" said Ohtani, who was awarded the Most Valuable Player award for his heroics.",
        "\"I'm taking this trophy and let's get four more wins. We won it as a team and this is really a team effort. I hope everybody in LA and Japan and all over the world could enjoy a really good sake [Japanese rice wine].\"",
        "Ohtani's entered the game at the Dodger Stadium on the back of an eight-game home run drought, but led from the front as he struck out three batters in the opening frame.",
        "He then starred with the bat in a performance which included a crushing 446 foot home run and a monster 469 foot hit which bounced out of the stadium.",
        "It marked another historic showing from Ohtani, who last year became the first player ever to record 50 home runs and 50 stolen bases in the same season.",
        "\"That was probably the greatest post-season performance of all time,\" said Dodgers manager Dave Roberts.",
        "\"There's a reason why he's the greatest player on the planet. It's kind of whatever you don't expect, expect him to do it.",
        "\"This is just a performance that I've just never seen. No-one's ever seen something like this. I'm still in awe right now of Shohei.\"",
        "The Dodgers' comfortable victory sets up a World Series showdown against the Toronto Blue Jays or Seattle Mariners, with the latter 3-2 up in the best-of-seven series.",
        "Shohei Ohtani was handed the NLCS Most Valuable Player award for his performance"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/baseball/articles/ce373p7xl34o",
      "main_category": "sport",
      "detailed_category": "baseball",
      "topic": "Dodgers' journey from 'best ever' to 'rock bottom'",
      "content": [
        "Los Angeles Dodgers v Boston Red SoxVenue: Fenway Park, Boston Date: Sunday, 27 July First pitch: 18:35 BST Coverage: Live coverage on BBC iPlayer, the BBC Red Button and the BBC Sport website and app, from 18:30",
        "After winning last year's World Series, the Los Angeles Dodgers picked up from where they left off.They made a flying start to the current Major League Baseball season, becoming the first defending champions to win their first eight games.It had many saying this is the best MLB team that has ever been assembled.Three months later, the Dodgers remain top of their division, but they are struggling.After Tuesday's defeat to Minnesota, Dodgers manager Dave Roberts was desperate to stop the rot, saying: \"It better be rock bottom.\"Now his team visit the Boston Red Sox hoping to get their title defence back on track, and you can watch the final game of their three-game series live on the BBC.",
        "Speaking to BBC Sport after last year's championship win, former World Series winner Chase Utley said that the Dodgers' \"entire line-up has the ability to hit a home run and they play great defence. They're just really good at all aspects of the game.\"And in the off-season their roster got even better. After their starting pitcher rotation was hit by injuries last year, they brought in Blake Snell and Roki Sasaki to add greater strength in depth.They also re-signed veteran pitcher Clayton Kershaw and knew that at some point Shohei Ohtani would be able to pitch again after recovering from elbow surgery.Ohtani is a 'unicorn' in that he is a two-way player. The Japanese star is the first MLB player to be elite at both pitching and hitting at the same time.After joining the Dodgers in a deal worth $700m (£558m), he could only hit in his first season, yet still earned his third Most Valuable Player award as they won the World Series.The Dodgers' offensive line-up also features two former MVPs in Mookie Betts and Freddie Freeman, who are part of a nucleus of players on long-term contracts.And the team bolstered that core with Tommy Edman and Teoscar Hernandez signing extensions.",
        "It's a good job the Dodgers secured that pitching insurance for this season because their injury woes returned, with four of their starting pitchers having had spells out.That has meant they could not sustain that early-season form and have had to use their relieving pitchers - known as the bullpen - far more than any other MLB team.That has taken its toll, with six relieving pitchers currently out injured, and the team generally struggling for form - in the outfield, on the mound and at the plate.Betts has hit three home runs in his past 49 games and Freeman one in 61.At the start of this month, the Dodgers lost seven games in a row for the first time since September 2017. And since that 8-0 start to the season, their record is 53-43.Manager Dave Roberts said on Tuesday: \"It better be rock bottom, as far as how we've been pitching, how we've been playing defence.\"I think the offence is kind of starting to tick up, which is good. There's certainly more in there. But I think as far as quality of baseball, it's been a tough watch. It really has.\"Ohtani's class continues to shine through though. Only Seattle's Cal Raleigh (39) has hit more home runs than Ohtani (37) this season.Ohtani homered in five consecutive games over the past week, and in one of those games he also had three strikeouts as a pitcher.The 31-year-old's return to the mound last month has provided the Dodgers with some relief.So far he has made six starts, with his innings gradually being increased, and in his third game back, Ohtani threw his fastest MLB pitch ever (101.7mph).",
        "Ohtani is not scheduled to pitch again until Wednesday, with Dustin May set to be the Dodgers' starting pitcher for Sunday's game against Boston.And there will be a familiar face on the Fenway Park mound.Walker Buehler left the Dodgers for the Red Sox in the off-season and before the start of their three-game series on Friday, some of his former team-mates presented Buehler with his World Series ring for last season's championship triumph.The Dodgers won Friday's game 5-2 to improve their record to 61-43 atop the National League West division.Boston are 55-50 and sit third in the American League East, with Wilyer Abreu (20 home runs) their leading hitter.After going into the All-Star break on a 10-game winning streak, the Red Sox have won just two of their seven games since.As it stands, they would end their three-year play-off absence, but they too need an upturn in form to be sure of securing a wild-card spot.BBC Sport will be showing an MLB game live every Sunday evening until the end of the regular season on 28 September.",
        "Shohei Ohtani spent six seasons with the Los Angeles Angels before joining the Dodgers",
        "Los Angeles Dodgers v Boston Red Sox",
        "Venue: Fenway Park, Boston Date: Sunday, 27 July First pitch: 18:35 BST",
        "Coverage: Live coverage on BBC iPlayer, the BBC Red Button and the BBC Sport website and app, from 18:30",
        "After winning last year's World Series, the Los Angeles Dodgers picked up from where they left off.",
        "They made a flying start to the current Major League Baseball season, becoming the first defending champions to win their first eight games.",
        "It had many saying this is the best MLB team that has ever been assembled.",
        "Three months later, the Dodgers remain top of their division, but they are struggling.",
        "After Tuesday's defeat to Minnesota, Dodgers manager Dave Roberts was desperate to stop the rot, saying: \"It better be rock bottom.\"",
        "Now his team visit the Boston Red Sox hoping to get their title defence back on track, and you can watch the final game of their three-game series live on the BBC.",
        "This video can not be played",
        "Ohtani hits a home run in five consecutive games",
        "Speaking to BBC Sport after last year's championship win, former World Series winner Chase Utley said that the Dodgers' \"entire line-up has the ability to hit a home run and they play great defence. They're just really good at all aspects of the game.\"",
        "And in the off-season their roster got even better. After their starting pitcher rotation was hit by injuries last year, they brought in Blake Snell and Roki Sasaki to add greater strength in depth.",
        "They also re-signed veteran pitcher Clayton Kershaw and knew that at some point Shohei Ohtani would be able to pitch again after recovering from elbow surgery.",
        "Ohtani is a 'unicorn' in that he is a two-way player. The Japanese star is the first MLB player to be elite at both pitching and hitting at the same time.",
        "After joining the Dodgers in a deal worth $700m (£558m), he could only hit in his first season, yet still earned his third Most Valuable Player award as they won the World Series.",
        "The Dodgers' offensive line-up also features two former MVPs in Mookie Betts and Freddie Freeman, who are part of a nucleus of players on long-term contracts.",
        "And the team bolstered that core with Tommy Edman and Teoscar Hernandez signing extensions.",
        "Why Dodgers are on brink of World Series dynasty",
        "Why 'face of baseball' is on cusp of global stardom",
        "It's a good job the Dodgers secured that pitching insurance for this season because their injury woes returned, with four of their starting pitchers having had spells out.",
        "That has meant they could not sustain that early-season form and have had to use their relieving pitchers - known as the bullpen - far more than any other MLB team.",
        "That has taken its toll, with six relieving pitchers currently out injured, and the team generally struggling for form - in the outfield, on the mound and at the plate.",
        "Betts has hit three home runs in his past 49 games and Freeman one in 61.",
        "At the start of this month, the Dodgers lost seven games in a row for the first time since September 2017. And since that 8-0 start to the season, their record is 53-43.",
        "Manager Dave Roberts said on Tuesday: \"It better be rock bottom, as far as how we've been pitching, how we've been playing defence.",
        "\"I think the offence is kind of starting to tick up, which is good. There's certainly more in there. But I think as far as quality of baseball, it's been a tough watch. It really has.\"",
        "Ohtani's class continues to shine through though. Only Seattle's Cal Raleigh (39) has hit more home runs than Ohtani (37) this season.",
        "Ohtani homered in five consecutive games over the past week, and in one of those games he also had three strikeouts as a pitcher.",
        "The 31-year-old's return to the mound last month has provided the Dodgers with some relief.",
        "So far he has made six starts, with his innings gradually being increased, and in his third game back, Ohtani threw his fastest MLB pitch ever (101.7mph).",
        "This video can not be played",
        "Ohtani strikes out three batters",
        "Ohtani is not scheduled to pitch again until Wednesday, with Dustin May set to be the Dodgers' starting pitcher for Sunday's game against Boston.",
        "And there will be a familiar face on the Fenway Park mound.",
        "Walker Buehler left the Dodgers for the Red Sox in the off-season and before the start of their three-game series on Friday, some of his former team-mates presented Buehler with his World Series ring for last season's championship triumph.",
        "The Dodgers won Friday's game 5-2 to improve their record to 61-43 atop the National League West division.",
        "Boston are 55-50 and sit third in the American League East, with Wilyer Abreu (20 home runs) their leading hitter.",
        "After going into the All-Star break on a 10-game winning streak, the Red Sox have won just two of their seven games since.",
        "As it stands, they would end their three-year play-off absence, but they too need an upturn in form to be sure of securing a wild-card spot.",
        "BBC Sport will be showing an MLB game live every Sunday evening until the end of the regular season on 28 September.",
        "How does scoring work in baseball?"
      ]
    }
  ]
}