{
  "scraped_at": "2025-10-27T18:56:59.763547",
  "total_articles": 9,
  "category": "badminton",
  "articles_per_category": 100,
  "articles": [
    {
      "url": "https://www.bbc.com/sport/badminton/articles/c4gk30zgdxgo",
      "main_category": "sport",
      "detailed_category": "badminton",
      "topic": "GB's Bethell defends European Para Badminton title",
      "content": [
        "Dan Bethell claimed his fifth European men's singles title in Istanbul as part of a successful European Para Badminton Championships for the Great Britain team. The defending champion once again met Oleksandr Chyrkov in the SL3 final, after beating the Ukrainian in Rotterdam to claim the crown two years ago, and this time saw out a 21-9 21-8 win. The British team claimed 13 medals in total, including three gold, two silver and eight bronze, which are awarded to players who reach the semi-finals but fail to progress.\"To see so many pathway players performing alongside the GB players is fantastic and shows how much the sport is developing across the country,\" double Paralympic silver medallist Bethell, 29, told Badminton England.\"There's been some amazing performances and victories across the board.\"Englishman Jack Shephard reached the final of the men's SH6 singles but was unable to defend his title, losing 21-17 21-12 to France's reigning Paralympic champion Charles Noakes. But Shephard, 28, did win gold in the mixed doubles alongside 17-year-old compatriot Anya Butterworth, who stepped in after Shephard's regular partner Rachel Choong sustained an injury before the tournament.   Butterworth also upset the odds to reach her first European singles final, beating second seed Daria Bujnicka in the last four, but had to settle for silver after losing a tight medal match 23-21 18-21 21-11 against Polish top seed Oliwia Szmigiel. Meanwhile, England's Krysten Coombs teamed up with men's singles champion Noakes to win gold in the SH6 men's doubles.Scot Andrew Davies claimed bronze medals in both the men's and mixed doubles in the SH6 category, while Wales' David Jack Wilson and Englishman Robert Donald finished with bronze in the men's SU5 singles. Other British players to win bronze include Emma Louise Stoner (SL4 women's singles), David Follett (WH1/2 mixed doubles), Curnow Pirbhai-Clarke and William Smith (both SL3/4 men's doubles).",
        "Dan Bethell won Paralympic silver in Tokyo (2021) and Paris (2024)",
        "Dan Bethell claimed his fifth European men's singles title in Istanbul as part of a successful European Para Badminton Championships for the Great Britain team.",
        "The defending champion once again met Oleksandr Chyrkov in the SL3 final, after beating the Ukrainian in Rotterdam to claim the crown two years ago, and this time saw out a 21-9 21-8 win.",
        "The British team claimed 13 medals in total, including three gold, two silver and eight bronze, which are awarded to players who reach the semi-finals but fail to progress.",
        "\"To see so many pathway players performing alongside the GB players is fantastic and shows how much the sport is developing across the country,\" double Paralympic silver medallist Bethell, 29, told Badminton England.",
        "\"There's been some amazing performances and victories across the board.\"",
        "Englishman Jack Shephard reached the final of the men's SH6 singles but was unable to defend his title, losing 21-17 21-12 to France's reigning Paralympic champion Charles Noakes.",
        "But Shephard, 28, did win gold in the mixed doubles alongside 17-year-old compatriot Anya Butterworth, who stepped in after Shephard's regular partner Rachel Choong sustained an injury before the tournament.",
        "Butterworth also upset the odds to reach her first European singles final, beating second seed Daria Bujnicka in the last four, but had to settle for silver after losing a tight medal match 23-21 18-21 21-11 against Polish top seed Oliwia Szmigiel.",
        "Meanwhile, England's Krysten Coombs teamed up with men's singles champion Noakes to win gold in the SH6 men's doubles.",
        "Scot Andrew Davies claimed bronze medals in both the men's and mixed doubles in the SH6 category, while Wales' David Jack Wilson and Englishman Robert Donald finished with bronze in the men's SU5 singles.",
        "Other British players to win bronze include Emma Louise Stoner (SL4 women's singles), David Follett (WH1/2 mixed doubles), Curnow Pirbhai-Clarke and William Smith (both SL3/4 men's doubles)."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/badminton/articles/c5yk6ep3197o",
      "main_category": "sport",
      "detailed_category": "badminton",
      "topic": "Wales' Wilson wins first major international medal",
      "content": [
        "Wales' David Jack Wilson claimed his first major international medal when winning bronze at the European Para Badminton Championships in Turkey.The 30-year-old reached the semi-finals in Istanbul after a determined run through the tournament, defeating France's Abdoullah Ait Bella in a hard-fought quarter-final.That set up a meeting with the top seed Meril Loquette, a familiar opponent from the international circuit.Despite a spirited performance, Wilson was unable to overcome the Frenchman but did secure a bronze medal.",
        "David Jack Wilson won bronze at the European Para Badminton Championships",
        "Wales' David Jack Wilson claimed his first major international medal when winning bronze at the European Para Badminton Championships in Turkey.",
        "The 30-year-old reached the semi-finals in Istanbul after a determined run through the tournament, defeating France's Abdoullah Ait Bella in a hard-fought quarter-final.",
        "That set up a meeting with the top seed Meril Loquette, a familiar opponent from the international circuit.",
        "Despite a spirited performance, Wilson was unable to overcome the Frenchman but did secure a bronze medal."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/badminton/articles/cm2z3083p0yo",
      "main_category": "sport",
      "detailed_category": "badminton",
      "topic": "Wilson to use 'home advantage' at Para-Badminton International",
      "content": [
        "Jack Wilson says competing on home soil will be \"something special\" as he prepares for the British & Irish Para-Badminton International in Cardiff.The 30-year-old, from Glyn Ceiriog near Wrexham, will compete in the SU5 category for athletes with upper limb impairments. Currently ranked number one in both Wales and the UK, Wilson is eager to make the most of familiar surroundings.\"It's the first time since 2003 that para-badminton has been back in Wales,\" says Wilson. \"I've got home advantage, back in the hall I spent 10 years of my life in. I'm raring to go.\"",
        "With a medal firmly in his sights, Wilson also hopes the event will shine a light on the sport's accessibility.\"The ideal scenario is to at least medal,\" added Wilson.\"It's very important to raise awareness of the sport and show that it's accessible. \"Badminton Wales have done a lot recently in promoting para-badminton.\"",
        "The competition will be Wales' largest ever para-badminton tournament, and takes place in Cardiff from 22-26 July.The important Grade 2, Level 1 event will take place at the Sport Wales National Centre in Sophia Gardens.The competition sees 131 athletes from 32 countries - including Paralympic, World, and European medallists - compete in what is one of the major stops on the global para-badminton calendar.The tournament also marks a significant moment for Welsh sport, bringing elite international competition back to the capital for the first time since the World Championships were held in the country back in 2003.The event forms part of a wider effort by Badminton Wales to champion inclusivity in sport. Alongside the tournament, the governing body has launched its 'Can You Manage?' campaign – a powerful new video initiative featuring para-athletes that challenges public perceptions and aims to inspire greater participation in the sport.Kelly Aston MBE, CEO of Badminton Wales, said: \"This is the first time we've hosted an event of this size.\"We really want to make it a major occasion to showcase that Wales can host events like para-badminton on the world stage.\"",
        "This video can not be played",
        "Wilson hoping to use 'home advantage' in Welsh capital",
        "Jack Wilson says competing on home soil will be \"something special\" as he prepares for the British & Irish Para-Badminton International in Cardiff.",
        "The 30-year-old, from Glyn Ceiriog near Wrexham, will compete in the SU5 category for athletes with upper limb impairments.",
        "Currently ranked number one in both Wales and the UK, Wilson is eager to make the most of familiar surroundings.",
        "\"It's the first time since 2003 that para-badminton has been back in Wales,\" says Wilson.",
        "\"I've got home advantage, back in the hall I spent 10 years of my life in. I'm raring to go.\"",
        "With a medal firmly in his sights, Wilson also hopes the event will shine a light on the sport's accessibility.",
        "\"The ideal scenario is to at least medal,\" added Wilson.",
        "\"It's very important to raise awareness of the sport and show that it's accessible.",
        "\"Badminton Wales have done a lot recently in promoting para-badminton.\"",
        "Jack Wilson is one of seven GB athletes taking part in the British & Irish Para-Badminton International",
        "The competition will be Wales' largest ever para-badminton tournament, and takes place in Cardiff from 22-26 July.",
        "The important Grade 2, Level 1 event will take place at the Sport Wales National Centre in Sophia Gardens.",
        "The competition sees 131 athletes from 32 countries - including Paralympic, World, and European medallists - compete in what is one of the major stops on the global para-badminton calendar.",
        "The tournament also marks a significant moment for Welsh sport, bringing elite international competition back to the capital for the first time since the World Championships were held in the country back in 2003.",
        "The event forms part of a wider effort by Badminton Wales to champion inclusivity in sport.",
        "Alongside the tournament, the governing body has launched its 'Can You Manage?' campaign – a powerful new video initiative featuring para-athletes that challenges public perceptions and aims to inspire greater participation in the sport.",
        "Kelly Aston MBE, CEO of Badminton Wales, said: \"This is the first time we've hosted an event of this size.",
        "\"We really want to make it a major occasion to showcase that Wales can host events like para-badminton on the world stage.\""
      ]
    },
    {
      "url": "https://www.bbc.com/sport/badminton/articles/clyjz9gdx85o",
      "main_category": "sport",
      "detailed_category": "badminton",
      "topic": "How to follow the All England Open Badminton Championships",
      "content": [
        "The 2025 All England Open is under way - and you can follow the action on the BBC from 14-16 March.This is the world's oldest and most prestigious badminton tournament - dating back to 1898, when it was first held.Taking place at the Utilita Arena Birmingham, the tournament hosts the very best  players including gold, silver and bronze medallists from the 2024 Olympics. You can watch live action across Red Button, the BBC Sport app and iPlayer.",
        "The tournament features singles and doubles action and is the only Super 1,000 event that takes place in Europe. It started on Tuesday, and in total features 155 matches.",
        "Two-time Olympic champion Victor Axelsen has already crashed out of the men's event. World number one Shi Yuqi and world champion Kunlavut Vitidsarn of Thailand are among the favourites.In the women's singles, 2023 winner An Se-young is one to watch.England's Ben Lane and Sean Landy feature in the men's doubles. The pair were knocked out in the first round of 2024, and will be hoping they can go far this year.",
        "Friday, 14 March: 09:30 - 14:30 - Live on BBC Red Button, BBC Sport website and iPlayer; 1700 - 22:00 - Quarter-finals live on iPlayer and BBC Sport websiteSaturday, 15 March: Semi-final action: 09:30 - 14:30 - iPlayer and BBC Sport website; 17:00 - 22:00 - iPlayer and BBC Sport websiteSunday, 16 March: Final day: 11:00 - 17:00 - iPlayer and BBC Sport website",
        "Shi Yuqi is the top seed in the men's event",
        "The 2025 All England Open is under way - and you can follow the action on the BBC from 14-16 March.",
        "This is the world's oldest and most prestigious badminton tournament - dating back to 1898, when it was first held.",
        "Taking place at the Utilita Arena Birmingham, the tournament hosts the very best  players including gold, silver and bronze medallists from the 2024 Olympics.",
        "You can watch live action across Red Button, the BBC Sport app and iPlayer.",
        "The tournament features singles and doubles action and is the only Super 1,000 event that takes place in Europe.",
        "It started on Tuesday, and in total features 155 matches.",
        "Two-time Olympic champion Victor Axelsen has already crashed out of the men's event. World number one Shi Yuqi and world champion Kunlavut Vitidsarn of Thailand are among the favourites.",
        "In the women's singles, 2023 winner An Se-young is one to watch.",
        "England's Ben Lane and Sean Landy feature in the men's doubles. The pair were knocked out in the first round of 2024, and will be hoping they can go far this year.",
        "Friday, 14 March: 09:30 - 14:30 - Live on BBC Red Button, BBC Sport website and iPlayer; 1700 - 22:00 - Quarter-finals live on iPlayer and BBC Sport website",
        "Saturday, 15 March: Semi-final action: 09:30 - 14:30 - iPlayer and BBC Sport website; 17:00 - 22:00 - iPlayer and BBC Sport website",
        "Sunday, 16 March: Final day: 11:00 - 17:00 - iPlayer and BBC Sport website"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/badminton/articles/cg7gd42p2dxo",
      "main_category": "sport",
      "detailed_category": "badminton",
      "topic": "Smith and Ellis announce international retirement",
      "content": [
        "British mixed doubles pair Lauren Smith and Marcus Ellis have retired from international badminton after revealing they are expecting a baby.The couple won European gold in 2019, competed at the Olympics in Tokyo in 2021 and claimed silver at the 2022 Commonwealth Games.\"We're so happy to share the news that our family is growing,\" 33-year-old Smith said on Instagram.\"This means we won't be returning to international competition, and are starting a new chapter in our lives.\"Ellis, 35, won a bronze with Chris Langridge in the men's doubles at the 2016 Olympics in Rio, while Smith has won seven Commonwealth medals.\"Marcus will continue to play and coach, in his clubs and at training centres around Europe,\" said Smith.\"I will continue to create content and develop my skills and experience in media.\"Badminton England head of performance Mark Beecher said: \"They have competed at the very highest level in our sport and we are proud of all they have achieved.\"",
        "Lauren Smith and Marcus Ellis achieved a career-high ranking of seven in the mixed doubles",
        "British mixed doubles pair Lauren Smith and Marcus Ellis have retired from international badminton after revealing they are expecting a baby.",
        "The couple won European gold in 2019, competed at the Olympics in Tokyo in 2021 and claimed silver at the 2022 Commonwealth Games.",
        "\"We're so happy to share the news that our family is growing,\" 33-year-old Smith said on Instagram.",
        "\"This means we won't be returning to international competition, and are starting a new chapter in our lives.\"",
        "Ellis, 35, won a bronze with Chris Langridge in the men's doubles at the 2016 Olympics in Rio, while Smith has won seven Commonwealth medals.",
        "\"Marcus will continue to play and coach, in his clubs and at training centres around Europe,\" said Smith.",
        "\"I will continue to create content and develop my skills and experience in media.\"",
        "Badminton England head of performance Mark Beecher said: \"They have competed at the very highest level in our sport and we are proud of all they have achieved.\""
      ]
    },
    {
      "url": "https://www.bbc.com/sport/articles/c9818n39vrvo",
      "main_category": "sport",
      "detailed_category": "badminton",
      "topic": "Who are the Commonwealth Games winners and losers?",
      "content": [
        "When legendary rocker Ozzy Osborne brought the curtain down on the 2022 Commonwealth Games, there was a sense of euphoria in Birmingham.The Games was widely considered a roaring success, providing a post-Covid buzz to the city, the country and the competing Commonwealth nations.However, it came at a price. Costing £800m, it was the most expensive sports event hosted in the UK since the 2012 Olympics.Reform of the Games - making it more cost-effective, sustainable and future-proof - was already an intense discussion point.Then, the Australian state of Victoria pulled out of hosting the 2026 event. State Premier Daniel Andrews concluded it was \"all cost and no benefit\" and plunged the future of the Commonwealth Games into serious doubt.To the rescue came Glasgow.The Scottish city hosted the Games in 2014 but it will have a very different, streamlined look when it returns there in two years' time, with only 10 sports to be played out over four venues at an estimated cost of about £140m.\"The Games had got out of hand - it was too big and trying to be a 'mini Olympics',\" Commonwealth Games Federation chief executive Katie Sadleir told BBC Sport.Earlier, Sadleir said: \"We want to create a sustainable model that can go around the Commonwealth because the Commonwealth members love the Commonwealth Games and we want to take it there as well.\"",
        "The Commonwealth Games has always had a flexible programme, where the choice of sports is dictated by the host city.The list is drawn up after consideration to the \"universality of participation and quality of competition\", as well as local infrastructure and interest.At Glasgow 2026, there will be 10 sports:Athletics and Para-athletics (track and field only)Swimming and Para-swimmingArtistic gymnasticsTrack cycling and Para-track cyclingNetballWeightlifting and Para-powerliftingBoxingJudoBowls and Para-bowls3x3 basketball and 3x3 wheelchair basketballTwelve sports that featured at Birmingham 2022 - plus the marathon, Para marathon and 10k walk, which are typically key components of the athletics and Para-athletics events - will not be staged in Glasgow.The sports that have been cut are:HockeySquashRugby sevensCricketBeach volleyballDivingBadmintonRoad cyclingMountain bikingTable tennisTriathlonWrestling",
        "Prior to Tuesday's announcement, only athletics and swimming were assured of their place at Glasgow 2026 as 'mandatory' Commonwealth Games sports.The sports dropped have met the decision with understandable disappointment.Diving has been part of every Games since 1930 but has missed out in Glasgow, with a lack of an existing purpose-built venue being cited as the primary reason.Scottish Swimming acknowledged the \"difficult decisions\" facing organisers but Diving Australia said the sport's Commonwealth heritage made the decision \"even more regrettable\".Hockey is another long-standing core sport - having been introduced in 1998 - to lose out.\"It is really disappointing and a reflection of where we are as a sport,\" said former Great Britain captain Kate Richardson-Walsh, who helped England win women's hockey silver at Glasgow 2014.\"It is a moment where we should reflect as a sport, for many different reasons, about how we can improve and stay relevant.\"Squash, badminton and table tennis were all culled, meaning there will be no racquet sports in Glasgow.Three-time squash gold medallist Nick Matthew was surprised his sport's \"heritage and tradition of providing a world class competition in the Commonwealths\" did not save its place.\"It's a blow. With the UK countries, Australia, New Zealand, Pakistan, India, Malaysia, etc, the depth of competition is incredibly high,\" said Matthew.\"Hockey missing out stood out to me as well. I think you would be hard pushed to see more world class sports at Commonwealth level than squash or hockey.\"Scottish badminton player Kirsty Gilmour, who won silver at Glasgow 2014, said she felt \"sad\" for young players who are missing out on a global event.\"We had to have conversations in training about realigning focuses and future prospects because for the 19, 20, 21-year-olds that was going to be a big multisport doorstep event,\" the 31-year-old Glaswegian told BBC Radio 5 Live.",
        "For many sports, the Commonwealth Games remains the biggest stage to showcase their talent, both to home and international audiences.More eyeballs on the sport can lead to more interest and, crucially, more investment for today's and tomorrow's stars.\"These are small windows of opportunities for minority sports to be seen and to get support which they’re now going to miss out,\" said Richardson-Walsh, who had a stint as assistant coach of the Canada women's hockey team last year.\"What does that mean for these sports and countries?\"India, who were fourth in the 2022 medal table, are one of the competing national teams who look set to be hit hardest by the slimmed-down programme.According to ESPN,, external there were 210 Indian athletes who competed in Birmingham - 98 participated in sports which have been axed.Indian competitors won 61 medals for their nation, including 30 in events not being held in Glasgow.\"It is a shocking and huge setback for Indian sports,\" said Sanjay Mishra, general secretary of the Badminton Association of India.\"It feels like a conspiracy to sideline India's rising sporting potential.\"Gilmour also pointed to the impact on athletes from smaller competing nations.\"The beauty of the Commonwealth Games is that smaller nations are there to feel what that big stage is like,\" Gilmour said. \"There is a real depth and breadth to the Games.\"",
        "Scaling down the Commonwealth Games means fewer sports, fewer athletes and fewer venues.The cost-cutting measures left many - including long-standing core sports which see the Commonwealth Games as the pinnacle - facing an anxious wait.Netball was one of them. Yet to be elevated to an Olympic sport, its biggest global platform is the Commonwealth Games and there was a sense of relief that it will feature in Glasgow.Scotland international Niamh McCall said she was nervous when \"glued\" to news of the decision because of the impact being included - or not - would have on her sport.\"The Commonwealth Games are massive for our sport because we don't compete at the Olympics. It is important and for young girls to see us play and get involved,\" McCall told BBC Scotland.England memorably won netball gold in 2018, watched by a BBC television audience of 1.8m and sparking a surge of interest., external\"I don't think anybody will ever forget 2018 and that last-second goal which inspired so many people to get behind our Roses and get involved in the sport,\" said England Netball chief executive Fran Connolly.Boxing and lawn bowls - both present in the inaugural edition of the event in 1930 - have also made the cut despite fears they might be dropped.Officials from World Bowls, Bowls Scotland and Bowls England said they were \"delighted\" that the sport's \"pinnacle event\" remained.\"It creates unparalleled levels of visibility, inspires new people to take up bowls and provides a North Star for our leading bowlers,\" added the world governing body.Para-sport will again be fully integrated at the Games, with six sports - down from eight - included on the programme.\"Integration of Para-sport has been a very successful aspect of the Commonwealth Games programme since Manchester 2002,\" said Paralympics Australia interim CEO Cameron Murray.\"We are pleased to see a high level of representation that ensures the Games remains a great example of inclusion and diversity in elite sport.\"",
        "As the disappointment of missing out sunk in for some sports, Games officials have been keen to stress the door has not been shut for good.\"This is a compact programme and it has been necessitated by the timeframe we have had to develop a world-class event,\" said CGF chief executive Sadleir.\"This is definitely not a precedent of which sports will be on the programme in the future.\"That is presuming, however, there are takers to host the 2030 event. The existential threat to the Games continues to loom large.\"Not much of the Commonwealth Games left is there,\" said television presenter Fred Sirieix, whose daughter Andrea Spendolini-Sirieix was a diving gold medallist at Birmingham 2022.\"Such a scaled-back competition makes you wonder about its future.\"Conal Heatley, the chief executive of Commonwealth Games Northern Ireland, said he feared the Games could \"slip away\" after Victoria pulled the plug.\"I think if we had looked at its future six or nine months ago, I'd have been nervous. I'm a lot more confident now,\" he said.Sadleir remains optimistic about 2030, saying \"three countries\" have expressed interest in hosting what would be a centenary Games.She said: \"I want to start having a conversation so the Games is strong and alive.\"",
        "England's netballers were among the stars of the 2018 Commonwealth Games, winning gold",
        "When legendary rocker Ozzy Osborne brought the curtain down on the 2022 Commonwealth Games, there was a sense of euphoria in Birmingham.",
        "The Games was widely considered a roaring success, providing a post-Covid buzz to the city, the country and the competing Commonwealth nations.",
        "However, it came at a price. Costing £800m, it was the most expensive sports event hosted in the UK since the 2012 Olympics.",
        "Reform of the Games - making it more cost-effective, sustainable and future-proof - was already an intense discussion point.",
        "Then, the Australian state of Victoria pulled out of hosting the 2026 event. State Premier Daniel Andrews concluded it was \"all cost and no benefit\" and plunged the future of the Commonwealth Games into serious doubt.",
        "To the rescue came Glasgow.",
        "The Scottish city hosted the Games in 2014 but it will have a very different, streamlined look when it returns there in two years' time, with only 10 sports to be played out over four venues at an estimated cost of about £140m.",
        "\"The Games had got out of hand - it was too big and trying to be a 'mini Olympics',\" Commonwealth Games Federation chief executive Katie Sadleir told BBC Sport.",
        "Earlier, Sadleir said: \"We want to create a sustainable model that can go around the Commonwealth because the Commonwealth members love the Commonwealth Games and we want to take it there as well.\"",
        "Sports announced for Glasgow 2026 Commonwealth Games",
        "Will Glasgow be last leg or clever rebirth for Commonwealths?",
        "What do athletes think about Glasgow 2026?",
        "The Commonwealth Games has always had a flexible programme, where the choice of sports is dictated by the host city.",
        "The list is drawn up after consideration to the \"universality of participation and quality of competition\", as well as local infrastructure and interest.",
        "At Glasgow 2026, there will be 10 sports:",
        "Athletics and Para-athletics (track and field only)",
        "Swimming and Para-swimming",
        "Track cycling and Para-track cycling",
        "Weightlifting and Para-powerlifting",
        "3x3 basketball and 3x3 wheelchair basketball",
        "Twelve sports that featured at Birmingham 2022 - plus the marathon, Para marathon and 10k walk, which are typically key components of the athletics and Para-athletics events - will not be staged in Glasgow.",
        "The sports that have been cut are:",
        "Prior to Tuesday's announcement, only athletics and swimming were assured of their place at Glasgow 2026 as 'mandatory' Commonwealth Games sports.",
        "The sports dropped have met the decision with understandable disappointment.",
        "Diving has been part of every Games since 1930 but has missed out in Glasgow, with a lack of an existing purpose-built venue being cited as the primary reason.",
        "Scottish Swimming acknowledged the \"difficult decisions\" facing organisers but Diving Australia said the sport's Commonwealth heritage made the decision \"even more regrettable\".",
        "Hockey is another long-standing core sport - having been introduced in 1998 - to lose out.",
        "\"It is really disappointing and a reflection of where we are as a sport,\" said former Great Britain captain Kate Richardson-Walsh, who helped England win women's hockey silver at Glasgow 2014.",
        "\"It is a moment where we should reflect as a sport, for many different reasons, about how we can improve and stay relevant.\"",
        "Squash, badminton and table tennis were all culled, meaning there will be no racquet sports in Glasgow.",
        "Three-time squash gold medallist Nick Matthew was surprised his sport's \"heritage and tradition of providing a world class competition in the Commonwealths\" did not save its place.",
        "\"It's a blow. With the UK countries, Australia, New Zealand, Pakistan, India, Malaysia, etc, the depth of competition is incredibly high,\" said Matthew.",
        "\"Hockey missing out stood out to me as well. I think you would be hard pushed to see more world class sports at Commonwealth level than squash or hockey.\"",
        "Scottish badminton player Kirsty Gilmour, who won silver at Glasgow 2014, said she felt \"sad\" for young players who are missing out on a global event.",
        "\"We had to have conversations in training about realigning focuses and future prospects because for the 19, 20, 21-year-olds that was going to be a big multisport doorstep event,\" the 31-year-old Glaswegian told BBC Radio 5 Live.",
        "For many sports, the Commonwealth Games remains the biggest stage to showcase their talent, both to home and international audiences.",
        "More eyeballs on the sport can lead to more interest and, crucially, more investment for today's and tomorrow's stars.",
        "\"These are small windows of opportunities for minority sports to be seen and to get support which they’re now going to miss out,\" said Richardson-Walsh, who had a stint as assistant coach of the Canada women's hockey team last year.",
        "\"What does that mean for these sports and countries?\"",
        "India, who were fourth in the 2022 medal table, are one of the competing national teams who look set to be hit hardest by the slimmed-down programme.",
        "According to ESPN,, external there were 210 Indian athletes who competed in Birmingham - 98 participated in sports which have been axed.",
        "Indian competitors won 61 medals for their nation, including 30 in events not being held in Glasgow.",
        "\"It is a shocking and huge setback for Indian sports,\" said Sanjay Mishra, general secretary of the Badminton Association of India.",
        "\"It feels like a conspiracy to sideline India's rising sporting potential.\"",
        "Gilmour also pointed to the impact on athletes from smaller competing nations.",
        "\"The beauty of the Commonwealth Games is that smaller nations are there to feel what that big stage is like,\" Gilmour said. \"There is a real depth and breadth to the Games.\"",
        "Scaling down the Commonwealth Games means fewer sports, fewer athletes and fewer venues.",
        "The cost-cutting measures left many - including long-standing core sports which see the Commonwealth Games as the pinnacle - facing an anxious wait.",
        "Netball was one of them. Yet to be elevated to an Olympic sport, its biggest global platform is the Commonwealth Games and there was a sense of relief that it will feature in Glasgow.",
        "Scotland international Niamh McCall said she was nervous when \"glued\" to news of the decision because of the impact being included - or not - would have on her sport.",
        "\"The Commonwealth Games are massive for our sport because we don't compete at the Olympics. It is important and for young girls to see us play and get involved,\" McCall told BBC Scotland.",
        "England memorably won netball gold in 2018, watched by a BBC television audience of 1.8m and sparking a surge of interest., external",
        "\"I don't think anybody will ever forget 2018 and that last-second goal which inspired so many people to get behind our Roses and get involved in the sport,\" said England Netball chief executive Fran Connolly.",
        "Boxing and lawn bowls - both present in the inaugural edition of the event in 1930 - have also made the cut despite fears they might be dropped.",
        "Officials from World Bowls, Bowls Scotland and Bowls England said they were \"delighted\" that the sport's \"pinnacle event\" remained.",
        "\"It creates unparalleled levels of visibility, inspires new people to take up bowls and provides a North Star for our leading bowlers,\" added the world governing body.",
        "Para-sport will again be fully integrated at the Games, with six sports - down from eight - included on the programme.",
        "\"Integration of Para-sport has been a very successful aspect of the Commonwealth Games programme since Manchester 2002,\" said Paralympics Australia interim CEO Cameron Murray.",
        "\"We are pleased to see a high level of representation that ensures the Games remains a great example of inclusion and diversity in elite sport.\"",
        "As the disappointment of missing out sunk in for some sports, Games officials have been keen to stress the door has not been shut for good.",
        "\"This is a compact programme and it has been necessitated by the timeframe we have had to develop a world-class event,\" said CGF chief executive Sadleir.",
        "\"This is definitely not a precedent of which sports will be on the programme in the future.\"",
        "That is presuming, however, there are takers to host the 2030 event. The existential threat to the Games continues to loom large.",
        "\"Not much of the Commonwealth Games left is there,\" said television presenter Fred Sirieix, whose daughter Andrea Spendolini-Sirieix was a diving gold medallist at Birmingham 2022.",
        "\"Such a scaled-back competition makes you wonder about its future.\"",
        "Conal Heatley, the chief executive of Commonwealth Games Northern Ireland, said he feared the Games could \"slip away\" after Victoria pulled the plug.",
        "\"I think if we had looked at its future six or nine months ago, I'd have been nervous. I'm a lot more confident now,\" he said.",
        "Sadleir remains optimistic about 2030, saying \"three countries\" have expressed interest in hosting what would be a centenary Games.",
        "She said: \"I want to start having a conversation so the Games is strong and alive.\"",
        "We have to keep Commonwealth Games going - Kenny",
        "Commonwealth Games: Why is it so special to be part of Team Scotland?",
        "Grey-Thompson 'delighted' by Glasgow 2026 Games deal"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/articles/cyvp2nq7176o",
      "main_category": "sport",
      "detailed_category": "badminton",
      "topic": "Bethell and Coombs win Para-badminton silvers",
      "content": [
        "British duo Dan Bethell and Krysten Coombs both claimed Paralympic badminton silver medals after losing out in their respective finals in Paris.Bethell had a gold-medal point against Kumar Nitesh of India in the men's SL3 singles decider, but went down 14-21 21-18 23-21 to finish runner-up for a second Games in a row.Coombes, a bronze medallist in Tokyo in 2021 when the sport made its debut, gave everything in the men's SH6 decider against French favourite Charles Noakes who was cheered on by a raucous late night home crowd at La Chapelle Arena.After a tight opening game, Noakes pulled away early in the second and despite a late Coombs flurry, sealed a 21-19 21-13 success.",
        "Bethell, the world number two, had not dropped a game on his way to his second consecutive final and beaten Nitesh in their nine previous encounters.\"I came here for gold and after winning silver in Tokyo I wanted to go one better, but I just couldn't get over the line,\" said the 28-year-old.\"At the moment it feels pretty devastating.\"After the pair shared the first two games, Bethell recovered from 19-16 down in the decider, saved a match point and had one of his own before Nitesh rallied again to break British hearts.",
        "Coombs, who has appeared as an extra in the TV show Game of Thrones, held the early initiative against Noakes, who led 6-5 in their head-to-head meetings coming into the Games.There was never more than three points in it in the opening game but the Frenchman finished strongly and then built up a 19-7 lead in the second game to put him on the brink of glory.Coombs rattled off the next five points to give himself a glimmer of hope, but it wasn't enough to stop Noakes, much to the delight of his supporters.\"It obviously wasn't the result I'd have wanted but to be out there with that crowd was incredible and amazing,\" said the Briton. \"Near the end I had to take it all in.\"I came out to play my best badminton and see what happened. The dream was to win that gold but it wasn't to be.\"There was a momentum swing at 17-17 in the first game, he got that little edge and that's badminton, that's what happens. \"I struggled a little bit to come back out in the second, but I gave it my all.\"",
        "Bethell is competing at his second Paralympics",
        "British duo Dan Bethell and Krysten Coombs both claimed Paralympic badminton silver medals after losing out in their respective finals in Paris.",
        "Bethell had a gold-medal point against Kumar Nitesh of India in the men's SL3 singles decider, but went down 14-21 21-18 23-21 to finish runner-up for a second Games in a row.",
        "Coombes, a bronze medallist in Tokyo in 2021 when the sport made its debut, gave everything in the men's SH6 decider against French favourite Charles Noakes who was cheered on by a raucous late night home crowd at La Chapelle Arena.",
        "After a tight opening game, Noakes pulled away early in the second and despite a late Coombs flurry, sealed a 21-19 21-13 success.",
        "Bethell, the world number two, had not dropped a game on his way to his second consecutive final and beaten Nitesh in their nine previous encounters.",
        "\"I came here for gold and after winning silver in Tokyo I wanted to go one better, but I just couldn't get over the line,\" said the 28-year-old.",
        "\"At the moment it feels pretty devastating.\"",
        "After the pair shared the first two games, Bethell recovered from 19-16 down in the decider, saved a match point and had one of his own before Nitesh rallied again to break British hearts.",
        "This video can not be played",
        "Para badminton player Dan Bethell was beaten 23-21 in deciding set of the final in Paris.",
        "Dan Bethell wins second Paralympic silver",
        "Coombs, who has appeared as an extra in the TV show Game of Thrones, held the early initiative against Noakes, who led 6-5 in their head-to-head meetings coming into the Games.",
        "There was never more than three points in it in the opening game but the Frenchman finished strongly and then built up a 19-7 lead in the second game to put him on the brink of glory.",
        "Coombs rattled off the next five points to give himself a glimmer of hope, but it wasn't enough to stop Noakes, much to the delight of his supporters.",
        "\"It obviously wasn't the result I'd have wanted but to be out there with that crowd was incredible and amazing,\" said the Briton. \"Near the end I had to take it all in.",
        "\"I came out to play my best badminton and see what happened. The dream was to win that gold but it wasn't to be.",
        "\"There was a momentum swing at 17-17 in the first game, he got that little edge and that's badminton, that's what happens.",
        "\"I struggled a little bit to come back out in the second, but I gave it my all.\"",
        "Paris 2024 Paralympics",
        "What's happening and when at the Paris Paralympics?",
        "All you need to know about the Paris Paralympics",
        "Sport-by-sport guide to Paris 2024 Paralympics",
        "Paralympics 2024: What you need to know about classification",
        "Paralympics 2024: Who has been selected for the GB team?"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/badminton/articles/cpvven25gqxo",
      "main_category": "sport",
      "detailed_category": "badminton",
      "topic": "Paralympics 2024: A guide to Para-badminton at the Paris Games",
      "content": [
        "Dates: 29 August-2 SeptemberVenue: Porte de la Chapelle ArenaGold medals on offer: 16",
        "Para-badminton competitors are divided into six classes (two wheelchair classes and four standing classes).WH1 and WH2 classes are for wheelchair users. WH1 athletes have a more severe impairment than WH2 athletes.SL3 and 4 competitors are standing athletes with lower limb impairments while SU5 competitors are standing athletes with upper limb impairments and SH6 competitors are short-stature athletes.The sport follows the rules of badminton, except for minor modifications. All events are best-of-three games and first to 21 points.Every time there is a serve, a point is scored. The side winning a rally serves in the next point. At 20-all, the side which gains a two-point lead first wins that game. If the game is 29-all, the side scoring the 30th point wins the game.Singles events in the two wheelchair classes and in the SL3 class use half the court, with shuttles falling between the net and a service line placed close to the net considered out of bounds.",
        "Since winning silver in the SL3 event on its Games debut in 2021, Dan Bethell has continued to win major championship medals and will be hungry to go one better than Tokyo.Rachel Choong will be the first British woman to compete in the sport at a Paralympics and as well as featuring in the SH6 singles, her and Jack Shephard will be strong contenders in the SH6 mixed doubles where they have built a strong partnership.And after bronze in Tokyo, Krysten Coombs will be aiming to win another medal in the SH6 men's singles.",
        "Like at the Olympics, Asian nations are the dominant force across the sport.China were the leading nation at the Tokyo Games where the sport made its debut and then went on to win 13 of the 22 gold medals on offer at the World Championships earlier this year, including in all six women's finals.The current two-time player of the year and world champion Daiki Kajiwara of Japan will be aiming to retain his WH2 singles crown while Leani Ratri Oktila of Indonesia, a winner of two golds and a silver in Tokyo, will be hoping to extend her record as her country's most successful Paralympian.",
        "The shuttlecock used in badminton is a piece of cork covered in goat skin with 16 goose feathers attached to one end. It can also be made of synthetic materials. It can reach speeds of up to 300km/h.",
        "Two - one silver (Dan Bethell) and one bronze (Krysten Coombs)",
        "China's Liu Yutong and Yin Menglu are among the leading players in the world",
        "Dates: 29 August-2 September",
        "Venue: Porte de la Chapelle Arena",
        "Gold medals on offer: 16",
        "Para-badminton competitors are divided into six classes (two wheelchair classes and four standing classes).",
        "WH1 and WH2 classes are for wheelchair users. WH1 athletes have a more severe impairment than WH2 athletes.",
        "SL3 and 4 competitors are standing athletes with lower limb impairments while SU5 competitors are standing athletes with upper limb impairments and SH6 competitors are short-stature athletes.",
        "The sport follows the rules of badminton, except for minor modifications. All events are best-of-three games and first to 21 points.",
        "Every time there is a serve, a point is scored. The side winning a rally serves in the next point. At 20-all, the side which gains a two-point lead first wins that game. If the game is 29-all, the side scoring the 30th point wins the game.",
        "Singles events in the two wheelchair classes and in the SL3 class use half the court, with shuttles falling between the net and a service line placed close to the net considered out of bounds.",
        "Since winning silver in the SL3 event on its Games debut in 2021, Dan Bethell has continued to win major championship medals and will be hungry to go one better than Tokyo.",
        "Rachel Choong will be the first British woman to compete in the sport at a Paralympics and as well as featuring in the SH6 singles, her and Jack Shephard will be strong contenders in the SH6 mixed doubles where they have built a strong partnership.",
        "And after bronze in Tokyo, Krysten Coombs will be aiming to win another medal in the SH6 men's singles.",
        "Like at the Olympics, Asian nations are the dominant force across the sport.",
        "China were the leading nation at the Tokyo Games where the sport made its debut and then went on to win 13 of the 22 gold medals on offer at the World Championships earlier this year, including in all six women's finals.",
        "The current two-time player of the year and world champion Daiki Kajiwara of Japan will be aiming to retain his WH2 singles crown while Leani Ratri Oktila of Indonesia, a winner of two golds and a silver in Tokyo, will be hoping to extend her record as her country's most successful Paralympian.",
        "The shuttlecock used in badminton is a piece of cork covered in goat skin with 16 goose feathers attached to one end. It can also be made of synthetic materials. It can reach speeds of up to 300km/h.",
        "Two - one silver (Dan Bethell) and one bronze (Krysten Coombs)"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/badminton/articles/cy4y88dgxnjo",
      "main_category": "sport",
      "detailed_category": "badminton",
      "topic": "Coombs targets Paralympic gold medal in Paris",
      "content": [
        "Badminton player Krysten Coombs says he is aiming to take gold at the 2024 Paralympics for Great Britain.The 33-year-old from Totnes in Devon won bronze in Tokyo three years ago on the sport's debut.Now Coombs - who competes in the SH6 category for athletes with dwarfism - hopes he can do even better.\"Obviously, the dream is win a gold,\" he told BBC Radio Devon.\"But if I could upgrade that medal it would be amazing or even stay the same again.\"To experience the whole thing and being there is a dream.\"I've got the results. I've got the backing and I'm feeling confident and niggle free and ready to go now.\"",
        "Coombs left Devon for Sheffield in 2018 when he became fully funded by UK Sport after badminton was included in the Paralympics. He says being a full-time athlete for the past six years has helped develop his talent to the point where he has won silver and bronze medals at the World Championships in singles having previously won European and World doubles titles.And he feels his chances are good, despite fierce competition from other nations. \"China is always a big one, India is a big one, France have got a guy this year and us GB guys we're actually up there,\" Coombs said.\"We have been dominating the circuit - we've always been coming away from internationals with medals.\"Having watched the Olympic Games in Paris Coombs has been able to get an idea of the venue he will be playing at. He can also count on lots of support from friends and family with the event being held so close to the UK - unlike Tokyo where there were no spectators due to the Covid-19 pandemic.\"Badminton's got quite a big following in France anyway, so hopefully that's going to increase that and ticket sales are good,\" Coombs said.\"I've got loads of friends and family coming over which is going to be amazing, [after] going to Tokyo and not having that experience with your loved ones and the people that supported you for so many years.\"I can't wait for them to be able to see it and even people back home - being on the same time zone pretty much is going to be a lot better than Tokyo.\"",
        "Krysten Coombs won badminton bronze in the SH6 category at the last Paralympics in Tokyo in 2021",
        "Badminton player Krysten Coombs says he is aiming to take gold at the 2024 Paralympics for Great Britain.",
        "The 33-year-old from Totnes in Devon won bronze in Tokyo three years ago on the sport's debut.",
        "Now Coombs - who competes in the SH6 category for athletes with dwarfism - hopes he can do even better.",
        "\"Obviously, the dream is win a gold,\" he told BBC Radio Devon.",
        "\"But if I could upgrade that medal it would be amazing or even stay the same again.",
        "\"To experience the whole thing and being there is a dream.",
        "\"I've got the results. I've got the backing and I'm feeling confident and niggle free and ready to go now.\"",
        "Paralympics 2024: Who has been selected for the GB team?",
        "All you need to know about the Paris Paralympics",
        "More than one million Paralympic tickets still unsold",
        "Coombs left Devon for Sheffield in 2018 when he became fully funded by UK Sport after badminton was included in the Paralympics.",
        "He says being a full-time athlete for the past six years has helped develop his talent to the point where he has won silver and bronze medals at the World Championships in singles having previously won European and World doubles titles.",
        "And he feels his chances are good, despite fierce competition from other nations.",
        "\"China is always a big one, India is a big one, France have got a guy this year and us GB guys we're actually up there,\" Coombs said.",
        "\"We have been dominating the circuit - we've always been coming away from internationals with medals.\"",
        "Having watched the Olympic Games in Paris Coombs has been able to get an idea of the venue he will be playing at.",
        "He can also count on lots of support from friends and family with the event being held so close to the UK - unlike Tokyo where there were no spectators due to the Covid-19 pandemic.",
        "\"Badminton's got quite a big following in France anyway, so hopefully that's going to increase that and ticket sales are good,\" Coombs said.",
        "\"I've got loads of friends and family coming over which is going to be amazing, [after] going to Tokyo and not having that experience with your loved ones and the people that supported you for so many years.",
        "\"I can't wait for them to be able to see it and even people back home - being on the same time zone pretty much is going to be a lot better than Tokyo.\"",
        "Krysten Coombs has been a full-time para badminton player since 2018"
      ]
    }
  ]
}