{
  "scraped_at": "2025-10-27T18:56:59.794546",
  "total_articles": 22,
  "category": "hockey",
  "articles_per_category": 100,
  "articles": [
    {
      "url": "https://www.bbc.com/sport/hockey/articles/c62n9kzg5zgo",
      "main_category": "sport",
      "detailed_category": "hockey",
      "topic": "Ireland begin maiden Pro League campaign in Dublin",
      "content": [
        "Ireland Women will begin their maiden FIH Pro League campaign in Dublin in December.Gareth Grundie's side will take on Belgium and England at the Sport Ireland campus in Blanchardstown in December in the first two of their eight fixtures in the competition.They will then travel to Australia where they will face the hosts, and Argentina in February.After that they go to the Netherlands to face the world champions and Spain in June.Ireland will conclude their campaign against host nation Germany and China later that same month.They earned promotion to the top tier despite a penalty shootout defeat in the second-tier Nations Cup to New Zealand in March.This was due to the fact the victors declined the invitation to join the Pro League.The Irish men's side were relegated to the Nations Cup last season and will begin their campaign back in the second tier in Dublin too.",
        "Ireland Women will take part in the Pro League for the first time this year",
        "Ireland Women will begin their maiden FIH Pro League campaign in Dublin in December.",
        "Gareth Grundie's side will take on Belgium and England at the Sport Ireland campus in Blanchardstown in December in the first two of their eight fixtures in the competition.",
        "They will then travel to Australia where they will face the hosts, and Argentina in February.",
        "After that they go to the Netherlands to face the world champions and Spain in June.",
        "Ireland will conclude their campaign against host nation Germany and China later that same month.",
        "They earned promotion to the top tier despite a penalty shootout defeat in the second-tier Nations Cup to New Zealand in March.",
        "This was due to the fact the victors declined the invitation to join the Pro League.",
        "The Irish men's side were relegated to the Nations Cup last season and will begin their campaign back in the second tier in Dublin too."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/hockey/articles/cj6yn1z7r3ro",
      "main_category": "sport",
      "detailed_category": "hockey",
      "topic": "England men & women fail to reach Eurohockey semis",
      "content": [
        "England men's and women's hockey teams both failed to reach the semi-finals of the 2025 EuroHockey Championships after disappointing defeats in Germany. The women's side were beaten 2-1 by Spain in Pool B, while the men's team suffered a shock 3-2 loss to France in Pool C. It was Spain's first victory over England in normal time of the women's Euros for 30 years, and secured qualification for the Hockey World Cup in 2026. France have reached their first men's Euros semi-final since 1970 thanks to a last-gasp winner against England. England men face Belgium in their final group match on Thursday, with the women's team playing France on Friday, both at 14:00 BST.",
        "Spain opened the scoring against England through Luciana Molino in the first quarter, before Tessa Howard equalised with a field goal two minutes later. Lucia Jimenez scored the decisive goal for Spain in the second half, sending them through to the semi-finals at the expense of England, who had beaten Scotland 3-0 in their opening game. England's men, meanwhile, who defeated Poland 5-0 in their opening game, followed by a 1-1 draw with Germany, took the lead on 10 minutes against France through Stuart Rushmore, before an Amaury Bellenger equaliser in the third quarter. Matteo Desgouillons' strike to put France ahead was cancelled about by Rushmore's second late on, but with the final buzzer approaching, England were left stunned when Timothee Clement scored to send France through to the semis.",
        "England women are eighth in the International Hockey Federation rankings, while the men's side are seventh",
        "England men's and women's hockey teams both failed to reach the semi-finals of the 2025 EuroHockey Championships after disappointing defeats in Germany.",
        "The women's side were beaten 2-1 by Spain in Pool B, while the men's team suffered a shock 3-2 loss to France in Pool C.",
        "It was Spain's first victory over England in normal time of the women's Euros for 30 years, and secured qualification for the Hockey World Cup in 2026.",
        "France have reached their first men's Euros semi-final since 1970 thanks to a last-gasp winner against England.",
        "England men face Belgium in their final group match on Thursday, with the women's team playing France on Friday, both at 14:00 BST.",
        "Spain opened the scoring against England through Luciana Molino in the first quarter, before Tessa Howard equalised with a field goal two minutes later.",
        "Lucia Jimenez scored the decisive goal for Spain in the second half, sending them through to the semi-finals at the expense of England, who had beaten Scotland 3-0 in their opening game.",
        "England's men, meanwhile, who defeated Poland 5-0 in their opening game, followed by a 1-1 draw with Germany, took the lead on 10 minutes against France through Stuart Rushmore, before an Amaury Bellenger equaliser in the third quarter.",
        "Matteo Desgouillons' strike to put France ahead was cancelled about by Rushmore's second late on, but with the final buzzer approaching, England were left stunned when Timothee Clement scored to send France through to the semis."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/hockey/articles/c3v3n5ry0wqo",
      "main_category": "sport",
      "detailed_category": "hockey",
      "topic": "Ireland 'have to put right' scoring woes - Mullan",
      "content": [
        "Goals win matches and the stark reality for Ireland at the EuroHockey championships is that they drew a blank in their three pool games.They received plaudits for a battling performance against the Netherlands, losing only 0-2 against the world number one side who went on to put five past Germany and six against France.While under different circumstances a scoreless draw against Germany would have been a phenomenal result. Had they beaten the lower ranked French in their second game, Ireland would now be preparing for a semi-final against Belgium.However they let France off the hook in a shock 1-0 defeat.Yes, they hit three posts but their failure in front of goal allowed the French to remain in the game and take one opportunity that confined Ireland to a defeat they should never have suffered, one that meant they needed a two-goal victory over Germany to progress.It does speak to their resilience that they outplayed the Germans and created more chances, but again they failed to take any.Again, plaudits for the effort and for the performance, but almost always in sport it's the result that counts and Ireland finished bottom of the pool with only a point to show for their efforts.They just conceded three goals across three games, but scored none and they'll compete with England and Scotland for 5th-8th place instead of chasing medals.",
        "\"I mean, it's definitely the closest we've got to beating Germany in competition over the last number of times that we've played them,\" said Ireland’s Katie Mullan.\"Really, really proud of the fight we put up. To come back from a really disappointing performance against France and go out there and fight as hard as we did. We had some really, really good chances.\"You know, the reality is that the France game, really, we needed to win that one.\"That would have made life a lot easier but that being said, we had our opportunities and we fought really hard against a good German side.\"There are usually small margins at this level between success and failure.In the opening quarter against France, Mullan was one of three Irish players to hit a post. Had one or more of those crept a few inches to the right or left then perhaps Ireland go on to win.Against Germany there was a penalty stroke saved early in the game that was a pivotal moment.\"We just had to wipe that slate clean from the French game and go out there and chase two goals, and that's what we did,\" added Mullan.\"I mean, yeah, there's a stroke, but there's also a number of penalty corners again.\"We didn't get the rebounds on off the keeper and there's a number of ways we could have scored those two goals today.\"We just have to go back to the drawing board on looking to get that ball in the back of the net because to have scored no goals this far into the tournament, you know, it's something we have to put right.\"",
        "Ireland also mis-fired on 22 short corners in the three games, a horrible statistic and one that means you simply won’t win games at this level.\"We put a huge emphasis on penalty corner attack. We put the time in, we put the effort in, we put the analysis in. It's all there.\"Sometimes you need a couple to click, and then you just build confidence after confidence and they all start going in.\"It's not an ability thing, for sure. We have the ability. It's not a technical thing, we have the technical side and we have the corner calls there.\"So yeah, we just need to find the back of the net on a couple and I believe then they'll start, they'll start on a roll.\"The tournament isn’t over for Ireland and their remaining games in the 5th-8th bracket are an opportunity to put those scoring issues to bed, especially as they look forward to making their debut in the FIH Pro League later this year.There, Ireland will take on the best in the world and goals will surely be at a premium.\"We've got to step up to that level,\" added Mullan. \"We have to split the tournament in two - part one's done, start part two now and if we have two solid performances and two good results, we'll get on the plane happy.\"It’s a test of character for this group.\"",
        "Ireland's EuroHockey hopes were ended by their goalless draw with Germany",
        "Goals win matches and the stark reality for Ireland at the EuroHockey championships is that they drew a blank in their three pool games.",
        "They received plaudits for a battling performance against the Netherlands, losing only 0-2 against the world number one side who went on to put five past Germany and six against France.",
        "While under different circumstances a scoreless draw against Germany would have been a phenomenal result. Had they beaten the lower ranked French in their second game, Ireland would now be preparing for a semi-final against Belgium.",
        "However they let France off the hook in a shock 1-0 defeat.",
        "Yes, they hit three posts but their failure in front of goal allowed the French to remain in the game and take one opportunity that confined Ireland to a defeat they should never have suffered, one that meant they needed a two-goal victory over Germany to progress.",
        "It does speak to their resilience that they outplayed the Germans and created more chances, but again they failed to take any.",
        "Again, plaudits for the effort and for the performance, but almost always in sport it's the result that counts and Ireland finished bottom of the pool with only a point to show for their efforts.",
        "They just conceded three goals across three games, but scored none and they'll compete with England and Scotland for 5th-8th place instead of chasing medals.",
        "\"I mean, it's definitely the closest we've got to beating Germany in competition over the last number of times that we've played them,\" said Ireland’s Katie Mullan.",
        "\"Really, really proud of the fight we put up. To come back from a really disappointing performance against France and go out there and fight as hard as we did. We had some really, really good chances.",
        "\"You know, the reality is that the France game, really, we needed to win that one.",
        "\"That would have made life a lot easier but that being said, we had our opportunities and we fought really hard against a good German side.\"",
        "There are usually small margins at this level between success and failure.",
        "In the opening quarter against France, Mullan was one of three Irish players to hit a post. Had one or more of those crept a few inches to the right or left then perhaps Ireland go on to win.",
        "Against Germany there was a penalty stroke saved early in the game that was a pivotal moment.",
        "\"We just had to wipe that slate clean from the French game and go out there and chase two goals, and that's what we did,\" added Mullan.",
        "\"I mean, yeah, there's a stroke, but there's also a number of penalty corners again.",
        "\"We didn't get the rebounds on off the keeper and there's a number of ways we could have scored those two goals today.",
        "\"We just have to go back to the drawing board on looking to get that ball in the back of the net because to have scored no goals this far into the tournament, you know, it's something we have to put right.\"",
        "Katie Mullan and Katie Larmour console each other after the Germany game",
        "Ireland also mis-fired on 22 short corners in the three games, a horrible statistic and one that means you simply won’t win games at this level.",
        "\"We put a huge emphasis on penalty corner attack. We put the time in, we put the effort in, we put the analysis in. It's all there.",
        "\"Sometimes you need a couple to click, and then you just build confidence after confidence and they all start going in.",
        "\"It's not an ability thing, for sure. We have the ability. It's not a technical thing, we have the technical side and we have the corner calls there.",
        "\"So yeah, we just need to find the back of the net on a couple and I believe then they'll start, they'll start on a roll.\"",
        "The tournament isn’t over for Ireland and their remaining games in the 5th-8th bracket are an opportunity to put those scoring issues to bed, especially as they look forward to making their debut in the FIH Pro League later this year.",
        "There, Ireland will take on the best in the world and goals will surely be at a premium.",
        "\"We've got to step up to that level,\" added Mullan.",
        "\"We have to split the tournament in two - part one's done, start part two now and if we have two solid performances and two good results, we'll get on the plane happy.",
        "\"It’s a test of character for this group.\""
      ]
    },
    {
      "url": "https://www.bbc.com/sport/hockey/articles/c9vd7w2w8gzo",
      "main_category": "sport",
      "detailed_category": "hockey",
      "topic": "Ireland fail to make Euro semis with Germany draw",
      "content": [
        "Ireland produced their best performance of EuroHockey 2025, but a 0-0 draw against Germany was not nearly enough to claim a semi-final place.Gareth Grundie’s squad were markedly better than in defeat by France on Monday, but that is where the damage was done and needing to beat Germany by two goals to make the knockout stages was always going to be a tough task.They had an early opportunity to take the lead but Hannah McLoughlin saw her penalty stroke saved and although they created other chances in an evenly fought contest, they never looked like gaining the two-goal deficit they required.\"Certainly pleased with tonight's performance,\" said Irish coach Grundie.\"I think we went toe-to-toe with Germany in front of their home crowd but for us really the damage was done on Monday.\"We didn't take our opportunity against France.\"If we'd gone into today's game with equal points and maybe even a superior goal difference, then I think we certainly would have put them under a bit of pressure.\"",
        "Germany started the game brightly but Irish goalkeeper Lizzie Murphy and her penalty corner defence kept them at bay.As the opening quarter wore on, Ireland gradually began to control possession and they were gifted an opportunity to take the lead when Emily Kealy was fouled in the process of shooting.However, Hannah McLoughlin saw her penalty stroke effort comfortably saved by Julia Sonntag.It was a pivotal moment so early in the game.Ireland were playing much better than at any stage against France but once again struggled in the attacking third to create clear cut chances as the game remained scoreless at the interval.Sarah McAuley’s intervention set up Katie Mullan for a shot early in the second half as Ireland continued to push forward but the former captain’s effort went wide.As they pushed harder, so their discipline slipped and Ireland ended the third quarter down to nine players with Roisin Upton and Niamh Carey serving two-minute suspensions.",
        "Mikayla Power’s strong shot was well saved as Ireland threw the kitchen sink at Germany in the final 15 minutes.However, their penalty corner routine would fail to fire again. In the three Pool matches they didn’t score from 22 short corners and you simply have to be better at this level.They also failed to score from open play despite only conceding three goals.\"That's what we keep preaching every day in training,\" Grundie said of their inability to convert.\"It is about small margins at this level. We have to be able to execute so it’s obviously disappointing.\"If one of the early ones goes in against France then it can be a different story.\"One of the early ones goes in tonight, then they're certainly under pressure and we can have a real go.\"It wasn’t to be, but we'll build from this performance because it was certainly positive.\"Ireland will now face Scotland and England in the competition for 5-8 places.",
        "Ireland’s Katie Mullan battles for possession against Germany",
        "Ireland produced their best performance of EuroHockey 2025, but a 0-0 draw against Germany was not nearly enough to claim a semi-final place.",
        "Gareth Grundie’s squad were markedly better than in defeat by France on Monday, but that is where the damage was done and needing to beat Germany by two goals to make the knockout stages was always going to be a tough task.",
        "They had an early opportunity to take the lead but Hannah McLoughlin saw her penalty stroke saved and although they created other chances in an evenly fought contest, they never looked like gaining the two-goal deficit they required.",
        "\"Certainly pleased with tonight's performance,\" said Irish coach Grundie.",
        "\"I think we went toe-to-toe with Germany in front of their home crowd but for us really the damage was done on Monday.",
        "\"We didn't take our opportunity against France.",
        "\"If we'd gone into today's game with equal points and maybe even a superior goal difference, then I think we certainly would have put them under a bit of pressure.\"",
        "Germany started the game brightly but Irish goalkeeper Lizzie Murphy and her penalty corner defence kept them at bay.",
        "As the opening quarter wore on, Ireland gradually began to control possession and they were gifted an opportunity to take the lead when Emily Kealy was fouled in the process of shooting.",
        "However, Hannah McLoughlin saw her penalty stroke effort comfortably saved by Julia Sonntag.",
        "It was a pivotal moment so early in the game.",
        "Ireland were playing much better than at any stage against France but once again struggled in the attacking third to create clear cut chances as the game remained scoreless at the interval.",
        "Sarah McAuley’s intervention set up Katie Mullan for a shot early in the second half as Ireland continued to push forward but the former captain’s effort went wide.",
        "As they pushed harder, so their discipline slipped and Ireland ended the third quarter down to nine players with Roisin Upton and Niamh Carey serving two-minute suspensions.",
        "Niamh Carey has an effort on goal",
        "Mikayla Power’s strong shot was well saved as Ireland threw the kitchen sink at Germany in the final 15 minutes.",
        "However, their penalty corner routine would fail to fire again. In the three Pool matches they didn’t score from 22 short corners and you simply have to be better at this level.",
        "They also failed to score from open play despite only conceding three goals.",
        "\"That's what we keep preaching every day in training,\" Grundie said of their inability to convert.",
        "\"It is about small margins at this level. We have to be able to execute so it’s obviously disappointing.",
        "\"If one of the early ones goes in against France then it can be a different story.",
        "\"One of the early ones goes in tonight, then they're certainly under pressure and we can have a real go.",
        "\"It wasn’t to be, but we'll build from this performance because it was certainly positive.\"",
        "Ireland will now face Scotland and England in the competition for 5-8 places."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/hockey/articles/c9qyyddlx8xo",
      "main_category": "sport",
      "detailed_category": "hockey",
      "topic": "Ireland’s EuroHockey hopes dashed by loss to France",
      "content": [
        "Ireland’s hopes of reaching the EuroHockey semi-finals for the first time are in tatters after a shocking 1-0 defeat by France in Monchengladbach.The only goal of the game came early in the fourth quarter from a penalty corner as Mathilde Duffrene’s shot beat Ireland goalkeeper Lizzie Murphy.Ireland had plenty of possession and opportunities, as well as hitting a couple of posts, but lost the initiative as the game wore on.Ireland will now need a two-goal win over hosts Germany on Wednesday night to make the last four, assuming France get nothing from their final game with the Netherlands.This comes after the Dutch beat Germany 5-1.",
        "Ireland dominated the first quarter but could not find the opening score. Katie Mullan had an early opportunity but hit the post and then could not control the rebound as it flew over the bar. There then came a flurry of penalty corners in a row, five in all for Ireland. Christina Hamill saw her effort hit the post and Niamh Carey's deflection went wide.France sounded a warning to Ireland early in the second quarter when they had a goal disallowed from a short corner as the ball was lifted into the net above the height of the backboard.Both sides then struggled in the heat to create any meaningful circle penetrations before half-time.Ireland started the second half with attacking intent and Hannah McLoughlin saw two strikes at goal saved by Lucie Ehrmann.However, the French were growing in confidence and Lizzie Murphy had to make a point blank save from Gabrielle Verrier to keep the game scoreless.The longer the game wore on the more panic there was in Ireland’s play. They would pay the price when Duffrene’s effort from a penalty corner found its way into the back of the Irish net with ten minutes remaining.",
        "\"We had enough chances to win the game early on, and we tried to stay steady throughout the four quarters,\" said Irish captain Sarah Hawkshaw.\"Even in the last quarter we had multiple chances that we could have put it away, but they sat so defensively and then once they got the goal on it made it more difficult.\"We knew penalty corner attack would be important and we had enough of them to slot it away as well, so yeah, very disappointed in that end, but we'll have to put it to bed. The moment's over and we'll look at the next one.\"Ireland had thirteen penalty corners in the game and couldn’t convert and at this level that simply isn’t good enough.Now they must pick themselves up for a final pool game against Germany on Wednesday night, no matter where they find themselves in the tournament.\"We know how up and down it can be, but we try to maintain quite a steady mood in camp and that's really important,\" added Hawkshaw.\"We'll obviously take our learnings from this game, but we have a good sense of where we are, a sense in international hockey, and we need to remember that and not let moments like this bring us down.\"So yeah, as I said, the moment's over, we need to quickly be disappointed, look at what we need to fix and go into Germany.\"",
        "Ireland are reliant on the Netherlands beating Germany on Monday night to keep their hopes of progression alive",
        "Ireland’s hopes of reaching the EuroHockey semi-finals for the first time are in tatters after a shocking 1-0 defeat by France in Monchengladbach.",
        "The only goal of the game came early in the fourth quarter from a penalty corner as Mathilde Duffrene’s shot beat Ireland goalkeeper Lizzie Murphy.",
        "Ireland had plenty of possession and opportunities, as well as hitting a couple of posts, but lost the initiative as the game wore on.",
        "Ireland will now need a two-goal win over hosts Germany on Wednesday night to make the last four, assuming France get nothing from their final game with the Netherlands.",
        "This comes after the Dutch beat Germany 5-1.",
        "Ireland beaten by Dutch in EuroHockey opener",
        "Ireland dominated the first quarter but could not find the opening score.",
        "Katie Mullan had an early opportunity but hit the post and then could not control the rebound as it flew over the bar. There then came a flurry of penalty corners in a row, five in all for Ireland.",
        "Christina Hamill saw her effort hit the post and Niamh Carey's deflection went wide.",
        "France sounded a warning to Ireland early in the second quarter when they had a goal disallowed from a short corner as the ball was lifted into the net above the height of the backboard.",
        "Both sides then struggled in the heat to create any meaningful circle penetrations before half-time.",
        "Ireland started the second half with attacking intent and Hannah McLoughlin saw two strikes at goal saved by Lucie Ehrmann.",
        "However, the French were growing in confidence and Lizzie Murphy had to make a point blank save from Gabrielle Verrier to keep the game scoreless.",
        "The longer the game wore on the more panic there was in Ireland’s play.",
        "They would pay the price when Duffrene’s effort from a penalty corner found its way into the back of the Irish net with ten minutes remaining.",
        "Ireland had thirteen penalty corners in the game but could not convert",
        "\"We had enough chances to win the game early on, and we tried to stay steady throughout the four quarters,\" said Irish captain Sarah Hawkshaw.",
        "\"Even in the last quarter we had multiple chances that we could have put it away, but they sat so defensively and then once they got the goal on it made it more difficult.",
        "\"We knew penalty corner attack would be important and we had enough of them to slot it away as well, so yeah, very disappointed in that end, but we'll have to put it to bed. The moment's over and we'll look at the next one.\"",
        "Ireland had thirteen penalty corners in the game and couldn’t convert and at this level that simply isn’t good enough.",
        "Now they must pick themselves up for a final pool game against Germany on Wednesday night, no matter where they find themselves in the tournament.",
        "\"We know how up and down it can be, but we try to maintain quite a steady mood in camp and that's really important,\" added Hawkshaw.",
        "\"We'll obviously take our learnings from this game, but we have a good sense of where we are, a sense in international hockey, and we need to remember that and not let moments like this bring us down.",
        "\"So yeah, as I said, the moment's over, we need to quickly be disappointed, look at what we need to fix and go into Germany.\""
      ]
    },
    {
      "url": "https://www.bbc.com/sport/hockey/articles/cn8445jmr94o",
      "main_category": "sport",
      "detailed_category": "hockey",
      "topic": "England beat Scotland in EuroHockey opener",
      "content": [
        "England's women opened their 2025 EuroHockey Championships campaign with a 3-0 win over Scotland on Sunday.Fiona Crackles gave England the lead in the 12th minute with a fine control and finish, before Lily Walker doubled the advantage early in the second quarter after meeting Tess Howard's backhand cross.Scotland rallied and controlled the third quarter but could not take advantage of their opportunities.Sabbie Heesh in the England goal smothered the first, before Anna Toman cleared a Sarah Jamieson effort off the goalline.2015 winners England regained their composure and scored a third when Toman's corner sweep was deflected in by Lily Owsley.England will play 2023 runners-up Belgium in their next match on Monday at 17:00 BST in Monchengladbach, Germany.Meanwhile, James Gall scored as England's men drew 1-1 with Germany in their second match of the tournament, following a 5-0 thrashing of Poland on Friday.",
        "England's next game is against Belgium on Monday",
        "England's women opened their 2025 EuroHockey Championships campaign with a 3-0 win over Scotland on Sunday.",
        "Fiona Crackles gave England the lead in the 12th minute with a fine control and finish, before Lily Walker doubled the advantage early in the second quarter after meeting Tess Howard's backhand cross.",
        "Scotland rallied and controlled the third quarter but could not take advantage of their opportunities.",
        "Sabbie Heesh in the England goal smothered the first, before Anna Toman cleared a Sarah Jamieson effort off the goalline.",
        "2015 winners England regained their composure and scored a third when Toman's corner sweep was deflected in by Lily Owsley.",
        "England will play 2023 runners-up Belgium in their next match on Monday at 17:00 BST in Monchengladbach, Germany.",
        "Meanwhile, James Gall scored as England's men drew 1-1 with Germany in their second match of the tournament, following a 5-0 thrashing of Poland on Friday."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/olympics/articles/c3wn49w06v2o",
      "main_category": "sport",
      "detailed_category": "hockey",
      "topic": "Ireland beaten by Dutch in EuroHockey opener",
      "content": [
        "Ireland lost their opening game of the EuroHockey Championships 2-0 to reigning Olympic, world and European champions the Netherlands in Monchengladbach.Goals from Joosje Burg and Yibbi Jansen were enough for the Dutch as temperatures in north-western Germany edged towards 30C on a brutally hot day.Ireland coach Gareth Grundie will take plenty of positives from a strong defensive performance that bodes well for the rest of the tournament.\"I think that's probably the closest we've come to them in competition in a long time,\" Grundie told BBC Sport NI after the defeat.\"[I'm] obviously not [happy] the result but happy with the performance, happy in terms of goal difference going into the rest of the group so it actually sets us up quite nicely depending on a couple of other results.\"",
        "The only goal in the first half came with a little luck after nine minutes against the run of play when Ireland were settling in the game.Ireland goalkeeper Lizzie Murphy made an outstanding save, only to see the ball ricochet off the chest of Sarah McAuley and into the path of Burg who had a simple tap-in.Roisin Upton and Hannah McLoughlin brilliantly marshalled the Ireland defence as they frustrated the Dutch in the second quarter as the heat began to take its toll on both sides.A harsh penalty corner call on Upton was punished by the Netherlands in the third quarter when Jansen‘s shot beat Murphy.Ireland were not deterred, however, and came close through Katie Mullan after great work from Mikayla Power.Mullan was denied by Dutch keeper Josine Kosing, who was on hand again to save from McLoughlin‘s shot at a penalty corner as Ireland pushed forward and refused to sit back.\"The idea was always to make sure that we were really disciplined,\" Grundie added.\"They're an outstanding side, so the longer that we could stay in the game we knew we might get an opportunity, and if one had gone in then we might have been able to push towards the end.\"I think we actually have to keep that same discipline, take that same approach against France [on Monday], but we have to have a little bit more confidence in ourselves on the ball and go and play our own game a little bit more.\"",
        "Katie Mullan battles for possession against the Netherlands",
        "Ireland lost their opening game of the EuroHockey Championships 2-0 to reigning Olympic, world and European champions the Netherlands in Monchengladbach.",
        "Goals from Joosje Burg and Yibbi Jansen were enough for the Dutch as temperatures in north-western Germany edged towards 30C on a brutally hot day.",
        "Ireland coach Gareth Grundie will take plenty of positives from a strong defensive performance that bodes well for the rest of the tournament.",
        "\"I think that's probably the closest we've come to them in competition in a long time,\" Grundie told BBC Sport NI after the defeat.",
        "\"[I'm] obviously not [happy] the result but happy with the performance, happy in terms of goal difference going into the rest of the group so it actually sets us up quite nicely depending on a couple of other results.\"",
        "The only goal in the first half came with a little luck after nine minutes against the run of play when Ireland were settling in the game.",
        "Ireland goalkeeper Lizzie Murphy made an outstanding save, only to see the ball ricochet off the chest of Sarah McAuley and into the path of Burg who had a simple tap-in.",
        "Roisin Upton and Hannah McLoughlin brilliantly marshalled the Ireland defence as they frustrated the Dutch in the second quarter as the heat began to take its toll on both sides.",
        "A harsh penalty corner call on Upton was punished by the Netherlands in the third quarter when Jansen‘s shot beat Murphy.",
        "Ireland were not deterred, however, and came close through Katie Mullan after great work from Mikayla Power.",
        "Mullan was denied by Dutch keeper Josine Kosing, who was on hand again to save from McLoughlin‘s shot at a penalty corner as Ireland pushed forward and refused to sit back.",
        "\"The idea was always to make sure that we were really disciplined,\" Grundie added.",
        "\"They're an outstanding side, so the longer that we could stay in the game we knew we might get an opportunity, and if one had gone in then we might have been able to push towards the end.",
        "\"I think we actually have to keep that same discipline, take that same approach against France [on Monday], but we have to have a little bit more confidence in ourselves on the ball and go and play our own game a little bit more.\"",
        "Ireland coach Grundie targeting Euro semi-finals"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/hockey/articles/cly62zpe85go",
      "main_category": "sport",
      "detailed_category": "hockey",
      "topic": "England beat Poland at EuroHockey Championships",
      "content": [
        "England's men claimed a comfortable 5-0 win over Poland as they get their Pool B campaign under way at the EuroHockey Championships in Monchengladbach.David Goodfield put England ahead in the first half but the 2023 finalists were made to wait to extend their lead by a resolute Polish side that came through the qualifiers in Dublin last summer. Jacob Payton swept in the second in the third quarter and Phil Roper, Sam Ward's deflected penalty corner shot and a Tom Sorsby effort in the last minute, rounding off the scoring. \"We really stuck at our gameplan. I was really proud of the boys to keep digging in knowing we were doing the right thing and we perservered and scored a few more goals,\" said midfielder Sorsby.\"I think I had more shots in that game than in my entire international career so far and I want to convert a few more.\"England will now face hosts Germany in their next fixture on Sunday, 14:00 BST, before taking on France on 12 August, 11:30 BST.",
        "England are ranked fifth in the world",
        "England's men claimed a comfortable 5-0 win over Poland as they get their Pool B campaign under way at the EuroHockey Championships in Monchengladbach.",
        "David Goodfield put England ahead in the first half but the 2023 finalists were made to wait to extend their lead by a resolute Polish side that came through the qualifiers in Dublin last summer.",
        "Jacob Payton swept in the second in the third quarter and Phil Roper, Sam Ward's deflected penalty corner shot and a Tom Sorsby effort in the last minute, rounding off the scoring.",
        "\"We really stuck at our gameplan. I was really proud of the boys to keep digging in knowing we were doing the right thing and we perservered and scored a few more goals,\" said midfielder Sorsby.",
        "\"I think I had more shots in that game than in my entire international career so far and I want to convert a few more.\"",
        "England will now face hosts Germany in their next fixture on Sunday, 14:00 BST, before taking on France on 12 August, 11:30 BST."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/olympics/articles/cp37qqlklndo",
      "main_category": "sport",
      "detailed_category": "hockey",
      "topic": "Ireland coach Grundie targeting Euro semi-finals",
      "content": [
        "Head coach Gareth Grundie says Ireland are \"not here just to take part\" as they prepare to face elite opposition at the EuroHockey Championships in Germany. In 15 previous tournament appearances, the Irish have never placed higher than fifth - a position they have achieved five times. But while the tournament features six of the world's top eleven teams, Grundie insists Ireland are targeting a semi-final spot. \"We're really excited to get going at the EuroHockey Championships. It's a fantastic tournament and a great stage for us to test ourselves against the best teams in Europe,\" said Grundie, who replaced Sean Dancer as head coach last year. \"We're not here just to take part; we want to challenge the top sides and push hard for a place in the semi-finals. The players are ready, and we're looking forward to seeing what we can deliver.\"",
        "Ireland open their tournament on Saturday against reigning Olympic, world and European champions the Netherlands before facing France on Monday.They will then take on hosts Germany in what will likely be a decisive game in the race for the semi-finals on Wednesday evening. Ireland completed their preparations for the Euros with an encouraging 2-1 series win over Spain in Dublin last week.That came on the back of the runner-up finish at the Nations Cup when they lost in a shootout in the final to New Zealand but would eventually lead to an invitation to take part in next season’s Pro League, the highest level of competition in world hockey.\"It was frustrating, and it was very disappointing not to get over the line with that one, especially because we didn't actually lose a game in real time in the whole tournament,\" explained captain Sarah Hawkshaw.\"We had a brand new coaching staff with Gareth in charge and while we achieved what we wanted to on the pitch that final hurdle in the shootout is kind of what let us down.\"So yes, disappointed, but looking at it now, we'll take our performances into the Pro League, and we'll be smiling going into it.\"",
        "The Pro League is for the future. Hawkshaw's attention is very much on this week.As well as targeting a place in the last four, there is also the incentive of a World Cup qualifying place for next year on offer.With the Netherlands, Belgium and Germany having already qualified, the next best finisher in the Euros will claim a place without having to go through a qualifying tournament at the start of next year.Ireland's squad boasts a wealth of experience, including World Cup silver medallists Katie Mullan and Roisin Upton and Tokyo Olympians such as Hawkshaw, Sarah Torrans, Hannah McLoughlin, Sarah McAuley and Michelle Carey.However, goalkeeper Ayeisha McFerran, Elena Neill and Naomi Carroll are missing, giving the opportunity to the likes of Belfast Harlequins defender Katie Larmour, who will play in her first senior international tournament.Charlotte Beggs and Katie McKee are the other two Ulster players in the squad.",
        "Gareth Grundie has set the goal of reaching the Euros semi-finals",
        "Head coach Gareth Grundie says Ireland are \"not here just to take part\" as they prepare to face elite opposition at the EuroHockey Championships in Germany.",
        "In 15 previous tournament appearances, the Irish have never placed higher than fifth - a position they have achieved five times.",
        "But while the tournament features six of the world's top eleven teams, Grundie insists Ireland are targeting a semi-final spot.",
        "\"We're really excited to get going at the EuroHockey Championships. It's a fantastic tournament and a great stage for us to test ourselves against the best teams in Europe,\" said Grundie, who replaced Sean Dancer as head coach last year.",
        "\"We're not here just to take part; we want to challenge the top sides and push hard for a place in the semi-finals. The players are ready, and we're looking forward to seeing what we can deliver.\"",
        "Ireland open their tournament on Saturday against reigning Olympic, world and European champions the Netherlands before facing France on Monday.",
        "They will then take on hosts Germany in what will likely be a decisive game in the race for the semi-finals on Wednesday evening.",
        "Ireland completed their preparations for the Euros with an encouraging 2-1 series win over Spain in Dublin last week.",
        "That came on the back of the runner-up finish at the Nations Cup when they lost in a shootout in the final to New Zealand but would eventually lead to an invitation to take part in next season’s Pro League, the highest level of competition in world hockey.",
        "\"It was frustrating, and it was very disappointing not to get over the line with that one, especially because we didn't actually lose a game in real time in the whole tournament,\" explained captain Sarah Hawkshaw.",
        "\"We had a brand new coaching staff with Gareth in charge and while we achieved what we wanted to on the pitch that final hurdle in the shootout is kind of what let us down.",
        "\"So yes, disappointed, but looking at it now, we'll take our performances into the Pro League, and we'll be smiling going into it.\"",
        "Katie Mullan and Sarah Hawkshaw will be pivotal to Ireland’s chances",
        "The Pro League is for the future. Hawkshaw's attention is very much on this week.",
        "As well as targeting a place in the last four, there is also the incentive of a World Cup qualifying place for next year on offer.",
        "With the Netherlands, Belgium and Germany having already qualified, the next best finisher in the Euros will claim a place without having to go through a qualifying tournament at the start of next year.",
        "Ireland's squad boasts a wealth of experience, including World Cup silver medallists Katie Mullan and Roisin Upton and Tokyo Olympians such as Hawkshaw, Sarah Torrans, Hannah McLoughlin, Sarah McAuley and Michelle Carey.",
        "However, goalkeeper Ayeisha McFerran, Elena Neill and Naomi Carroll are missing, giving the opportunity to the likes of Belfast Harlequins defender Katie Larmour, who will play in her first senior international tournament.",
        "Charlotte Beggs and Katie McKee are the other two Ulster players in the squad."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/hockey/articles/cde39xz3z3eo",
      "main_category": "sport",
      "detailed_category": "hockey",
      "topic": "Wales men beat Ireland in EuroHockey II final shootout",
      "content": [
        "Wales men won a shootout in their EuroHockey Championship II final against Ireland in Portugal.Jeremy Duncan gave Ireland the lead but Jack Pritchard levelled and the game ended 1-1 at full-time with Wales winning the shootout 3-1.Wales' men had already secured their place in the World Cup qualifiers and Europe's 2027 top flight.Wales women finished in second place at the Eurohockey II championships in Poland despite a 2-1 defeat to Italy in their final game.Maria Agustina Fiorelli put Italy ahead before a sliding deflection from Isabelle Howell brought Wales level.But a penalty corner from Italy's Frederica Carter proved to be the winner.Wales were already assured of their place in the World Cup qualifiers in 2026 and the European A division in 2027.",
        "Wales men won a shootout in their EuroHockey Championship II final against Ireland in Portugal.",
        "Jeremy Duncan gave Ireland the lead but Jack Pritchard levelled and the game ended 1-1 at full-time with Wales winning the shootout 3-1.",
        "Wales' men had already secured their place in the World Cup qualifiers and Europe's 2027 top flight.",
        "Wales women finished in second place at the Eurohockey II championships in Poland despite a 2-1 defeat to Italy in their final game.",
        "Maria Agustina Fiorelli put Italy ahead before a sliding deflection from Isabelle Howell brought Wales level.",
        "But a penalty corner from Italy's Frederica Carter proved to be the winner.",
        "Wales were already assured of their place in the World Cup qualifiers in 2026 and the European A division in 2027."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/hockey/articles/c0e9w0wwx27o",
      "main_category": "sport",
      "detailed_category": "hockey",
      "topic": "Wales women and men reach European top flight",
      "content": [
        "Wales will play in the European top flight for the first time in 24 years in 2027 after beating Austria 2-1 in dramatic fashion in their Women's EuroHockey Championship II semi-final in Poland.It will mark Wales' return to the European A Division for the first time since 2003 having already secured a place in the World Cup qualifiers for just the second time in their history, by progressing from the group stage in Gniezno.Wales' men will also play in the World Cup qualifiers and Europe's 2027 top flight after their 5-0 win over Italy in the EuroHockey Championship II in Portugal.Against Austria, Wales women captain Beth Bingham struck first, in the 21st minute, by tapping in from a penalty corner rebound.Kristine Vukovich levelled for Austria with 10 minutes left through a penalty corner, but Amy Cradden stepped up to score the winner late on, also from a penalty corner, to spark Wales' celebrations.",
        "Wales women's only previous qualification for the World Cup qualifiers came in 2021, where they lost to Ireland in the final round.Wales will face Italy, the 3-0 winners of Friday's second semi-final against Switzerland, on Saturday in the tournament final.In Lousada, Ben Francis, Gareth Griffiths, Nic Morgan, Jack Pritchard and Fred Newbold hit the target as Wales sealed their return to the A Division they last played in in 2023.In 2021, Wales men won that year's World Cup qualifiers in Cardiff. But their minds will be on Saturday's tier-two final when they will face Ireland in Saturday's final after their 3-1 semi-final win against Scotland.",
        "Wales beat Czech Republic, Switzerland and Lithuania in the pool stage in Poland",
        "Wales will play in the European top flight for the first time in 24 years in 2027 after beating Austria 2-1 in dramatic fashion in their Women's EuroHockey Championship II semi-final in Poland.",
        "It will mark Wales' return to the European A Division for the first time since 2003 having already secured a place in the World Cup qualifiers for just the second time in their history, by progressing from the group stage in Gniezno.",
        "Wales' men will also play in the World Cup qualifiers and Europe's 2027 top flight after their 5-0 win over Italy in the EuroHockey Championship II in Portugal.",
        "Against Austria, Wales women captain Beth Bingham struck first, in the 21st minute, by tapping in from a penalty corner rebound.",
        "Kristine Vukovich levelled for Austria with 10 minutes left through a penalty corner, but Amy Cradden stepped up to score the winner late on, also from a penalty corner, to spark Wales' celebrations.",
        "Wales women's only previous qualification for the World Cup qualifiers came in 2021, where they lost to Ireland in the final round.",
        "Wales will face Italy, the 3-0 winners of Friday's second semi-final against Switzerland, on Saturday in the tournament final.",
        "In Lousada, Ben Francis, Gareth Griffiths, Nic Morgan, Jack Pritchard and Fred Newbold hit the target as Wales sealed their return to the A Division they last played in in 2023.",
        "In 2021, Wales men won that year's World Cup qualifiers in Cardiff. But their minds will be on Saturday's tier-two final when they will face Ireland in Saturday's final after their 3-1 semi-final win against Scotland."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/hockey/articles/cg7jz9gm47eo",
      "main_category": "sport",
      "detailed_category": "hockey",
      "topic": "Ireland secure promotion and World Cup qualifiers spot",
      "content": [
        "Ireland defeated Scotland 3-1 in their EuroHockey Championship II semi-final to secure a spot in the 2026 World Cup qualifiers.The win also books their place in Saturday's final against Wales, and promotion to the EuroHockey Championships in 2027.Holders Ireland took an early lead in Portugal as Lee Cole scored with a dragflick on his 149th international appearance.Louis Rowe scored at the second attempt after his penalty corner was blocked by the Scottish defence, and Adam McAllister's effort was defected into the net to extend Ireland's lead.Scotland netted a consolation through Robert Field, who scored in the final minute. \"The goals this week were to get back to the EuroHockey Championships and make the World Cup Qualifiers,\" said head coach Mark Tumilty.Now we have one more since we have made the final; to go out and win it.\"\"We haven't played in the top division since 2019. Most of the current players have never played at that level. \"First we work towards the World Cup Qualifiers next year. We have a lot of work to do ahead of those qualifiers.\"",
        "Lee Cole opened the scoring for Ireland against Scotland",
        "Ireland defeated Scotland 3-1 in their EuroHockey Championship II semi-final to secure a spot in the 2026 World Cup qualifiers.",
        "The win also books their place in Saturday's final against Wales, and promotion to the EuroHockey Championships in 2027.",
        "Holders Ireland took an early lead in Portugal as Lee Cole scored with a dragflick on his 149th international appearance.",
        "Louis Rowe scored at the second attempt after his penalty corner was blocked by the Scottish defence, and Adam McAllister's effort was defected into the net to extend Ireland's lead.",
        "Scotland netted a consolation through Robert Field, who scored in the final minute.",
        "\"The goals this week were to get back to the EuroHockey Championships and make the World Cup Qualifiers,\" said head coach Mark Tumilty.",
        "Now we have one more since we have made the final; to go out and win it.\"",
        "\"We haven't played in the top division since 2019. Most of the current players have never played at that level.",
        "\"First we work towards the World Cup Qualifiers next year. We have a lot of work to do ahead of those qualifiers.\""
      ]
    },
    {
      "url": "https://www.bbc.com/sport/hockey/articles/cpdjv86y248o",
      "main_category": "sport",
      "detailed_category": "hockey",
      "topic": "World Cup qualifiers await Wales after EuroHockey Championship II win",
      "content": [
        "Wales' women have secured a place in the World Cup qualifiers for just the second time in their history, after progressing from the group stage of EuroHockey Championship II.Two goals from Amy Cradden - both from penalty corners - helped Wales secure a 2-0 win over Lithuania, following up on wins over Switzerland and Czech Republic.Wales' only previous qualification for the World Cup qualifiers came back in 2021, where they lost to Ireland in the final round.Having only conceded one goal in the group stage, Wales will now face the second-place team from Pool A in Friday's semi-final.Victory in the semi-final will see Wales compete in the top tier of European hockey in 2027 in London.",
        "Wednesday proved a big day for Wales' men's team as well, as they secured an emphatic win to progress through their group stage of the EuroHockey Championship II.Wales scored 14 goals in a statement victory over Croatia in Portugal, with seven coming in the first quarter alone.Jack Pritchard and Gareth Furlong were the game's top scorers with four and three goals respectively.This win sees the team qualify for the semi-finals, with the result of the Scotland vs Switzerland game later today to determine who they face on Friday.Wales must win their semi-final to guarantee their qualification to the men's World Cup qualifiers.",
        "Wales are unbeaten at EuroHockey Championships II this year",
        "Wales' women have secured a place in the World Cup qualifiers for just the second time in their history, after progressing from the group stage of EuroHockey Championship II.",
        "Two goals from Amy Cradden - both from penalty corners - helped Wales secure a 2-0 win over Lithuania, following up on wins over Switzerland and Czech Republic.",
        "Wales' only previous qualification for the World Cup qualifiers came back in 2021, where they lost to Ireland in the final round.",
        "Having only conceded one goal in the group stage, Wales will now face the second-place team from Pool A in Friday's semi-final.",
        "Victory in the semi-final will see Wales compete in the top tier of European hockey in 2027 in London.",
        "Wednesday proved a big day for Wales' men's team as well, as they secured an emphatic win to progress through their group stage of the EuroHockey Championship II.",
        "Wales scored 14 goals in a statement victory over Croatia in Portugal, with seven coming in the first quarter alone.",
        "Jack Pritchard and Gareth Furlong were the game's top scorers with four and three goals respectively.",
        "This win sees the team qualify for the semi-finals, with the result of the Scotland vs Switzerland game later today to determine who they face on Friday.",
        "Wales must win their semi-final to guarantee their qualification to the men's World Cup qualifiers."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/hockey/articles/cqxgwj28zezo",
      "main_category": "sport",
      "detailed_category": "hockey",
      "topic": "Wales hammer Czech Republic 5-1 in Poland",
      "content": [
        "Wales cruised to a 5-1 win over Czech Republic at the EuroHockey Championship II in Gniezno, Poland.The game had been postponed from Monday due to heavy rain, but having also won their opener against Switzerland on Sunday, Wales now top Pool B before their group-stage finale against Lithuania on Wednesday.Beth Peers' reverse stick effort put Wales ahead with her third goal in seven appearances before Great Britain squad member Millie Holme added the second.Rebecca Daniels was next on the scoresheet before captain Beth Bingham's penalty stroke and Betsan Thomas scored the fifth.Switzerland meet Lithuania later on Tuesday.",
        "Wales beat Switzerland 3-1 in the opening game of their EuroHockey Championship II campaign",
        "Wales cruised to a 5-1 win over Czech Republic at the EuroHockey Championship II in Gniezno, Poland.",
        "The game had been postponed from Monday due to heavy rain, but having also won their opener against Switzerland on Sunday, Wales now top Pool B before their group-stage finale against Lithuania on Wednesday.",
        "Beth Peers' reverse stick effort put Wales ahead with her third goal in seven appearances before Great Britain squad member Millie Holme added the second.",
        "Rebecca Daniels was next on the scoresheet before captain Beth Bingham's penalty stroke and Betsan Thomas scored the fifth.",
        "Switzerland meet Lithuania later on Tuesday."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/hockey/articles/cp945v7v4ylo",
      "main_category": "sport",
      "detailed_category": "hockey",
      "topic": "Wales level late to earn EuroHockey draw against Scotland",
      "content": [
        "Wales men scored a goal with seconds remaining to salvage a 2-2 draw against Scotland in the second game of their EuroHockey Championship II campaign in Portugal.Nic Morgan put Wales in front on 12 minutes but Scotland levelled through Struan Walker.Walker put Scotland ahead in the final quarter but Gareth Griffiths equalised with 12 seconds remaining.In the women's competition in Poland, Wales' game against Czech Republic was postponed due to heavy rain.The game has been re-arranged for Tuesday morning.",
        "Wales men scored a goal with seconds remaining to salvage a 2-2 draw against Scotland in the second game of their EuroHockey Championship II campaign in Portugal.",
        "Nic Morgan put Wales in front on 12 minutes but Scotland levelled through Struan Walker.",
        "Walker put Scotland ahead in the final quarter but Gareth Griffiths equalised with 12 seconds remaining.",
        "In the women's competition in Poland, Wales' game against Czech Republic was postponed due to heavy rain.",
        "The game has been re-arranged for Tuesday morning."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/hockey/articles/cyvnprmzzreo",
      "main_category": "sport",
      "detailed_category": "hockey",
      "topic": "Wales begin EuroHockey campaign with Switzerland win",
      "content": [
        "Wales men began their EuroHockey Championship II campaign with a 3-1 win over Switzerland in Lousada, Portugal.Jack Pritchard and Rhys Bradshaw gave Wales an early lead in the first period, with Gareth Griffiths' penalty corner making it 3-0 by half-time.Lukas Hengartner pulled a goal back for Switzerland but Wales held out. They face Scotland in their second game on Monday (17:30 BST).In the women's competition in Gniezno, Poland, Wales also faced Switzerland later on Sunday with captain Beth Bingham's strike from the penalty spot enough to earn a 1-0 win.Wales are next in action on Monday against Czech Republic (14:15 BST).",
        "Wales men began their EuroHockey Championship II campaign with a 3-1 win over Switzerland in Lousada, Portugal.",
        "Jack Pritchard and Rhys Bradshaw gave Wales an early lead in the first period, with Gareth Griffiths' penalty corner making it 3-0 by half-time.",
        "Lukas Hengartner pulled a goal back for Switzerland but Wales held out. They face Scotland in their second game on Monday (17:30 BST).",
        "In the women's competition in Gniezno, Poland, Wales also faced Switzerland later on Sunday with captain Beth Bingham's strike from the penalty spot enough to earn a 1-0 win.",
        "Wales are next in action on Monday against Czech Republic (14:15 BST)."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/hockey/articles/czeyl4gxg7eo",
      "main_category": "sport",
      "detailed_category": "hockey",
      "topic": "Ireland’s women promoted to Pro League for first time",
      "content": [
        "Ireland’s women will play in the FIH Pro League for the first time later this year after accepting an invitation from the world governing body.Gareth Grundie’s side narrowly missed out on automatic promotion to the sport’s highest level of competition after the lost the final of the FIH Nations to New Zealand in March.The defeat, in a shootout, meant New Zealand could have taken their place in the Pro League but declined the invitation.Ireland are the ninth and final team to be confirmed for the seventh edition of the Pro League.",
        "They will play alongside the World's top sides, including Olympic gold medallists Netherlands, Olympic Bronze medallists Argentina, and World number 3 Belgium.The other countries taking part are Germany, England, China, Australia and Spain.Ireland, currently ranked eleven in the world, will replace India in next season's competition, following their relegation on Sunday.The timing of their inclusion in the competition couldn’t be better with qualification for the 2026 World Cup coming up at the start of next year and will provide the best preparation for the squad.\"I am delighted that we have been given the opportunity to participate in the FIH Pro League 2025/26 Season 7,“ said Ireland Women's Head Coach Gareth Grundie.“It's a testament to the quality of play this team has achieved to date and is an excellent and invaluable opportunity for further improvement. “It comes at an ideal time for us as a programme also, pitting us against the World's best teams as we go in search of qualification for the 2026 FIH World Cup in the Netherlands and Belgium.\"The Irish squad, currently preparing for the European Championships in August, will find out their Pro League schedule shortly.",
        "Ireland’s women will play in the Pro League for the first time",
        "Ireland’s women will play in the FIH Pro League for the first time later this year after accepting an invitation from the world governing body.",
        "Gareth Grundie’s side narrowly missed out on automatic promotion to the sport’s highest level of competition after the lost the final of the FIH Nations to New Zealand in March.",
        "The defeat, in a shootout, meant New Zealand could have taken their place in the Pro League but declined the invitation.",
        "Ireland are the ninth and final team to be confirmed for the seventh edition of the Pro League.",
        "They will play alongside the World's top sides, including Olympic gold medallists Netherlands, Olympic Bronze medallists Argentina, and World number 3 Belgium.",
        "The other countries taking part are Germany, England, China, Australia and Spain.",
        "Ireland, currently ranked eleven in the world, will replace India in next season's competition, following their relegation on Sunday.",
        "The timing of their inclusion in the competition couldn’t be better with qualification for the 2026 World Cup coming up at the start of next year and will provide the best preparation for the squad.",
        "\"I am delighted that we have been given the opportunity to participate in the FIH Pro League 2025/26 Season 7,“ said Ireland Women's Head Coach Gareth Grundie.",
        "“It's a testament to the quality of play this team has achieved to date and is an excellent and invaluable opportunity for further improvement.",
        "“It comes at an ideal time for us as a programme also, pitting us against the World's best teams as we go in search of qualification for the 2026 FIH World Cup in the Netherlands and Belgium.\"",
        "The Irish squad, currently preparing for the European Championships in August, will find out their Pro League schedule shortly."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/hockey/articles/crrq7527r12o",
      "main_category": "sport",
      "detailed_category": "hockey",
      "topic": "England Women avoid Pro League relegation",
      "content": [
        "England Women's hockey team avoided relegation from the Pro League with a victory over Germany on the final weekend of the season.A sixth-minute goal from Elizabeth Neal and Sabbie Heesh's save from a penalty stroke with 100 seconds left, was enough to seal the win in Berlin on Saturday, ensuring they would definitely finish above India in the nine-team table.Germany won 4-2 in the second game on Sunday to secure their own survival, sealing India's relegation and ensuring England end the campaign in seventh place.England's men were already safe from relegation going to the weekend and also ended the season seventh after losing both games against Belgium.",
        "They were comfortably beaten 3-1 in Saturday's first game in Antwerp, with Jacob Payton scoring their only goal.Sunday's game was much closer, with Zachary Wallace, Phil Roper, Will Calnan and Liam Sanford on target in a thrilling 4-4 draw.That sent the game to penalties, but Wallace, Roper and Stuart Rushmere missed their efforts to seal a 3-0 shootout success for the hosts.The Netherlands had already secured top spot in both the men's and women's competition before the final round of matches.",
        "Elizabeth Neal's goal helped England secure the win they needed to avoid relegation.",
        "England Women's hockey team avoided relegation from the Pro League with a victory over Germany on the final weekend of the season.",
        "A sixth-minute goal from Elizabeth Neal and Sabbie Heesh's save from a penalty stroke with 100 seconds left, was enough to seal the win in Berlin on Saturday, ensuring they would definitely finish above India in the nine-team table.",
        "Germany won 4-2 in the second game on Sunday to secure their own survival, sealing India's relegation and ensuring England end the campaign in seventh place.",
        "England's men were already safe from relegation going to the weekend and also ended the season seventh after losing both games against Belgium.",
        "They were comfortably beaten 3-1 in Saturday's first game in Antwerp, with Jacob Payton scoring their only goal.",
        "Sunday's game was much closer, with Zachary Wallace, Phil Roper, Will Calnan and Liam Sanford on target in a thrilling 4-4 draw.",
        "That sent the game to penalties, but Wallace, Roper and Stuart Rushmere missed their efforts to seal a 3-0 shootout success for the hosts.",
        "The Netherlands had already secured top spot in both the men's and women's competition before the final round of matches."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/hockey/articles/c5ylxdxrypeo",
      "main_category": "sport",
      "detailed_category": "hockey",
      "topic": "Wales beat hosts Poland for third in Nations Cup 2",
      "content": [
        "Wales secured bronze with a 1-0 win against host Poland in the inaugural FIH Women's Nations Cup 2 semi-final in Walcz.Lily Roberts scored winner in the third quarter as Wales made up for the disappointment of not reaching the final.They were beaten 2-1 by Pool A winners Uruguay in Saturday's semi-finals but after tying 3-3 in normal time the South Americans succumbed in a 3-1 penalty shootout against Pool B table-toppers France in Sunday's final.Wales drew 3-3 against Italy in their tournament opener and went on to beat Czechia 2-0 before reaching the semi-finals despite losing 2-1 to France in their final group game.",
        "Wales captain Beth Bingham believes their efforts in Poland will stand them in good stead for what lies ahead.\"We're delighted to win our final match and take home the bronze medal,\" she said. \"We've grown throughout the tournament as a team and learnt a lot about ourselves which will put us in good stead for the upcoming Europeans later this summer.\"",
        "Wales finished second in their pool behind France in Walcz",
        "Wales secured bronze with a 1-0 win against host Poland in the inaugural FIH Women's Nations Cup 2 semi-final in Walcz.",
        "Lily Roberts scored winner in the third quarter as Wales made up for the disappointment of not reaching the final.",
        "They were beaten 2-1 by Pool A winners Uruguay in Saturday's semi-finals but after tying 3-3 in normal time the South Americans succumbed in a 3-1 penalty shootout against Pool B table-toppers France in Sunday's final.",
        "Wales drew 3-3 against Italy in their tournament opener and went on to beat Czechia 2-0 before reaching the semi-finals despite losing 2-1 to France in their final group game.",
        "Wales captain Beth Bingham believes their efforts in Poland will stand them in good stead for what lies ahead.",
        "\"We're delighted to win our final match and take home the bronze medal,\" she said.",
        "\"We've grown throughout the tournament as a team and learnt a lot about ourselves which will put us in good stead for the upcoming Europeans later this summer.\""
      ]
    },
    {
      "url": "https://www.bbc.com/sport/hockey/articles/clyzxzk0md3o",
      "main_category": "sport",
      "detailed_category": "hockey",
      "topic": "England end Pro League home leg with two wins",
      "content": [
        "England's men's and women's hockey teams secured victory on the final day of the London leg of the Pro League.An impressive 2-1 victory over second-placed Australia provided a happy ending to a disappointing week for England's men, who look set for a mid-table finish.A strong second-half performance from the women earned them a 4-1 win over Spain, lifting themselves off the bottom of the table - above India and Germany.Having lost their first game against Australia on Saturday, a brace from Jack Waller was enough for the men to edge past their opponents.They headed into the weekend off the back of two defeats against the Netherlands.Meanwhile, second-half goals from Maddie Axford, Georgie Gardens and Izzy Petter helped England women secure victory over Spain.",
        "Candela Mejias' goal in the final quarter gave Spain a narrow victory in their first match on Saturday against England's women, who traded wins with Australia earlier in the week.The final round of fixtures take place next weekend - the men travel to Belgium for a double-header, with the women in Germany for their final two games.",
        "England's men's and women's hockey teams secured victory on the final day of the London leg of the Pro League.",
        "An impressive 2-1 victory over second-placed Australia provided a happy ending to a disappointing week for England's men, who look set for a mid-table finish.",
        "A strong second-half performance from the women earned them a 4-1 win over Spain, lifting themselves off the bottom of the table - above India and Germany.",
        "Having lost their first game against Australia on Saturday, a brace from Jack Waller was enough for the men to edge past their opponents.",
        "They headed into the weekend off the back of two defeats against the Netherlands.",
        "Meanwhile, second-half goals from Maddie Axford, Georgie Gardens and Izzy Petter helped England women secure victory over Spain.",
        "Candela Mejias' goal in the final quarter gave Spain a narrow victory in their first match on Saturday against England's women, who traded wins with Australia earlier in the week.",
        "The final round of fixtures take place next weekend - the men travel to Belgium for a double-header, with the women in Germany for their final two games."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/hockey/articles/c9w1rw701e9o",
      "main_category": "sport",
      "detailed_category": "hockey",
      "topic": "Wales eye Nations Cup 2 third after Uruguay defeat",
      "content": [
        "Wales' hopes of reaching the inaugural FIH Women's Nations Cup 2 final were dashed in a 2-1 defeat by Uruguay in Walcz, Poland.The South Americans came back from 1-0 down to secure their spot in Sunday's final.Wales will now face hosts Poland - who were beaten 4-1 by France in the other semi-final - for third place on Sunday (15:30 BST)  Anja Atkin struck first for Wales in the second quarter against Uruguay, but Manuela Vilar levelled and Teresa Viana ensured her side's 2-1 win with a third quarter penalty stroke.",
        "Wales saw their lead end on the stroke of half-time in Poland",
        "Wales' hopes of reaching the inaugural FIH Women's Nations Cup 2 final were dashed in a 2-1 defeat by Uruguay in Walcz, Poland.",
        "The South Americans came back from 1-0 down to secure their spot in Sunday's final.",
        "Wales will now face hosts Poland - who were beaten 4-1 by France in the other semi-final - for third place on Sunday (15:30 BST)",
        "Anja Atkin struck first for Wales in the second quarter against Uruguay, but Manuela Vilar levelled and Teresa Viana ensured her side's 2-1 win with a third quarter penalty stroke."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/hockey/articles/c994rdxpkrxo",
      "main_category": "sport",
      "detailed_category": "hockey",
      "topic": "Wales claim fifth after edging hosts Malaysia",
      "content": [
        "Wales men came from a goal down to beat hosts Malaysia 2-1 in their final game of the FIH Nations Cup to finish fifth.Syed Cholan opened the scoring for Malaysia in the second quarter, but Rhys Bradshaw levelled things in the third at the National Hockey Stadium in Kuala Lumpur.A tight contest was decided late in the game when Gareth Furlong hit the winner for Wales, the score like Bradshaw's earlier effort coming from a penalty corner.It was the second successive game in which Wales had fought back to win, having come from 3-2 down against Japan to win 6-4 last time out.Wales will now prepare for their European Championships in Portugal in July, where the side will be looking to secure promotion to the A division of competition.",
        "Wales fought back from behind to beat hosts Malaysia in the FIH Nations Cup",
        "Wales men came from a goal down to beat hosts Malaysia 2-1 in their final game of the FIH Nations Cup to finish fifth.",
        "Syed Cholan opened the scoring for Malaysia in the second quarter, but Rhys Bradshaw levelled things in the third at the National Hockey Stadium in Kuala Lumpur.",
        "A tight contest was decided late in the game when Gareth Furlong hit the winner for Wales, the score like Bradshaw's earlier effort coming from a penalty corner.",
        "It was the second successive game in which Wales had fought back to win, having come from 3-2 down against Japan to win 6-4 last time out.",
        "Wales will now prepare for their European Championships in Portugal in July, where the side will be looking to secure promotion to the A division of competition.",
        "Wales eye fifth against Malaysia after Japan win",
        "Wales to face Uruguay in Nations Cup 2 semi-final"
      ]
    }
  ]
}