{
  "scraped_at": "2025-10-27T18:56:59.802547",
  "total_articles": 12,
  "category": "netball",
  "articles_per_category": 100,
  "articles": [
    {
      "url": "https://www.bbc.com/sport/netball/articles/c8xrw5xng5no",
      "main_category": "sport",
      "detailed_category": "netball",
      "topic": "'Ten days in Lionesses' den and I wanted to stay forever'",
      "content": [
        "Liv Tchine's first impression was \"wow\".Her second was \"can I stay here forever?\"Her third was \"one day this will be all ours\".Netball's kingdom is modest, but prolific England goal shooter Tchine and her team-mates recently had a glimpse of a top-tier sporting promised land.These are the Roses players targeting Commonwealth Games gold at Glasgow 2026 and World Cup glory in 2027.They are at the vanguard of the sport's professional era, the elite of the three million people who play netball in England at least once a year. Most players are women, but men play too.Tchine and co draw inspiration from the Euros-winning Lionesses and World Cup-winning Red Roses, rather than lament encroachment on netball's legacy territory.Netball Super League is newly professional but funds are tight, similar to football's Women's Super League in the mid-2010s.Players hear of rewards that could be theirs one day. Often those rewards feel a million miles away, yet not always.For Tchine, a standout in the London Pulse side who swept to their first Super League title this year, the \"wow\" moment came at the Lionesses' luxury hangout.St George's Park lies in Staffordshire countryside, tucked out of sight. An understated private drive off a hedge-lined B road is a portal to a world beyond the dreams of most sportspeople.\"Just imagine netball having this kind of facility. Do you know how sick that would be?\"That was Tchine on an Instagram video diary, reacting to visiting the Football Association's state-of-the-art national team training centre for the first time. The gym, the recovery rooms, the green, green grass of England's home.England's netballers spent a training block there, before autumn series against Jamaica and New Zealand.\"I was like, if we could just stay here forever, I would happily move,\" Tchine tells BBC Sport.\"So, so good. We were there for 10 days. The facilities were, honestly, so amazing.\"The whole time we were there I was just like, one day netball could definitely have something like this.\"The second season since Super League's relaunch is coming, with 2026 fixtures announced this week., externalPulse are in \"the best position we've ever been in\", Tchine says.The league is growing. Average attendances climbed by 42% in 2025, having been about 1,500 previously. In comparison, the first Women's Super League football season - following a 2014 reboot - had average crowds of 728 (from 562 in 2013).Women's football crowds in the tens of thousands are now almost commonplace, but that didn't happen overnight.Tchine, a 24-year-old south Londoner, admired portraits of England footballers - men and women - lining St George's Park's corridors.\"I definitely hope that if I'm still playing in 10 years we'll be at the same level as the Lionesses and the Red Roses,\" she says.\"They were both absolutely incredible this summer - going out there, doing their job and coming out with wins was amazing. It's really good to see women's sport hitting levels that it's never been at in the past.\"I want to be able to go out with the Roses and use that momentum to try and get our gold medal.\"",
        "Netball England trumpets participation numbers, but football, rugby and cricket are also appealing to women and girls.Sport England figures, published by The Times, external in November 2024, indicated more girls aged under 18 in 2022-23 played football (16%) than netball (15.4%).That marks a shift in five years, with football rising by 2% and netball static.When the effect of the Lionesses' Euros triumph in 2022 became apparent, England Netball chief executive Fran Connolly warned a parliamentary committee that any \"disproportionate focus on growing football... will have a detrimental effect on other women's sports, particularly those that do not have the financial underpinning of a male counterpart\".Baroness Sue Campbell, who successfully advocated for more female participation while serving as the FA's director of women's football, is now England Netball's chair.Big moments matter. YouGov figures showed 130,700 women started playing netball, or played more often, within months of England winning gold at the 2018 Commonwealth Games in Australia.A repeat in Glasgow would be timely.",
        "Cardiff Dragons become simply Dragons. They will play in Liverpool as well as the Welsh capital.Games will be played for the first time at the National Cycling Centre in Manchester and Essex Sports Arena.Wembley Arena will stage a London derby when Mavericks host Pulse in May.Manchester Thunder have brought England star Eleanor Cardwell back from Australia, where she was MVP in Adelaide's 2023 Grand Final win.",
        "21 February: Super Cup, Sheffield Arena27 February: Netball Super League beginsOpening fixtures:27 February: London Pulse v Manchester Thunder28 February: London Mavericks v Nottingham Forest, Loughborough Lightning v Dragons, Birmingham Panthers v Leeds Rhinos20 June: Grand Final, venue tbc",
        "Liv Tchine's shooting accuracy led London Pulse to glory - now it could be key to England's gold medal hopes",
        "Liv Tchine's first impression was \"wow\".",
        "Her second was \"can I stay here forever?\"",
        "Her third was \"one day this will be all ours\".",
        "Netball's kingdom is modest, but prolific England goal shooter Tchine and her team-mates recently had a glimpse of a top-tier sporting promised land.",
        "These are the Roses players targeting Commonwealth Games gold at Glasgow 2026 and World Cup glory in 2027.",
        "They are at the vanguard of the sport's professional era, the elite of the three million people who play netball in England at least once a year. Most players are women, but men play too.",
        "Tchine and co draw inspiration from the Euros-winning Lionesses and World Cup-winning Red Roses, rather than lament encroachment on netball's legacy territory.",
        "Netball Super League is newly professional but funds are tight, similar to football's Women's Super League in the mid-2010s.",
        "Players hear of rewards that could be theirs one day. Often those rewards feel a million miles away, yet not always.",
        "For Tchine, a standout in the London Pulse side who swept to their first Super League title this year, the \"wow\" moment came at the Lionesses' luxury hangout.",
        "St George's Park lies in Staffordshire countryside, tucked out of sight. An understated private drive off a hedge-lined B road is a portal to a world beyond the dreams of most sportspeople.",
        "\"Just imagine netball having this kind of facility. Do you know how sick that would be?\"",
        "That was Tchine on an Instagram video diary, reacting to visiting the Football Association's state-of-the-art national team training centre for the first time. The gym, the recovery rooms, the green, green grass of England's home.",
        "England's netballers spent a training block there, before autumn series against Jamaica and New Zealand.",
        "\"I was like, if we could just stay here forever, I would happily move,\" Tchine tells BBC Sport.",
        "\"So, so good. We were there for 10 days. The facilities were, honestly, so amazing.",
        "\"The whole time we were there I was just like, one day netball could definitely have something like this.\"",
        "The second season since Super League's relaunch is coming, with 2026 fixtures announced this week., external",
        "Pulse are in \"the best position we've ever been in\", Tchine says.",
        "The league is growing. Average attendances climbed by 42% in 2025, having been about 1,500 previously. In comparison, the first Women's Super League football season - following a 2014 reboot - had average crowds of 728 (from 562 in 2013).",
        "Women's football crowds in the tens of thousands are now almost commonplace, but that didn't happen overnight.",
        "Tchine, a 24-year-old south Londoner, admired portraits of England footballers - men and women - lining St George's Park's corridors.",
        "\"I definitely hope that if I'm still playing in 10 years we'll be at the same level as the Lionesses and the Red Roses,\" she says.",
        "\"They were both absolutely incredible this summer - going out there, doing their job and coming out with wins was amazing. It's really good to see women's sport hitting levels that it's never been at in the past.",
        "\"I want to be able to go out with the Roses and use that momentum to try and get our gold medal.\"",
        "Dragons move to benefit Welsh netball, says Drane",
        "'We were judged for wanting babies but I want mums on my team'",
        "Plans for Netball World Cup every two years",
        "Tchine lifts the Taini Jamison Series trophy after the Roses beat New Zealand in 2024",
        "Netball England trumpets participation numbers, but football, rugby and cricket are also appealing to women and girls.",
        "Sport England figures, published by The Times, external in November 2024, indicated more girls aged under 18 in 2022-23 played football (16%) than netball (15.4%).",
        "That marks a shift in five years, with football rising by 2% and netball static.",
        "When the effect of the Lionesses' Euros triumph in 2022 became apparent, England Netball chief executive Fran Connolly warned a parliamentary committee that any \"disproportionate focus on growing football... will have a detrimental effect on other women's sports, particularly those that do not have the financial underpinning of a male counterpart\".",
        "Baroness Sue Campbell, who successfully advocated for more female participation while serving as the FA's director of women's football, is now England Netball's chair.",
        "Big moments matter. YouGov figures showed 130,700 women started playing netball, or played more often, within months of England winning gold at the 2018 Commonwealth Games in Australia.",
        "A repeat in Glasgow would be timely.",
        "Cardiff Dragons become simply Dragons. They will play in Liverpool as well as the Welsh capital.",
        "Games will be played for the first time at the National Cycling Centre in Manchester and Essex Sports Arena.",
        "Wembley Arena will stage a London derby when Mavericks host Pulse in May.",
        "Manchester Thunder have brought England star Eleanor Cardwell back from Australia, where she was MVP in Adelaide's 2023 Grand Final win.",
        "This video can not be played",
        "London Pulse win first Netball Super League title",
        "21 February: Super Cup, Sheffield Arena",
        "27 February: Netball Super League begins",
        "27 February: London Pulse v Manchester Thunder",
        "28 February: London Mavericks v Nottingham Forest, Loughborough Lightning v Dragons, Birmingham Panthers v Leeds Rhinos",
        "20 June: Grand Final, venue tbc",
        "Fadoju commits to London Pulse for next NSL season",
        "Pulse beat Lightning to win first Netball Super League title",
        "Super League 2.0 - how has netball's relaunch gone?"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/netball/articles/ckgqp7l40d9o",
      "main_category": "sport",
      "detailed_category": "netball",
      "topic": "Dragons move to benefit Welsh netball, says Drane",
      "content": [
        "Former Wales captain Suzy Drane believes playing some games in Liverpool and dropping 'Cardiff' from the name of the Dragons franchise can benefit Welsh netball in the build up to the 2026 Commonwealth Games in Glasgow.Previously known as LexisNexis Cardiff Dragons, the city name has been removed for the 2026 Netball Super League (NSL) season, when home games will be played at Cardiff's House of Sport and Liverpool's M&S Bank Arena. St Asaph-born Drane, who retired in 2022 after a 20-year career in which she became Wales' most capped player with 125 international appearances, sees the \"business decsion\" as a positive one for the sport in Wales.\"We've got a fantastic following in netball in Wales, why just focus that on the following here in Cardiff?\" Drane told Radio Wales Breakfast.Although six other franchises will play at more than one venue in 2026, Dragons will be the only one playing in two countries.\"That's because we are the unique and only team that play outside England which I see very much as a strength,\" added the 38-year-old who is a lecturer in sport development at Cardiff Metropolitan University.\"We can bring in our fans and what better time... this is the lead-up season to Glasgow 2026. \"So hopefully all of this will benefit the following that is going to be supporting Wales and Team Wales netball team as they go up to Glasgow.\"",
        "Known as the Celtic Dragons for 18 years after the formation of the Elite League in 2005, Wales' NSL franchise was rebranded to become Cardiff Dragons for the 2024 season, in which they finished eighth out of 10 teams.With reduced numbers in 2025 the Wales-based side finished last of eight in the revamped professional NSL.Despite question marks about the franchise's finances Drane believes the Dragons can prosper.\"I think that they will have been disappointed last year and I think they have a right to be disappointed,\" said Drane who played in the 2013 Grand Final during her 14 years with Celtic Dragons.\"They have tremendous amounts of potential and they will have been working their socks off last year and to not get some of those wins that you could feel when you were there, you could feel that they were coming. \"They will be working hard to convert all of the hard work that they're doing in training into those results this year and never write Dragons off.\"Let's not forget that Dragons have been top. They have been in a final in the previous Netball Super League and it just takes a team to come together and work through some of those challenges.\"That takes investment of time, effort, energy, investment of fans and investment of businesses and organisation into netball, that's what we need.\"",
        "Suzy Drane was inducted into the Welsh Sports Hall of Fame in 2023",
        "Former Wales captain Suzy Drane believes playing some games in Liverpool and dropping 'Cardiff' from the name of the Dragons franchise can benefit Welsh netball in the build up to the 2026 Commonwealth Games in Glasgow.",
        "Previously known as LexisNexis Cardiff Dragons, the city name has been removed for the 2026 Netball Super League (NSL) season, when home games will be played at Cardiff's House of Sport and Liverpool's M&S Bank Arena.",
        "St Asaph-born Drane, who retired in 2022 after a 20-year career in which she became Wales' most capped player with 125 international appearances, sees the \"business decsion\" as a positive one for the sport in Wales.",
        "\"We've got a fantastic following in netball in Wales, why just focus that on the following here in Cardiff?\" Drane told Radio Wales Breakfast.",
        "Although six other franchises will play at more than one venue in 2026, Dragons will be the only one playing in two countries.",
        "\"That's because we are the unique and only team that play outside England which I see very much as a strength,\" added the 38-year-old who is a lecturer in sport development at Cardiff Metropolitan University.",
        "\"We can bring in our fans and what better time... this is the lead-up season to Glasgow 2026.",
        "\"So hopefully all of this will benefit the following that is going to be supporting Wales and Team Wales netball team as they go up to Glasgow.\"",
        "This video can not be played",
        "Netball 'needs to shout louder' as women's rugby and football popularity grows",
        "Known as the Celtic Dragons for 18 years after the formation of the Elite League in 2005, Wales' NSL franchise was rebranded to become Cardiff Dragons for the 2024 season, in which they finished eighth out of 10 teams.",
        "With reduced numbers in 2025 the Wales-based side finished last of eight in the revamped professional NSL.",
        "Despite question marks about the franchise's finances Drane believes the Dragons can prosper.",
        "\"I think that they will have been disappointed last year and I think they have a right to be disappointed,\" said Drane who played in the 2013 Grand Final during her 14 years with Celtic Dragons.",
        "\"They have tremendous amounts of potential and they will have been working their socks off last year and to not get some of those wins that you could feel when you were there, you could feel that they were coming.",
        "\"They will be working hard to convert all of the hard work that they're doing in training into those results this year and never write Dragons off.",
        "\"Let's not forget that Dragons have been top. They have been in a final in the previous Netball Super League and it just takes a team to come together and work through some of those challenges.",
        "\"That takes investment of time, effort, energy, investment of fans and investment of businesses and organisation into netball, that's what we need.\"",
        "Renamed Dragons to play in Cardiff and Liverpool",
        "Ex-rugby star Owens joins Cardiff Dragons board"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/netball/articles/cg4204rz6pyo",
      "main_category": "sport",
      "detailed_category": "netball",
      "topic": "Renamed Dragons to play in Cardiff and Liverpool",
      "content": [
        "Welsh netball's leading women's team will lose 'Cardiff' from their title for the 2026 Netball Super League (NSL) season and host games in Liverpool as well as the Welsh capital.Previously known as LexisNexis Cardiff Dragons, the city name has been removed and they are now LexisNexis Dragons and will play home games at Cardiff's House of Sport and Liverpool's M&S Bank Arena.Dragons are among six of the league's teams who will play home games at alternative venues, but are also the only side who will host opponents in two different countries. Only London Pulse and Nottingham Forest Netball will host games at one venue, remaining in their home cities.Dragons named their squad in early September despite financial uncertainty.The Welsh side finished bottom of the revamped NSL last season - winning only two of their 14 matches - and there have been question marks about the franchise's finances.BBC Sport Wales had been told that players were informed in the off-season that they may not have had a team to play for this coming campaign if Dragons did not secure the required funding.",
        "South Africa's Khanyisa Chawane is one of Dragons' returning players",
        "Welsh netball's leading women's team will lose 'Cardiff' from their title for the 2026 Netball Super League (NSL) season and host games in Liverpool as well as the Welsh capital.",
        "Previously known as LexisNexis Cardiff Dragons, the city name has been removed and they are now LexisNexis Dragons and will play home games at Cardiff's House of Sport and Liverpool's M&S Bank Arena.",
        "Dragons are among six of the league's teams who will play home games at alternative venues, but are also the only side who will host opponents in two different countries.",
        "Only London Pulse and Nottingham Forest Netball will host games at one venue, remaining in their home cities.",
        "Dragons named their squad in early September despite financial uncertainty.",
        "The Welsh side finished bottom of the revamped NSL last season - winning only two of their 14 matches - and there have been question marks about the franchise's finances.",
        "BBC Sport Wales had been told that players were informed in the off-season that they may not have had a team to play for this coming campaign if Dragons did not secure the required funding.",
        "Ex-rugby star Owens joins Cardiff Dragons board"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/netball/articles/c20wgzr7n2vo",
      "main_category": "sport",
      "detailed_category": "netball",
      "topic": "Fadoju commits to London Pulse for next NSL season",
      "content": [
        "England's Funmi Fadoju has committed to Netball Super League champions London Pulse for another season.Goal defence Fadoju, 22, was player of the match in Pulse's first Grand Final title win as they beat defending champions Loughborough Lightning on Sunday.Fadoju played a key role in Pulse's historic season as they topped the regular season table and also won the inaugural Netball Super Cup in March.\"It's such a great team and I'm surrounded by some of the best players in the country,\" Fadoju said.\"What's not to love? We push each other to be our best selves every day and I love everything about the team.\"By the end of the Super League campaign, Fadoju finished with the most interceptions, gains and deflections among all players.As one of the world's most exciting talents, it is likely that Fadoju would have had lucrative offers from Australia's Super Netball league had she expressed interest in moving abroad.However, she told Pulse's social media channels that she is currently happy in London, where she grew up.Fadoju joined Pulse in 2020 and has 41 international caps, including playing in the 2023 World Cup where England finished second to Australia, who won their 12th title.",
        "Funmi Fadoju made her Super League debut for London Pulse in 2020",
        "England's Funmi Fadoju has committed to Netball Super League champions London Pulse for another season.",
        "Goal defence Fadoju, 22, was player of the match in Pulse's first Grand Final title win as they beat defending champions Loughborough Lightning on Sunday.",
        "Fadoju played a key role in Pulse's historic season as they topped the regular season table and also won the inaugural Netball Super Cup in March.",
        "\"It's such a great team and I'm surrounded by some of the best players in the country,\" Fadoju said.",
        "\"What's not to love? We push each other to be our best selves every day and I love everything about the team.\"",
        "By the end of the Super League campaign, Fadoju finished with the most interceptions, gains and deflections among all players.",
        "As one of the world's most exciting talents, it is likely that Fadoju would have had lucrative offers from Australia's Super Netball league had she expressed interest in moving abroad.",
        "However, she told Pulse's social media channels that she is currently happy in London, where she grew up.",
        "Fadoju joined Pulse in 2020 and has 41 international caps, including playing in the 2023 World Cup where England finished second to Australia, who won their 12th title.",
        "Pulse beat Lightning to win first Netball Super League title",
        "Super League 2.0 - how has netball's relaunch gone?",
        "Pulse beat Lightning to win first Netball Super League title"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/netball/articles/cew0j5ey9r4o",
      "main_category": "sport",
      "detailed_category": "netball",
      "topic": "Cardiff Dragons reveal 2026 squad despite financial concerns",
      "content": [
        "LexisNexis Cardiff Dragons have named their squad for next season's Netball Super League (NSL) campaign, despite facing an uncertain future due to funding concerns.The Welsh side finished bottom of the revamped NSL last season - winning only two of their 14 matches - and there are question marks about how robust the franchise's finances are.BBC Sport Wales has been told that players were informed in the off-season that they may not have had a team to play for next season if Dragons did not secure the required funding.That hurdle seems to have been overcome, in the short term at least, allowing Dragons to retain the bulk of the squad from last season - including key goal shooter Georgia Rowe, alongside international Welsh Feathers team-mates Bethan Dyke and Leah Middleton.New additions include Scotland goal attack or goal shooter Niamh McCall and defender Ella Bowen, who was at Leeds Rhinos last season.Australian goal defence or goalkeeper Jacqui Newton - who captained Dragons last campaign - returns for a third season in south Wales.But goalkeeper Celena Appleby-Prince has re-joined Loughborough Lightning, last season's NSL runners-up.",
        "It has been a turbulent period on and off the court, with Wales Netball saying during the summer it had launched an \"urgent internal review and turnaround plan\" following \"a comprehensive review of historical finances and governance across both LexisNexis Cardiff Dragons and Wales Netball\".During that period, the majority of the Dragons' board resigned, while Sara Moore left as Dragons and Wales Netball head of performance.While Dragons struggled last season, it was not all doom and gloom for Welsh netball on the court with the national Feathers side reaching their highest ever world ranking of sixth last March following an undefeated 2024-2025 campaign.The Wales Netball and Cardiff Dragons chief executive, Sarah Boswell, said at the time that the success at international level should be used as a springboard to secure the future of netball in Wales.\"In 2025, I want to see a real acceleration in investment - financial, structural, and cultural - into the game,\" she said.",
        "Previous to a Wales Netball Extraordinary General Meeting (EGM) that was held on 30 July, the governing body's chair Cath Hares said: \"The Wales Netball board remains hopeful, through collaboration and shared commitment with our partners and stakeholders, that a positive route forward can be secured, which strengthens our financial position and delivers on our strategic ambitions.\"Boswell has also said work was under way to find a secure future for both organisations, saying: \"This is a pivotal moment for netball in Wales.\"We are working tirelessly, in collaboration with key stakeholders, to future-proof our sport and ensure that it continues to thrive - from grassroots to elite level. \"Throughout this process, the wellbeing of athletes and staff remain our number one priority and we are committed to transparency and communication with them through these next steps. \"We are grateful to the Welsh Government and Sport Wales for their continued support.\"",
        "When the 2026 season begins, it will be the second campaign since sweeping changes were made to the top level of the game in the UK.Last season was the NSL's first since being reduced from 10 to eight teams, which involved controversially cutting sides from Guildford, Bath and Worcester, plus Scotland's lone representative, Glasgow-based Strathclyde Sirens, while new teams were created in Nottingham and Birmingham.More than 50% of games were played in major arenas, with league officials saying there was a 42% rise in regular-season crowds. London Pulse secured their first NSL title as they beat Loughborough Lightning in the Grand Final held at the O2 Arena in London.The so-called NSL 2.0 era aimed to make the competition more professional, though not every player is full-time.The NSL signing window opened on 7 July and ran until 29 August, with each club having until 5 September to make public announcements of their signings. Each NSL squad is made up of 10 players.",
        "Attack: Georgia Rowe, Phillipa Yarranton, Niamh McCallMid-court: Khanyisa Chawane, Bethan Dyke, Vicky BoothDefence: Leah Middleton, Jacqui Newton, Alex Johnson, Ella Bowen",
        "Australian defender Jacqui Newton will return for a third season with Cardiff Dragons",
        "LexisNexis Cardiff Dragons have named their squad for next season's Netball Super League (NSL) campaign, despite facing an uncertain future due to funding concerns.",
        "The Welsh side finished bottom of the revamped NSL last season - winning only two of their 14 matches - and there are question marks about how robust the franchise's finances are.",
        "BBC Sport Wales has been told that players were informed in the off-season that they may not have had a team to play for next season if Dragons did not secure the required funding.",
        "That hurdle seems to have been overcome, in the short term at least, allowing Dragons to retain the bulk of the squad from last season - including key goal shooter Georgia Rowe, alongside international Welsh Feathers team-mates Bethan Dyke and Leah Middleton.",
        "New additions include Scotland goal attack or goal shooter Niamh McCall and defender Ella Bowen, who was at Leeds Rhinos last season.",
        "Australian goal defence or goalkeeper Jacqui Newton - who captained Dragons last campaign - returns for a third season in south Wales.",
        "But goalkeeper Celena Appleby-Prince has re-joined Loughborough Lightning, last season's NSL runners-up.",
        "Super League 2.0 - how has netball's relaunch gone?",
        "Pulse beat Lightning to win first Netball Super League title",
        "Moore leaves Welsh Netball and Cardiff Dragons role",
        "It has been a turbulent period on and off the court, with Wales Netball saying during the summer it had launched an \"urgent internal review and turnaround plan\" following \"a comprehensive review of historical finances and governance across both LexisNexis Cardiff Dragons and Wales Netball\".",
        "During that period, the majority of the Dragons' board resigned, while Sara Moore left as Dragons and Wales Netball head of performance.",
        "While Dragons struggled last season, it was not all doom and gloom for Welsh netball on the court with the national Feathers side reaching their highest ever world ranking of sixth last March following an undefeated 2024-2025 campaign.",
        "The Wales Netball and Cardiff Dragons chief executive, Sarah Boswell, said at the time that the success at international level should be used as a springboard to secure the future of netball in Wales.",
        "\"In 2025, I want to see a real acceleration in investment - financial, structural, and cultural - into the game,\" she said.",
        "Previous to a Wales Netball Extraordinary General Meeting (EGM) that was held on 30 July, the governing body's chair Cath Hares said: \"The Wales Netball board remains hopeful, through collaboration and shared commitment with our partners and stakeholders, that a positive route forward can be secured, which strengthens our financial position and delivers on our strategic ambitions.\"",
        "Boswell has also said work was under way to find a secure future for both organisations, saying: \"This is a pivotal moment for netball in Wales.",
        "\"We are working tirelessly, in collaboration with key stakeholders, to future-proof our sport and ensure that it continues to thrive - from grassroots to elite level.",
        "\"Throughout this process, the wellbeing of athletes and staff remain our number one priority and we are committed to transparency and communication with them through these next steps.",
        "\"We are grateful to the Welsh Government and Sport Wales for their continued support.\"",
        "When the 2026 season begins, it will be the second campaign since sweeping changes were made to the top level of the game in the UK.",
        "Last season was the NSL's first since being reduced from 10 to eight teams, which involved controversially cutting sides from Guildford, Bath and Worcester, plus Scotland's lone representative, Glasgow-based Strathclyde Sirens, while new teams were created in Nottingham and Birmingham.",
        "More than 50% of games were played in major arenas, with league officials saying there was a 42% rise in regular-season crowds.",
        "London Pulse secured their first NSL title as they beat Loughborough Lightning in the Grand Final held at the O2 Arena in London.",
        "The so-called NSL 2.0 era aimed to make the competition more professional, though not every player is full-time.",
        "The NSL signing window opened on 7 July and ran until 29 August, with each club having until 5 September to make public announcements of their signings. Each NSL squad is made up of 10 players.",
        "Attack: Georgia Rowe, Phillipa Yarranton, Niamh McCall",
        "Mid-court: Khanyisa Chawane, Bethan Dyke, Vicky Booth",
        "Defence: Leah Middleton, Jacqui Newton, Alex Johnson, Ella Bowen"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/netball/articles/c5y9de9l65lo",
      "main_category": "sport",
      "detailed_category": "netball",
      "topic": "Pulse beat Lightning to win first Netball Super League title",
      "content": [
        "London Pulse secured their first Netball Super League title and denied Loughborough Lightning an unprecedented three-peat with a thrilling 53-45 Grand Final win at the O2 Arena in London.Victory wraps up a magnificent treble for Sam Bird's side, who topped the regular season table and won the inaugural Netball Super Cup in March.The final whistle sparked wild celebrations from the majority of the 10,000 fans inside the venue, with the Pulse players embracing before sinking to the floor.Their victory was based on a solid defensive display by player of the match Funmi Fadoju, who ended with eight deflections, three intercepts and eight gains.The foundation set by Fadoju allowed Pulse to be aggressive and pushed Lightning back up the court, forcing the champions into uncharacteristic mistakes and restricting them to their lowest score of the season.Pulse never relinquished the lead after nudging in front inside the opening five minutes, resisting the challenge of an eager Lightning, and always looking to have another gear if required.Pulse's Gracie Smith, who was sitting her GCSE exams last month, was introduced at half-time to become the youngest player to feature in a Grand Final aged just 16.",
        "London Pulse defender and player of the match Funmi Fadoju: \"It feels so amazing. I am so proud of the girls. We went out there and did what we had to do.\"We knew exactly what our set-ups were, we knew we had to work together, and that's what we did.\"There's no words to describe it. I knew we could do it and we did.\"Pulse coach Sam Bird told Sky Sports: \"I'm so happy for the club, the girls, our sponsors, our fans. It is such a great day. It was such a hard game. It was like a game of chess. The strategy involved was really tough and I'm just really proud we got across the line.\"Loughborough head coach Vic Burgess: \"I'm pretty devastated. Credit to Pulse, they came out and did a great job. There was always going to be a massive battle and they came out on top. That's the nature of sport.\"",
        "It's been all Thunder and Lightning of late, with a Manchester and Loughborough duopoly of the NSL title over the past five seasons, but the clouds have broken and there's a new champion team in town. Just like this year, Pulse also topped the regular-season standings in 2023, but on that occasion the team from the Copper Box lost out to Loughborough in the Grand Final.This turning of the tables in British netball's biggest match means Pulse have become NSL champions within 10 years of the club's formation. At courtside, Pulse boss Bird - CEO and director of netball at the club - earns the success she has been craving since joining in May 2019 after a stint with Severn Stars. On the court, her players are richly deserved first-time winners.",
        "Most goals: Elmere van der Berg (Manchester Thunder) - 496 Most feeds: Bethan Dyke (Cardiff Dragons) - 465 Most super shots: Rolene Streutker (Nottingham Forest) - 157 Deflections: Funmi Fadoju (London Pulse) - 128",
        "Follow BBC Sport's netball coverage, with news, features and video clips",
        "This video can not be played",
        "London Pulse win first Netball Super League title",
        "London Pulse secured their first Netball Super League title and denied Loughborough Lightning an unprecedented three-peat with a thrilling 53-45 Grand Final win at the O2 Arena in London.",
        "Victory wraps up a magnificent treble for Sam Bird's side, who topped the regular season table and won the inaugural Netball Super Cup in March.",
        "The final whistle sparked wild celebrations from the majority of the 10,000 fans inside the venue, with the Pulse players embracing before sinking to the floor.",
        "Their victory was based on a solid defensive display by player of the match Funmi Fadoju, who ended with eight deflections, three intercepts and eight gains.",
        "The foundation set by Fadoju allowed Pulse to be aggressive and pushed Lightning back up the court, forcing the champions into uncharacteristic mistakes and restricting them to their lowest score of the season.",
        "Pulse never relinquished the lead after nudging in front inside the opening five minutes, resisting the challenge of an eager Lightning, and always looking to have another gear if required.",
        "Pulse's Gracie Smith, who was sitting her GCSE exams last month, was introduced at half-time to become the youngest player to feature in a Grand Final aged just 16.",
        "London Pulse defender and player of the match Funmi Fadoju: \"It feels so amazing. I am so proud of the girls. We went out there and did what we had to do.",
        "\"We knew exactly what our set-ups were, we knew we had to work together, and that's what we did.",
        "\"There's no words to describe it. I knew we could do it and we did.\"",
        "Pulse coach Sam Bird told Sky Sports: \"I'm so happy for the club, the girls, our sponsors, our fans. It is such a great day. It was such a hard game. It was like a game of chess. The strategy involved was really tough and I'm just really proud we got across the line.\"",
        "Loughborough head coach Vic Burgess: \"I'm pretty devastated. Credit to Pulse, they came out and did a great job. There was always going to be a massive battle and they came out on top. That's the nature of sport.\"",
        "It's been all Thunder and Lightning of late, with a Manchester and Loughborough duopoly of the NSL title over the past five seasons, but the clouds have broken and there's a new champion team in town. Just like this year, Pulse also topped the regular-season standings in 2023, but on that occasion the team from the Copper Box lost out to Loughborough in the Grand Final.",
        "This turning of the tables in British netball's biggest match means Pulse have become NSL champions within 10 years of the club's formation. At courtside, Pulse boss Bird - CEO and director of netball at the club - earns the success she has been craving since joining in May 2019 after a stint with Severn Stars. On the court, her players are richly deserved first-time winners.",
        "Most goals: Elmere van der Berg (Manchester Thunder) - 496",
        "Most feeds: Bethan Dyke (Cardiff Dragons) - 465",
        "Most super shots: Rolene Streutker (Nottingham Forest) - 157",
        "Deflections: Funmi Fadoju (London Pulse) - 128",
        "Super League 2.0 - how has netball's relaunch gone?",
        "'We were judged for wanting babies but I want mums on my team'",
        "Retiring Mentor upbeat about future of netball",
        "'Two concussions in a month was scary and it's why I'm retiring'",
        "How Panagarry turned career doubts into NSL titles",
        "'I was completely burnt out, I could not function'",
        "Panthers head coach Trip to leave at end of season",
        "'Netball? You mean football?' - Now I'm England men's netball captain",
        "England legend Mentor to retire at end of season",
        "Rhinos appeal to overturn Panthers defeat rejected",
        "Follow BBC Sport's netball coverage, with news, features and video clips"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/netball/articles/cr79009r9lko",
      "main_category": "sport",
      "detailed_category": "netball",
      "topic": "Super League 2.0 - how has netball's relaunch gone?",
      "content": [
        "A lick of paint or something more substantial? As the first Netball Super League season since its relaunch reaches a climax with Sunday's Grand Final, what has changed?Player pay rises averaging about 60% have only led a small contingent to commit to full-time professionalism.So where is the growth, where might it come next, and what else has been happening?Netball's big day out at the O2 in London offers a timely moment to examine how the professional side of the sport in the UK - specifically England and Wales - is evolving.",
        "Trimming the league from 10 to eight teams for this season involved controversially cutting sides from Guildford, Bath and Worcester, plus Scotland's lone representative, Glasgow-based Strathclyde Sirens.Teams sprung up in Nottingham and Birmingham - Forest and Panthers finishing fifth and sixth respectively - as the league looked to become a big-city operation, with its stronghold in England, given England Netball is the league's organiser.Loughborough Lightning are outliers in a sense - a university-based team with a long track record of success. Bath, also with university ties, enjoyed huge success before losing their place in the elite, but Loughborough surely have greater security. England Netball has its headquarters in the Leicestershire town, and the team continue to set high standards.A fifth consecutive appearance in the Grand Final - where first-time winners London Pulse narrowly denied them a title 'three-peat' - showed the Lightning team led by coach Vic Burgess remain an exemplar for league newcomers and established sides alike.",
        "The season's opening night served up a cruel reminder that netball players risk serious injury every time they take to the court.Teams are offering better training facilities and more opportunities to spend time in the gym, but women in sport remain far more susceptible to non-contact serious injuries than men. That was highlighted when London Mavericks' Vicki Oyesola crumpled to the court after landing a little awkwardly against Cardiff Dragons.It was the dreaded anterior cruciate ligament (ACL) knee injury, the bane of many a netballer's career - a season-ender on day one. NSL says women are six times more likely to sustain such a non-contact injury than men, while a National Ligament Registry study has shown there are only more ACLs suffered by women in skiing than in netball.More setbacks have followed, with Birmingham Panthers goal shooter Sigi Burger suffering a complete tear of her medial collateral ligament.Manchester Thunder captain Amy Carter, who is a junior doctor and missed the 2022 season with an ACL injury, explained to BBC Sport why netballers suffer so badly.\"It's a few different things. Your hips are a little bit wider, your knees are a bit closer together, you're more likely to do your ACL,\" Carter said. \"You've got the menstrual cycle to take into account, which can increase your risk when you're on your period. The nature of the game, the change of directions, the high impact, the stopping still straight away, that can also contribute to it.\"Research continues into how players might mitigate risk, but knees are not the only problem. Panthers' Gabby Marshall retired in May after a second concussion injury in a month.",
        "More than 50% of games have been played in major arenas this season and there has been a sharp climb in attendances.Average regular-season crowds have been estimated at about 1,500 in 2024, and league officials announced there was a 42% rise this year.For a first season of the so-called NSL 2.0 era, the rise signals strong progress.As an intriguing comparison, the first season of Women's Super League football following a similar reboot in 2014 resulted in average crowds of 728 (from 562 in 2013).",
        "The move to switch the Grand Final from Birmingham to London's O2 reflected an ambition to see netball played in the biggest possible indoor venues.The 'think big' approach has been clear all season and England Netball said ticket sales meant the season-ending showpiece would be the best-attended netball event in England since 2002.",
        "The introduction of a two-point super shot this season raised eyebrows.In play for the final five minutes of each quarter, NSL hoped it would lead to closer matches. There was also the prospect it could spark thrilling comebacks or blowout wins.Some players and coaches liked the idea, some did not. NSL has contentedly reported a 23% increase in games with less than a five-goal winning margin.Off the court, the Women's Sport Trust said NSL enjoyed a 524% increase in TikTok views amid a push to connect with potential new fan bases.But there are issues to examine, with video assistant referee (VAR) technology worthy of ongoing discussion.Leeds Rhinos were upset when they controversially lost to Birmingham Panthers in May.Rhinos were beaten 71-69 after extra time but felt they deserved the win in regulation time after what they believed was a two-point super shot was only credited as a one-point shot.Replays appeared to back up Rhinos' claims, but there was no immediate recourse without VAR, with league rules preventing the outcome of a match being altered after the event. All rather unsatisfactory, and food for thought for those pushing the sport forward.",
        "London Pulse finished top of the table in the regular season",
        "A lick of paint or something more substantial? As the first Netball Super League season since its relaunch reaches a climax with Sunday's Grand Final, what has changed?",
        "Player pay rises averaging about 60% have only led a small contingent to commit to full-time professionalism.",
        "So where is the growth, where might it come next, and what else has been happening?",
        "Netball's big day out at the O2 in London offers a timely moment to examine how the professional side of the sport in the UK - specifically England and Wales - is evolving.",
        "Pulse beat Lightning to win first Netball Super League title",
        "Trimming the league from 10 to eight teams for this season involved controversially cutting sides from Guildford, Bath and Worcester, plus Scotland's lone representative, Glasgow-based Strathclyde Sirens.",
        "Teams sprung up in Nottingham and Birmingham - Forest and Panthers finishing fifth and sixth respectively - as the league looked to become a big-city operation, with its stronghold in England, given England Netball is the league's organiser.",
        "Loughborough Lightning are outliers in a sense - a university-based team with a long track record of success.",
        "Bath, also with university ties, enjoyed huge success before losing their place in the elite, but Loughborough surely have greater security. England Netball has its headquarters in the Leicestershire town, and the team continue to set high standards.",
        "A fifth consecutive appearance in the Grand Final - where first-time winners London Pulse narrowly denied them a title 'three-peat' - showed the Lightning team led by coach Vic Burgess remain an exemplar for league newcomers and established sides alike.",
        "Newcomers Nottingham Forest did the double over high-flying near-neighbours Loughborough",
        "The season's opening night served up a cruel reminder that netball players risk serious injury every time they take to the court.",
        "Teams are offering better training facilities and more opportunities to spend time in the gym, but women in sport remain far more susceptible to non-contact serious injuries than men.",
        "That was highlighted when London Mavericks' Vicki Oyesola crumpled to the court after landing a little awkwardly against Cardiff Dragons.",
        "It was the dreaded anterior cruciate ligament (ACL) knee injury, the bane of many a netballer's career - a season-ender on day one.",
        "NSL says women are six times more likely to sustain such a non-contact injury than men, while a National Ligament Registry study has shown there are only more ACLs suffered by women in skiing than in netball.",
        "More setbacks have followed, with Birmingham Panthers goal shooter Sigi Burger suffering a complete tear of her medial collateral ligament.",
        "Manchester Thunder captain Amy Carter, who is a junior doctor and missed the 2022 season with an ACL injury, explained to BBC Sport why netballers suffer so badly.",
        "\"It's a few different things. Your hips are a little bit wider, your knees are a bit closer together, you're more likely to do your ACL,\" Carter said.",
        "\"You've got the menstrual cycle to take into account, which can increase your risk when you're on your period. The nature of the game, the change of directions, the high impact, the stopping still straight away, that can also contribute to it.\"",
        "Research continues into how players might mitigate risk, but knees are not the only problem. Panthers' Gabby Marshall retired in May after a second concussion injury in a month.",
        "Champions Lightning beat Thunder to reach Grand Final",
        "'We were judged for wanting babies but I want mums on my team'",
        "Plans for Netball World Cup every two years",
        "More than 50% of games have been played in major arenas this season and there has been a sharp climb in attendances.",
        "Average regular-season crowds have been estimated at about 1,500 in 2024, and league officials announced there was a 42% rise this year.",
        "For a first season of the so-called NSL 2.0 era, the rise signals strong progress.",
        "As an intriguing comparison, the first season of Women's Super League football following a similar reboot in 2014 resulted in average crowds of 728 (from 562 in 2013).",
        "The move to switch the Grand Final from Birmingham to London's O2 reflected an ambition to see netball played in the biggest possible indoor venues.",
        "The 'think big' approach has been clear all season and England Netball said ticket sales meant the season-ending showpiece would be the best-attended netball event in England since 2002.",
        "This video can not be played",
        "What is Netball Super League's new super shot?",
        "The introduction of a two-point super shot this season raised eyebrows.",
        "In play for the final five minutes of each quarter, NSL hoped it would lead to closer matches. There was also the prospect it could spark thrilling comebacks or blowout wins.",
        "Some players and coaches liked the idea, some did not. NSL has contentedly reported a 23% increase in games with less than a five-goal winning margin.",
        "Off the court, the Women's Sport Trust said NSL enjoyed a 524% increase in TikTok views amid a push to connect with potential new fan bases.",
        "But there are issues to examine, with video assistant referee (VAR) technology worthy of ongoing discussion.",
        "Leeds Rhinos were upset when they controversially lost to Birmingham Panthers in May.",
        "Rhinos were beaten 71-69 after extra time but felt they deserved the win in regulation time after what they believed was a two-point super shot was only credited as a one-point shot.",
        "Replays appeared to back up Rhinos' claims, but there was no immediate recourse without VAR, with league rules preventing the outcome of a match being altered after the event. All rather unsatisfactory, and food for thought for those pushing the sport forward.",
        "Retiring Mentor upbeat about future of netball",
        "'I was completely burnt out, I could not function'",
        "How can netball cash in on its grassroots support?"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/netball/articles/c4gd9432qljo",
      "main_category": "sport",
      "detailed_category": "netball",
      "topic": "'We were judged for wanting babies but I want mums on my team'",
      "content": [
        "Warning: This article contains discussion about miscarriage",
        "\"I want to be a mum more than anything, but it's just not on the cards for me.\"Nottingham Forest netball head coach Chelsea Pitman is telling BBC Sport about her difficult fertility journey.She is recalling the conversations and self-questioning that followed \"quite a few\" miscarriages.\"The future could be bright, who knows,\" she adds.That glimmer remains, but however Pitman's future plays out, she is determined that pregnancy and motherhood are never taboo topics in sport.The former England wing attack wants others to feel liberated to share their unspoken stories - whether those are first thoughts about having children, or the recounting of painful experiences such as her own.Pitman claims netball clubs have backed away in the past from players keen to become mothers and says this must stop.From her own seat of power at Forest, Pitman is ready to help future sporting mums, and hopes the rest of netball joins her.",
        "Looking back only a few years, Pitman points to negative attitudes towards players with maternal ambitions.She was reluctant to discuss her own wishes, or even the fact she had become pregnant, for fear of jeopardising her playing career.\"I like to think it's changed,\" Pitman says. \"Back then, absolutely not.\"You'd be judged by it, or if it came to contracts or recruitment, that's going to be at the forefront of coaches' minds in a high-performance environment: 'What, they want to have a baby?'\"Those conversations need to stop now. Hopefully they have stopped, but 100% back then I know I didn't want it to be common knowledge.\"At Forest, her attitude is welcoming to prospective parents.\"If you want to be a mum, that's amazing. But I want you as an athlete and you're not pregnant now - so come, I don't care,\" Pitman says.",
        "Pitman, 37, is the Diamond who became a Rose.Born in New South Wales, she won the 2011 World Cup with the Australia Diamonds before her father's English background enabled her to switch allegiances.In 2018, she helped the England Roses win Commonwealth Games gold on the Gold Coast, getting the better of Australia in the final.Pitman has travelled extensively in her netball career but has settled in Nottingham, where she has \"absolutely fallen in love with the city\".She guided Forest, in their debut season, to a creditable fifth place in the eight-team Netball Super League, and to a remarkable double over derby rivals and defending champions Loughborough Lightning.Pitman loves the \"muck-in mentality\" at Forest and works to fuel the culture.There are children around the club. Scotland international Iona Christian gave birth to son Lawrie in March 2024 before joining Forest.Pitman will often care for Lawrie while the squad are working hard in the gym.She was experiencing \"a flat day\" recently before Christian handed her Lawrie.\"He just brought me back down to earth and took the stress off me,\" Pitman says. \"It's been such breath of a fresh air. He's wonderful and everyone loves him.\"",
        "Pitman thought having a baby would \"be so easy\".She feels her body, which allowed her to achieve so much in netball, \"failed\" her when she needed it most.\"I was like, 'OK, my body allowed me to achieve everything there was to achieve in the sense of netball, but it hasn't allowed me to achieve the one thing that I really wanted',\" she says.One miscarriage came on England duty, shortly before Covid-19 triggered lockdowns.Pitman was close to the three-month pregnancy stage at which point many people share their news with friends and family.\"It was really tough,\" she recalls.A cruel twist of fate meant Pitman, who knew she was miscarrying, was selected by UK Anti-Doping for a post-match urine test.\"For people that don't know, you need to pee in a cup, and when you're miscarrying, obviously things are happening as well. I just remember looking at the team doctor, going, 'this is the worst week of my life',\" she says.Pitman urges anyone going through pregnancy loss to \"lean on the ones that you love\" rather than delay conversations.She elected to \"just put it somewhere and then deal with it later\".Eventually she told her story on social media and also spoke to BBC Sport about the toll of the lost pregnancies.Pitman found she was not alone. A wave of support followed.\"I was like, 'why do we keep this quiet?'\" she says.\"The amount of women that were like, 'oh my gosh, this has made me want to open up to my family and stuff'. It's sad, because it is quite a lonely place if you do what I did and just keep it in.\"",
        "Pitman remembers speaking with friends about whether she would choose another gold medal ahead of starting a family. The answer came easily.\"Like 100%, I want to be a mum more than anything, but it's just not on the cards for me,\" Pitman says.\"We don't know the future. The future could be bright, who knows, but that was probably the bit that I had to understand a little bit.\"Pitman gets \"goose bumps\" when she learns how other sports are helping women.WTA Tour tennis players wishing to freeze eggs or embryos, so they can start a family at a later date, will have their ranking protected in future. The tour has also introduced paid maternity leave.\"I truly hope we head down that path,\" Pitman says.Realistically, netball lacks the necessary financial resources though. The Super League relaunched in 2025 but remains semi-professional.\"Until we are able to full-time pay those girls or those women, we can't have those conversations about what maternity pay looks like and what support we can give in fertility options,\" Pitman says.For now, Pitman encourages players to back their instincts about whether to try for a baby.\"Life's too short,\" she says. \"You're old for a long period of time, so do whatever makes you happy.\"",
        "If you have been affected by issues in this story, BBC Action Line has details of available support",
        "This video can not be played",
        "'I pride myself on being honest' - Pitman on sharing her experiences of miscarriage",
        "Warning: This article contains discussion about miscarriage",
        "\"I want to be a mum more than anything, but it's just not on the cards for me.\"",
        "Nottingham Forest netball head coach Chelsea Pitman is telling BBC Sport about her difficult fertility journey.",
        "She is recalling the conversations and self-questioning that followed \"quite a few\" miscarriages.",
        "\"The future could be bright, who knows,\" she adds.",
        "That glimmer remains, but however Pitman's future plays out, she is determined that pregnancy and motherhood are never taboo topics in sport.",
        "The former England wing attack wants others to feel liberated to share their unspoken stories - whether those are first thoughts about having children, or the recounting of painful experiences such as her own.",
        "Pitman claims netball clubs have backed away in the past from players keen to become mothers and says this must stop.",
        "From her own seat of power at Forest, Pitman is ready to help future sporting mums, and hopes the rest of netball joins her.",
        "Follow BBC Sport's Women's Summer of Sport coverage. Video, 00:02:10Follow BBC Sport's Women's Summer of Sport coverage",
        "Why summer can be 'era-defining' for women's sport",
        "Looking back only a few years, Pitman points to negative attitudes towards players with maternal ambitions.",
        "She was reluctant to discuss her own wishes, or even the fact she had become pregnant, for fear of jeopardising her playing career.",
        "\"I like to think it's changed,\" Pitman says. \"Back then, absolutely not.",
        "\"You'd be judged by it, or if it came to contracts or recruitment, that's going to be at the forefront of coaches' minds in a high-performance environment: 'What, they want to have a baby?'",
        "\"Those conversations need to stop now. Hopefully they have stopped, but 100% back then I know I didn't want it to be common knowledge.\"",
        "At Forest, her attitude is welcoming to prospective parents.",
        "\"If you want to be a mum, that's amazing. But I want you as an athlete and you're not pregnant now - so come, I don't care,\" Pitman says.",
        "Pitman was a proud Commonwealth Games gold medallist with England",
        "Pitman, 37, is the Diamond who became a Rose.",
        "Born in New South Wales, she won the 2011 World Cup with the Australia Diamonds before her father's English background enabled her to switch allegiances.",
        "In 2018, she helped the England Roses win Commonwealth Games gold on the Gold Coast, getting the better of Australia in the final.",
        "Pitman has travelled extensively in her netball career but has settled in Nottingham, where she has \"absolutely fallen in love with the city\".",
        "She guided Forest, in their debut season, to a creditable fifth place in the eight-team Netball Super League, and to a remarkable double over derby rivals and defending champions Loughborough Lightning.",
        "Pitman loves the \"muck-in mentality\" at Forest and works to fuel the culture.",
        "There are children around the club. Scotland international Iona Christian gave birth to son Lawrie in March 2024 before joining Forest.",
        "Pitman will often care for Lawrie while the squad are working hard in the gym.",
        "She was experiencing \"a flat day\" recently before Christian handed her Lawrie.",
        "\"He just brought me back down to earth and took the stress off me,\" Pitman says.",
        "\"It's been such breath of a fresh air. He's wonderful and everyone loves him.\"",
        "Laura Kenny: Can elite sport damage women's fertility?",
        "The changing expectations of elite sports mothers",
        "'Improved support' offered to pregnant athletes - UK Sport",
        "Pitman thought having a baby would \"be so easy\".",
        "She feels her body, which allowed her to achieve so much in netball, \"failed\" her when she needed it most.",
        "\"I was like, 'OK, my body allowed me to achieve everything there was to achieve in the sense of netball, but it hasn't allowed me to achieve the one thing that I really wanted',\" she says.",
        "One miscarriage came on England duty, shortly before Covid-19 triggered lockdowns.",
        "Pitman was close to the three-month pregnancy stage at which point many people share their news with friends and family.",
        "\"It was really tough,\" she recalls.",
        "A cruel twist of fate meant Pitman, who knew she was miscarrying, was selected by UK Anti-Doping for a post-match urine test.",
        "\"For people that don't know, you need to pee in a cup, and when you're miscarrying, obviously things are happening as well. I just remember looking at the team doctor, going, 'this is the worst week of my life',\" she says.",
        "Pitman urges anyone going through pregnancy loss to \"lean on the ones that you love\" rather than delay conversations.",
        "She elected to \"just put it somewhere and then deal with it later\".",
        "Eventually she told her story on social media and also spoke to BBC Sport about the toll of the lost pregnancies.",
        "Pitman found she was not alone. A wave of support followed.",
        "\"I was like, 'why do we keep this quiet?'\" she says.",
        "\"The amount of women that were like, 'oh my gosh, this has made me want to open up to my family and stuff'. It's sad, because it is quite a lonely place if you do what I did and just keep it in.\"",
        "Pitman remembers speaking with friends about whether she would choose another gold medal ahead of starting a family. The answer came easily.",
        "\"Like 100%, I want to be a mum more than anything, but it's just not on the cards for me,\" Pitman says.",
        "\"We don't know the future. The future could be bright, who knows, but that was probably the bit that I had to understand a little bit.\"",
        "Pitman gets \"goose bumps\" when she learns how other sports are helping women.",
        "WTA Tour tennis players wishing to freeze eggs or embryos, so they can start a family at a later date, will have their ranking protected in future. The tour has also introduced paid maternity leave.",
        "\"I truly hope we head down that path,\" Pitman says.",
        "Realistically, netball lacks the necessary financial resources though. The Super League relaunched in 2025 but remains semi-professional.",
        "\"Until we are able to full-time pay those girls or those women, we can't have those conversations about what maternity pay looks like and what support we can give in fertility options,\" Pitman says.",
        "For now, Pitman encourages players to back their instincts about whether to try for a baby.",
        "\"Life's too short,\" she says. \"You're old for a long period of time, so do whatever makes you happy.\"",
        "If you have been affected by issues in this story, BBC Action Line has details of available support"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/netball/articles/cgjg47vw44lo",
      "main_category": "sport",
      "detailed_category": "netball",
      "topic": "Plans for Netball World Cup every two years",
      "content": [
        "World Netball has announced plans for the World Cup to take place every two years as they look to \"future-proof\" uncertainty around the Commonwealth Games.Netball has been an official Commonwealth Games sport since 1998 and has relied on the event to showcase the sport to a wider audience.The World Cup traditionally takes place on a four-year cycle with the next tournament set to be hosted in Australia in 2027.The long-term future of the Commonwealth Games is unclear after difficulties finding a host nation for the 2026 edition due to rising costs.World Netball also plans to introduce a men's World Cup competition.\"We need to be proactive about future-proofing ourselves given the uncertainty around the Commonwealth Games post 2026,\" World Netball CEO Fiona Harold said on the decision to switch the World Cup to a biennial event.\"These decisions allow us to control our destiny and it's positive news for everyone.\"As the International Federation, it is our job to sustain and grow the game over the long term.\"The governing body says all future World Cups will take place in November to allow for consistency and avoid disruption to domestic leagues.They are also launching a new biennial event from November 2028 that will take place in non-World Cup years.Australia won the bid to host the 2026 Commonwealth Games in Victoria but pulled out in July 2023 due to budget blowouts.Just a month later, the government of Alberta pulled its support for a bid to host the 2030 Commonwealth Games, citing rising costs.Glasgow has agreed to step in as host for next year's event but only after getting assurances they could run a scaled-down version, with 10 sports set to take place across four venues in the city.\"International netball has never been more competitive but the landscape is becoming increasingly complex to navigate,\" Harold added.\"World Netball needs to support its members and deliver solutions that mean everyone in the ecosystem benefits.\"Australia beat England in the final of the 2023 World Cup to claim a record-extending 12th title.",
        "The governing body says men's netball is \"gaining momentum rapidly\" and intends to support that growth by introducing a World Cup.England men played their first international match in October 2022, having been formed just seven months earlier.Australia, a dominant force in both men's and women's netball, has been running a men's and mixed netball championship for more than 40 years.New Zealand, the Caribbean and Americas regions all field men's national teams and clubs continue to emerge across Africa.\"The resounding feedback from many stakeholders across the game is that this is a really positive step, especially as we continue to strive and build our case for Olympic Games inclusion,\" Harold said.\"I have enjoyed engaging with men's netball groups over the past few months and we will continue to collaborate with them to help them realise their dream of seeing an inaugural men's Netball World Cup happen in the next few years.\"",
        "Australia beat England 61-45 in the final of the 2023 World Cup",
        "World Netball has announced plans for the World Cup to take place every two years as they look to \"future-proof\" uncertainty around the Commonwealth Games.",
        "Netball has been an official Commonwealth Games sport since 1998 and has relied on the event to showcase the sport to a wider audience.",
        "The World Cup traditionally takes place on a four-year cycle with the next tournament set to be hosted in Australia in 2027.",
        "The long-term future of the Commonwealth Games is unclear after difficulties finding a host nation for the 2026 edition due to rising costs.",
        "World Netball also plans to introduce a men's World Cup competition.",
        "\"We need to be proactive about future-proofing ourselves given the uncertainty around the Commonwealth Games post 2026,\" World Netball CEO Fiona Harold said on the decision to switch the World Cup to a biennial event.",
        "\"These decisions allow us to control our destiny and it's positive news for everyone.",
        "\"As the International Federation, it is our job to sustain and grow the game over the long term.\"",
        "The governing body says all future World Cups will take place in November to allow for consistency and avoid disruption to domestic leagues.",
        "They are also launching a new biennial event from November 2028 that will take place in non-World Cup years.",
        "Australia won the bid to host the 2026 Commonwealth Games in Victoria but pulled out in July 2023 due to budget blowouts.",
        "Just a month later, the government of Alberta pulled its support for a bid to host the 2030 Commonwealth Games, citing rising costs.",
        "Glasgow has agreed to step in as host for next year's event but only after getting assurances they could run a scaled-down version, with 10 sports set to take place across four venues in the city.",
        "\"International netball has never been more competitive but the landscape is becoming increasingly complex to navigate,\" Harold added.",
        "\"World Netball needs to support its members and deliver solutions that mean everyone in the ecosystem benefits.\"",
        "Australia beat England in the final of the 2023 World Cup to claim a record-extending 12th title.",
        "The governing body says men's netball is \"gaining momentum rapidly\" and intends to support that growth by introducing a World Cup.",
        "England men played their first international match in October 2022, having been formed just seven months earlier.",
        "Australia, a dominant force in both men's and women's netball, has been running a men's and mixed netball championship for more than 40 years.",
        "New Zealand, the Caribbean and Americas regions all field men's national teams and clubs continue to emerge across Africa.",
        "\"The resounding feedback from many stakeholders across the game is that this is a really positive step, especially as we continue to strive and build our case for Olympic Games inclusion,\" Harold said.",
        "\"I have enjoyed engaging with men's netball groups over the past few months and we will continue to collaborate with them to help them realise their dream of seeing an inaugural men's Netball World Cup happen in the next few years.\""
      ]
    },
    {
      "url": "https://www.bbc.com/sport/netball/articles/c0r1rpkendxo",
      "main_category": "sport",
      "detailed_category": "netball",
      "topic": "Retiring Mentor upbeat about future of netball",
      "content": [
        "Netball legend Geva Mentor says she is positive about the future of the sport after playing the final game of her career on Sunday.The 40-year-old retired after Leeds Rhinos' last game of the Netball Super League season - an 80-61 defeat by Nottingham Forest.\"I'm excited to see where netball goes over the next few years,\" the former England international told BBC Sport.\"We are looking at the improvement of the game and making it a real product that everyone can get behind.\"Netball Super League is in the early stages of a move towards a fully professional future.Most players still have jobs outside the sport, and the transition that began this season, with hefty pay rises for some, is widely seen as a 10-year project as the league looks to catch up with Australia's Super Netball.",
        "Mentor, who is now based in France, has been a trailblazer of the sport - playing more than 310 games at club level and twice being named the World's Best Netballer.She spent 16 seasons playing in New Zealand and Australia and played 175 times for her country, competing at six World Cups and six Commonwealth Games, winning gold in 2018 thanks to the famous win over Australia.She joined the Rhinos for the 2024 season and, although she was unable to end on a winning note, received a warm reception at Motorpoint Arena in Nottingham - which included being given a guard of honour after the game.\"We probably haven't had the results or performances we wanted this season,\" she added. \"But there is a brilliant culture here and it's pushing and building.\"I wish them all the best for the future and I will be in the crowd cheering them on.\"This is all a bit surreal but it is so nice to be playing in a big arena and good to be up against Forest, who have had a stellar first season and have grown into it.\"",
        "This video can not be played",
        "'Excited to see where netball can go' - Mentor on retirement after lengthy career",
        "Netball legend Geva Mentor says she is positive about the future of the sport after playing the final game of her career on Sunday.",
        "The 40-year-old retired after Leeds Rhinos' last game of the Netball Super League season - an 80-61 defeat by Nottingham Forest.",
        "\"I'm excited to see where netball goes over the next few years,\" the former England international told BBC Sport.",
        "\"We are looking at the improvement of the game and making it a real product that everyone can get behind.\"",
        "Netball Super League is in the early stages of a move towards a fully professional future.",
        "Most players still have jobs outside the sport, and the transition that began this season, with hefty pay rises for some, is widely seen as a 10-year project as the league looks to catch up with Australia's Super Netball.",
        "England legend Mentor to retire at end of season",
        "'I feel happy and content' - Mentor on retirement",
        "Pulse secure Netball Super League top spot - what happens next?",
        "Mentor, who is now based in France, has been a trailblazer of the sport - playing more than 310 games at club level and twice being named the World's Best Netballer.",
        "She spent 16 seasons playing in New Zealand and Australia and played 175 times for her country, competing at six World Cups and six Commonwealth Games, winning gold in 2018 thanks to the famous win over Australia.",
        "She joined the Rhinos for the 2024 season and, although she was unable to end on a winning note, received a warm reception at Motorpoint Arena in Nottingham - which included being given a guard of honour after the game.",
        "\"We probably haven't had the results or performances we wanted this season,\" she added. \"But there is a brilliant culture here and it's pushing and building.",
        "\"I wish them all the best for the future and I will be in the crowd cheering them on.",
        "\"This is all a bit surreal but it is so nice to be playing in a big arena and good to be up against Forest, who have had a stellar first season and have grown into it.\"",
        "Watch the full game and reaction: Netball Super League - Nottingham Forest v Leeds Rhinos"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/netball/articles/c20n9prpvreo",
      "main_category": "sport",
      "detailed_category": "netball",
      "topic": "'Netball? You mean football?' - Now I'm England men's netball captain",
      "content": [
        "Joining a men's netball club in England was not easy for James Thomson-Boston when he moved over from Australia nine years ago.\"When I came here I wanted to join a men's netball team, and everyone was like, 'Oh, I think you mean football?' - I was like, 'No, I mean netball',\" the 32-year-old told BBC Sport.Now, he captains the England men's team and led his side out at London's Copper Box on Sunday for game one in a three-match international series against Australia.\"Netball has always been something your sister played, or the girls played at school, or a sport you were forced to play when you were like 12,\" Thomson-Boston said.But in his experience, that's changing.Certainly his England side gave a good account of themselves in their first match of the series against the Kelpies.Although they suffered a 63-34 loss, it was a much narrower margin of defeat aganst the most dominant side in men's international netball than in their last meeting.",
        "The England men's team, or the England Thorns, played their first international match in October 2022, after being formed just seven months earlier.They were defeated by hosts Australia 73-27 but it was a landmark moment for men's netball back home.\"We didn't get people saying 'Oh God, you got beaten by 60 goals'. People were like, 'It was really impressive to see you go out there, and show that the UK is developing in the netball world',\" Thomson-Boston said.Since that tour, male participation in netball has more than tripled in England. There are now over 70 clubs across the UK offering men's and mixed teams.The England Men's and Mixed Netball Association, EMMNA, is looking to expand its National Championships given the increasing demand from clubs to be involved.There were 14 teams involved in the first men's and mixed National Championships in 2021. This year, they have 48 teams competing, with a further 10 on a waiting list.The men's game continues to grow around the world.Australia, a dominant force in both men's and women's netball, has been running a Men's and Mixed Netball Championship for more than 40 years.\"People [in Australia] are encouraged from a young age to play the sport and to really see it as a viable option\", Thomson-Boston said.New Zealand, the Caribbean and Americas regions all field men's national teams, and clubs continue to emerge across Africa.",
        "Ryan Allan, president and founder of the volunteer-run organisation EMMNA, believes the biggest barrier to the growth of men's netball in England is funding.All the athletes in the England men's team are self-funded, with Thomson-Boston saying they play \"for the pride\" and \"to further the sport\".Allan identifies boys aged between 11 to 16 as those who tend to have limited opportunities to continue playing because of a lack of school-based netball programmes or pathways.Then there is the stigma of netball being a sport \"that the girls played at school\", which Thomson-Boston believes is changing.\"Less people are coming up to me and saying, 'Oh, I thought that [netball] was for girls',\" he said. \"More people are saying, 'Oh, you can play netball, you can play men's netball and you play for England'.\"",
        "The narrative of women's sport fighting for recognition in a historically male-dominated space is a familiar one.But for netball, it is quite the opposite position.The women's game is supporting growth in the men's ranks, with the Netball Super League teams  the elite women's clubs in England  welcoming England men's players as training partners.The benefits are mutual.London Pulse head coach Sam Bird, with whose Super League team Thomson-Boston trains, said: \"The men play a slightly different form of the game, so it's quite good for challenging us.\"If you've been playing netball as a female, coming up through the ranks, you tend to sort of play in one style. The men create an unpredictable style for us, and the girls really enjoy training against that sort of unpredictability.\"Pulse defender Darcie Everitt added: \"They bring a lot of strength and they also play really, really fast. As a defender, it's good to practise against that style of play. They push us even further.\"The men's matches against Australia are being promoted as double-headers with Super League matches, where fans can watch both the England men and a Super League women's match with a single ticket.Game 1  Sunday 25 May, 15:30 BST - England v Australia, double-header with London Pulse v Birmingham PanthersGame 2 - Saturday 31 May, 12:00 BST - England v Australia, double-header with Loughborough Lightning v Nottingham ForestGame 3 - Sunday 1 June, 15:30 BST - England v Australia, double-header with London Pulse v Leeds Rhinos",
        "As men's netball continues to develop, protecting the sport's identity as a traditionally female-led sport has become a key part of that journey, Thomson-Boston said.\"This was a female-led space that was for females, aimed at females,\" he said. \"We aren't coming in to dominate that space. We just want to increase the amount of people who can see the sport\".\"Because it's a female-led sport, you are always surrounded by this really inclusive feminine energy, I think, and they are the ones welcoming people in.\"",
        "There has never been a men's netball World Cup - but there are ongoing discussions around a potential launch in 2027, the same year of the women's Netball World Cup in Sydney.Could a men's World Cup run alongside the women's edition?\"The end goal would be that it runs in tandem. Everyone is in the same area, all the same energy, bringing all the netball noise!\" Thomson-Boston said.As for the Olympics, netball has yet to make its debut.\"The bigger we can make it in the next couple of years, the more chance we're going to make it to the Olympics,\" Thomson-Boston said. \"I don't think my knees will survive until then, but who knows!\"",
        "Joining a men's netball club in England was not easy for James Thomson-Boston when he moved over from Australia nine years ago.",
        "\"When I came here I wanted to join a men's netball team, and everyone was like, 'Oh, I think you mean football?' - I was like, 'No, I mean netball',\" the 32-year-old told BBC Sport.",
        "Now, he captains the England men's team and led his side out at London's Copper Box on Sunday for game one in a three-match international series against Australia.",
        "\"Netball has always been something your sister played, or the girls played at school, or a sport you were forced to play when you were like 12,\" Thomson-Boston said.",
        "But in his experience, that's changing.",
        "Certainly his England side gave a good account of themselves in their first match of the series against the Kelpies.",
        "Although they suffered a 63-34 loss, it was a much narrower margin of defeat aganst the most dominant side in men's international netball than in their last meeting.",
        "The England men's team, or the England Thorns, played their first international match in October 2022, after being formed just seven months earlier.",
        "They were defeated by hosts Australia 73-27 but it was a landmark moment for men's netball back home.",
        "\"We didn't get people saying 'Oh God, you got beaten by 60 goals'. People were like, 'It was really impressive to see you go out there, and show that the UK is developing in the netball world',\" Thomson-Boston said.",
        "Since that tour, male participation in netball has more than tripled in England. There are now over 70 clubs across the UK offering men's and mixed teams.",
        "The England Men's and Mixed Netball Association, EMMNA, is looking to expand its National Championships given the increasing demand from clubs to be involved.",
        "There were 14 teams involved in the first men's and mixed National Championships in 2021. This year, they have 48 teams competing, with a further 10 on a waiting list.",
        "The men's game continues to grow around the world.",
        "Australia, a dominant force in both men's and women's netball, has been running a Men's and Mixed Netball Championship for more than 40 years.",
        "\"People [in Australia] are encouraged from a young age to play the sport and to really see it as a viable option\", Thomson-Boston said.",
        "New Zealand, the Caribbean and Americas regions all field men's national teams, and clubs continue to emerge across Africa.",
        "In 2024, the England men toured St Kitts and Nevis, playing in the Americas Netball Men's Championships",
        "Ryan Allan, president and founder of the volunteer-run organisation EMMNA, believes the biggest barrier to the growth of men's netball in England is funding.",
        "All the athletes in the England men's team are self-funded, with Thomson-Boston saying they play \"for the pride\" and \"to further the sport\".",
        "Allan identifies boys aged between 11 to 16 as those who tend to have limited opportunities to continue playing because of a lack of school-based netball programmes or pathways.",
        "Then there is the stigma of netball being a sport \"that the girls played at school\", which Thomson-Boston believes is changing.",
        "\"Less people are coming up to me and saying, 'Oh, I thought that [netball] was for girls',\" he said. \"More people are saying, 'Oh, you can play netball, you can play men's netball and you play for England'.\"",
        "The narrative of women's sport fighting for recognition in a historically male-dominated space is a familiar one.",
        "But for netball, it is quite the opposite position.",
        "The women's game is supporting growth in the men's ranks, with the Netball Super League teams  the elite women's clubs in England  welcoming England men's players as training partners.",
        "The benefits are mutual.",
        "London Pulse head coach Sam Bird, with whose Super League team Thomson-Boston trains, said: \"The men play a slightly different form of the game, so it's quite good for challenging us.",
        "\"If you've been playing netball as a female, coming up through the ranks, you tend to sort of play in one style. The men create an unpredictable style for us, and the girls really enjoy training against that sort of unpredictability.\"",
        "Pulse defender Darcie Everitt added: \"They bring a lot of strength and they also play really, really fast. As a defender, it's good to practise against that style of play. They push us even further.\"",
        "The men's matches against Australia are being promoted as double-headers with Super League matches, where fans can watch both the England men and a Super League women's match with a single ticket.",
        "Game 1  Sunday 25 May, 15:30 BST - England v Australia, double-header with London Pulse v Birmingham Panthers",
        "Game 2 - Saturday 31 May, 12:00 BST - England v Australia, double-header with Loughborough Lightning v Nottingham Forest",
        "Game 3 - Sunday 1 June, 15:30 BST - England v Australia, double-header with London Pulse v Leeds Rhinos",
        "For the 2025 season, six Super League teams were working with male training partners",
        "As men's netball continues to develop, protecting the sport's identity as a traditionally female-led sport has become a key part of that journey, Thomson-Boston said.",
        "\"This was a female-led space that was for females, aimed at females,\" he said. \"We aren't coming in to dominate that space. We just want to increase the amount of people who can see the sport\".",
        "\"Because it's a female-led sport, you are always surrounded by this really inclusive feminine energy, I think, and they are the ones welcoming people in.\"",
        "There has never been a men's netball World Cup - but there are ongoing discussions around a potential launch in 2027, the same year of the women's Netball World Cup in Sydney.",
        "Could a men's World Cup run alongside the women's edition?",
        "\"The end goal would be that it runs in tandem. Everyone is in the same area, all the same energy, bringing all the netball noise!\" Thomson-Boston said.",
        "As for the Olympics, netball has yet to make its debut.",
        "\"The bigger we can make it in the next couple of years, the more chance we're going to make it to the Olympics,\" Thomson-Boston said. \"I don't think my knees will survive until then, but who knows!\"",
        "'Two concussions in a month was scary and it's why I'm retiring'",
        "'I was completely burnt out, I could not function'",
        "How Panagarry turned career doubts into NSL titles"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/netball/articles/c77n74d6mzeo",
      "main_category": "sport",
      "detailed_category": "netball",
      "topic": "'Two concussions in a month was scary and it's why I'm retiring'",
      "content": [
        "Gabby Marshall was on a spinal board in the back of a West Midlands ambulance when it dawned on her - through the fog of a second concussion in a month - that this might be the injury that would end her sporting career.On Tuesday morning she made it official.After three weeks of severe headaches and discombobulating fatigue, the 29-year-old captain of Birmingham Panthers kissed goodbye to her life in netball at a tearful team meeting, concluding there was no other choice she could have made.It was not how \"devastated\" Marshall envisaged the first year of Netball Super League's much-vaunted professional era turning out for her.Rather this, though, than a worst-case scenario further down the line.She told BBC Sport: \"I dread to think, after a rest period and recovery for this one, if I was to then step on court again and be in the same situation again.\"I dread to think of the symptoms I would have because this one has been quite scary and quite difficult.\"It's a tricky decision to come to because you never want your career to end like this.\"Marshall was concussed for the first time this season in Birmingham's opening game against Leeds Rhinos on 14 March.It left her feeling nauseous for days, but she completed return to play protocols and was feeling fine when she lined up to face leaders London Pulse on 13 April, only for a collision in the third quarter to end her game and ultimately her life as a professional athlete.Marshall was attempting to catch a pass when she collided with Pulse goalkeeper Darcie Everitt and hit the deck, the back of her head banging against the court at Worcester Arena.The match was paused for 20 minutes as Marshall was treated and taken away to hospital for checks and a CT scan.Those showed up clear, but Marshall has endured a dismal time since.She is seeing a neurological physiotherapist as she looks to lead a normal life again.\"I was quite unwell for the first 10 days or so, not really able to do very much, and I'm not back to normal yet but I'm better than I was,\" she said.She recalls being in the ambulance, helpless.\"You think, 'oh wow, I've just had one particularly big head knock and now the second one',\" said Marshall.\"I've got a medical background from studying physiotherapy at university, so I was well aware of the dangers of having two concussions quite close together.\"I've had a couple earlier in my career as well, so I was quite aware it's a very serious injury. I had an MRI yesterday.\"There's a misconception with concussions where perhaps people think it's a little bang to the head and you're going to be OK afterwards.\"Hopefully I do make a full recovery, but this one's been quite scary.\"There's been quite a lot of fairly severe headaches, intense pressure in the head, unable to look at any screens, read anything.\"I've been sleeping 12 hours at night, then I'd go and sit downstairs for 10 or 15 minutes and would fall asleep for three hours. Crazy exhaustion.\"",
        "The Mancunian, who played at centre and wing defence, is described on her Panthers profile as the team's \"beating heart\".Previously with Manchester Thunder and Severn Stars, she represented England at youth level.Injuries to both ankles waylaid her in the past, but not like the concussions.Athletes in other sports, such as football, rugby, boxing and American football, have suffered long-term damage to the brain through repeated head trauma.\"With this, you're a bit of a prisoner to your own brain. You can't read a book, or you can't go out to a coffee shop because it's too over-stimulating,\" Marshall said.\"That's the scary nature of this injury and why I've come to this decision.\"I told the girls this morning at training and it was quite emotional. I'm devastated.\"What comes next for a woman who had been all in on netball, relishing being at the domestic pinnacle of a sport that has plans for large-scale growth in the next decade?\"I don't really know,\" she said. \"I'm sure as one door closes, another will open.\"Marshall doesn't harbour any ill feeling towards Everitt, who was given a two-minute penalty following the collision.\"I've had communication with Darcie since the incident. She was going for the ball and it's one of those things. It happens,\" Marshall said.\"I was quite unlucky to be on the receiving end of two of those this season, but it's the nature of the game unfortunately.\"",
        "Gabby Marshall made her top-flight netball debut in 2013",
        "Gabby Marshall was on a spinal board in the back of a West Midlands ambulance when it dawned on her - through the fog of a second concussion in a month - that this might be the injury that would end her sporting career.",
        "On Tuesday morning she made it official.",
        "After three weeks of severe headaches and discombobulating fatigue, the 29-year-old captain of Birmingham Panthers kissed goodbye to her life in netball at a tearful team meeting, concluding there was no other choice she could have made.",
        "It was not how \"devastated\" Marshall envisaged the first year of Netball Super League's much-vaunted professional era turning out for her.",
        "Rather this, though, than a worst-case scenario further down the line.",
        "She told BBC Sport: \"I dread to think, after a rest period and recovery for this one, if I was to then step on court again and be in the same situation again.",
        "\"I dread to think of the symptoms I would have because this one has been quite scary and quite difficult.",
        "\"It's a tricky decision to come to because you never want your career to end like this.\"",
        "Marshall was concussed for the first time this season in Birmingham's opening game against Leeds Rhinos on 14 March.",
        "It left her feeling nauseous for days, but she completed return to play protocols and was feeling fine when she lined up to face leaders London Pulse on 13 April, only for a collision in the third quarter to end her game and ultimately her life as a professional athlete.",
        "Marshall was attempting to catch a pass when she collided with Pulse goalkeeper Darcie Everitt and hit the deck, the back of her head banging against the court at Worcester Arena.",
        "The match was paused for 20 minutes as Marshall was treated and taken away to hospital for checks and a CT scan.",
        "Those showed up clear, but Marshall has endured a dismal time since.",
        "She is seeing a neurological physiotherapist as she looks to lead a normal life again.",
        "\"I was quite unwell for the first 10 days or so, not really able to do very much, and I'm not back to normal yet but I'm better than I was,\" she said.",
        "She recalls being in the ambulance, helpless.",
        "\"You think, 'oh wow, I've just had one particularly big head knock and now the second one',\" said Marshall.",
        "\"I've got a medical background from studying physiotherapy at university, so I was well aware of the dangers of having two concussions quite close together.",
        "\"I've had a couple earlier in my career as well, so I was quite aware it's a very serious injury. I had an MRI yesterday.",
        "\"There's a misconception with concussions where perhaps people think it's a little bang to the head and you're going to be OK afterwards.",
        "\"Hopefully I do make a full recovery, but this one's been quite scary.",
        "\"There's been quite a lot of fairly severe headaches, intense pressure in the head, unable to look at any screens, read anything.",
        "\"I've been sleeping 12 hours at night, then I'd go and sit downstairs for 10 or 15 minutes and would fall asleep for three hours. Crazy exhaustion.\"",
        "Brain-cooling treatment for concussion trialled",
        "Sport concussion guidance to require 24-hour rest",
        "FA knew of concussion dangers in 1983, say ex-players",
        "The Mancunian, who played at centre and wing defence, is described on her Panthers profile as the team's \"beating heart\".",
        "Previously with Manchester Thunder and Severn Stars, she represented England at youth level.",
        "Injuries to both ankles waylaid her in the past, but not like the concussions.",
        "Athletes in other sports, such as football, rugby, boxing and American football, have suffered long-term damage to the brain through repeated head trauma.",
        "\"With this, you're a bit of a prisoner to your own brain. You can't read a book, or you can't go out to a coffee shop because it's too over-stimulating,\" Marshall said.",
        "\"That's the scary nature of this injury and why I've come to this decision.",
        "\"I told the girls this morning at training and it was quite emotional. I'm devastated.\"",
        "What comes next for a woman who had been all in on netball, relishing being at the domestic pinnacle of a sport that has plans for large-scale growth in the next decade?",
        "\"I don't really know,\" she said. \"I'm sure as one door closes, another will open.\"",
        "Marshall doesn't harbour any ill feeling towards Everitt, who was given a two-minute penalty following the collision.",
        "\"I've had communication with Darcie since the incident. She was going for the ball and it's one of those things. It happens,\" Marshall said.",
        "\"I was quite unlucky to be on the receiving end of two of those this season, but it's the nature of the game unfortunately.\"",
        "Rhinos bid to overturn Super League defeat",
        "How Panagarry turned career doubts into NSL titles",
        "'I was completely burnt out, I could not function'"
      ]
    }
  ]
}