{
  "scraped_at": "2025-10-27T18:56:59.791546",
  "total_articles": 23,
  "category": "golf",
  "articles_per_category": 100,
  "articles": [
    {
      "url": "https://www.bbc.com/sport/golf/articles/c20p1xzgrxko",
      "main_category": "sport",
      "detailed_category": "golf",
      "topic": "Canter sinks 100ft putt as Lee wins in South Korea",
      "content": [
        "DP World Genesis Championship - final round-11 Junghwan Lee (Kor);  -8 Nacho Elvira (Spa), Laurie Canter (Eng); -7 Andrea Pavan (Ita), Andy Sullivan (Eng), Yuto Katsuragawa (Jpn)Selected others: -4 Alex Fitzpatrick (Eng), Scott Jamieson (Sco), Calum Hill (Sco); -3 Adam Scott (Aus), Ben Schmidt (Eng), Marcus Armitage (Eng)Full leaderboard",
        "England's Laurie Canter sank a 100-foot eagle putt on the 18th hole as he finished in a tie for second at the Genesis Championship in South Korea.The 35-year-old's incredible final putt helped him finish alongside Spain's Nacho Elvira on eight under in Cheonan - three shots behind home winner Jung-Hwan Lee.Patrick Fishburn's 106-foot putt at the Texas Open in April is the longest in a major professional tournament in 2025.Elvira, who shared the third-round lead with Sweden's Mikael Lindberg, headed into the back nine in front, but bogeys at the 11th and 17th proved costly.South Korea's Lee fired a superb seven-under final round of 64 which meant Elvira need an eagle on the 18th to force a play-off, but he sent his second shot into the water to end any hopes.Canter's final round score of 67 included three birdies, with fellow Englishman Andy Sullivan finishing tied for fourth after a final-round 70.\"This was my best round, especially as the gallery out there were really cheering for me. They gave me the strength I needed,\" Lee told Sky Sports.\"I just hope I can live up to their expectations in the future as well.\"",
        "Laurie Canter has won three times as a professional",
        "DP World Genesis Championship - final round",
        "-11 Junghwan Lee (Kor);  -8 Nacho Elvira (Spa), Laurie Canter (Eng); -7 Andrea Pavan (Ita), Andy Sullivan (Eng), Yuto Katsuragawa (Jpn)",
        "Selected others: -4 Alex Fitzpatrick (Eng), Scott Jamieson (Sco), Calum Hill (Sco); -3 Adam Scott (Aus), Ben Schmidt (Eng), Marcus Armitage (Eng)",
        "England's Laurie Canter sank a 100-foot eagle putt on the 18th hole as he finished in a tie for second at the Genesis Championship in South Korea.",
        "The 35-year-old's incredible final putt helped him finish alongside Spain's Nacho Elvira on eight under in Cheonan - three shots behind home winner Jung-Hwan Lee.",
        "Patrick Fishburn's 106-foot putt at the Texas Open in April is the longest in a major professional tournament in 2025.",
        "Elvira, who shared the third-round lead with Sweden's Mikael Lindberg, headed into the back nine in front, but bogeys at the 11th and 17th proved costly.",
        "South Korea's Lee fired a superb seven-under final round of 64 which meant Elvira need an eagle on the 18th to force a play-off, but he sent his second shot into the water to end any hopes.",
        "Canter's final round score of 67 included three birdies, with fellow Englishman Andy Sullivan finishing tied for fourth after a final-round 70.",
        "\"This was my best round, especially as the gallery out there were really cheering for me. They gave me the strength I needed,\" Lee told Sky Sports.",
        "\"I just hope I can live up to their expectations in the future as well.\""
      ]
    },
    {
      "url": "https://www.bbc.com/sport/golf/articles/c4gw6g780zro",
      "main_category": "sport",
      "detailed_category": "golf",
      "topic": "Hull helps World team finish third in team event",
      "content": [
        "England's Charley Hull and New Zealand's Lydia Ko won their singles matches to help the World team beat Japan and finish third at the LPGA Tour's International Crown tournament.Australia stunned the United States in the final to win the biennial competition for the first time.World number three Minjee Lee beat Angel Yin and Hannah Green defeated Yealimi Noh in their singles matches.The tournament brings together seven national teams and the World team, each made up of four players who participate in the matchplay event, with a total prize pot of $2m (£1,502,855).\"I'm so happy that I could do it with these girls, it was just a lot of fun this whole week,\" three-time major winner Lee said.\"Playing matchplay is something different and we don't get to do it too often.\"Australia beat the World team in Sunday's semi-finals while the USA defeated Japan.Thailand, China, South Korea and Sweden were eliminated in the pool stage.",
        "England's Charley Hull won her singles match to help the World team beat Japan",
        "England's Charley Hull and New Zealand's Lydia Ko won their singles matches to help the World team beat Japan and finish third at the LPGA Tour's International Crown tournament.",
        "Australia stunned the United States in the final to win the biennial competition for the first time.",
        "World number three Minjee Lee beat Angel Yin and Hannah Green defeated Yealimi Noh in their singles matches.",
        "The tournament brings together seven national teams and the World team, each made up of four players who participate in the matchplay event, with a total prize pot of $2m (£1,502,855).",
        "\"I'm so happy that I could do it with these girls, it was just a lot of fun this whole week,\" three-time major winner Lee said.",
        "\"Playing matchplay is something different and we don't get to do it too often.\"",
        "Australia beat the World team in Sunday's semi-finals while the USA defeated Japan.",
        "Thailand, China, South Korea and Sweden were eliminated in the pool stage."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/golf/articles/cp3xnq9k29no",
      "main_category": "sport",
      "detailed_category": "golf",
      "topic": "How shinty mindset helped MacIntyre in Ryder Cup win",
      "content": [
        "Bob MacIntyre admits his shinty experience helped steady him as he thought he was about to lose the Ryder Cup for Europe last month.It had looked like Europe would thump the USA in New York, but the hosts fought back strongly on the final day, before the visitors finally secured the win through Tyrell Hatton's point.MacIntyre was last out for the Europeans and as the day wore on, it looked increasingly likely the Cup could come down to the last match.\"It was horrible,\" the world number eight told BBC Radio Scotland's The Saturday Show. \"There's no vice-captains, there's nobody walking with you apart from your family, friends, your partners. \"You feel as though it's you and your caddie against America. When I teed off, I thought 'this is going to be over by the time I get to the eighth', there was so much blue on the board.\"I got to eight or nine, and the main difference is just it's very even, but there's more red now. The matches going down the 18th kept flipping to red and I thought 'this is tight now'. It felt like 'this could come down to your match'.\"I missed the putt on the 15th and I honestly thought 'I'm going to lose the Ryder Cup for us'.\"I did the exact same thing in Rome, missed a putt on 14 and thought the exact same thing - I've lost the Ryder Cup.\"However, MacIntyre was able to rely on a mindset learned from the game he grew up playing back in Oban - shinty.\"I just thought 'what would I do in a game of shinty when they score a goal in the 80th minute to go 1-0 up?',\" he said. \"You can't just put your head down and give up. You've still got 10 minutes to come back, same in football.\"",
        "MacIntyre has now played a part in Ryder Cup victories in both Europe and America and the 29-year-old acknowledged that he is close to achieving everything he wants in the game.\"To win two, one at home and one away, it's what dreams are made of,\" he said. \"I've literally got one more thing to achieve in the game of golf and that's win a major championship.\"Then I can walk away from the game of golf thinking I've done everything I dreamed of as a kid.\"And, as usual, MacIntyre played a big part in the celebrations. As videos from the Team Europe bus emerged on social media, he was central to the action with another rendition of The Proclaimers' I'm Gonna Be (500 Miles) added to the annals.\"I wish I was on that bus again right now,\" he reminisced. \"It was amazing, some of the boys were flying before we even got on the bus, because their games finished sooner. \"Everything that was happening that day was a bit of carnage. When you're on those buses, like any sport and when it's an away game, especially being from where I'm from, the away trips are long - two and a half hours at least - so the journey home is always the best part after a win. \"The journey home on the bus from Rome was special but the journey back to the hotel in New York was... I don't know if anything is ever going to top that. It was outrageous.\"",
        "Bob MacIntyre admits his shinty experience helped steady him as he thought he was about to lose the Ryder Cup for Europe last month.",
        "It had looked like Europe would thump the USA in New York, but the hosts fought back strongly on the final day, before the visitors finally secured the win through Tyrell Hatton's point.",
        "MacIntyre was last out for the Europeans and as the day wore on, it looked increasingly likely the Cup could come down to the last match.",
        "\"It was horrible,\" the world number eight told BBC Radio Scotland's The Saturday Show. \"There's no vice-captains, there's nobody walking with you apart from your family, friends, your partners.",
        "\"You feel as though it's you and your caddie against America. When I teed off, I thought 'this is going to be over by the time I get to the eighth', there was so much blue on the board.",
        "\"I got to eight or nine, and the main difference is just it's very even, but there's more red now. The matches going down the 18th kept flipping to red and I thought 'this is tight now'. It felt like 'this could come down to your match'.",
        "\"I missed the putt on the 15th and I honestly thought 'I'm going to lose the Ryder Cup for us'.",
        "\"I did the exact same thing in Rome, missed a putt on 14 and thought the exact same thing - I've lost the Ryder Cup.\"",
        "However, MacIntyre was able to rely on a mindset learned from the game he grew up playing back in Oban - shinty.",
        "\"I just thought 'what would I do in a game of shinty when they score a goal in the 80th minute to go 1-0 up?',\" he said.",
        "\"You can't just put your head down and give up. You've still got 10 minutes to come back, same in football.\"",
        "MacIntyre has now played a part in Ryder Cup victories in both Europe and America and the 29-year-old acknowledged that he is close to achieving everything he wants in the game.",
        "\"To win two, one at home and one away, it's what dreams are made of,\" he said. \"I've literally got one more thing to achieve in the game of golf and that's win a major championship.",
        "\"Then I can walk away from the game of golf thinking I've done everything I dreamed of as a kid.\"",
        "And, as usual, MacIntyre played a big part in the celebrations. As videos from the Team Europe bus emerged on social media, he was central to the action with another rendition of The Proclaimers' I'm Gonna Be (500 Miles) added to the annals.",
        "\"I wish I was on that bus again right now,\" he reminisced. \"It was amazing, some of the boys were flying before we even got on the bus, because their games finished sooner.",
        "\"Everything that was happening that day was a bit of carnage. When you're on those buses, like any sport and when it's an away game, especially being from where I'm from, the away trips are long - two and a half hours at least - so the journey home is always the best part after a win.",
        "\"The journey home on the bus from Rome was special but the journey back to the hotel in New York was... I don't know if anything is ever going to top that. It was outrageous.\""
      ]
    },
    {
      "url": "https://www.bbc.com/sport/golf/articles/c1j8p3w6g65o",
      "main_category": "sport",
      "detailed_category": "golf",
      "topic": "Season opener cancelled after PGA Tour fails to find new venue",
      "content": [
        "The PGA Tour has cancelled its 2026 season-opening event in Hawaii after failing to find an alternative venue to host The Sentry. The tournament, which was to be played from 8-11 January, had to be moved from the Plantation Course at Kapalua on the Island of Maui because of drought conditions.  However, the PGA Tour said that, \"having assessed alternate venues in Hawaii and beyond\" it could not play the tournament because of \"logistical challenges - including shipping deadlines, tournament infrastructure and vendor support\".The first event of next year will now be the Sony Open from 15-18 January at the  Waialae Country Club in Honolulu, Hawaii.The Sentry, which relocated from California to Maui in 1999, was the PGA Tour's season opener between 1986 and 2013 before returning to that slot in 2024, when the Tour switched back to a calendar-year schedule.The field at the event would have featured the top 50 players from the previous year's FedExCup standings, as well as winners of PGA Tour events from the previous year.",
        "Hideki Matsuyama of Japan won The Sentry in 2025",
        "The PGA Tour has cancelled its 2026 season-opening event in Hawaii after failing to find an alternative venue to host The Sentry.",
        "The tournament, which was to be played from 8-11 January, had to be moved from the Plantation Course at Kapalua on the Island of Maui because of drought conditions.",
        "However, the PGA Tour said that, \"having assessed alternate venues in Hawaii and beyond\" it could not play the tournament because of \"logistical challenges - including shipping deadlines, tournament infrastructure and vendor support\".",
        "The first event of next year will now be the Sony Open from 15-18 January at the  Waialae Country Club in Honolulu, Hawaii.",
        "The Sentry, which relocated from California to Maui in 1999, was the PGA Tour's season opener between 1986 and 2013 before returning to that slot in 2024, when the Tour switched back to a calendar-year schedule.",
        "The field at the event would have featured the top 50 players from the previous year's FedExCup standings, as well as winners of PGA Tour events from the previous year."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/golf/articles/c0kpgp20v1eo",
      "main_category": "sport",
      "detailed_category": "golf",
      "topic": "Bradley will 'never get over' US Ryder Cup defeat",
      "content": [
        "Keegan Bradley fears he will \"never get over\" the USA's Ryder Cup defeat by Europe after enduring \"one of the toughest times\" of his life since the loss in New York.The 39-year-old captained Team USA at Bethpage in September, overseeing a disastrous campaign as Europe secured a 15-13 victory.Bradley's appointment made him the youngest captain of either side since Arnold Palmer in 1963.But he accepted he had made some wrong calls after his pairings and course set-up were among the decisions questioned in the aftermath of the defeat, as Europe became the first team to win away since 2012. \"Since Bethpage, this has been one of the toughest times in my life,\" said Bradley, in his first news conference since the event.\"You win, it's glory for a lifetime - but I didn't and I'm going to have to sit with this for the rest of my life.\"There's no part of me that thinks I'll ever get over this. This event has been so brutal to me. I'll forever wonder and wish.\"",
        "Despite a dramatic final day comeback attempt, Team USA gave themselves too much to do after Europe established a 5½-2½ lead on the opening day and extended that to 11½-4½ by the end of day two - the biggest lead going into the final day in modern Ryder Cup history. And although the hosts won 8½ points from the 12 singles matches, it wasn't enough.\"You put so much into it, and you have all this planning, and the first two days went as poorly as we could have ever thought,\" said Bradley.Bradley had been expected to fulfil a player-captain role but had a \"change of heart\" earlier this year and opted against playing in New York. \"The first practice day, I was out on the tee, and I was watching the guys walk down the fairway all together, and I said to myself 'I wish I was playing - that's what it's all about. I'm missing out'.'\"But Bradley says he made the right decision in omitting himself from selection because he was \"physically exhausted\" by the second day of the match. \"I just didn't think I could do both jobs,\" he said. Bradley has now lost three Ryder Cups as a player and captain. He still hasn't unpacked his suitcase from the 2012 defeat at Medinah and also was a member of the losing US side at Gleneagles in 2014.And, despite being unsure if he will get the chance again, he says he will continue to make himself available for future editions. The next Ryder Cup takes place at Adare Manor in Ireland from September 17-19 2027.",
        "Keegan Bradley has featured in three Ryder Cups as player or captain but is yet to win it",
        "Keegan Bradley fears he will \"never get over\" the USA's Ryder Cup defeat by Europe after enduring \"one of the toughest times\" of his life since the loss in New York.",
        "The 39-year-old captained Team USA at Bethpage in September, overseeing a disastrous campaign as Europe secured a 15-13 victory.",
        "Bradley's appointment made him the youngest captain of either side since Arnold Palmer in 1963.",
        "But he accepted he had made some wrong calls after his pairings and course set-up were among the decisions questioned in the aftermath of the defeat, as Europe became the first team to win away since 2012.",
        "\"Since Bethpage, this has been one of the toughest times in my life,\" said Bradley, in his first news conference since the event.",
        "\"You win, it's glory for a lifetime - but I didn't and I'm going to have to sit with this for the rest of my life.",
        "\"There's no part of me that thinks I'll ever get over this. This event has been so brutal to me. I'll forever wonder and wish.\"",
        "'Stirring final-day fightback cannot hide US Ryder Cup shortcomings'",
        "How Europe held off US to win sensational Ryder Cup",
        "Despite a dramatic final day comeback attempt, Team USA gave themselves too much to do after Europe established a 5½-2½ lead on the opening day and extended that to 11½-4½ by the end of day two - the biggest lead going into the final day in modern Ryder Cup history.",
        "And although the hosts won 8½ points from the 12 singles matches, it wasn't enough.",
        "\"You put so much into it, and you have all this planning, and the first two days went as poorly as we could have ever thought,\" said Bradley.",
        "Bradley had been expected to fulfil a player-captain role but had a \"change of heart\" earlier this year and opted against playing in New York.",
        "\"The first practice day, I was out on the tee, and I was watching the guys walk down the fairway all together, and I said to myself 'I wish I was playing - that's what it's all about. I'm missing out'.'\"",
        "But Bradley says he made the right decision in omitting himself from selection because he was \"physically exhausted\" by the second day of the match.",
        "\"I just didn't think I could do both jobs,\" he said.",
        "Bradley has now lost three Ryder Cups as a player and captain. He still hasn't unpacked his suitcase from the 2012 defeat at Medinah and also was a member of the losing US side at Gleneagles in 2014.",
        "And, despite being unsure if he will get the chance again, he says he will continue to make himself available for future editions.",
        "The next Ryder Cup takes place at Adare Manor in Ireland from September 17-19 2027."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/golf/articles/c891xzv8pk5o",
      "main_category": "sport",
      "detailed_category": "golf",
      "topic": "Fleetwood answers son's dreams with win in India",
      "content": [
        "DP World India Championship - final round-22 T Fleetwood (Eng); -20 K Nakajima (Jpn); -18 A Fitzpatrick (Eng), S Lowry (Ire), T Lawrence (SA); -17 V Hovland (Nor), J Luiten (Ned), J Schaper (SA)Selected others: -16 D Hillier (NZ); -15 B Schmidt (Eng); -14 D Bradbury (Eng); -13 A Sullivan (Eng), B Robinson-Thompson (Eng); -11 R McIlroy (NI)Full leaderboard",
        "Tommy Fleetwood made his son Frankie's dream come true after sealing his eighth European tour title with a two-shot victory at the DP World India Championship.After rolling in for a seven-under-par final round of 65 to finish on 22 under at Delhi Golf Club, the Ryder Cup star said his eight-year-old son had never had a chance to run on to the 18th green to congratulate him. He was not present for Fleetwood's maiden PGA Tour victory in August and was not old enough to attend the world number five's last win on the DP World Tour, in January 2024.\"That was all day today what I had in my mind - could I put myself in a position where I could actually make that happen?,\" said Fleetwood, 34, after embracing his son on the green.\"It's just one of those little things. It means so much to me and that was really cool...that's what I wanted to do all day.\"I hope there are going to be many more times when we hopefully get the chance to do that.\"",
        "Fleetwood had started the final round in second place, two shots behind Japan's Keita Nakajima.New Zealander Daniel Hillier - ranked 218th in the world - leapfrogged them into a surprise lead, after moving to seven under for his round, but was unable to recover from a double bogey six on the 14th.Nakajima, meanwhile, could not summon up the fireworks of his third-round 65, and had to settle for his third second-place finish on the DP World Tour.However Englishman Fleetwood, whose putter had run cold during a frustrating third round on Saturday, had a run of four consecutive birdies around the turn - from the seventh to the 10th - followed by fine birdie putts on the 14th and 17th, to go down the last with a comfortable two-shot advantage.His latest victory ensured he would qualify for the season-ending tournaments and continued a recent run of form that also included a star turn in Europe's Ryder Cup win over the United States in New York. \"There's been plenty of times when things haven't gone my way, but the last two tournaments I have been in contention in I have won, so maybe things are starting to even out a little bit,\" added Fleetwood following the latest achievement of a remarkable season, in which he has claimed eight top-10 finishes on the PGA Tour.Fellow Englishman Alex Fitzpatrick rolled in for a birdie at the last to finish with a third consecutive round of 67, which moved him to 18 under and a tie for third place alongside Ireland's Shane Lowry.Viktor Hovland finished his week with a flourish, moving up to 17 under and a share of fourth place after chipping in for an eagle at the last.Rory McIlroy, meanwhile, finished in a tie for 25th on 11 under.",
        "Tommy Fleetwood's son Frankie runs on to the 18th green to celebrate with him in Delhi",
        "DP World India Championship - final round",
        "-22 T Fleetwood (Eng); -20 K Nakajima (Jpn); -18 A Fitzpatrick (Eng), S Lowry (Ire), T Lawrence (SA); -17 V Hovland (Nor), J Luiten (Ned), J Schaper (SA)",
        "Selected others: -16 D Hillier (NZ); -15 B Schmidt (Eng); -14 D Bradbury (Eng); -13 A Sullivan (Eng), B Robinson-Thompson (Eng); -11 R McIlroy (NI)",
        "Tommy Fleetwood made his son Frankie's dream come true after sealing his eighth European tour title with a two-shot victory at the DP World India Championship.",
        "After rolling in for a seven-under-par final round of 65 to finish on 22 under at Delhi Golf Club, the Ryder Cup star said his eight-year-old son had never had a chance to run on to the 18th green to congratulate him.",
        "He was not present for Fleetwood's maiden PGA Tour victory in August and was not old enough to attend the world number five's last win on the DP World Tour, in January 2024.",
        "\"That was all day today what I had in my mind - could I put myself in a position where I could actually make that happen?,\" said Fleetwood, 34, after embracing his son on the green.",
        "\"It's just one of those little things. It means so much to me and that was really cool...that's what I wanted to do all day.",
        "\"I hope there are going to be many more times when we hopefully get the chance to do that.\"",
        "Fleetwood had started the final round in second place, two shots behind Japan's Keita Nakajima.",
        "New Zealander Daniel Hillier - ranked 218th in the world - leapfrogged them into a surprise lead, after moving to seven under for his round, but was unable to recover from a double bogey six on the 14th.",
        "Nakajima, meanwhile, could not summon up the fireworks of his third-round 65, and had to settle for his third second-place finish on the DP World Tour.",
        "However Englishman Fleetwood, whose putter had run cold during a frustrating third round on Saturday, had a run of four consecutive birdies around the turn - from the seventh to the 10th - followed by fine birdie putts on the 14th and 17th, to go down the last with a comfortable two-shot advantage.",
        "His latest victory ensured he would qualify for the season-ending tournaments and continued a recent run of form that also included a star turn in Europe's Ryder Cup win over the United States in New York.",
        "\"There's been plenty of times when things haven't gone my way, but the last two tournaments I have been in contention in I have won, so maybe things are starting to even out a little bit,\" added Fleetwood following the latest achievement of a remarkable season, in which he has claimed eight top-10 finishes on the PGA Tour.",
        "Fellow Englishman Alex Fitzpatrick rolled in for a birdie at the last to finish with a third consecutive round of 67, which moved him to 18 under and a tie for third place alongside Ireland's Shane Lowry.",
        "Viktor Hovland finished his week with a flourish, moving up to 17 under and a share of fourth place after chipping in for an eagle at the last.",
        "Rory McIlroy, meanwhile, finished in a tie for 25th on 11 under.",
        "Frankie did not get the chance to share in his dad's victory at the PGA Tour Championship in August"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/golf/articles/c24ln9gmnv6o",
      "main_category": "sport",
      "detailed_category": "golf",
      "topic": "Fleetwood loses lead to Japan's Nakajima in India",
      "content": [
        "DP World India Championship - third round-17 K Nakajima (Jpn); -15 T Fleetwood (Eng); -14 S Lowry (Ire); -13 J Dantorp (Swe), A Fitzpatrick (Eng), D Hillier (NZ), B Harman (US)Selected others: -12 V Hovland (Nor), B Robinson-Thompson (Eng); -11 D Bradbury (Eng); -10 R McIlroy (NI), B Schmidt (Eng)Full leaderboard",
        "Tommy Fleetwood benefited from a massive stroke of luck on the final hole of his third round at the DP World India Championship to end the day two shots behind leader Keita Nakajima. Overnight leader Fleetwood endured a frustrating back nine at Delhi Golf Club, missing a succession of short putts as Japan's Nakajima overtook him with a stunning seven-under-par round of 65. England's Fleetwood was trailing by three when he put his approach shot deep into trees lining the par-five 18th, but his ball bounced out and he was able to finish with a chip and a putt for birdie. The 34-year-old's 69 took him to 15 under for his three rounds, while Ryder Cup team-mate Shane Lowry is a shot back in third place after also carding a 69.    Elsewhere, England's Alex Fitzpatrick is in a four-way tie for fourth place on 13 under following his bogey-free 67, while Rory McIlroy is down in 15th, on 10 under after his 68. Fleetwood stormed into the lead with a dazzling eight-under 64 in Friday's second round, but cut a frustrated figure on Saturday as his putter ran cold. He was three under for the day at the turn, but missed two six-foot birdie putts on the back nine, then one from a similar distance on the 17th for par. Nakajima seized his opportunity, making seven birdies and no bogeys as he moved from fourth place overnight to head the field on 17 under par. Lowry, who played alongside Nakajima, also birdied the last to stay within touching distance of the lead. \"Keita played great today,\" the Irishman told the DP World Tour. \"He will be hard to beat tomorrow, but there will be a few of us not far behind him and hopefully giving him a run.\"",
        "Tommy Fleetwood birdied three of his opening eight holes in Delhi on Saturday but had to wait until the 18th for his fourth of the day",
        "DP World India Championship - third round",
        "-17 K Nakajima (Jpn); -15 T Fleetwood (Eng); -14 S Lowry (Ire); -13 J Dantorp (Swe), A Fitzpatrick (Eng), D Hillier (NZ), B Harman (US)",
        "Selected others: -12 V Hovland (Nor), B Robinson-Thompson (Eng); -11 D Bradbury (Eng); -10 R McIlroy (NI), B Schmidt (Eng)",
        "Tommy Fleetwood benefited from a massive stroke of luck on the final hole of his third round at the DP World India Championship to end the day two shots behind leader Keita Nakajima.",
        "Overnight leader Fleetwood endured a frustrating back nine at Delhi Golf Club, missing a succession of short putts as Japan's Nakajima overtook him with a stunning seven-under-par round of 65.",
        "England's Fleetwood was trailing by three when he put his approach shot deep into trees lining the par-five 18th, but his ball bounced out and he was able to finish with a chip and a putt for birdie.",
        "The 34-year-old's 69 took him to 15 under for his three rounds, while Ryder Cup team-mate Shane Lowry is a shot back in third place after also carding a 69.",
        "Elsewhere, England's Alex Fitzpatrick is in a four-way tie for fourth place on 13 under following his bogey-free 67, while Rory McIlroy is down in 15th, on 10 under after his 68.",
        "Fleetwood stormed into the lead with a dazzling eight-under 64 in Friday's second round, but cut a frustrated figure on Saturday as his putter ran cold.",
        "He was three under for the day at the turn, but missed two six-foot birdie putts on the back nine, then one from a similar distance on the 17th for par.",
        "Nakajima seized his opportunity, making seven birdies and no bogeys as he moved from fourth place overnight to head the field on 17 under par.",
        "Lowry, who played alongside Nakajima, also birdied the last to stay within touching distance of the lead.",
        "\"Keita played great today,\" the Irishman told the DP World Tour. \"He will be hard to beat tomorrow, but there will be a few of us not far behind him and hopefully giving him a run.\""
      ]
    },
    {
      "url": "https://www.bbc.com/sport/golf/articles/cr43lpxv323o",
      "main_category": "sport",
      "detailed_category": "golf",
      "topic": "Flawless Fleetwood leads as McIlroy rallies",
      "content": [
        "DP World India Championship - second round-12 T Fleetwood (Eng); -11 S Lowry (Ire), B Harman (US); -10 K Nakajima (Jpn) -9 B Robinson-Thompson (Eng), J Luiten (Ned)Selected others: -8 A Fitzpatrick (Eng); -7 B Griffin (US), A Sullivan (Eng); -6 R McIlroy (NI), V Hovland (Nor); -5 L Donald (Eng)Full leaderboard",
        "Tommy Fleetwood fired a superb eight-under round of 64 to take the halfway lead at the DP World India Championship, while Rory McIlroy finished strongly to stay in touch. England's Fleetwood carded eight birdies in a bogey-free round to lead former Open champions Shane Lowry and Brian Harman by a shot at Delhi Golf Club. Overnight leader Lowry - playing with European Ryder Cup team-mate Fleetwood - made four birdies and a bogey in a 69 while Harman carded a 65 to surge up the leaderboard. World number five Fleetwood is chasing his eighth DP World Tour title after claiming the PGA Tour's FedEx Cup in August.\"I hit it in the fairway a lot and gave myself some chances with irons,\" said Fleetwood.  \"It's easy talking about how many things you did well when you shot eight under, but it was a really good round of golf.\"",
        "While Fleetwood enjoyed serene progress on Friday, McIlroy was 10 shots adrift after mixing two birdies with three bogeys over the first 12 holes. But the world number two picked up four shots in his last six holes to post his second successive 69 and join Ryder Cup team-mate Viktor Hovland on six under. \"I felt like my approach play was pretty scrappy, missed an iron shot right on four, so that's not ideal,\" said McIlroy, who shook hands with Indian cricket legend Sachin Tendulkar after finishing his round. \"Being a little tidier and keep the bogeys off the scorecard, I think I can have a good weekend and get closer to the leaders.\"US Ryder Cup player Ben Griffin - playing with McIlroy and Hovland - recovered from a slow start to card his second straight 68 and sit four shots off Fleetwood. Japan's Keita Nakajima is 10 under after following a 65 with a 69, while Shubhankar Sharma is the leading Indian player on four under after a bogey-free 66.",
        "DP World India Championship - second round",
        "-12 T Fleetwood (Eng); -11 S Lowry (Ire), B Harman (US); -10 K Nakajima (Jpn) -9 B Robinson-Thompson (Eng), J Luiten (Ned)",
        "Selected others: -8 A Fitzpatrick (Eng); -7 B Griffin (US), A Sullivan (Eng); -6 R McIlroy (NI), V Hovland (Nor); -5 L Donald (Eng)",
        "Tommy Fleetwood fired a superb eight-under round of 64 to take the halfway lead at the DP World India Championship, while Rory McIlroy finished strongly to stay in touch.",
        "England's Fleetwood carded eight birdies in a bogey-free round to lead former Open champions Shane Lowry and Brian Harman by a shot at Delhi Golf Club.",
        "Overnight leader Lowry - playing with European Ryder Cup team-mate Fleetwood - made four birdies and a bogey in a 69 while Harman carded a 65 to surge up the leaderboard.",
        "World number five Fleetwood is chasing his eighth DP World Tour title after claiming the PGA Tour's FedEx Cup in August.",
        "\"I hit it in the fairway a lot and gave myself some chances with irons,\" said Fleetwood.",
        "\"It's easy talking about how many things you did well when you shot eight under, but it was a really good round of golf.\"",
        "While Fleetwood enjoyed serene progress on Friday, McIlroy was 10 shots adrift after mixing two birdies with three bogeys over the first 12 holes.",
        "But the world number two picked up four shots in his last six holes to post his second successive 69 and join Ryder Cup team-mate Viktor Hovland on six under.",
        "\"I felt like my approach play was pretty scrappy, missed an iron shot right on four, so that's not ideal,\" said McIlroy, who shook hands with Indian cricket legend Sachin Tendulkar after finishing his round.",
        "\"Being a little tidier and keep the bogeys off the scorecard, I think I can have a good weekend and get closer to the leaders.\"",
        "US Ryder Cup player Ben Griffin - playing with McIlroy and Hovland - recovered from a slow start to card his second straight 68 and sit four shots off Fleetwood.",
        "Japan's Keita Nakajima is 10 under after following a 65 with a 69, while Shubhankar Sharma is the leading Indian player on four under after a bogey-free 66."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/golf/articles/c6254d59549o",
      "main_category": "sport",
      "detailed_category": "golf",
      "topic": "McIlroy trails Lowry in India after ditching driver",
      "content": [
        "DP World India Championship - first round -8 S Lowry (Ire); -7 K Nakajima (Jpn); -6 C Jarvis (SA) -5 J Campillo (Spa), J De Bruyn (Ger), R Gangjee (Ind)Selected others: -4 B Griffin (US), B Harman (US), T Fleetwood (Eng), L Donald (Eng); -3 R McIlroy (NI); -1 V Hovland (Nor)Full leaderboard",
        "Shane Lowry fired an opening eight-under 64 to lead the DP World India Championship, with Rory McIlroy five shots back after leaving his driver out of the bag. Irishman Lowry, who missed the cut at last week's Open de Espana, birdied six of his last eight holes to lead Japan's Keita Nakajima by one shot.Lowry and McIlroy's Ryder Cup team-mate Tommy Fleetwood and captain Luke Donald both shot four-under 68. Playing for the first time since Europe's Ryder Cup triumph in New York last month, McIlroy fired six birdies and three bogeys in an up-and-down opening round. The world number two chipped in from the fringe on the 10th - his opening hole - before slipping to back-to-back bogeys. He picked up shots on the par-fives 14th and 18th and gained three more shots on his back nine before a bogey six at the eighth.  Despite opting for a safer approach off the tee, Northern Ireland's McIlroy said he still found Delhi Golf Club trickier than expected.  \"You're just really trying to be as conservative as possible off the tee and then you're trying to pick off birdies on the par-fives and then maybe pick up a couple more, but it's a tricky golf course,\" said the five-time major winner.",
        "After starting with four pars, Lowry - who is without an individual victory since September 2022 - carded back-to-back birdies at the fifth and sixth holes.The former Open champion vaulted into a share of the lead with a run of five straight birdies from the par-four 11th before picking up a shot at the last to edge ahead of Nakajima. \"It's not that hard when you hit it in play out there, but you start missing fairways it becomes quite tricky, so I'm happy with that,\" said Lowry. He added: \"You need to shape it around the course, hit it in position off the tee and it's all about your iron play. That's one of my strengths and I took advantage of that today and managed to roll a few putts in on the back nine, which was nice.\"Lowry added there was a \"little bit\" of Ryder Cup chat with playing partners Fleetwood and Donald. \"We could hear the horns from the road, it was not as off-putting as the Bethpage [Black] crowd,\" he said with a smile, referring to the hostile New York fans at last month's Ryder Cup. Fleetwood mixed four birdies, an eagle and two bogeys to sit four shots back. Donald, who is playing his first tournament since his second Ryder Cup success as captain, carded five birdies and a bogey to match fellow Englishman Fleetwood and 2023 Open champion Brian Harman.   Playing with McIlroy, US Ryder Cup player Ben Griffin opened with a 68 while McIlroy's European team-mate Viktor Hovland signed for a 71.",
        "Lowry enjoyed a bogey-free round while McIlroy had three blemishes on his card",
        "DP World India Championship - first round",
        "-8 S Lowry (Ire); -7 K Nakajima (Jpn); -6 C Jarvis (SA) -5 J Campillo (Spa), J De Bruyn (Ger), R Gangjee (Ind)",
        "Selected others: -4 B Griffin (US), B Harman (US), T Fleetwood (Eng), L Donald (Eng); -3 R McIlroy (NI); -1 V Hovland (Nor)",
        "Shane Lowry fired an opening eight-under 64 to lead the DP World India Championship, with Rory McIlroy five shots back after leaving his driver out of the bag.",
        "Irishman Lowry, who missed the cut at last week's Open de Espana, birdied six of his last eight holes to lead Japan's Keita Nakajima by one shot.",
        "Lowry and McIlroy's Ryder Cup team-mate Tommy Fleetwood and captain Luke Donald both shot four-under 68.",
        "Playing for the first time since Europe's Ryder Cup triumph in New York last month, McIlroy fired six birdies and three bogeys in an up-and-down opening round.",
        "The world number two chipped in from the fringe on the 10th - his opening hole - before slipping to back-to-back bogeys.",
        "He picked up shots on the par-fives 14th and 18th and gained three more shots on his back nine before a bogey six at the eighth.",
        "Despite opting for a safer approach off the tee, Northern Ireland's McIlroy said he still found Delhi Golf Club trickier than expected.",
        "\"You're just really trying to be as conservative as possible off the tee and then you're trying to pick off birdies on the par-fives and then maybe pick up a couple more, but it's a tricky golf course,\" said the five-time major winner.",
        "People remembering Ryder Cup for 'wrong reason'",
        "Why Ryder Cup players get free pass to season-ending DP World Tour play-offs",
        "After starting with four pars, Lowry - who is without an individual victory since September 2022 - carded back-to-back birdies at the fifth and sixth holes.",
        "The former Open champion vaulted into a share of the lead with a run of five straight birdies from the par-four 11th before picking up a shot at the last to edge ahead of Nakajima.",
        "\"It's not that hard when you hit it in play out there, but you start missing fairways it becomes quite tricky, so I'm happy with that,\" said Lowry.",
        "He added: \"You need to shape it around the course, hit it in position off the tee and it's all about your iron play. That's one of my strengths and I took advantage of that today and managed to roll a few putts in on the back nine, which was nice.\"",
        "Lowry added there was a \"little bit\" of Ryder Cup chat with playing partners Fleetwood and Donald.",
        "\"We could hear the horns from the road, it was not as off-putting as the Bethpage [Black] crowd,\" he said with a smile, referring to the hostile New York fans at last month's Ryder Cup.",
        "Fleetwood mixed four birdies, an eagle and two bogeys to sit four shots back.",
        "Donald, who is playing his first tournament since his second Ryder Cup success as captain, carded five birdies and a bogey to match fellow Englishman Fleetwood and 2023 Open champion Brian Harman.",
        "Playing with McIlroy, US Ryder Cup player Ben Griffin opened with a 68 while McIlroy's European team-mate Viktor Hovland signed for a 71."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/golf/articles/cp3d57gl397o",
      "main_category": "sport",
      "detailed_category": "golf",
      "topic": "Why Ryder Cup players get free pass to season-ending DP World Tour play-offs",
      "content": [
        "Rory McIlroy breaks new ground by playing in India this week as he returns to action for the first time since the Ryder Cup.While the Northern Irishman widens his golfing horizons, the DP World Tour enters the final phase of this year's Race to Dubai. McIlroy is in pole position to secure the season-long title for the fourth season running and seventh time overall.There are only three more events following the India Championship; the following week's Genesis Championship in South Korea - which concludes the 'Back Nine' phase of the schedule - and then the final two tournaments in the Middle East.These big money 'play-off' events in Abu Dhabi and Dubai are reserved for the top 70 and then top 50 in the standings.But for the likes of Tommy Fleetwood and Shane Lowry, who are also in this week's field in India, there is less pressure than you might imagine.",
        "Comfortably outside the top 70, at first glance it would appear both need high finishes from their trip to the Delhi Golf Club to keep alive their seasons. But, in fact, they are already assured of their places in Abu Dhabi and Dubai.This is due to a little publicised but pragmatic loophole whereby members of Europe's Ryder Cup team are also considered eligible for next month's closing tournaments.Fleetwood, who won the PGA Tour's play-offs with his stirring victory at August's Tour Championship in Atlanta, lies 94th in the European tour's season-long table.  Lowry, who sank the putt that retained the Ryder Cup, is 155th.Other European team-mates who can potentially benefit are Ludvig Aberg (72nd) and Sepp Straka (147th).This might question the integrity of a play-off system, which by definition is supposed to bring cut-throat competitive jeopardy, but this scenario also illustrates realities faced by the Wentworth-based DP World Tour.They are reliant on big backers such as DP World, who are also the title sponsors of this week's event in India. They need the biggest stars at their biggest events to justify the investment, which runs to millions of dollars.Fleetwood has enjoyed one of his most successful seasons, capped by his first win on American soil at East Lake just under two months ago.He is one of European golf's superstars and, frankly, it would be unthinkable to stage the 2025 season finale without him.Common sense trumps competitive integrity, even though the world number five - a Dubai resident - has reserved his best performances for events that do not count on his home tour.Fleetwood has so far played only four DP World Tour events and failed to finish in the top 20 at any of them; the Dubai Desert Classic, Scottish Open, BMW PGA Championship or Alfred Dunhill Links Championship.The majors also count on the Race to Dubai and his share of 16th at the Open was his only top 20 in the big four tournaments.  But on the American-based circuit he enjoyed seven top-five finishes.Fleetwood was also Europe's top points scorer at Bethpage last month. It would be absurd for him not to be taking his place alongside the tour's leading stars at the end of the season.While in the past the PGA and European tours were deadly rivals they are now inextricably linked thanks to the strategic alliance that underpins DP World Tour prize funds.While Marco Penge, last week's winner of the Open De Espana, has moved into McIlroy's wing mirrors as his closest rival at the top of the Race to Dubai, much of the interest for the rest of the season will have an American bias.The narrative will be driven by the scramble for 10 places on the PGA Tour for those who do not already have playing rights in the US.  Penge, with three DPWT wins, is assured of what is widely regarded as 'promotion' to the US circuit.The Clitheroe-based pro, who also guaranteed invites to the Masters and Open with his Spanish success, is not in the India field but will mount a final push to try to overhaul McIlroy at the top of the standings.And Dan Brown, the man Penge beat in the Madrid play-off, is one of four other Britons in the thick of the battle for a 2026 PGA card.Yorkshireman John Parry and the Bath duo of Jordan Smith and Laurie Canter also currently occupy spots that would yield a golden ticket for next year.Some observers see this scenario as evidence that the DP World Tour is now nothing more than a feeder for big brother on the other side of the pond.But the DP World Tour argue it is a vital mechanism that underpins their schedule, a necessary and enticing element that maximises playing opportunities for its members.Certainly this is the time of the year where the realities and compromises of men's professional golf seem at their most evident.",
        "Fleetwood top scored with four points at the Ryder Cup, Lowry went unbeaten and McIlroy contributed 3½ points",
        "Rory McIlroy breaks new ground by playing in India this week as he returns to action for the first time since the Ryder Cup.",
        "While the Northern Irishman widens his golfing horizons, the DP World Tour enters the final phase of this year's Race to Dubai. McIlroy is in pole position to secure the season-long title for the fourth season running and seventh time overall.",
        "There are only three more events following the India Championship; the following week's Genesis Championship in South Korea - which concludes the 'Back Nine' phase of the schedule - and then the final two tournaments in the Middle East.",
        "These big money 'play-off' events in Abu Dhabi and Dubai are reserved for the top 70 and then top 50 in the standings.",
        "But for the likes of Tommy Fleetwood and Shane Lowry, who are also in this week's field in India, there is less pressure than you might imagine.",
        "Venue's bid to host Ryder Cup with £170m upgrade",
        "US Ryder Cup fans probably crossed line - Morikawa",
        "'England Golf needs government backing for 2030 Solheim Cup bid'",
        "Comfortably outside the top 70, at first glance it would appear both need high finishes from their trip to the Delhi Golf Club to keep alive their seasons. But, in fact, they are already assured of their places in Abu Dhabi and Dubai.",
        "This is due to a little publicised but pragmatic loophole whereby members of Europe's Ryder Cup team are also considered eligible for next month's closing tournaments.",
        "Fleetwood, who won the PGA Tour's play-offs with his stirring victory at August's Tour Championship in Atlanta, lies 94th in the European tour's season-long table.  Lowry, who sank the putt that retained the Ryder Cup, is 155th.",
        "Other European team-mates who can potentially benefit are Ludvig Aberg (72nd) and Sepp Straka (147th).",
        "This might question the integrity of a play-off system, which by definition is supposed to bring cut-throat competitive jeopardy, but this scenario also illustrates realities faced by the Wentworth-based DP World Tour.",
        "They are reliant on big backers such as DP World, who are also the title sponsors of this week's event in India. They need the biggest stars at their biggest events to justify the investment, which runs to millions of dollars.",
        "Fleetwood has enjoyed one of his most successful seasons, capped by his first win on American soil at East Lake just under two months ago.",
        "He is one of European golf's superstars and, frankly, it would be unthinkable to stage the 2025 season finale without him.",
        "Common sense trumps competitive integrity, even though the world number five - a Dubai resident - has reserved his best performances for events that do not count on his home tour.",
        "Fleetwood has so far played only four DP World Tour events and failed to finish in the top 20 at any of them; the Dubai Desert Classic, Scottish Open, BMW PGA Championship or Alfred Dunhill Links Championship.",
        "The majors also count on the Race to Dubai and his share of 16th at the Open was his only top 20 in the big four tournaments.  But on the American-based circuit he enjoyed seven top-five finishes.",
        "Fleetwood was also Europe's top points scorer at Bethpage last month. It would be absurd for him not to be taking his place alongside the tour's leading stars at the end of the season.",
        "While in the past the PGA and European tours were deadly rivals they are now inextricably linked thanks to the strategic alliance that underpins DP World Tour prize funds.",
        "While Marco Penge, last week's winner of the Open De Espana, has moved into McIlroy's wing mirrors as his closest rival at the top of the Race to Dubai, much of the interest for the rest of the season will have an American bias.",
        "The narrative will be driven by the scramble for 10 places on the PGA Tour for those who do not already have playing rights in the US.  Penge, with three DPWT wins, is assured of what is widely regarded as 'promotion' to the US circuit.",
        "The Clitheroe-based pro, who also guaranteed invites to the Masters and Open with his Spanish success, is not in the India field but will mount a final push to try to overhaul McIlroy at the top of the standings.",
        "And Dan Brown, the man Penge beat in the Madrid play-off, is one of four other Britons in the thick of the battle for a 2026 PGA card.",
        "Yorkshireman John Parry and the Bath duo of Jordan Smith and Laurie Canter also currently occupy spots that would yield a golden ticket for next year.",
        "Some observers see this scenario as evidence that the DP World Tour is now nothing more than a feeder for big brother on the other side of the pond.",
        "But the DP World Tour argue it is a vital mechanism that underpins their schedule, a necessary and enticing element that maximises playing opportunities for its members.",
        "Certainly this is the time of the year where the realities and compromises of men's professional golf seem at their most evident."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/golf/articles/ckgyg5grm53o",
      "main_category": "sport",
      "detailed_category": "golf",
      "topic": "England's Penge wins Spanish Open in play-off",
      "content": [
        "Spanish Open final leaderboard-15 D Brown (Eng), M Penge (Eng)*; -14 J Girrbach (Swi); -12 T McKibbin (NI)*Penge wins after first hole of sudden-death play-offSelected others: -10 A Fitzpatrick (Eng), C Hill (Sco), J Rahm (Spa); -9 P Reed (US), G Forrest (Sco), T Clements (Eng)",
        "Marco Penge held his nerve in a play-off to defeat fellow Englishman Daniel Brown and take the Spanish Open title in Madrid.Penge held a four-shot lead over nearest challenger Joel Girrbach going into the final round, while he was five shots better off than Brown.However, he only had a one-shot advantage going to the 18th on Sunday after his lead was trimmed.After Penge made par to finish with a one-over 72 for his final round at the Club de Campo, Brown sank a birdie putt for a 67 which forced a play-off as both finished on 15 under.At the first time of asking in the sudden-death play-off, Penge birdied the 18th with an eight-foot putt to secure a third European Tour title of the season.Penge's victory in Spain also means he has automatically qualified for the 154th Open at Royal Birkdale next year as well at the Masters at Augusta.\"It was a strange day for me,\" said Penge, who carded 66, 67 and 64 in his first three rounds.\"I had it in my head that the golfing gods were kind of against me in a way. Dan and Joel played great, they were holing putts and putting the pressure on me.\"I just couldn't get it in the hole. It felt like I was really up against it, but I felt like I managed myself really well.\"Penge was given a three-month ban in December 2024 for placing bets on multiple events, with one month suspended for a year.He has resumed his career in fine fashion and said: \"I think tee to green I played solid and it was just a matter of the putts - I think I used them all yesterday, but holing that one [on the play-off hole] was worth the wait.\"Switzerland's Girrbach finished with a 69 as he ended up in third place on 14 under.Three-time champion Jon Rahm carded a closing 65, which included seven birdies and a bogey, as the Spaniard finished tied for ninth at his home Open.",
        "Marco Penge has won three times on the DP World Tour this year",
        "Spanish Open final leaderboard",
        "-15 D Brown (Eng), M Penge (Eng)*; -14 J Girrbach (Swi); -12 T McKibbin (NI)",
        "*Penge wins after first hole of sudden-death play-off",
        "Selected others: -10 A Fitzpatrick (Eng), C Hill (Sco), J Rahm (Spa); -9 P Reed (US), G Forrest (Sco), T Clements (Eng)",
        "Marco Penge held his nerve in a play-off to defeat fellow Englishman Daniel Brown and take the Spanish Open title in Madrid.",
        "Penge held a four-shot lead over nearest challenger Joel Girrbach going into the final round, while he was five shots better off than Brown.",
        "However, he only had a one-shot advantage going to the 18th on Sunday after his lead was trimmed.",
        "After Penge made par to finish with a one-over 72 for his final round at the Club de Campo, Brown sank a birdie putt for a 67 which forced a play-off as both finished on 15 under.",
        "At the first time of asking in the sudden-death play-off, Penge birdied the 18th with an eight-foot putt to secure a third European Tour title of the season.",
        "Penge's victory in Spain also means he has automatically qualified for the 154th Open at Royal Birkdale next year as well at the Masters at Augusta.",
        "\"It was a strange day for me,\" said Penge, who carded 66, 67 and 64 in his first three rounds.",
        "\"I had it in my head that the golfing gods were kind of against me in a way. Dan and Joel played great, they were holing putts and putting the pressure on me.",
        "\"I just couldn't get it in the hole. It felt like I was really up against it, but I felt like I managed myself really well.\"",
        "Penge was given a three-month ban in December 2024 for placing bets on multiple events, with one month suspended for a year.",
        "He has resumed his career in fine fashion and said: \"I think tee to green I played solid and it was just a matter of the putts - I think I used them all yesterday, but holing that one [on the play-off hole] was worth the wait.\"",
        "Switzerland's Girrbach finished with a 69 as he ended up in third place on 14 under.",
        "Three-time champion Jon Rahm carded a closing 65, which included seven birdies and a bogey, as the Spaniard finished tied for ninth at his home Open."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/golf/articles/c0kpjdk56dko",
      "main_category": "sport",
      "detailed_category": "golf",
      "topic": "People remembering Ryder Cup for 'wrong reason'",
      "content": [
        "Rory McIlroy says he wants to \"shift the narrative\" after claiming people are remembering Europe's Ryder Cup win in New York last month for the \"wrong reason\". McIlroy bore the brunt of verbal abuse from a hostile crowd throughout the event at Bethpage Black and hit out at \"unacceptable and abusive behaviour\" after his wife Erica was hit by a drink thrown by an American fan.Speaking on Wednesday before his first tournament since the Ryder Cup, McIlroy said the focus on the fans' behaviour detracts from a rare European win on American soil. \"The unfortunate thing is people aren't remembering that [performance] and they are remembering the week for the wrong reason,\" said the Northern Irishman, who contributed three-and-a-half points as Europe won 15-13. \"I would like to shift the narrative and focus on how good the European team were and how proud I was to be part of that team to win an away Ryder Cup.\"",
        "Asked if he thinks people no longer watch sport purely for enjoyment, McIlroy said he believes the \"majority\" of fans tune in because it is impossible to predict the outcome, but admitted interests such as gambling have changed the way it is consumed. \"Knowing that you're going to get criticised for your performances, athletes have to do a better job of blocking out the noise,\" said the 36-year-old. \"So not going on social media, trying not to read anything about yourself, it's easier said than done.\"But the more athletes can do that, I think it's better for their performance, for their mental health, and for their longevity in a given sport.\"",
        "Europe's victory at Bethpage Black was McIlroy's sixth in eight Ryder Cup appearances and second in America after also playing in 2012's memorable triumph at Medinah. Speaking on Tuesday, Donald - who also led Europe to their 2023 win in Rome - said McIlroy would make a \"good captain\", but the world number two does not expect to take the reins until the \"mid-2030s\". \"Certainly not 2027 [at Adare Manor in Ireland],\" he laughed when asked if he would like to lead the side. \"I hope I'm still playing at that point and good enough to put points on the board for Europe. But yeah, I would love to be the European team captain at some point.\"But that will be when I'm not good enough to make the team, or I make way for the new generation to come along.\"McIlroy is returning to action at this week's DP World Tour's India Championship - a new tournament - alongside Ryder Cup team-mates Shane Lowry, Tommy Fleetwood and Viktor Hovland. Grouped with Hovland and US Ryder Cup player Ben Griffin, McIlroy begins Thursday's first round at Delhi Golf Club at 02:55 BST.",
        "McIlroy was targeted by a hostile New York crowd throughout last month's Ryder Cup",
        "Rory McIlroy says he wants to \"shift the narrative\" after claiming people are remembering Europe's Ryder Cup win in New York last month for the \"wrong reason\".",
        "McIlroy bore the brunt of verbal abuse from a hostile crowd throughout the event at Bethpage Black and hit out at \"unacceptable and abusive behaviour\" after his wife Erica was hit by a drink thrown by an American fan.",
        "Speaking on Wednesday before his first tournament since the Ryder Cup, McIlroy said the focus on the fans' behaviour detracts from a rare European win on American soil.",
        "\"The unfortunate thing is people aren't remembering that [performance] and they are remembering the week for the wrong reason,\" said the Northern Irishman, who contributed three-and-a-half points as Europe won 15-13.",
        "\"I would like to shift the narrative and focus on how good the European team were and how proud I was to be part of that team to win an away Ryder Cup.\"",
        "Ryder Cup fan behaviour unacceptable - McIlroy",
        "US Ryder Cup fans probably crossed line - Morikawa",
        "PGA chief to apologise to McIlroy family over Ryder Cup abuse",
        "Asked if he thinks people no longer watch sport purely for enjoyment, McIlroy said he believes the \"majority\" of fans tune in because it is impossible to predict the outcome, but admitted interests such as gambling have changed the way it is consumed.",
        "\"Knowing that you're going to get criticised for your performances, athletes have to do a better job of blocking out the noise,\" said the 36-year-old.",
        "\"So not going on social media, trying not to read anything about yourself, it's easier said than done.",
        "\"But the more athletes can do that, I think it's better for their performance, for their mental health, and for their longevity in a given sport.\"",
        "While McIlroy has been inspired by the \"effort and dedication\" Luke Donald has brought to the captaincy, he does not expect to lead Europe for another decade",
        "Europe's victory at Bethpage Black was McIlroy's sixth in eight Ryder Cup appearances and second in America after also playing in 2012's memorable triumph at Medinah.",
        "Speaking on Tuesday, Donald - who also led Europe to their 2023 win in Rome - said McIlroy would make a \"good captain\", but the world number two does not expect to take the reins until the \"mid-2030s\".",
        "\"Certainly not 2027 [at Adare Manor in Ireland],\" he laughed when asked if he would like to lead the side.",
        "\"I hope I'm still playing at that point and good enough to put points on the board for Europe. But yeah, I would love to be the European team captain at some point.",
        "\"But that will be when I'm not good enough to make the team, or I make way for the new generation to come along.\"",
        "McIlroy is returning to action at this week's DP World Tour's India Championship - a new tournament - alongside Ryder Cup team-mates Shane Lowry, Tommy Fleetwood and Viktor Hovland.",
        "Grouped with Hovland and US Ryder Cup player Ben Griffin, McIlroy begins Thursday's first round at Delhi Golf Club at 02:55 BST."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/golf/articles/cy505qvr762o",
      "main_category": "sport",
      "detailed_category": "golf",
      "topic": "Woods has disc replaced in latest injury setback",
      "content": [
        "Tiger Woods has had disc replacement surgery in the latest setback to stall his return to the PGA Tour.The 15-time major champion has been sidelined since missing the cut at The Open in July 2024 and took to social media to announce the news.\"After experiencing pain and lack of mobility in my back, I consulted with doctors and surgeons to have tests taken,\" Woods said in a statement.\"I opted to have my disc replaced yesterday, and I already know I made a good decision for my health and my back.\"Woods, 49, said that the surgery, performed by Dr Sheeraz Qureshi, could be \"deemed successful\".It was his seventh back procedure in the past decade.In March, Woods had surgery to repair a ruptured left Achilles tendon suffered while training at home. That ended his plans of making a return at the Masters the following month.He had withdrawn from the Genesis Invitational weeks earlier following the death of his mother.Even before then Woods had played a limited schedule, having suffering severe injuries in a car accident in February 2021.The American did not appear on the initial player list released earlier this week for December's Hero World Challenge, an event he hosts.",
        "Tiger Woods has not played on the PGA Tour since 2024",
        "Tiger Woods has had disc replacement surgery in the latest setback to stall his return to the PGA Tour.",
        "The 15-time major champion has been sidelined since missing the cut at The Open in July 2024 and took to social media to announce the news.",
        "\"After experiencing pain and lack of mobility in my back, I consulted with doctors and surgeons to have tests taken,\" Woods said in a statement.",
        "\"I opted to have my disc replaced yesterday, and I already know I made a good decision for my health and my back.\"",
        "Woods, 49, said that the surgery, performed by Dr Sheeraz Qureshi, could be \"deemed successful\".",
        "It was his seventh back procedure in the past decade.",
        "In March, Woods had surgery to repair a ruptured left Achilles tendon suffered while training at home. That ended his plans of making a return at the Masters the following month.",
        "He had withdrawn from the Genesis Invitational weeks earlier following the death of his mother.",
        "Even before then Woods had played a limited schedule, having suffering severe injuries in a car accident in February 2021.",
        "The American did not appear on the initial player list released earlier this week for December's Hero World Challenge, an event he hosts."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/golf/articles/c78n30k5ndyo",
      "main_category": "sport",
      "detailed_category": "golf",
      "topic": "'England Golf needs government backing for 2030 Solheim Cup bid'",
      "content": [
        "Following Europe's recent Ryder Cup success, England Golf is urging the government to underwrite its bid to stage the Solheim Cup in the country for the first time.The contest between the leading female golfers of Europe and the United States has been held twice in Scotland and in Wales but never in England. A bid has been put together to hold it at the The Grove in Hertfordshire in 2030.But organisers need £30m to back the bid and there is only £10m in place. England Golf is urgently seeking Treasury support to underwrite the shortfall.The bid document, seen by BBC Sport, states that England Golf believes a successful bid \"represents huge value for England\".It is also confident that with the necessary backing the attempt to lure the Solheim Cup to England would be successful.",
        "Talks to secure Treasury backing began in early spring but an answer on whether it will be forthcoming is urgently needed. The rights for the 2030 match are held by the International Management Group (IMG) who want a resolution by the end of this month.\"We believe at this moment in time, it's right and proper that the Solheim Cup should come to England,\" England Golf's chief executive Jeremy Tomlinson told BBC Sport.\"We've provided so many players through the years and continue to do so, whether it's Charley (Hull), Georgia (Hall), or Lottie Woad.\"We have such inspirational women in the game of golf that we just think it would be fantastic to be able to get the Solheim Cup.\"But what would be the benefit to the taxpayer? \"We've just seen from the Ryder Cup the type of effect that huge golf events can have with regards to not just local economies, but to a nation.\"And that's certainly what we believe can happen from a Solheim Cup perspective, whether it's actually just the spend that would happen in and around the event or whether it be the job creation.\"But also the lead up and then the legacy post match. We believe both locally and nationally, there's an incredible return to host an event like this.\"Women in sport is just bang on where we need to be right now, making sure that we make sport the most equitable opportunity for men and women.\"We've seen what the Ryder Cup does for golf. We've seen what the Ryder Cup does for men's golf.\"",
        "Tomlinson insists that initial talks with government have been \"positive\" but now the process is entering a crunch period.\"With a good level of public support here, it could really help the government understand that this would be a right and proper action to take,\" he added.The Grove is located near Watford and is well placed to draw fans from the London catchment area.The venue has staged a World Golf Championships tournament and boasts hotel facilities commensurate with those required for hosting an event such as the Solheim Cup.Tomlinson refused to say that talks have reached an impasse, but admitted: \"There is definitely a quandary at the moment with regards to whether or not the government can fund events like this.\"They have shown, whether it be from a world athletics perspective, whether it be from the women's rugby perspective, that they are prepared to put their hands in their pocket for certain events.\"To stage a Ryder Cup in Europe would cost around £100m but for the women's version it is around £30m. \"We're looking for circa £20m from the government to underwrite it,\" Tomlinson said.\"And that's to add to already a significant investment from both venue and ourselves and potentially other partners that we'd look to put money in.\"We'd like to think that it provides incredible value compared to other sporting investments that are a lot more sizeable than that, but it's not an insignificant amount of money that we need.\"We need it to be underwritten quickly, so that we can truly move forward with our bid and secure the Solheim Cup.\"He added:  \"I think if we could get a positive answer within the next month or so, we would be able to secure the Solheim Cup to come to England.\"I don't have the money right now; the bid doesn't move forward. It could change tomorrow if I got the thumbs up, but it really is on a tight time frame.\"The government's manifesto before the last election stated commitment to delivering international events and seeking new opportunities to inspire the next generation of talent while promoting exercise and healthy living.BBC Sport approached the Treasury for comment and in response a spokesman for the Department of Media, Culture and Sport, said: \"The UK has a world-leading reputation for hosting major sporting events and we want that to continue.\"Staging events on home soil captures imaginations, encourages participation and boosts local economies.\"We have a strong pipeline of events over the coming years from the Women's T20 World Cup in 2026 through to supporting a bid to host the Fifa Women's World Cup in 2035.\"Support for future bids will be based on a range of criteria including how far they help create social and economic benefits for the UK.\"",
        "The last Solheim Cup held on European soil was in Spain in 2023, with the next taking place in the Netherlands in 2026",
        "Following Europe's recent Ryder Cup success, England Golf is urging the government to underwrite its bid to stage the Solheim Cup in the country for the first time.",
        "The contest between the leading female golfers of Europe and the United States has been held twice in Scotland and in Wales but never in England. A bid has been put together to hold it at the The Grove in Hertfordshire in 2030.",
        "But organisers need £30m to back the bid and there is only £10m in place. England Golf is urgently seeking Treasury support to underwrite the shortfall.",
        "The bid document, seen by BBC Sport, states that England Golf believes a successful bid \"represents huge value for England\".",
        "It is also confident that with the necessary backing the attempt to lure the Solheim Cup to England would be successful.",
        "'Stirring final-day fightback cannot hide US Ryder Cup shortcomings'",
        "Two more years? Europe captain Donald not ruling out third term",
        "US beat Europe to end seven-year Solheim Cup drought",
        "Talks to secure Treasury backing began in early spring but an answer on whether it will be forthcoming is urgently needed. The rights for the 2030 match are held by the International Management Group (IMG) who want a resolution by the end of this month.",
        "\"We believe at this moment in time, it's right and proper that the Solheim Cup should come to England,\" England Golf's chief executive Jeremy Tomlinson told BBC Sport.",
        "\"We've provided so many players through the years and continue to do so, whether it's Charley (Hull), Georgia (Hall), or Lottie Woad.",
        "\"We have such inspirational women in the game of golf that we just think it would be fantastic to be able to get the Solheim Cup.\"",
        "But what would be the benefit to the taxpayer? \"We've just seen from the Ryder Cup the type of effect that huge golf events can have with regards to not just local economies, but to a nation.",
        "\"And that's certainly what we believe can happen from a Solheim Cup perspective, whether it's actually just the spend that would happen in and around the event or whether it be the job creation.",
        "\"But also the lead up and then the legacy post match. We believe both locally and nationally, there's an incredible return to host an event like this.",
        "\"Women in sport is just bang on where we need to be right now, making sure that we make sport the most equitable opportunity for men and women.",
        "\"We've seen what the Ryder Cup does for golf. We've seen what the Ryder Cup does for men's golf.\"",
        "Tomlinson insists that initial talks with government have been \"positive\" but now the process is entering a crunch period.",
        "\"With a good level of public support here, it could really help the government understand that this would be a right and proper action to take,\" he added.",
        "The Grove is located near Watford and is well placed to draw fans from the London catchment area.",
        "The venue has staged a World Golf Championships tournament and boasts hotel facilities commensurate with those required for hosting an event such as the Solheim Cup.",
        "Tomlinson refused to say that talks have reached an impasse, but admitted: \"There is definitely a quandary at the moment with regards to whether or not the government can fund events like this.",
        "\"They have shown, whether it be from a world athletics perspective, whether it be from the women's rugby perspective, that they are prepared to put their hands in their pocket for certain events.\"",
        "To stage a Ryder Cup in Europe would cost around £100m but for the women's version it is around £30m.",
        "\"We're looking for circa £20m from the government to underwrite it,\" Tomlinson said.",
        "\"And that's to add to already a significant investment from both venue and ourselves and potentially other partners that we'd look to put money in.",
        "\"We'd like to think that it provides incredible value compared to other sporting investments that are a lot more sizeable than that, but it's not an insignificant amount of money that we need.",
        "\"We need it to be underwritten quickly, so that we can truly move forward with our bid and secure the Solheim Cup.\"",
        "He added:  \"I think if we could get a positive answer within the next month or so, we would be able to secure the Solheim Cup to come to England.",
        "\"I don't have the money right now; the bid doesn't move forward. It could change tomorrow if I got the thumbs up, but it really is on a tight time frame.\"",
        "The government's manifesto before the last election stated commitment to delivering international events and seeking new opportunities to inspire the next generation of talent while promoting exercise and healthy living.",
        "BBC Sport approached the Treasury for comment and in response a spokesman for the Department of Media, Culture and Sport, said: \"The UK has a world-leading reputation for hosting major sporting events and we want that to continue.",
        "\"Staging events on home soil captures imaginations, encourages participation and boosts local economies.",
        "\"We have a strong pipeline of events over the coming years from the Women's T20 World Cup in 2026 through to supporting a bid to host the Fifa Women's World Cup in 2035.",
        "\"Support for future bids will be based on a range of criteria including how far they help create social and economic benefits for the UK.\""
      ]
    },
    {
      "url": "https://www.bbc.com/sport/golf/articles/cdjzm0p3gjdo",
      "main_category": "sport",
      "detailed_category": "golf",
      "topic": "'In Donald we trust' - how Europe's 'best-ever captain' masterminded win",
      "content": [
        "On the day President Trump visited the Ryder Cup, a homemade banner was tacked to a hospitality box alongside the 18th fairway at Bethpage.\"In Donald we trust,\" it read.The message was not aimed at the US President. The blue and yellow sign hailed European leader Luke Donald, who underlined the point by becoming only the fourth captain in history to win back-to-back Ryder Cups.When Trump met Donald on Friday, the politician told the 47-year-old Englishman he was a \"great leader\".Unsurprisingly, everyone at Bethpage agreed after Europe secured their rare away win on Sunday.\"Luke is the captain of this ship, and he's led us better than I can see anybody leading us. He set the bar extremely high for the future captains,\" said Spain's Jon Rahm as his team-mates nodded in agreement.Beaten US captain Keegan Bradley described Donald as the \"best European Ryder Cup captain ever\" - although Tony Jacklin might have something to say about that claim.Donald, who was a late replacement for LIV defector Henrik Stenson before Europe's 2023 win in Rome, is only the second man to lead Europe to home and away victories after Jacklin in 1985 and 1987.\"I think he turned this European team into a really unstoppable force,\" added Bradley.\"He put his team in the best position to win, and to do that at these two places is a remarkable feat.\"Following Europe's stellar success in New York, BBC Sport analyses how Donald masterminded it.",
        "When Donald led his side to success in Rome, the clamour immediately began for him to stay on in the captaincy.Chants of \"two more years\" - from both his celebrating players and jubilant fans - echoed around the Marco Simone Golf and Country Club. Their wish was granted when Donald's second term was confirmed that November.Since his initial appointment three years ago, he has developed into a statesman-like leader whose strong qualities are admired by his players, peers and supporters.\"He's obviously had a phenomenal career as a player, but I would certainly say there has been a public change in his confidence being in the captain's role,\" former Ryder Cup player Oliver Wilson, who has known Donald since they played US college golf together, told BBC Sport.\"He has realised he's really good at this and there are so many reasons why he's really good at this.\"Donald is described as a natural introvert by those who know him well, but they say he also carries an air of assurance which he transmits to his players.That is considered his greatest asset.Donald is regarded as a good communicator and ensuring everyone in the European camp knew their role bred confidence they would achieve their goal of beating the Americans in their Bethpage bearpit - where the visitors faced torrid abuse.\"When I was talking to some of the vice-captains earlier in the week, I was blown away by the confidence,\" Wilson added.\"It was a quiet confidence, but it genuinely caught me off guard. Normally people are a a little cagey. There was none of that. \"It was more like 'we are going to win, we are the better team, this is why we are going to win, we're just going to execute our plan'.\"I've never experienced that in a Ryder Cup environment. I was even fired up.\"",
        "Donald's playing CV - a former world number one and four-time Ryder Cup winner - is another integral ingredient in his successful leadership. Through his stature and amenable nature, he has been able to enhance a team spirit already fostered by friendships, but without the need for bonding sessions which feel forced.\"The players respect him so much. Luke has got to know his players inside out and having virtually the same team helps,\" Catriona Matthew, a two-time Solheim Cup-winning captain with home and away wins in 2019 and 2021, told BBC Sport.\"But he's still been out there at so many events over the past two years and talking to the players regularly. You've got to get that connection with the team.\"If the players see how much you put into it as a captain, they respect you all the more. The best captains make it about the team rather than them.\"Jose Maria Olazabal - the Spanish legend who was one of five Europe vice-captains - agrees Donald's close relationship with his players was a defining factor.\"From the start he was sending regular messages and motivating the players. In that regard the way the players were prepared was top class,\" he told BBC Sport.",
        "As soon as Donald's reappointment was confirmed, it was quickly back to business.Donald appointed 2014 captain Paul McGinley as his strategic advisor and the pair agreed on a subtle but key change to the approach for New York - the trip could not be treated in the same manner as a home match.The 'away template' was born.Part of that process was flying the team out to Bethpage together after most competed at the DP World Tour's flagship PGA Championship event at Wentworth.Golfing superstars are not exempt from suffering from jetlag, so going out almost two weeks before Friday's opening day meant they were fully in sync when the action started.Spending more time on Long Island enabled extra preparation on the ground.The European team could suss out the lay of the land at Bethpage Black - a daunting course which has hosted major championships - and work out the all-important partnerships.\"Going out early was one of the best things they've done – and I'm amazed it took so long to do it,\" said Wilson, who played in Europe’s 2008 defeat in Valhalla.\"This is an extremely tiring week and being jetlagged is not conducive to performing at your best. \"There is so many things you have to do at a Ryder Cup  – events at night, signing sessions, team photos, media, press, all sorts of things – you'd get done at 10:30pm and then up at 4:30/5am. \"So in the first week, they get the pairings done, figure out golf ball-wise who is doing what, talk through the strategy, see the course.\"All their work is done so when they rock up to play they can take it easier.\"",
        "Golf is no different to any other top-level sport in terms of the deep analysis which it relies on.Donald wanted to take the number-crunching to another level. He headed into Moneyball territory.That's why he appointed Edoardo Molinari, a team-mate in Europe's 2010 win at Celtic Manor, as one of his vice-captains.The 44-year-old Italian is known throughout the game for his approach to analytics and has been heavily leaned on by Donald.\"I'm going to give a lot of props to Edoardo,\" Donald said in his team's winning news conference on Sunday.\"Edoardo and I sit down and we chat for many, many hours about all the kind of different stats and the pairings and the personalities and the course fits.\"Molinari graduated from a five-year engineering degree before turning professional and founded a statistic-based company in 2020.The firm describes its database as \"golf's most advanced analytics for tour players\", a claim supported by many of the European Ryder Cup players using it.The depth of Molinari's work is illustrated by his team's analysis of driving statistics.",
        "The PGA Tour takes two drives from every player's round from holes faced in opposite directions to counteract the effect of wind. Molinari's team analyse every shot taken with a driver.\"If you look at the PGA Tour stats, they say the US team is longer off the tee. But Edoardo's stats present a more accurate representation of both teams - they say the European team is longer,\" said Wilson.\"So you look at the Bethpage course and the US have cut the rough down – that completely plays into the European hands. \"The US team are better on approach play but they are losing the advantage because Europe were hitting it further and can still play from the rough. \"Using Scottie Scheffler as an example, he was hamstrung to a degree because his strength is getting the ball in play off the tee. \"He's getting the ball in play but he's not getting the advantage because the European team can play from the rough.\"",
        "Has any great leader ever referenced hotel shampoo when asked for details about their leadership strategy? They have now.Donald is famous for his attention to detail and provided fascinating insight into how he leaves no stone unturned.When the team arrived at their hotel in Garden City, a salubrious Long Island village 12 miles to the west of Bethpage, things were not quite up to scratch.A crack in the doors to each room let in too much light. The bedding was not as comfortable as hoped. And the shampoo did not smell fragrant enough.Tyrrell Hatton and Shane Lowry, two of the more follicly-challenged players, rubbed their heads in agreement.\"My job is literally to give these guys a better chance to win. It can be as simple as some very small things,\" said Donald, who arranged for European sporting greats including Roger Federer and former NBA basketball player Pau Gasol to provide motivational messages to the team.\"It's just taking the time and having the care that you want to do everything you can to kind of give these guys the best opportunity.\"Another part of Donald's meticulous approach was providing virtual reality headsets to his players in an attempt to replicate the barrage abuse of abuse they would face from the boisterous Bethpage crowd.\"You want to create an environment where they can succeed. These are 12 amazing players, we know that,\" added Donald, who refused to take full credit for the work and thanked his whole backroom team.\"You're just trying to put them in a position where they feel comfortable.\"",
        "When Donald and his players stood on the victory podium with the Ryder Cup, a familiar chant returned.Thousands of European fans gathered behind the stage pleaded for Donald to serve another term at Adare Manor in 2027 and were joined by the jubilant players.A coy Donald shook his head.\"I'm not sure my heart can take it,\" he smiled.Given the amount of time and effort he has put into the job, you have to wonder if he does have enough energy to devote to another tilt.Unsurprisingly, his future cropped up in the post-match news conference.With his surrounding players restarting the chant, Donald was asked what his response would be if the question was posed from the European tour.\"My answer is I'm going to enjoy tonight,\" he said.Maybe Kinnings should collar Donald when he has sunk a few celebratory beers. Two more years?",
        "This video can not be played",
        "How a dramatic end to the Ryder Cup unfolded",
        "On the day President Trump visited the Ryder Cup, a homemade banner was tacked to a hospitality box alongside the 18th fairway at Bethpage.",
        "\"In Donald we trust,\" it read.",
        "The message was not aimed at the US President.",
        "The blue and yellow sign hailed European leader Luke Donald, who underlined the point by becoming only the fourth captain in history to win back-to-back Ryder Cups.",
        "When Trump met Donald on Friday, the politician told the 47-year-old Englishman he was a \"great leader\".",
        "Unsurprisingly, everyone at Bethpage agreed after Europe secured their rare away win on Sunday.",
        "\"Luke is the captain of this ship, and he's led us better than I can see anybody leading us. He set the bar extremely high for the future captains,\" said Spain's Jon Rahm as his team-mates nodded in agreement.",
        "Beaten US captain Keegan Bradley described Donald as the \"best European Ryder Cup captain ever\" - although Tony Jacklin might have something to say about that claim.",
        "Donald, who was a late replacement for LIV defector Henrik Stenson before Europe's 2023 win in Rome, is only the second man to lead Europe to home and away victories after Jacklin in 1985 and 1987.",
        "\"I think he turned this European team into a really unstoppable force,\" added Bradley.",
        "\"He put his team in the best position to win, and to do that at these two places is a remarkable feat.\"",
        "Following Europe's stellar success in New York, BBC Sport analyses how Donald masterminded it.",
        "Two more years? Europe captain Donald not ruling out third term",
        "Luke Donald is only the second European Ryder Cup captain to lead the side to home and away victories",
        "When Donald led his side to success in Rome, the clamour immediately began for him to stay on in the captaincy.",
        "Chants of \"two more years\" - from both his celebrating players and jubilant fans - echoed around the Marco Simone Golf and Country Club.",
        "Their wish was granted when Donald's second term was confirmed that November.",
        "Since his initial appointment three years ago, he has developed into a statesman-like leader whose strong qualities are admired by his players, peers and supporters.",
        "\"He's obviously had a phenomenal career as a player, but I would certainly say there has been a public change in his confidence being in the captain's role,\" former Ryder Cup player Oliver Wilson, who has known Donald since they played US college golf together, told BBC Sport.",
        "\"He has realised he's really good at this and there are so many reasons why he's really good at this.\"",
        "Donald is described as a natural introvert by those who know him well, but they say he also carries an air of assurance which he transmits to his players.",
        "That is considered his greatest asset.",
        "Donald is regarded as a good communicator and ensuring everyone in the European camp knew their role bred confidence they would achieve their goal of beating the Americans in their Bethpage bearpit - where the visitors faced torrid abuse.",
        "\"When I was talking to some of the vice-captains earlier in the week, I was blown away by the confidence,\" Wilson added.",
        "\"It was a quiet confidence, but it genuinely caught me off guard. Normally people are a a little cagey. There was none of that.",
        "\"It was more like 'we are going to win, we are the better team, this is why we are going to win, we're just going to execute our plan'.",
        "\"I've never experienced that in a Ryder Cup environment. I was even fired up.\"",
        "Donald's playing CV - a former world number one and four-time Ryder Cup winner - is another integral ingredient in his successful leadership.",
        "Through his stature and amenable nature, he has been able to enhance a team spirit already fostered by friendships, but without the need for bonding sessions which feel forced.",
        "\"The players respect him so much. Luke has got to know his players inside out and having virtually the same team helps,\" Catriona Matthew, a two-time Solheim Cup-winning captain with home and away wins in 2019 and 2021, told BBC Sport.",
        "\"But he's still been out there at so many events over the past two years and talking to the players regularly. You've got to get that connection with the team.",
        "\"If the players see how much you put into it as a captain, they respect you all the more. The best captains make it about the team rather than them.\"",
        "Jose Maria Olazabal - the Spanish legend who was one of five Europe vice-captains - agrees Donald's close relationship with his players was a defining factor.",
        "\"From the start he was sending regular messages and motivating the players. In that regard the way the players were prepared was top class,\" he told BBC Sport.",
        "This video can not be played",
        "Donald 'so proud' of his European team",
        "As soon as Donald's reappointment was confirmed, it was quickly back to business.",
        "Donald appointed 2014 captain Paul McGinley as his strategic advisor and the pair agreed on a subtle but key change to the approach for New York - the trip could not be treated in the same manner as a home match.",
        "The 'away template' was born.",
        "Part of that process was flying the team out to Bethpage together after most competed at the DP World Tour's flagship PGA Championship event at Wentworth.",
        "Golfing superstars are not exempt from suffering from jetlag, so going out almost two weeks before Friday's opening day meant they were fully in sync when the action started.",
        "Spending more time on Long Island enabled extra preparation on the ground.",
        "The European team could suss out the lay of the land at Bethpage Black - a daunting course which has hosted major championships - and work out the all-important partnerships.",
        "\"Going out early was one of the best things they've done – and I'm amazed it took so long to do it,\" said Wilson, who played in Europe’s 2008 defeat in Valhalla.",
        "\"This is an extremely tiring week and being jetlagged is not conducive to performing at your best.",
        "\"There is so many things you have to do at a Ryder Cup  – events at night, signing sessions, team photos, media, press, all sorts of things – you'd get done at 10:30pm and then up at 4:30/5am.",
        "\"So in the first week, they get the pairings done, figure out golf ball-wise who is doing what, talk through the strategy, see the course.",
        "\"All their work is done so when they rock up to play they can take it easier.\"",
        "Europe sneak past US in sensational Ryder Cup",
        "Ryder Cup fan behaviour unacceptable - McIlroy",
        "Golf is no different to any other top-level sport in terms of the deep analysis which it relies on.",
        "Donald wanted to take the number-crunching to another level. He headed into Moneyball territory.",
        "That's why he appointed Edoardo Molinari, a team-mate in Europe's 2010 win at Celtic Manor, as one of his vice-captains.",
        "The 44-year-old Italian is known throughout the game for his approach to analytics and has been heavily leaned on by Donald.",
        "\"I'm going to give a lot of props to Edoardo,\" Donald said in his team's winning news conference on Sunday.",
        "\"Edoardo and I sit down and we chat for many, many hours about all the kind of different stats and the pairings and the personalities and the course fits.\"",
        "Molinari graduated from a five-year engineering degree before turning professional and founded a statistic-based company in 2020.",
        "The firm describes its database as \"golf's most advanced analytics for tour players\", a claim supported by many of the European Ryder Cup players using it.",
        "The depth of Molinari's work is illustrated by his team's analysis of driving statistics.",
        "This video can not be played",
        "We've shut up a lot of people - McIlroy",
        "The PGA Tour takes two drives from every player's round from holes faced in opposite directions to counteract the effect of wind. Molinari's team analyse every shot taken with a driver.",
        "\"If you look at the PGA Tour stats, they say the US team is longer off the tee. But Edoardo's stats present a more accurate representation of both teams - they say the European team is longer,\" said Wilson.",
        "\"So you look at the Bethpage course and the US have cut the rough down – that completely plays into the European hands.",
        "\"The US team are better on approach play but they are losing the advantage because Europe were hitting it further and can still play from the rough.",
        "\"Using Scottie Scheffler as an example, he was hamstrung to a degree because his strength is getting the ball in play off the tee.",
        "\"He's getting the ball in play but he's not getting the advantage because the European team can play from the rough.\"",
        "Bradley wants Ryder Cup rule changed after defeat",
        "Has any great leader ever referenced hotel shampoo when asked for details about their leadership strategy? They have now.",
        "Donald is famous for his attention to detail and provided fascinating insight into how he leaves no stone unturned.",
        "When the team arrived at their hotel in Garden City, a salubrious Long Island village 12 miles to the west of Bethpage, things were not quite up to scratch.",
        "A crack in the doors to each room let in too much light. The bedding was not as comfortable as hoped. And the shampoo did not smell fragrant enough.",
        "Tyrrell Hatton and Shane Lowry, two of the more follicly-challenged players, rubbed their heads in agreement.",
        "\"My job is literally to give these guys a better chance to win. It can be as simple as some very small things,\" said Donald, who arranged for European sporting greats including Roger Federer and former NBA basketball player Pau Gasol to provide motivational messages to the team.",
        "\"It's just taking the time and having the care that you want to do everything you can to kind of give these guys the best opportunity.\"",
        "Another part of Donald's meticulous approach was providing virtual reality headsets to his players in an attempt to replicate the barrage abuse of abuse they would face from the boisterous Bethpage crowd.",
        "\"You want to create an environment where they can succeed. These are 12 amazing players, we know that,\" added Donald, who refused to take full credit for the work and thanked his whole backroom team.",
        "\"You're just trying to put them in a position where they feel comfortable.\"",
        "When Donald and his players stood on the victory podium with the Ryder Cup, a familiar chant returned.",
        "Thousands of European fans gathered behind the stage pleaded for Donald to serve another term at Adare Manor in 2027 and were joined by the jubilant players.",
        "A coy Donald shook his head.",
        "\"I'm not sure my heart can take it,\" he smiled.",
        "Given the amount of time and effort he has put into the job, you have to wonder if he does have enough energy to devote to another tilt.",
        "Unsurprisingly, his future cropped up in the post-match news conference.",
        "With his surrounding players restarting the chant, Donald was asked what his response would be if the question was posed from the European tour.",
        "\"My answer is I'm going to enjoy tonight,\" he said.",
        "Maybe Kinnings should collar Donald when he has sunk a few celebratory beers. Two more years?"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/golf/articles/cx2x4v79yv1o",
      "main_category": "sport",
      "detailed_category": "golf",
      "topic": "Two more years? Europe captain Donald not ruling out third term",
      "content": [
        "Luke Donald has not ruled out a third term as European Ryder Cup captain, but says he will not \"rush into a decision\" as the away celebrations continue in New York.Donald, 47, sealed his place as one of Europe's greatest captains after masterminding a tense victory over the United States in New York.He became only the second European captain - after Tony Jacklin in 1985 and 1987 - to win back-to-back Ryder Cups.\"A lot of people questioned why I would do it a second time after doing it so well in Rome,\" Donald told BBC Sport from the European team's Long Island hotel on Monday. \"But home and away is a different challenge and I've ticked both those boxes.\"Whether I do it again is something I'll have to think about.\"Europe will defend the trophy on home soil in 2027, when the contest resumes at Adare Manor in Ireland on 17-19 September.In a wide-ranging interview, Donald also:discussed the unruly behaviour of American fanspraised the home team for trying to quell the vitriolindicated Europe have not received an apology from their hostsadmitted he thought at one point Europe were going to loserevealed how Rory McIlroy received a text from Donald Trump",
        "If Donald does end up leading the team in County Limerick, he will be the first European captain to serve three terms since Bernard Gallacher in 1995.Donald was initially appointed as a late replacement before the 2023 edition when, little over a year out from the Rome contest, LIV defector Henrik Stenson was told he would not be allowed to take on the role.After Donald guided the home side to a commanding victory, his players and thousands of fans clamoured for the Englishman to be given another term.The same chant of 'Two more years!' erupted as the Englishman clutched the Ryder Cup again at Bethpage on Sunday in the aftermath of a tenser-than-expected win.The players burst into song again during the team's victory news conference.\"I'm very humbled and grateful that some of the players and the fans were chanting two years again,\" he said.\"I'll never rule [doing it a third time] out.\"Everything I do I sit down and think about it in preparation. What is the cost, what are we doing here, how are we going to be successful, what are the challenges.\"I'm not going to rush into a decision like this today. I just want to enjoy this one.\"Justin Rose, who played in Bethpage, has been touted as a potential successor if Donald does not continue, while one of Molinari brothers - Donald's vice-captains Edoardo and Francesco - could be options if Europe opt to promote from within.Whoever takes over has a tough task, as both Jon Rahm and Shane Lowry warned on Sunday.\"It's like trying to come in after [Manchester United football manager] Sir Alex Ferguson.\" Lowry told newspaper reporters., external\"We've seen how that's gone over the last 12 years. I think it'll be very tough shoes to fill.\"",
        "Europe's victory came amid torrents of verbal abuse from a New York crowd which  was heavily criticised for its behaviour.American great Tom Watson, the eight-time major champion who twice led the US team in 1993 and 2014, said he was \"ashamed\" of the unruly scenes.\"I'd like to apologise for the rude and mean-spirited behaviour from our American crowd at Bethpage,\" said 76-year-old Watson.European talisman Rory McIlroy was the prime target from the American galleries, while his wife Erica was hit by a drinks cup flung from one of the stands.After sealing victory on Sunday, McIlroy said the level of the personal insults was unacceptable.BBC Sport has contacted New York State Police for figures of any arrest and ejections over the weekend.\"[The behaviour] needs to be talked about and needs to be addressed,\" said Donald, who praised police officers for their handling of a febrile situation.\"I don't know how you rein it in, the odd people who shout. It is a tricky one. \"We would love to just play and the US players were great on trying to quieten crowd.\"Many Americans were coming up to say they how embarrassed they were for some of their fans. It was a small subset and don't know how you control it.\"While Watson was gracious on social media, there has not been an official apology from the US team.However, Donald thanked US counterpart Keegan Bradley and his players for attempting to ask the crowd to show respect.\"I think the Americans were acting in the right way,\" said Donald. \"They understand they want the crowd to support them but not to be vitriolic against us.\"BBC Sport has contacted the PGA of America - which organised the tournament - for a response to Donald and McIlroy's comments.",
        "With Europe holding a record 11½-4½ lead going into the Sunday singles, most envisaged a straightforward gallop over the line.Instead, the visitors had to hold off the Americans as they threatened to complete the biggest comeback in Ryder Cup history.The relief was clear as Donald and his jubilant players celebrated with thousands of European fans gathered at Bethpage, swigging beers in their winning news conference and spraying champagne on the putting green.The party continued back at the team hotel with their families, caddies and other backroom staff.The American contingent were staying in the same hotel, where they had a separate function.\"It was the most stressful day of my life on a golf course,\" said Donald, who added that he finally enjoyed a \"few glasses\" after going teetotal in the build-up.\"I thought Rome was stressful but that beat it by quite a bit,\" he said.\"At one point I thought we'd get to 20 points and then at another point I thought we were going to lose.\"It was a weird, weird day.\"",
        "This video can not be played",
        "'McIlroy got a text from the President' - Donald on Ryder Cup celebrations & his future as captain",
        "Luke Donald has not ruled out a third term as European Ryder Cup captain, but says he will not \"rush into a decision\" as the away celebrations continue in New York.",
        "Donald, 47, sealed his place as one of Europe's greatest captains after masterminding a tense victory over the United States in New York.",
        "He became only the second European captain - after Tony Jacklin in 1985 and 1987 - to win back-to-back Ryder Cups.",
        "\"A lot of people questioned why I would do it a second time after doing it so well in Rome,\" Donald told BBC Sport from the European team's Long Island hotel on Monday.",
        "\"But home and away is a different challenge and I've ticked both those boxes.",
        "\"Whether I do it again is something I'll have to think about.\"",
        "Europe will defend the trophy on home soil in 2027, when the contest resumes at Adare Manor in Ireland on 17-19 September.",
        "In a wide-ranging interview, Donald also:",
        "discussed the unruly behaviour of American fans",
        "praised the home team for trying to quell the vitriol",
        "indicated Europe have not received an apology from their hosts",
        "admitted he thought at one point Europe were going to lose",
        "revealed how Rory McIlroy received a text from Donald Trump",
        "If Donald does end up leading the team in County Limerick, he will be the first European captain to serve three terms since Bernard Gallacher in 1995.",
        "Donald was initially appointed as a late replacement before the 2023 edition when, little over a year out from the Rome contest, LIV defector Henrik Stenson was told he would not be allowed to take on the role.",
        "After Donald guided the home side to a commanding victory, his players and thousands of fans clamoured for the Englishman to be given another term.",
        "The same chant of 'Two more years!' erupted as the Englishman clutched the Ryder Cup again at Bethpage on Sunday in the aftermath of a tenser-than-expected win.",
        "The players burst into song again during the team's victory news conference.",
        "\"I'm very humbled and grateful that some of the players and the fans were chanting two years again,\" he said.",
        "\"I'll never rule [doing it a third time] out.",
        "\"Everything I do I sit down and think about it in preparation. What is the cost, what are we doing here, how are we going to be successful, what are the challenges.",
        "\"I'm not going to rush into a decision like this today. I just want to enjoy this one.\"",
        "Justin Rose, who played in Bethpage, has been touted as a potential successor if Donald does not continue, while one of Molinari brothers - Donald's vice-captains Edoardo and Francesco - could be options if Europe opt to promote from within.",
        "Whoever takes over has a tough task, as both Jon Rahm and Shane Lowry warned on Sunday.",
        "\"It's like trying to come in after [Manchester United football manager] Sir Alex Ferguson.\" Lowry told newspaper reporters., external",
        "\"We've seen how that's gone over the last 12 years. I think it'll be very tough shoes to fill.\"",
        "Trump texts McIlroy - Europe troll US President in reply",
        "'In Donald we trust' - how Europe's 'best-ever captain' masterminded win",
        "Ryder Cup fan behaviour unacceptable - McIlroy",
        "Europe's victory came amid torrents of verbal abuse from a New York crowd which  was heavily criticised for its behaviour.",
        "American great Tom Watson, the eight-time major champion who twice led the US team in 1993 and 2014, said he was \"ashamed\" of the unruly scenes.",
        "\"I'd like to apologise for the rude and mean-spirited behaviour from our American crowd at Bethpage,\" said 76-year-old Watson.",
        "European talisman Rory McIlroy was the prime target from the American galleries, while his wife Erica was hit by a drinks cup flung from one of the stands.",
        "After sealing victory on Sunday, McIlroy said the level of the personal insults was unacceptable.",
        "BBC Sport has contacted New York State Police for figures of any arrest and ejections over the weekend.",
        "\"[The behaviour] needs to be talked about and needs to be addressed,\" said Donald, who praised police officers for their handling of a febrile situation.",
        "\"I don't know how you rein it in, the odd people who shout. It is a tricky one.",
        "\"We would love to just play and the US players were great on trying to quieten crowd.",
        "\"Many Americans were coming up to say they how embarrassed they were for some of their fans. It was a small subset and don't know how you control it.\"",
        "While Watson was gracious on social media, there has not been an official apology from the US team.",
        "However, Donald thanked US counterpart Keegan Bradley and his players for attempting to ask the crowd to show respect.",
        "\"I think the Americans were acting in the right way,\" said Donald.",
        "\"They understand they want the crowd to support them but not to be vitriolic against us.\"",
        "BBC Sport has contacted the PGA of America - which organised the tournament - for a response to Donald and McIlroy's comments.",
        "Luke Donald has captained Europe to two Ryder Cup victories",
        "With Europe holding a record 11½-4½ lead going into the Sunday singles, most envisaged a straightforward gallop over the line.",
        "Instead, the visitors had to hold off the Americans as they threatened to complete the biggest comeback in Ryder Cup history.",
        "The relief was clear as Donald and his jubilant players celebrated with thousands of European fans gathered at Bethpage, swigging beers in their winning news conference and spraying champagne on the putting green.",
        "The party continued back at the team hotel with their families, caddies and other backroom staff.",
        "The American contingent were staying in the same hotel, where they had a separate function.",
        "\"It was the most stressful day of my life on a golf course,\" said Donald, who added that he finally enjoyed a \"few glasses\" after going teetotal in the build-up.",
        "\"I thought Rome was stressful but that beat it by quite a bit,\" he said.",
        "\"At one point I thought we'd get to 20 points and then at another point I thought we were going to lose.",
        "\"It was a weird, weird day.\""
      ]
    },
    {
      "url": "https://www.bbc.com/sport/golf/articles/cqje8edyyz0o",
      "main_category": "sport",
      "detailed_category": "golf",
      "topic": "'Stirring final-day fightback cannot hide US Ryder Cup shortcomings'",
      "content": [
        "America's final-day comeback brought unexpected respectability to the final score, but also exposed how far the US lag behind Europe in their Ryder Cup efforts.By thoroughly dominating the closing singles, Keegan Bradley's team showed they had heart and ability aplenty, especially in a situation where they had nothing to lose.But, effectively, last week's 45th Ryder Cup had already been won by Europe before that last session teed off.Yes, it was tense and Luke Donald's line-up only just limped over the line to win 15-13, but they had done enough on the first two days to make it possible.Why? Because Europe's Ryder Cup culture, planning and strategy is vastly superior compared with counterparts who lurch from one form of leadership to another.",
        "The contrast could instantly be heard in the captains' speeches at the opening ceremony. Donald was all about the collective effort, Bradley was about his own passion for the Ryder Cup.It was self-centred and based on the emotions that were laid bare on Netflix's Full Swing documentary. From there he became a shock candidate for the captaincy.The lead-up was all about him, too. Would he play, wouldn't he? Unnecessary distractions while Donald and his team of statisticians and strategists worked out the best way to beat America in their own backyard.Bradley offered a glorious motivation with his infamous speech at last year's Presidents Cup, proclaiming that the US would \"kick Europe's [expletive] asses\".That went straight on to the European team-room wall.But more pertinently, the visitors knew what to expect from the course set-up and could prepare accordingly. Bradley changed nothing from the usual approach of short rough, thick grass around the greens and slick putting surfaces.And it backfired miserably for his team. \"We tried to set the course up to help our team,\" he said. \"Obviously it wasn't the right decision.\"I definitely made a mistake on the course set-up. I should have listened a little bit more to my intuition.\"For whatever reason, that wasn't the right way to set the course up. The greens were as soft as I've ever seen greens without it raining. Especially here, it can get pretty firm, and they never firmed up.\"You look at past Ryder Cups, and that's kind of how it goes. If I could go back, I probably would have changed that.\"",
        "Bradley had selected vice-captains Kevin Kisner and Gary Woodland despite neither having any Ryder Cup experience - compare that with Europe's stacked backroom team.It included winning skippers Paul McGinley (director of strategy), Thomas Bjorn and Jose Maria Olazabal. Alex Noren is firmly in touch with the leading players, likewise Francesco Molinari.The other Molinari, Edoardo, is a statistical wizard. He compiles his own extensive data rather than rely on less complete stats that might be available.The Italian, who played with his brother in the 2010 victory, has a track record of successfully informing which partnerships will work and which ones will not.So when it came to the foursomes, where the home team traditionally dominates, Europe won 6-2. They built a record lead of 11½-4½ by the Saturday night and throughout it all the players knew their leaders had their backs.\"We said it from the start - we're a big band of brothers,\" Robert MacIntyre told BBC Sport the morning after Europe's fifth away victory.\"It's a special feeling to do it again, but to do it when we were kind of written off and to do it in the style we've done it was huge.\"Europe had plans to deal with the hostility of the crowds. \"It was absolute carnage out there, but it makes it that much better that we managed to handle it,\" MacIntyre said.\"I mean, we play for each other. We do anything. Look, Luke told me I was playing foursomes. I play foursomes.\"I don't argue or ask 'can I play fourball?' I do as I'm told. And I think everyone in the team does the exact same.\"Luke tells you to jump, you ask 'how high?' As Europeans that's the only way we know.\"When I grew up playing team sports, you listened to the coaches, you listened to people in charge and did what you were told.\"And everyone in there, from myself to Rory [McIlroy], to [Jon] Rahm, everyone just does what we're told.\"Professional golfers are the ultimate sporting individuals - their own bosses week in, week out. They are not used to having others order them around.Europe have long since known this and created the culture described by MacIntyre, a veteran of many a shinty team room, to get the best out of such characters.America are some way from finding such a formula - it is why they seem to only perform when they are on their own.",
        "This video can not be played",
        "How a dramatic end to the Ryder Cup unfolded",
        "America's final-day comeback brought unexpected respectability to the final score, but also exposed how far the US lag behind Europe in their Ryder Cup efforts.",
        "By thoroughly dominating the closing singles, Keegan Bradley's team showed they had heart and ability aplenty, especially in a situation where they had nothing to lose.",
        "But, effectively, last week's 45th Ryder Cup had already been won by Europe before that last session teed off.",
        "Yes, it was tense and Luke Donald's line-up only just limped over the line to win 15-13, but they had done enough on the first two days to make it possible.",
        "Why? Because Europe's Ryder Cup culture, planning and strategy is vastly superior compared with counterparts who lurch from one form of leadership to another.",
        "Two more years? Europe captain Donald not ruling out third term",
        "Europe sneak past US in sensational Ryder Cup",
        "Ryder Cup fan behaviour unacceptable - McIlroy",
        "The contrast could instantly be heard in the captains' speeches at the opening ceremony. Donald was all about the collective effort, Bradley was about his own passion for the Ryder Cup.",
        "It was self-centred and based on the emotions that were laid bare on Netflix's Full Swing documentary. From there he became a shock candidate for the captaincy.",
        "The lead-up was all about him, too. Would he play, wouldn't he? Unnecessary distractions while Donald and his team of statisticians and strategists worked out the best way to beat America in their own backyard.",
        "Bradley offered a glorious motivation with his infamous speech at last year's Presidents Cup, proclaiming that the US would \"kick Europe's [expletive] asses\".",
        "That went straight on to the European team-room wall.",
        "But more pertinently, the visitors knew what to expect from the course set-up and could prepare accordingly. Bradley changed nothing from the usual approach of short rough, thick grass around the greens and slick putting surfaces.",
        "And it backfired miserably for his team. \"We tried to set the course up to help our team,\" he said. \"Obviously it wasn't the right decision.",
        "\"I definitely made a mistake on the course set-up. I should have listened a little bit more to my intuition.",
        "\"For whatever reason, that wasn't the right way to set the course up. The greens were as soft as I've ever seen greens without it raining. Especially here, it can get pretty firm, and they never firmed up.",
        "\"You look at past Ryder Cups, and that's kind of how it goes. If I could go back, I probably would have changed that.\"",
        "This video can not be played",
        "We've shut up a lot of people - McIlroy",
        "Bradley had selected vice-captains Kevin Kisner and Gary Woodland despite neither having any Ryder Cup experience - compare that with Europe's stacked backroom team.",
        "It included winning skippers Paul McGinley (director of strategy), Thomas Bjorn and Jose Maria Olazabal. Alex Noren is firmly in touch with the leading players, likewise Francesco Molinari.",
        "The other Molinari, Edoardo, is a statistical wizard. He compiles his own extensive data rather than rely on less complete stats that might be available.",
        "The Italian, who played with his brother in the 2010 victory, has a track record of successfully informing which partnerships will work and which ones will not.",
        "So when it came to the foursomes, where the home team traditionally dominates, Europe won 6-2. They built a record lead of 11½-4½ by the Saturday night and throughout it all the players knew their leaders had their backs.",
        "\"We said it from the start - we're a big band of brothers,\" Robert MacIntyre told BBC Sport the morning after Europe's fifth away victory.",
        "\"It's a special feeling to do it again, but to do it when we were kind of written off and to do it in the style we've done it was huge.\"",
        "Europe had plans to deal with the hostility of the crowds. \"It was absolute carnage out there, but it makes it that much better that we managed to handle it,\" MacIntyre said.",
        "\"I mean, we play for each other. We do anything. Look, Luke told me I was playing foursomes. I play foursomes.",
        "\"I don't argue or ask 'can I play fourball?' I do as I'm told. And I think everyone in the team does the exact same.",
        "\"Luke tells you to jump, you ask 'how high?' As Europeans that's the only way we know.",
        "\"When I grew up playing team sports, you listened to the coaches, you listened to people in charge and did what you were told.",
        "\"And everyone in there, from myself to Rory [McIlroy], to [Jon] Rahm, everyone just does what we're told.\"",
        "Professional golfers are the ultimate sporting individuals - their own bosses week in, week out. They are not used to having others order them around.",
        "Europe have long since known this and created the culture described by MacIntyre, a veteran of many a shinty team room, to get the best out of such characters.",
        "America are some way from finding such a formula - it is why they seem to only perform when they are on their own.",
        "This video can not be played",
        "'McIlroy got a text from the President' - Donald on Ryder Cup celebrations & his future as captain"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/golf/articles/c0m4g7k4l0yo",
      "main_category": "sport",
      "detailed_category": "golf",
      "topic": "How Europe held off US to win sensational Ryder Cup",
      "content": [
        "The 'Battering at Bethpage'. The 'Larruping on Long Island'. The 'Nobbling in New York'.The headlines were being written long before Sunday's Ryder Cup singles had even teed off such was Europe's domination over the opening two days. A record seven points they led by. 11½-4½. Just three points from 12 matches needed for victory.No side had ever come from more than four points back to win. A formality for the visitors? Not so fast. The Americans put up a fight that will be talked about for decades to come, but in the end Europe stumbled to a 15-13 victory, with Ludvig Aberg the only player to win his match, while six home players registered wins.Tyrrell Hatton, playing in match 10, finally got Europe to the magic 14½ points mark as they became the fifth European side to win an away match - and the first since 2012.It was fitting that the Englishman should secure the winning point given he was one of two undefeated players this week. The other was Shane Lowry, who holed the putt to take Europe to 14 points and ensure they would at least retain the trophy.World number two Rory McIlroy, who was the main target of a hostile New York crowd over the three days, said the victory \"shut up\" the home crowd after their \"unacceptable and abusive behaviour\". McIlroy's wife, Erica, was hit by a drink thrown by an American fan on Saturday, and both McIlroy and Lowry received cruel barbs during the tournament.Lowry and McIlroy both praised Erica's response, with McIlroy saying his wife \"handled everything this week with class and poise and dignity\".\"Golf should be held to a higher standard than what was seen out there this week,\" he added.",
        "The triumph cements Luke Donald's status as a bona fide Ryder Cup legend. After masterminding the 'Romp in Rome' in 2023, the Englishman - who also won all four Ryder Cups he played in - has become the second captain, after Tony Jacklin in 1985 and 1987, to lead the side to home and away victories. He is the only man to win home and away as a player as well.",
        "The US needed 10 points to regain the trophy. No side had ever won more than 8½ from the 12 singles matches.And their task was made that little bit harder when Europe announced Viktor Hovland would be unable to play because of a neck injury. Ryder Cup rules dictate that one US player also sits out and each team gets a half point. 12-5 Europe. When Cam Young and Justin Rose emerged on the first tee for the opening match, nobody could have dreamed of the drama that would follow.Even the notoriously feisty New York fans were there in hope, rather than expectation. It was the hope that killed them.New York-born Young, a rookie in the US side, birdied the first to get the earliest of red on the scoreboard. But Rose bounced back to go one ahead after five. Behind him Tommy Fleetwood, Matt Fitzpatrick, Rory McIlroy and Aberg were all leading. Bethpage Black was Bethpage Blue and the crowd went quiet.",
        "The script was following the previous days. Europe were in complete control.But then. Young won four of seven holes to go three ahead. Justin Thomas claimed three successive holes to lead Fleetwood. And Bryson DeChambeau was whittling away after losing five of the first seven to Fitzpatrick.Aberg's blue was erased from the scoreboard by Patrick Cantlay as the ebbs and flows of a Ryder Cup Sunday took hold with American cheers reverberating around this huge plot of land.Sepp Straka started fast but was pegged back and overtaken by JJ Spaun. Shane Lowry was embroiled in a tight tussle with Russell Henley, while Rasmus Hojgaard was never ahead against Ben Griffin.In the early matches, the finish line was in sight. Rose fought back to take Young down the last. The Englishman had a putt from 20 feet to secure at least a half point. He missed. Young from two feet closer, drained his and the youngest man on the US team had beaten Europe's elder statesman. 12-6.",
        "Fleetwood and Thomas jousted through the back nine and also made it to the last all square. Again the American's would emerge victorious, Thomas dropping a 15-footer. 12-7.In the only real beating handed out, Xander Schauffele strolled to victory over Jon Rahm, winning four of five holes on the back nine to ease to a 4&3 win. 12-8.European eyes were suddenly scouring the scoreboard to see where the 2½ points needed were going to come from.Aberg provided one. A par on the 17th was enough to see off Cantlay's challenge. But it would be Europe's only full point - the lowest in 12-match singles history. 13-8.DeChambeau's drive and desire had hauled in Fitzpatrick. Sensational birdies on the 14th and 15th, and a par on the 17th, was enough to also send them down the last all square. This time there would be no American birdie though and Europe had a half point. 13½-8½.DeChambeau still celebrated it like he'd won the Ryder Cup. And suddenly, the US team had belief that this might just be possible. The fans were certainly invested. Perhaps too much at times.McIlroy was once again the focus of their attention. The Northern Irishman has been abused all week and Sunday was no exception, with barbs being fired from the sidelines.But he had somehow kept his head to deliver 3½ points from four matches. His opponent on Sunday, the world number one Scottie Scheffler, had lost all four of his outings. The American was due a point.And he delivered. McIlroy, who conceded neither player was at their best, pushed him to the 18th but was unable to hole a monster birdie try as Scheffler put another point on the board. 13½-9½.Europe still needed a half from somewhere. Anywhere. But for the first time in three days there was no blue to be seen.Hatton and Robert MacIntyre were in dogfights with Collin Morikawa and Sam Burns respectively in the final two matches out on the course.US Open champion Spaun held off Straka. 13½-10½.But then hope. Lowry birdied the 15th to drag Henley back to a one-hole lead and they became the fifth match to head down 18. Both players found the green with their second shots. Henley putted first and missed. Lowry, from eight feet, had a chance to win the hole, halve the match and reach the 14 points Europe needed as holders to retain the trophy.It dropped. And Lowry exploded. The emotion flooded out as he jigged and wheeled across the green. He had been embroiled in several spats with the fans during his round with McIlroy on Saturday so you could understand his levels of celebration as American fans began to flood out of the course. 14-11.Europe had not come for the tie and retention though. The final three matches also went to the final hole. Griffin held off Hojgaard. 14-12.It looked like Hatton would be the one. His birdie on the 12th had drawn him level with Morikawa and the two were unable to separate themselves. If the Englishman could match Morikawa's score on the 18th, the trophy would be won.The American's lengthy birdie putt missed. Hatton had two putts to win the Ryder Cup from 20 feet. He cosied his birdie try to tap-in. Morikawa conceded. The celebrations could properly begin. 14½-12½.Scotland's MacIntyre brought up the rear and won the final hole with a par to snatch a half point against Burns. 15-13.It also meant the US had remarkably matched the Ryder Cup record of 8½ points in the singles but all the celebrations were blue.McIlroy declared after the win in Rome two years ago that they would win in Bethpage. He also said \"winning away is the hardest thing to achieve in golf\". He was correct on both fronts.",
        "This video can not be played",
        "How a dramatic end to the Ryder Cup unfolded",
        "The 'Battering at Bethpage'. The 'Larruping on Long Island'. The 'Nobbling in New York'.",
        "The headlines were being written long before Sunday's Ryder Cup singles had even teed off such was Europe's domination over the opening two days. A record seven points they led by. 11½-4½. Just three points from 12 matches needed for victory.",
        "No side had ever come from more than four points back to win. A formality for the visitors?",
        "Not so fast. The Americans put up a fight that will be talked about for decades to come, but in the end Europe stumbled to a 15-13 victory, with Ludvig Aberg the only player to win his match, while six home players registered wins.",
        "Tyrrell Hatton, playing in match 10, finally got Europe to the magic 14½ points mark as they became the fifth European side to win an away match - and the first since 2012.",
        "It was fitting that the Englishman should secure the winning point given he was one of two undefeated players this week. The other was Shane Lowry, who holed the putt to take Europe to 14 points and ensure they would at least retain the trophy.",
        "World number two Rory McIlroy, who was the main target of a hostile New York crowd over the three days, said the victory \"shut up\" the home crowd after their \"unacceptable and abusive behaviour\".",
        "McIlroy's wife, Erica, was hit by a drink thrown by an American fan on Saturday, and both McIlroy and Lowry received cruel barbs during the tournament.",
        "Lowry and McIlroy both praised Erica's response, with McIlroy saying his wife \"handled everything this week with class and poise and dignity\".",
        "\"Golf should be held to a higher standard than what was seen out there this week,\" he added.",
        "This video can not be played",
        "Shane Lowry emotional as Europe retain the Ryder Cup",
        "The triumph cements Luke Donald's status as a bona fide Ryder Cup legend.",
        "After masterminding the 'Romp in Rome' in 2023, the Englishman - who also won all four Ryder Cups he played in - has become the second captain, after Tony Jacklin in 1985 and 1987, to lead the side to home and away victories.",
        "He is the only man to win home and away as a player as well.",
        "The US needed 10 points to regain the trophy. No side had ever won more than 8½ from the 12 singles matches.",
        "And their task was made that little bit harder when Europe announced Viktor Hovland would be unable to play because of a neck injury. Ryder Cup rules dictate that one US player also sits out and each team gets a half point. 12-5 Europe.",
        "When Cam Young and Justin Rose emerged on the first tee for the opening match, nobody could have dreamed of the drama that would follow.",
        "Even the notoriously feisty New York fans were there in hope, rather than expectation. It was the hope that killed them.",
        "New York-born Young, a rookie in the US side, birdied the first to get the earliest of red on the scoreboard.",
        "But Rose bounced back to go one ahead after five. Behind him Tommy Fleetwood, Matt Fitzpatrick, Rory McIlroy and Aberg were all leading. Bethpage Black was Bethpage Blue and the crowd went quiet.",
        "The script was following the previous days. Europe were in complete control.",
        "But then. Young won four of seven holes to go three ahead. Justin Thomas claimed three successive holes to lead Fleetwood. And Bryson DeChambeau was whittling away after losing five of the first seven to Fitzpatrick.",
        "Aberg's blue was erased from the scoreboard by Patrick Cantlay as the ebbs and flows of a Ryder Cup Sunday took hold with American cheers reverberating around this huge plot of land.",
        "Sepp Straka started fast but was pegged back and overtaken by JJ Spaun. Shane Lowry was embroiled in a tight tussle with Russell Henley, while Rasmus Hojgaard was never ahead against Ben Griffin.",
        "In the early matches, the finish line was in sight. Rose fought back to take Young down the last. The Englishman had a putt from 20 feet to secure at least a half point. He missed. Young from two feet closer, drained his and the youngest man on the US team had beaten Europe's elder statesman. 12-6.",
        "'In Donald we trust' - how Europe's 'best ever captain' masterminded win",
        "Ryder Cup fan behaviour unacceptable - McIlroy",
        "Fleetwood and Thomas jousted through the back nine and also made it to the last all square. Again the American's would emerge victorious, Thomas dropping a 15-footer. 12-7.",
        "In the only real beating handed out, Xander Schauffele strolled to victory over Jon Rahm, winning four of five holes on the back nine to ease to a 4&3 win. 12-8.",
        "European eyes were suddenly scouring the scoreboard to see where the 2½ points needed were going to come from.",
        "Aberg provided one. A par on the 17th was enough to see off Cantlay's challenge. But it would be Europe's only full point - the lowest in 12-match singles history. 13-8.",
        "DeChambeau's drive and desire had hauled in Fitzpatrick. Sensational birdies on the 14th and 15th, and a par on the 17th, was enough to also send them down the last all square. This time there would be no American birdie though and Europe had a half point. 13½-8½.",
        "DeChambeau still celebrated it like he'd won the Ryder Cup. And suddenly, the US team had belief that this might just be possible. The fans were certainly invested. Perhaps too much at times.",
        "McIlroy was once again the focus of their attention. The Northern Irishman has been abused all week and Sunday was no exception, with barbs being fired from the sidelines.",
        "But he had somehow kept his head to deliver 3½ points from four matches. His opponent on Sunday, the world number one Scottie Scheffler, had lost all four of his outings. The American was due a point.",
        "And he delivered. McIlroy, who conceded neither player was at their best, pushed him to the 18th but was unable to hole a monster birdie try as Scheffler put another point on the board. 13½-9½.",
        "Europe still needed a half from somewhere. Anywhere. But for the first time in three days there was no blue to be seen.",
        "Hatton and Robert MacIntyre were in dogfights with Collin Morikawa and Sam Burns respectively in the final two matches out on the course.",
        "US Open champion Spaun held off Straka. 13½-10½.",
        "But then hope. Lowry birdied the 15th to drag Henley back to a one-hole lead and they became the fifth match to head down 18. Both players found the green with their second shots. Henley putted first and missed. Lowry, from eight feet, had a chance to win the hole, halve the match and reach the 14 points Europe needed as holders to retain the trophy.",
        "It dropped. And Lowry exploded.",
        "The emotion flooded out as he jigged and wheeled across the green. He had been embroiled in several spats with the fans during his round with McIlroy on Saturday so you could understand his levels of celebration as American fans began to flood out of the course. 14-11.",
        "Europe had not come for the tie and retention though.",
        "The final three matches also went to the final hole. Griffin held off Hojgaard. 14-12.",
        "It looked like Hatton would be the one. His birdie on the 12th had drawn him level with Morikawa and the two were unable to separate themselves. If the Englishman could match Morikawa's score on the 18th, the trophy would be won.",
        "The American's lengthy birdie putt missed. Hatton had two putts to win the Ryder Cup from 20 feet. He cosied his birdie try to tap-in. Morikawa conceded. The celebrations could properly begin. 14½-12½.",
        "Scotland's MacIntyre brought up the rear and won the final hole with a par to snatch a half point against Burns. 15-13.",
        "It also meant the US had remarkably matched the Ryder Cup record of 8½ points in the singles but all the celebrations were blue.",
        "McIlroy declared after the win in Rome two years ago that they would win in Bethpage. He also said \"winning away is the hardest thing to achieve in golf\".",
        "He was correct on both fronts.",
        "This video can not be played",
        "Donald 'so proud' of his European team",
        "This video can not be played",
        "We've shut up a lot of people - McIlroy",
        "Bradley wants Ryder Cup rule changed after defeat"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/articles/cd7204q227ro",
      "main_category": "sport",
      "detailed_category": "golf",
      "topic": "What is the biggest ever Ryder Cup victory?",
      "content": [
        "Europe have dominated the opening two days of the Ryder Cup against the United States, not just putting them on course for victory - but potentially a record-breaking one.Luke Donald's side lead 11½-4½ going into Sunday's singles. No other team has had such a large lead going into the final day since the tournament was expanded to include players from continental Europe in 1979.Europe need 14 points to retain the Ryder Cup, as in the event of a 14-14 tie they keep the trophy as holders. To win it outright - and secure just a fifth win on American soil - they need 14½.But if they maintain the dominance they showed over the first two days, then they will not only win the trophy, but re-write the record books.",
        "The biggest margin of victory since the competition was expanded in 1979 was 10 points in 2021, when the United States won 19-9 at Whistling Straits in Wisconsin.The record win before expansion was a huge 15 points in 1967, when the United States beat Great Britain 23½-8½ at Champions Golf Club in Houston, Texas.However, there were 32 points on offer across the three days as 16 singles matches were played across two sessions on Sunday, with players able to play twice. That was reduced to 12 singles matches, with players only able to play once, when continental Europe joined in 1979, leaving 28 points to play for.But, even with the fewer points available these days, Europe could break the all-time record margin - but they would need to win 11 of the singles matches to do so.Europe's biggest margin of victory is nine points, when they won 18½-9½ in successive Ryder Cups at Oakland Hills in 2004 and The K Club in 2006.They will break that record if they win eight of their 12 singles matches on Sunday. They could win fewer and still break the record if some matches are halved.The biggest away win is 18½-9½ - achieved by the US at Walton Heath in 1981 and Europe at Oakland Hills in 2004.The most points won by a team was 23½ by United States in 1967, with their 19 in 2021 the most post-1979.This article is the latest from BBC Sport's Ask Me Anything team.",
        "Ask Me Anything is a service dedicated to answering your questions.We want to reward your time by telling you things you do not know and reminding you of things you do.The team will find out everything you need to know and be able to call upon a network of contacts including our experts and pundits.We will be answering your questions from the heart of the BBC Sport newsroom, and going behind the scenes at some of the world's biggest sporting events.Our coverage will span the BBC Sport website, app, social media and YouTube accounts, plus BBC TV and radio.",
        "Europe have dominated the opening two days of the Ryder Cup against the United States, not just putting them on course for victory - but potentially a record-breaking one.",
        "Luke Donald's side lead 11½-4½ going into Sunday's singles. No other team has had such a large lead going into the final day since the tournament was expanded to include players from continental Europe in 1979.",
        "Europe need 14 points to retain the Ryder Cup, as in the event of a 14-14 tie they keep the trophy as holders. To win it outright - and secure just a fifth win on American soil - they need 14½.",
        "But if they maintain the dominance they showed over the first two days, then they will not only win the trophy, but re-write the record books.",
        "McIlroy & Lowry silence New York crowd on famous European day",
        "Destined for greatness - why Donald's Europe are set to win Ryder Cup",
        "What is the Ryder Cup envelope rule and how does it work?",
        "The United States thrashed Europe 19-9 at Whistling Straits in 2021",
        "The biggest margin of victory since the competition was expanded in 1979 was 10 points in 2021, when the United States won 19-9 at Whistling Straits in Wisconsin.",
        "The record win before expansion was a huge 15 points in 1967, when the United States beat Great Britain 23½-8½ at Champions Golf Club in Houston, Texas.",
        "However, there were 32 points on offer across the three days as 16 singles matches were played across two sessions on Sunday, with players able to play twice.",
        "That was reduced to 12 singles matches, with players only able to play once, when continental Europe joined in 1979, leaving 28 points to play for.",
        "But, even with the fewer points available these days, Europe could break the all-time record margin - but they would need to win 11 of the singles matches to do so.",
        "Europe's biggest margin of victory is nine points, when they won 18½-9½ in successive Ryder Cups at Oakland Hills in 2004 and The K Club in 2006.",
        "They will break that record if they win eight of their 12 singles matches on Sunday. They could win fewer and still break the record if some matches are halved.",
        "The biggest away win is 18½-9½ - achieved by the US at Walton Heath in 1981 and Europe at Oakland Hills in 2004.",
        "The most points won by a team was 23½ by United States in 1967, with their 19 in 2021 the most post-1979.",
        "This article is the latest from BBC Sport's Ask Me Anything team.",
        "Ask Me Anything is a service dedicated to answering your questions.",
        "We want to reward your time by telling you things you do not know and reminding you of things you do.",
        "The team will find out everything you need to know and be able to call upon a network of contacts including our experts and pundits.",
        "We will be answering your questions from the heart of the BBC Sport newsroom, and going behind the scenes at some of the world's biggest sporting events.",
        "Our coverage will span the BBC Sport website, app, social media and YouTube accounts, plus BBC TV and radio.",
        "How does the Ryder Cup work?",
        "Who is the man on the Ryder Cup trophy?",
        "Send us your questions"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/golf/articles/ce84e3jp4n2o",
      "main_category": "sport",
      "detailed_category": "golf",
      "topic": "Who is the man on the Ryder Cup trophy?",
      "content": [
        "Former professional golfer Abe Mitchell is the man on the top of the Ryder Cup trophy.Mitchell, who finished in the top 10 of The Open eight times between 1914 and 1933, was a private coach to English businessman Samuel Ryder.Ryder is responsible for sponsoring the first contest between British and American golfers, and also donated the trophy for the inaugural Ryder Cup in 1927.The gold trophy is 17 inches high and as a thank you to Mitchell for teaching Ryder how to play golf, he had a figure of his coach placed on top.\"I owe golf a great deal,\" said Mitchell at the time.\"What you have done, putting me on top of the cup, is more distinction than I could ever earn.\"Mitchell was also part of the Great Britain team at the 1929, 1931 and 1933, with Britain winning the 1929 and 1933 editions.He was also due to be Great Britain's player-captain in 1927, but Mitchell was unable to make the trip due to appendicitis.During his professional career, Mitchell won two professional singles titles. His first was the Southern Open 1922, which he tied with Leo Diegel. He also won the Miami Open in 1924.Away from golf, Mitchell also served on the front line during World War One and spent much of his time during the war in northern France.This article is the latest from BBC Sport's Ask Me Anything team.",
        "Ask Me Anything is a service dedicated to answering your questions.We want to reward your time by telling you things you do not know and reminding you of things you do.The team will find out everything you need to know and be able to call upon a network of contacts including our experts and pundits.We will be answering your questions from the heart of the BBC Sport newsroom, and going behind the scenes at some of the world's biggest sporting events.Our coverage will span the BBC Sport website, app, social media and YouTube accounts, plus BBC TV and radio.",
        "Is Gianfranco Zola part of Europe's Ryder Cup team?What are foursomes and fourballs?What was the 'Miracle at Medinah'?How does the Ryder Cup work?",
        "Former professional golfer Abe Mitchell is the man on the top of the Ryder Cup trophy.",
        "Mitchell, who finished in the top 10 of The Open eight times between 1914 and 1933, was a private coach to English businessman Samuel Ryder.",
        "Ryder is responsible for sponsoring the first contest between British and American golfers, and also donated the trophy for the inaugural Ryder Cup in 1927.",
        "The gold trophy is 17 inches high and as a thank you to Mitchell for teaching Ryder how to play golf, he had a figure of his coach placed on top.",
        "\"I owe golf a great deal,\" said Mitchell at the time.",
        "\"What you have done, putting me on top of the cup, is more distinction than I could ever earn.\"",
        "Mitchell was also part of the Great Britain team at the 1929, 1931 and 1933, with Britain winning the 1929 and 1933 editions.",
        "He was also due to be Great Britain's player-captain in 1927, but Mitchell was unable to make the trip due to appendicitis.",
        "During his professional career, Mitchell won two professional singles titles. His first was the Southern Open 1922, which he tied with Leo Diegel. He also won the Miami Open in 1924.",
        "Away from golf, Mitchell also served on the front line during World War One and spent much of his time during the war in northern France.",
        "This article is the latest from BBC Sport's Ask Me Anything team.",
        "The golfer on the top of the Ryder Cup trophy is based on Abe Mitchell, who featured three times in the competition",
        "Send us your questions",
        "Ask Me Anything is a service dedicated to answering your questions.",
        "We want to reward your time by telling you things you do not know and reminding you of things you do.",
        "The team will find out everything you need to know and be able to call upon a network of contacts including our experts and pundits.",
        "We will be answering your questions from the heart of the BBC Sport newsroom, and going behind the scenes at some of the world's biggest sporting events.",
        "Our coverage will span the BBC Sport website, app, social media and YouTube accounts, plus BBC TV and radio.",
        "Is Gianfranco Zola part of Europe's Ryder Cup team?",
        "What are foursomes and fourballs?",
        "What was the 'Miracle at Medinah'?",
        "How does the Ryder Cup work?"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/golf/articles/c7841lje754o",
      "main_category": "sport",
      "detailed_category": "golf",
      "topic": "What are foursomes and fourballs?",
      "content": [
        "Foursomes and fourballs are two of the three match formats in use during the Ryder Cup.In both formats two members of the Europe and United States teams face each other, but under slightly different rules.Foursomes, played in the morning of day one and day two, involve teams sharing one ball and both players taking alternate shots.Fourballs are different in that all four players play with their own ball on that hole, with the best-performing player winning the hole for their team. They are played in the afternoon on day one and two.The host captain can choose whether to play foursomes or fourballs first at the start of each day.Wins in the foursomes, fourballs and Sunday's singles matches are all worth one point for their team, while draws see both teams earn half a point each.This format has been in use for the Ryder Cup since 1979, which was also the first in which Europe featured as a team. The United States previously played Great Britain and later, Great Britain and Ireland, in the competition.",
        "Four matches of foursomes and fourballs are played each day, meaning eight of each team's 12 players are used in both of the sessions across Friday and Saturday.The pairings are selected by each team's captains, who decide which order their teams go out in across the two formats.Selections can be based on a range of factors, including relationships between players, how the two players' styles compliment each other, and favouring players who perform better in either foursomes or fourballs.In 2023, Europe duo Ludvig Aberg and Viktor Hovland, and American duo Max Homa and Brian Harman played together in three of the four pairs sessions.Thanks to Isaac Wood in Middlewich for the question.This article is the latest from BBC Sport's Ask Me Anything team.",
        "Ask Me Anything is a service dedicated to answering your questions.We want to reward your time by telling you things you do not know and reminding you of things you do.The team will find out everything you need to know and be able to call upon a network of contacts including our experts and pundits.We will be answering your questions from the heart of the BBC Sport newsroom, and going behind the scenes at some of the world's biggest sporting events.Our coverage will span the BBC Sport website, app, social media and YouTube accounts, plus BBC TV and radio.",
        "What was the 'Miracle at Medinah'?How does the Ryder Cup work?What is a mud ball?What is a birdie, eagle and albatross? Golf terms explained",
        "Foursomes and fourballs are two of the three match formats in use during the Ryder Cup.",
        "In both formats two members of the Europe and United States teams face each other, but under slightly different rules.",
        "Foursomes, played in the morning of day one and day two, involve teams sharing one ball and both players taking alternate shots.",
        "Fourballs are different in that all four players play with their own ball on that hole, with the best-performing player winning the hole for their team. They are played in the afternoon on day one and two.",
        "The host captain can choose whether to play foursomes or fourballs first at the start of each day.",
        "Wins in the foursomes, fourballs and Sunday's singles matches are all worth one point for their team, while draws see both teams earn half a point each.",
        "This format has been in use for the Ryder Cup since 1979, which was also the first in which Europe featured as a team. The United States previously played Great Britain and later, Great Britain and Ireland, in the competition.",
        "Send us your questions",
        "Rory McIlroy and Matt Fitzpatrick played together in fourballs on both days of the 2023 Ryder Cup",
        "Four matches of foursomes and fourballs are played each day, meaning eight of each team's 12 players are used in both of the sessions across Friday and Saturday.",
        "The pairings are selected by each team's captains, who decide which order their teams go out in across the two formats.",
        "Selections can be based on a range of factors, including relationships between players, how the two players' styles compliment each other, and favouring players who perform better in either foursomes or fourballs.",
        "In 2023, Europe duo Ludvig Aberg and Viktor Hovland, and American duo Max Homa and Brian Harman played together in three of the four pairs sessions.",
        "Thanks to Isaac Wood in Middlewich for the question.",
        "This article is the latest from BBC Sport's Ask Me Anything team.",
        "Ask Me Anything is a service dedicated to answering your questions.",
        "We want to reward your time by telling you things you do not know and reminding you of things you do.",
        "The team will find out everything you need to know and be able to call upon a network of contacts including our experts and pundits.",
        "We will be answering your questions from the heart of the BBC Sport newsroom, and going behind the scenes at some of the world's biggest sporting events.",
        "Our coverage will span the BBC Sport website, app, social media and YouTube accounts, plus BBC TV and radio.",
        "What was the 'Miracle at Medinah'?",
        "How does the Ryder Cup work?",
        "What is a birdie, eagle and albatross? Golf terms explained"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/golf/articles/cx2np5v1z4do",
      "main_category": "sport",
      "detailed_category": "golf",
      "topic": "How does the Ryder Cup work?",
      "content": [
        "2025 Ryder CupVenue: Bethpage Black, New York Dates: 26-28 SeptemberCoverage: Daily live text commentary and in-play clips on BBC Sport website from 11:30 BST. Radio commentary on 5 Live and BBC Sounds from 12:00 BST. Daily TV highlights from 00:00 BST.",
        "The Ryder Cup is a golf competition played every two years between Europe and the United States.The 2025 edition will take place between Friday, 26 September and Sunday, 28 September at the Bethpage Black Course in Farmingdale, New York.The host course is rotated every two years between Europe and America. The 2023 edition took place at Marco Simone Golf and Country Club in Rome. The 2027 contest will take place at Adare Manor in Ireland.Unlike most golf tournaments, the Ryder Cup is a team event, featuring 12 players on each side competing in different types of pairs and singles matches across the three days.The winning team is the one to accumulate the most points.",
        "There are three different match formats: foursomes, fourball and singles matches.Foursomes are also known as alternate shot. Two players compete as partners against their opponents, playing one ball between them and hitting alternate shots. The lowest score wins the hole. Players alternate in teeing off on each hole. Fourball matches see all four players play with their own balls individually, and the best score on each hole will win that hole for their team.Singles matches work in the same manner, but involve one player from each team playing against each other and the best score wins the hole.There will be four foursome matches and four fourball matches on both Friday and Saturday, with 16 points up for grabs.On Sunday, there will be 12 singles matches featuring every player on both teams.Each match is worth one point. All tied matches result in half a point for each team.",
        "With 28 points on offer across the Ryder Cup, a total of 14½ points is enough to secure victory.In 2023, Europe won 16½-11½ against Team USA.The last Ryder Cup to take place in America in 2021 saw the United States record a 19-9 win.",
        "Should the Ryder Cup end in a 14-14 draw, the winner of the previous edition retains the trophy.Europe are the current holders following their 2023 victory in Rome.Since 1979, when the Ryder Cup first become a competition between European and American golfers, there has only been one tie. That happened in 1989 at the Belfry in Warwickshire.",
        "Tee times for the 2025 Ryder Cup have been announced, although they are subject to change.All times stated are in British Summer Time.Friday's foursome matches will tee off at 12:10, 12:26, 12:42 and 12:58, with the fourball matches teeing off at at 17:25, 17:41, 17:57 and 18:13.Saturday's foursomes and fourballs will follow the same tee times as Friday's matches.Sunday's 12 singles matches will start at 17:02, with each subsequent match teeing off in 11 minute intervals.",
        "There have been 22 Ryder Cups since 1979, with Europe winning 12 times to United States' nine.The past five Ryder Cups have all been won by the home team, with Europe's last away win coming in 2012 at Medinah Country Club in Illinois. The last away win for the US was at the Belfry in 1993.Prior to 1979, the competition was played between the United States and Great Britain and Ireland for three editions between 1973 and 1977. All three were won by the American team.The first 19 Ryder Cups, between 1927 and 1971, were contested by the United States and Great Britain. The United States won 15 of them, Britain claimed three wins and the 1969 edition ended in a tie with the US retaining the trophy.",
        "When a player or team has secured victory prior to the end of a full round, the result shows the size of the win.For example, a 3&2 victory would mean a player or team was leading by three holes with two holes left to play.If a player or teams wins a match on the 18th hole, their result would be either 1up or 2up depending on how many holes they won by.If a match ends tied, the result is posted as A/S meaning all square.",
        "No prize money is awarded to players competing at the Ryder Cup.For the first time in the competition's history, the PGA of America have agreed to pay their 12 competing players.They will receive $500,000 (£370,000) each, although $300,000 (£220,000) of that will be donated to a charity or charities of the player's choosing.Speaking on the decision, McIlroy of Europe's team told BBC Sport: \"I personally would pay for the privilege to play on the Ryder Cup.\"This article is the latest from BBC Sport's Ask Me Anything team.",
        "Ask Me Anything is a service dedicated to answering your questions.We want to reward your time by telling you things you do not know and reminding you of things you do.The team will find out everything you need to know and be able to call upon a network of contacts including our experts and pundits.We will be answering your questions from the heart of the BBC Sport newsroom, and going behind the scenes at some of the world's biggest sporting events.Our coverage will span the BBC Sport website, app, social media and YouTube accounts, plus BBC TV and radio.",
        "When is the 2025 Ryder Cup?What is a mud ball?What is a birdie, eagle and albatross? Golf terms explainedWhat does the cut line mean in golf?",
        "Venue: Bethpage Black, New York Dates: 26-28 September",
        "Coverage: Daily live text commentary and in-play clips on BBC Sport website from 11:30 BST. Radio commentary on 5 Live and BBC Sounds from 12:00 BST. Daily TV highlights from 00:00 BST.",
        "The Ryder Cup is a golf competition played every two years between Europe and the United States.",
        "The 2025 edition will take place between Friday, 26 September and Sunday, 28 September at the Bethpage Black Course in Farmingdale, New York.",
        "The host course is rotated every two years between Europe and America. The 2023 edition took place at Marco Simone Golf and Country Club in Rome. The 2027 contest will take place at Adare Manor in Ireland.",
        "Unlike most golf tournaments, the Ryder Cup is a team event, featuring 12 players on each side competing in different types of pairs and singles matches across the three days.",
        "The winning team is the one to accumulate the most points.",
        "Send us your questions",
        "England's Tyrell Hatton recorded three wins and a draw from his four matches at the 2023 Ryder Cup",
        "There are three different match formats: foursomes, fourball and singles matches.",
        "Foursomes are also known as alternate shot. Two players compete as partners against their opponents, playing one ball between them and hitting alternate shots. The lowest score wins the hole. Players alternate in teeing off on each hole.",
        "Fourball matches see all four players play with their own balls individually, and the best score on each hole will win that hole for their team.",
        "Singles matches work in the same manner, but involve one player from each team playing against each other and the best score wins the hole.",
        "There will be four foursome matches and four fourball matches on both Friday and Saturday, with 16 points up for grabs.",
        "On Sunday, there will be 12 singles matches featuring every player on both teams.",
        "Each match is worth one point. All tied matches result in half a point for each team.",
        "Luke Donald was Europe's captain at their 2023 Ryder Cup victory",
        "With 28 points on offer across the Ryder Cup, a total of 14½ points is enough to secure victory.",
        "In 2023, Europe won 16½-11½ against Team USA.",
        "The last Ryder Cup to take place in America in 2021 saw the United States record a 19-9 win.",
        "Sergio Garcia holds the all-time record for most points scored by one player with 28½",
        "Should the Ryder Cup end in a 14-14 draw, the winner of the previous edition retains the trophy.",
        "Europe are the current holders following their 2023 victory in Rome.",
        "Since 1979, when the Ryder Cup first become a competition between European and American golfers, there has only been one tie. That happened in 1989 at the Belfry in Warwickshire.",
        "Tee times for the 2025 Ryder Cup have been announced, although they are subject to change.",
        "All times stated are in British Summer Time.",
        "Friday's foursome matches will tee off at 12:10, 12:26, 12:42 and 12:58, with the fourball matches teeing off at at 17:25, 17:41, 17:57 and 18:13.",
        "Saturday's foursomes and fourballs will follow the same tee times as Friday's matches.",
        "Sunday's 12 singles matches will start at 17:02, with each subsequent match teeing off in 11 minute intervals.",
        "Phil Mickleson of the United States holds the all-time record for most Ryder Cup appearances in his career with 12 between 1995 and 2018",
        "There have been 22 Ryder Cups since 1979, with Europe winning 12 times to United States' nine.",
        "The past five Ryder Cups have all been won by the home team, with Europe's last away win coming in 2012 at Medinah Country Club in Illinois. The last away win for the US was at the Belfry in 1993.",
        "Prior to 1979, the competition was played between the United States and Great Britain and Ireland for three editions between 1973 and 1977. All three were won by the American team.",
        "The first 19 Ryder Cups, between 1927 and 1971, were contested by the United States and Great Britain. The United States won 15 of them, Britain claimed three wins and the 1969 edition ended in a tie with the US retaining the trophy.",
        "When a player or team has secured victory prior to the end of a full round, the result shows the size of the win.",
        "For example, a 3&2 victory would mean a player or team was leading by three holes with two holes left to play.",
        "If a player or teams wins a match on the 18th hole, their result would be either 1up or 2up depending on how many holes they won by.",
        "If a match ends tied, the result is posted as A/S meaning all square.",
        "No prize money is awarded to players competing at the Ryder Cup.",
        "For the first time in the competition's history, the PGA of America have agreed to pay their 12 competing players.",
        "They will receive $500,000 (£370,000) each, although $300,000 (£220,000) of that will be donated to a charity or charities of the player's choosing.",
        "Speaking on the decision, McIlroy of Europe's team told BBC Sport: \"I personally would pay for the privilege to play on the Ryder Cup.\"",
        "This article is the latest from BBC Sport's Ask Me Anything team.",
        "Ask Me Anything is a service dedicated to answering your questions.",
        "We want to reward your time by telling you things you do not know and reminding you of things you do.",
        "The team will find out everything you need to know and be able to call upon a network of contacts including our experts and pundits.",
        "We will be answering your questions from the heart of the BBC Sport newsroom, and going behind the scenes at some of the world's biggest sporting events.",
        "Our coverage will span the BBC Sport website, app, social media and YouTube accounts, plus BBC TV and radio.",
        "When is the 2025 Ryder Cup?",
        "What is a birdie, eagle and albatross? Golf terms explained",
        "What does the cut line mean in golf?"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/golf/articles/cly047v99x1o",
      "main_category": "sport",
      "detailed_category": "golf",
      "topic": "Is Gianfranco Zola part of Europe's Ryder Cup team?",
      "content": [
        "Preparations for the 2025 Ryder Cup are in full swing.The biennial team event, which pits Europe against the USA, gets under way at the Bethpage Black Course, New York on Friday.But an unlikely face has been spotted during the practice rounds and in Europe's official team photo. That face belongs to former Chelsea and Italy forward Gianfranco Zola. And the 59-year-old actually has a role to play over the three-day event, serving as vice-captain Francesco Molinari's designated buggy driver.",
        "Zola is a former football player and manager.He was a member of Italy's 1994 World Cup squad, finishing as runners-up to Brazil, and earned 35 caps for his country. At club level, he represented Italian sides Nuorese, Torres, Napoli and Parma before spending seven seasons with Premier League side Chelsea, with whom he won two FA Cups among six trophies. He returned to Italy in 2003, finishing his career at Cagliari, before turning to management, including stints at West Ham and Watford. He is no stranger to golf, participating in a number of pro-am events on the DP World Tour, while in March, he represented Team World at the inaugural Reignwood Icons of Football tournament. \"I didn't know he was coming this week. So it was a huge surprise, and literally, he was one of the first people I bumped into,\" said Europe's Justin Rose, who supports Chelsea.\"I was star-struck which is amazing.\"Molinari, meanwhile, made history in 2018 when he won The Open Championship to become golf's first Italian major champion. He has been a member of three Ryder Cup-winning teams (2010, 2012, 2018) and is one of Luke Donald's five vice-captains, a role he previously fulfilled in 2023. The role of the vice-captain is to help prepare the team, act as a mentor, and keep the captain up to speed with what's happening on the course.This article is the latest from BBC Sport's Ask Me Anything team.",
        "Ask Me Anything is a service dedicated to answering your questions.We want to reward your time by telling you things you do not know and reminding you of things you do.The team will find out everything you need to know and be able to call upon a network of contacts including our experts and pundits.We will be answering your questions from the heart of the BBC Sport newsroom, and going behind the scenes at some of the world's biggest sporting events.Our coverage will span the BBC Sport website, app, social media and YouTube accounts, plus BBC TV and radio.",
        "When is the 2025 Ryder Cup?How does the Ryder Cup work?What is a mud ball?What is a birdie, eagle, and albatross? Golf terms explained",
        "Preparations for the 2025 Ryder Cup are in full swing.",
        "The biennial team event, which pits Europe against the USA, gets under way at the Bethpage Black Course, New York on Friday.",
        "But an unlikely face has been spotted during the practice rounds and in Europe's official team photo.",
        "That face belongs to former Chelsea and Italy forward Gianfranco Zola.",
        "And the 59-year-old actually has a role to play over the three-day event, serving as vice-captain Francesco Molinari's designated buggy driver.",
        "Send us your questions",
        "Gianfranco Zola earned 35 caps for Italy and won two FA Cups with Chelsea",
        "Zola is a former football player and manager.",
        "He was a member of Italy's 1994 World Cup squad, finishing as runners-up to Brazil, and earned 35 caps for his country.",
        "At club level, he represented Italian sides Nuorese, Torres, Napoli and Parma before spending seven seasons with Premier League side Chelsea, with whom he won two FA Cups among six trophies.",
        "He returned to Italy in 2003, finishing his career at Cagliari, before turning to management, including stints at West Ham and Watford.",
        "He is no stranger to golf, participating in a number of pro-am events on the DP World Tour, while in March, he represented Team World at the inaugural Reignwood Icons of Football tournament.",
        "\"I didn't know he was coming this week. So it was a huge surprise, and literally, he was one of the first people I bumped into,\" said Europe's Justin Rose, who supports Chelsea.",
        "\"I was star-struck which is amazing.\"",
        "Molinari, meanwhile, made history in 2018 when he won The Open Championship to become golf's first Italian major champion.",
        "He has been a member of three Ryder Cup-winning teams (2010, 2012, 2018) and is one of Luke Donald's five vice-captains, a role he previously fulfilled in 2023.",
        "The role of the vice-captain is to help prepare the team, act as a mentor, and keep the captain up to speed with what's happening on the course.",
        "This article is the latest from BBC Sport's Ask Me Anything team.",
        "Bethpage Black, New York",
        "Daily live text commentary and in-play clips on BBC Sport website from 11:30 BST. Radio commentary on BBC Radio 5 Live and BBC Sounds from 12:00. Daily TV highlights on iPlayer from 00:00.",
        "Ask Me Anything is a service dedicated to answering your questions.",
        "We want to reward your time by telling you things you do not know and reminding you of things you do.",
        "The team will find out everything you need to know and be able to call upon a network of contacts including our experts and pundits.",
        "We will be answering your questions from the heart of the BBC Sport newsroom, and going behind the scenes at some of the world's biggest sporting events.",
        "Our coverage will span the BBC Sport website, app, social media and YouTube accounts, plus BBC TV and radio.",
        "When is the 2025 Ryder Cup?",
        "How does the Ryder Cup work?",
        "What is a birdie, eagle, and albatross? Golf terms explained"
      ]
    }
  ]
}