{
  "scraped_at": "2025-10-27T18:56:59.760547",
  "total_articles": 7,
  "category": "archery",
  "articles_per_category": 100,
  "articles": [
    {
      "url": "https://www.bbc.com/sport/archery/articles/cpv2wdkjxgyo",
      "main_category": "sport",
      "detailed_category": "archery",
      "topic": "O'Sullivan opts out of Island Games due to cost",
      "content": [
        "Island Games archery champion Lucy O'Sullivan says she will not defend her gold medals due to the cost of attending the 2025 edition in Orkney.O'Sullivan won a clean sweep of five gold medals at Guernsey 2023, but the Great Britain international says she cannot afford to go to Orkney.The cost is around £2,000 per athlete and O'Sullivan has not paid her deposit to secure her place.\"Since Covid, prices have gone up a lot,\" she told BBC Radio Jersey. \"Whereas I would fly and hire a car, which was always the cheapest option to get to a competition in the UK, that's doubled.\"If I want to compete for Great Britain again you need to do six to 10 shoots to get the qualification scores.\"Unless you're finding sponsors to help you with that I can't be part of Team GB again, so the money that I need to go to the UK shoots is money that I would have to spend going to an Island Games - so one Island Games versus maybe two or three shoots in the UK is difficult. \"We're sportspeople from Jersey, it's always a balance and unless we get private sponsors for different events it's always going to be hard.\"",
        "She says it is with a heavy heart that she has decided to opt out of the next Island Games as it is an event that she feels benefits her.The cost next summer has put some Channel Island athletes off, with travel and accommodation options limited in one of the smallest islands ever to host the event. \"I love an Island Games,\" she said.\"It's been so great to be part of a multi-sport event because archery isn't in the Commonwealth Games that often, so the fact that we get to go to the Island Games is incredible.\"It's so nice to see other sports, see how other athletes train and what mental stuff they do and what nutrition they use.\"So for me an Island Games is such a great opportunity to connect with other athletes so that I can make myself better.\"",
        "Lucy O'Sullivan (centre) won gold in every event she competed in at the 2023 Island Games",
        "Island Games archery champion Lucy O'Sullivan says she will not defend her gold medals due to the cost of attending the 2025 edition in Orkney.",
        "O'Sullivan won a clean sweep of five gold medals at Guernsey 2023, but the Great Britain international says she cannot afford to go to Orkney.",
        "The cost is around £2,000 per athlete and O'Sullivan has not paid her deposit to secure her place.",
        "\"Since Covid, prices have gone up a lot,\" she told BBC Radio Jersey.",
        "\"Whereas I would fly and hire a car, which was always the cheapest option to get to a competition in the UK, that's doubled.",
        "\"If I want to compete for Great Britain again you need to do six to 10 shoots to get the qualification scores.",
        "\"Unless you're finding sponsors to help you with that I can't be part of Team GB again, so the money that I need to go to the UK shoots is money that I would have to spend going to an Island Games - so one Island Games versus maybe two or three shoots in the UK is difficult.",
        "\"We're sportspeople from Jersey, it's always a balance and unless we get private sponsors for different events it's always going to be hard.\"",
        "Athletes concerned over cost of 2025 Island Games",
        "O'Sullivan sweeps Island Games archery medals",
        "She says it is with a heavy heart that she has decided to opt out of the next Island Games as it is an event that she feels benefits her.",
        "The cost next summer has put some Channel Island athletes off, with travel and accommodation options limited in one of the smallest islands ever to host the event.",
        "\"I love an Island Games,\" she said.",
        "\"It's been so great to be part of a multi-sport event because archery isn't in the Commonwealth Games that often, so the fact that we get to go to the Island Games is incredible.",
        "\"It's so nice to see other sports, see how other athletes train and what mental stuff they do and what nutrition they use.",
        "\"So for me an Island Games is such a great opportunity to connect with other athletes so that I can make myself better.\""
      ]
    },
    {
      "url": "https://www.bbc.com/sport/archery/articles/cm23px4ej4wo",
      "main_category": "sport",
      "detailed_category": "archery",
      "topic": "Pregnant archer Grinham wins Paralympic gold",
      "content": [
        "Pregnant Para-archer Jodie Grinham and Nathan Macqueen clinched gold for Great Britain by beating Iran 155-151 in the mixed team compound final.It is a second medal in Paris for Grinham, who is seven months pregnant, after she beat team-mate Phoebe Paterson Pine to win women's individual compound bronze on Saturday.The GB pair led by one point (39-38) after the first end but the scores were level at 77-77 at the halfway point.A couple of 8s from Iran's Hadi Nori helped give GB a two-point lead (115-113) going into the final end and they responded in style with a perfect score of 40 to secure the title.",
        "\"All I wanted to do at the end was jump up and down and cry and scream and shout,\" Grinham, 31, who won compound team silver with John Stubbs in 2016, told BBC Wales. \"But being heavily pregnant, realistically the best thing to do was crouch down and take a second and then I could give hugs and things.\"The emotion was just a wave and it was like being a child at Christmas and getting your favourite toy.\"",
        "Since being selected for Paris, the Welsh archer - already mum to toddler son Christian - wanted to send out a powerful message to women and her attendance at the Games has attracted worldwide media attention.But it has not been all straightforward and after a scare last week, she had to attend a Parisian hospital for a check-up before being released and cleared to compete.Teaming up with Scotland's Macqueen, 33, who was paralysed in a motorbike accident when he was 18, the pair finished second behind India in Thursday's qualification round, earning them a bye into the quarter-finals.They defeated Australia 150-141 in the last eight before a 156-149 success over Italy in the last four set them up for the final.\"The idea was to show that nothing is impossible and to go out there and smash it,\" added Grinham.\"Thankfully I have an amazing team partner and it doesn't matter how I will shoot, I know he will be there and carry my back and we smashed it together. \"We are an amazing team and are bringing back the medal that we have worked so hard to get.\"",
        "This video can not be played",
        "Nothing is impossible - Para-archery gold medallist Grinham",
        "Pregnant Para-archer Jodie Grinham and Nathan Macqueen clinched gold for Great Britain by beating Iran 155-151 in the mixed team compound final.",
        "It is a second medal in Paris for Grinham, who is seven months pregnant, after she beat team-mate Phoebe Paterson Pine to win women's individual compound bronze on Saturday.",
        "The GB pair led by one point (39-38) after the first end but the scores were level at 77-77 at the halfway point.",
        "A couple of 8s from Iran's Hadi Nori helped give GB a two-point lead (115-113) going into the final end and they responded in style with a perfect score of 40 to secure the title.",
        "Grinham and Macqueen won gold together at the European Para Cup earlier this year",
        "\"All I wanted to do at the end was jump up and down and cry and scream and shout,\" Grinham, 31, who won compound team silver with John Stubbs in 2016, told BBC Wales.",
        "\"But being heavily pregnant, realistically the best thing to do was crouch down and take a second and then I could give hugs and things.",
        "\"The emotion was just a wave and it was like being a child at Christmas and getting your favourite toy.\"",
        "What's happening and when at the Paris Paralympics?",
        "All you need to know about the Paris Paralympics",
        "Sport-by-sport guide to Paris 2024 Paralympics",
        "Since being selected for Paris, the Welsh archer - already mum to toddler son Christian - wanted to send out a powerful message to women and her attendance at the Games has attracted worldwide media attention.",
        "But it has not been all straightforward and after a scare last week, she had to attend a Parisian hospital for a check-up before being released and cleared to compete.",
        "Teaming up with Scotland's Macqueen, 33, who was paralysed in a motorbike accident when he was 18, the pair finished second behind India in Thursday's qualification round, earning them a bye into the quarter-finals.",
        "They defeated Australia 150-141 in the last eight before a 156-149 success over Italy in the last four set them up for the final.",
        "\"The idea was to show that nothing is impossible and to go out there and smash it,\" added Grinham.",
        "\"Thankfully I have an amazing team partner and it doesn't matter how I will shoot, I know he will be there and carry my back and we smashed it together.",
        "\"We are an amazing team and are bringing back the medal that we have worked so hard to get.\"",
        "This video can not be played",
        "Paralympian mum-to-be Jodie Grinham won Gold in the mixed archery competition.",
        "Paris 2024 Paralympics"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/archery/articles/czxlw8g0gd9o",
      "main_category": "sport",
      "detailed_category": "archery",
      "topic": "Paralysis, amputation and Paralympic archery",
      "content": [
        "Content warning: This article contains discussion around suicide and depression.Shaun Anderson has called sport his “saviour” as he prepares for his third Paralympic Games having overcome two life-changing accidents and experienced depression.In 2004, the South African archer's left arm was amputated following a motorcycle crash.Then in 2017, a year after his first Paralympic appearance in Rio de Janeiro, a family fishing trip ended in disaster when a wave crashed into the boat Anderson was steering, tipping it over and trapping him underneath.“I basically started drowning,” he told BBC Sport Africa.“I was under the boat, they say for about four and a half minutes. I don't remember much after that. I remember waking up and not having feeling in my legs.”Damage to his back means Anderson is now paralysed from the waist down.\"You go from being an athlete at the Rio Paralympics, standing and walking in, and then a year later you end up in a wheelchair. \"I haven't put my head underwater since my accident. I haven't been on a boat since my accident. I don't like water whatsoever.\"",
        "It was after the first of his two accidents that Anderson developed his love for bow and arrow.\"My son wanted to try archery,\" the 51-year-old explained .\"We went into [an] archery shop, we got a bow, he shot and I said to the owner 'I want to shoot as well', and they said I can't. \"I don't believe in the word can't.\"So in the end, I figured out how to shoot and the rest has been history.\"Within six months he won his first medal, at an indoor event organised in South Africa by the International Field Archery Association.\"When people tell me I can’t do something, I like proving them wrong.\"I've always been good at sport, I've always loved sport. Sport has been my saviour.\"Five years later, Anderson competed at Rio 2016 in the men's individual compound, an event in which archers can stand, sit on a stool or use a wheelchair.Despite losing his opening match in the round of 32, he took enormous pride from his experience.\"I didn't get to the Paralympics on my good looks,\" he said jokingly.\"It took a lot of hard work, a lot of sacrifice from my family, myself. I mean, financially massive sacrifices, we had to give up a lot to get me there.\"Anderson's plans for Rio were almost thrown into disarray on the eve of the Games when he suffered a burst colon - a suspected after effect of the pain medication taken following his motorcycle accident.He experienced more trauma on the eve of his second Paralympics when his father died of Covid just weeks before the start of competition in Tokyo.“I think it put more pressure on me,” an emotional Anderson recalled. “I wanted really hard to do it for him.”",
        "It was after losing his first round match in the Japanese capital that Anderson's depression became more serious.He believes other athletes often put on a \"front\" to cover up mental health issues, pretending to be \"at your best all the time\".\"They (people) look at you as an athlete and they think, wow, everything's going great for this guy.\"I just felt like I wasn't worthy of anything anymore and I wasn't good enough. \"I felt like I was a burden to my family. So yeah, I nearly took my own life.\"Fortunately, the strong support structures around Anderson helped him.\"I realised that I love my life and I love my family too much.\"I stopped and I realised that I need to ask for help. And I got help.\"His advice to others is that they \"mustn't be scared to tell people\" when they are finding things difficult.\"It's something that will always be with me,\" he admitted.\"I surround myself with positive people, I keep myself positive. Negativity, I push away. If I'm having a bad day, I'll tell my family.\"",
        "Now heading to his third Paralympics, Anderson trains at his rural farm in Pretoria where he rears sheep, pigs and chickens.Due to issues with power supplies - known as load-shedding, something that has been a regular problem in South Africa - three years ago he decided to go “off the grid”.“I'm on full solar,” Anderson explained.“I grow my own vegetables. I have my own fruit trees. We’re basically self-sustainable.”In Paris, he will compete in the W1 event, a category for athletes with impairments in both the top and bottom halves of their body.A trigger system featuring a mouth plate allows him to release his arrows.While the intricacies of his technique are obvious to see, he believes people watching do not always appreciate the hidden challenges faced by para athletes – something he was also guilty of before becoming a wheelchair user.",
        "“I never realised how much a buddy from another country who is in a wheelchair had to go through in the morning just to eat or get to the range.“I have to go through a whole ritual every morning. I've got to get up, I've got to do a bowel program, I've got to clean my bladder.“Then I've got to have a guy with me the whole time to collect my arrows.”His homemade range is also now used as a training centre for young archers, and Anderson has coached fellow Paralympian Philip Coates-Palgrave, who competed with him in Tokyo.“After Paris, my goal is to get a couple of my junior archers to qualify for the Junior World Championships,\" he outlined.\"In the long-term, I’d like to maybe coach the Paralympic team.”As an archer, Anderson is used to drawing on both a bowstring and inner reserves of personal strength.A Christian, he admits that his two accidents did leave him wondering “why me?”, yet he has never been tempted to think of himself as cursed.\"I always believe things happen for a reason.\"I don't always know what are the reasons or what is the big guy's plan with me.\"But if people can learn out of what I've achieved and what I've overcome through all my obstacles, then I've done the right thing.\"",
        "This video can not be played",
        "Shaun Anderson trains at an archery range he has constructed on his \"off the grid\" farm in Pretoria",
        "Content warning: This article contains discussion around suicide and depression.",
        "Shaun Anderson has called sport his “saviour” as he prepares for his third Paralympic Games having overcome two life-changing accidents and experienced depression.",
        "In 2004, the South African archer's left arm was amputated following a motorcycle crash.",
        "Then in 2017, a year after his first Paralympic appearance in Rio de Janeiro, a family fishing trip ended in disaster when a wave crashed into the boat Anderson was steering, tipping it over and trapping him underneath.",
        "“I basically started drowning,” he told BBC Sport Africa.",
        "“I was under the boat, they say for about four and a half minutes. I don't remember much after that. I remember waking up and not having feeling in my legs.”",
        "Damage to his back means Anderson is now paralysed from the waist down.",
        "\"You go from being an athlete at the Rio Paralympics, standing and walking in, and then a year later you end up in a wheelchair.",
        "\"I haven't put my head underwater since my accident. I haven't been on a boat since my accident. I don't like water whatsoever.\"",
        "All you need to know about the Paris Paralympics",
        "It was after the first of his two accidents that Anderson developed his love for bow and arrow.",
        "\"My son wanted to try archery,\" the 51-year-old explained .",
        "\"We went into [an] archery shop, we got a bow, he shot and I said to the owner 'I want to shoot as well', and they said I can't.",
        "\"I don't believe in the word can't.",
        "\"So in the end, I figured out how to shoot and the rest has been history.\"",
        "Within six months he won his first medal, at an indoor event organised in South Africa by the International Field Archery Association.",
        "\"When people tell me I can’t do something, I like proving them wrong.",
        "\"I've always been good at sport, I've always loved sport. Sport has been my saviour.\"",
        "Five years later, Anderson competed at Rio 2016 in the men's individual compound, an event in which archers can stand, sit on a stool or use a wheelchair.",
        "Despite losing his opening match in the round of 32, he took enormous pride from his experience.",
        "\"I didn't get to the Paralympics on my good looks,\" he said jokingly.",
        "\"It took a lot of hard work, a lot of sacrifice from my family, myself. I mean, financially massive sacrifices, we had to give up a lot to get me there.\"",
        "Anderson's plans for Rio were almost thrown into disarray on the eve of the Games when he suffered a burst colon - a suspected after effect of the pain medication taken following his motorcycle accident.",
        "He experienced more trauma on the eve of his second Paralympics when his father died of Covid just weeks before the start of competition in Tokyo.",
        "“I think it put more pressure on me,” an emotional Anderson recalled. “I wanted really hard to do it for him.”",
        "Anderson competed at the 2020 Tokyo Paralympic Games weeks after his father died",
        "It was after losing his first round match in the Japanese capital that Anderson's depression became more serious.",
        "He believes other athletes often put on a \"front\" to cover up mental health issues, pretending to be \"at your best all the time\".",
        "\"They (people) look at you as an athlete and they think, wow, everything's going great for this guy.",
        "\"I just felt like I wasn't worthy of anything anymore and I wasn't good enough.",
        "\"I felt like I was a burden to my family. So yeah, I nearly took my own life.\"",
        "Fortunately, the strong support structures around Anderson helped him.",
        "\"I realised that I love my life and I love my family too much.",
        "\"I stopped and I realised that I need to ask for help. And I got help.\"",
        "His advice to others is that they \"mustn't be scared to tell people\" when they are finding things difficult.",
        "\"It's something that will always be with me,\" he admitted.",
        "\"I surround myself with positive people, I keep myself positive. Negativity, I push away. If I'm having a bad day, I'll tell my family.\"",
        "Anderson has adopted nine rescue dogs who he says “look after him” when he is “going through a bad time”",
        "Now heading to his third Paralympics, Anderson trains at his rural farm in Pretoria where he rears sheep, pigs and chickens.",
        "Due to issues with power supplies - known as load-shedding, something that has been a regular problem in South Africa - three years ago he decided to go “off the grid”.",
        "“I'm on full solar,” Anderson explained.",
        "“I grow my own vegetables. I have my own fruit trees. We’re basically self-sustainable.”",
        "In Paris, he will compete in the W1 event, a category for athletes with impairments in both the top and bottom halves of their body.",
        "A trigger system featuring a mouth plate allows him to release his arrows.",
        "While the intricacies of his technique are obvious to see, he believes people watching do not always appreciate the hidden challenges faced by para athletes – something he was also guilty of before becoming a wheelchair user.",
        "Anderson is permitted to use mechanical devices when competing",
        "“I never realised how much a buddy from another country who is in a wheelchair had to go through in the morning just to eat or get to the range.",
        "“I have to go through a whole ritual every morning. I've got to get up, I've got to do a bowel program, I've got to clean my bladder.",
        "“Then I've got to have a guy with me the whole time to collect my arrows.”",
        "His homemade range is also now used as a training centre for young archers, and Anderson has coached fellow Paralympian Philip Coates-Palgrave, who competed with him in Tokyo.",
        "“After Paris, my goal is to get a couple of my junior archers to qualify for the Junior World Championships,\" he outlined.",
        "\"In the long-term, I’d like to maybe coach the Paralympic team.”",
        "As an archer, Anderson is used to drawing on both a bowstring and inner reserves of personal strength.",
        "A Christian, he admits that his two accidents did leave him wondering “why me?”, yet he has never been tempted to think of himself as cursed.",
        "\"I always believe things happen for a reason.",
        "\"I don't always know what are the reasons or what is the big guy's plan with me.",
        "\"But if people can learn out of what I've achieved and what I've overcome through all my obstacles, then I've done the right thing.\""
      ]
    },
    {
      "url": "https://www.bbc.com/sport/archery/articles/cp089q32yrqo",
      "main_category": "sport",
      "detailed_category": "archery",
      "topic": "Paralysed by an ex-boyfriend, Otto rises as Paralympian",
      "content": [
        "This article contains descriptions and details of domestic violence. If you have been affected by any of the issues raised, BBC Action Line can provide contacts to find help.  Tracy Otto was just tucking into her lunch when she was surprised by the news that she is going to the Paralympics.\"They gave Ricky [Riessle], my boyfriend, this box with a hat in it, saying 'you're qualified',\" the 28-year-old tells BBC Sport.\"When he presented it to me I was eating, I had food in my mouth. So I was eating and crying, and there were cameras everywhere.\"Otto had been selected for the United States archery team, external at Paris 2024, where she will shoot in both the mixed teams with partner Jason Tabansky and in qualification for the W1 open individuals competition.",
        "\"It's so cool,\" Otto says from her Tampa home with a gigantic grin on her face. \"From being on my deathbed to the Paralympics is just a crazy journey. I am in awe of myself and my team.\"Otto is not exaggerating when she talks about being on her deathbed.In October 2019, Otto was attacked at her home by her ex-boyfriend.She was left paralysed from the chest down with limited use of her arms and hands, and lost her left eye. She can also no longer sweat or regulate her body temperature properly.Otto is willing to talk about the night which changed her life in remarkably honest detail in order, in her own words, to \"be a light, a beacon of hope in this world\". She wants to let other women who have suffered violence at the hands of a partner or an ex know they are not alone.",
        "In September 2019, Otto broke up with a boyfriend. A month previously, he had been arrested for attacking her at their home in Riverview, Florida. Otto was ready to move on with her life, and had met someone new.“I had just started talking to Ricky,\" she told the BBC World Service's Sportshour programme. \"We met on 26 September 2019, and we went on a couple of dates. \"I had broken up with my ex, kicked him out, told him to leave, he gathered all of his things, he was gone and I had changed all of the locks on my house. Everything was done.\"That night it was 24 October 2019, we had another little date, and we go off to bed. I remember rolling over and getting comfortable in bed and drifting off to sleep.\"And then all of a sudden, I hear this loud noise and I see a flashlight in my face and I was so confused. \"And then I heard his voice, and I realised it was my ex.\"He had parked his car at the front of my house, went around the back of the house and looked through my bedroom window. We were sleeping, and he had decided to go to purchase a high-powered pellet gun. \"He did the best that he could to get as close to a real gun as possible. And a knife and a set of handcuffs.\"And he comes back to my house, breaks in and wakes us up, screaming at us to get out of bed.\"He tells us that he's going to kill us and that if he didn't kill himself, he was going to call the police. \"So, he outright told us what he was going to do. This is where everything gets kind of blurry because it happened so quickly. I can tell you what I know happened, I just don't have it first-hand because my brain just kind of blocked everything out.\"The attacker punched Otto multiple times before shooting Riessle twice in the face and stabbing him in the back, causing his lung to collapse.He then shot Otto through the left eye, before stabbing her in the back of the neck, leaving her paralysed. He then sexually assaulted her.\"And he ends up calling the police on himself and tells them that 'this is my name, this is where I'm at'. He calls me his girlfriend, but then later admits to the police that we had broken up,\" Otto says.\"And he was like ''I just killed my girlfriend and her new boyfriend'. They show up, he's sitting in the driveway, and he gets taken away.\"In January 2023, the ex-boyfriend pleaded guilty to two counts of burglary with assault, two counts of attempted murder in the first degree, one count of sexual battery and two counts of aggravated bodily harm.He was sentenced to 40 years in jail.",
        "The attack changed Otto's life forever. Nearly five years on, she is still re-learning how her body works.\"It's more than just the paralysis and the wheelchair that you see on the outside, there's a lot going on the inside that doesn't function any more,\" she says.\"So, for example, my diaphragm is paralysed as well, my body doesn't also regulate its temperature any more. I can't thermally regulate, and that means I can't sweat any more.\"So, if I sit out in the sun, like I do for archery, my body and my internal temperature gets incredibly high, so we have to do everything that we can to make sure I don't overheat and have a heatstroke.\"And there's also bowel and bladder issues where that doesn't function any more, so I have to find alternate ways of relieving myself.\"Because my brain can't communicate with the rest of my body, if something is wrong below my level of injury, I can't feel it. And it can be literally anything.\"I could have to go to the bathroom, I could have a scratch, my clothes may be too tight, I could have an ingrown toenail, anything. \"If something happens below my level of injury that's an unwanted stimuli, my body  immediately goes into fight-or-flight mode and escalates my blood pressure.\"That's my body’s way of saying 'hey, something is wrong' but it gets dangerously high, and I can have a seizure, heart attack, stroke and ultimately die within minutes. And it can happen at any time.\"",
        "For most people, just attempting to return to everyday life after something so traumatic would be enough. But Otto, formerly an aspiring fitness model, wanted to get back to being active.So, in March 2021, she picked up a sport she had never tried before on a whim. \"I was in the car with Ricky, thinking about how I had lots of time on my hands - I can't work traditional jobs any more,\" she says.\"And I just thought 'why not try archery?' Ricky was like 'your hands don't work', but I just thought we'd figure it out. I did some research and found we have an adaptive archery course in our area. A week later I was shooting for the first time.\"Because of her disabilities, Otto has to shoot with a specially designed harness. She used to release arrows from her right shoulder, but now uses her mouth.\"I have an adaptive release that is on my wrist - it has a cable that goes up in through my hat and has a closed pin-type apparatus that I bite down on when I’m ready to release the arrow,” she says.\"And then I have a hat and glove that allows me to be able to hold the bow so I don't drop it when I release the arrow.\"Otto says she hit the target with the first arrow she ever shot, and was hooked.",
        "Soon, she had major ambitions.\"I wanted to go for Paralympics right away. In my second week of practice I was asking 'what does competing look like?'\" she says.Otto was soon touring the country, taking part in qualifying tournaments. As the only female American archer in her Paralympic category, she had to meet a minimum score - shooting 72 arrows, she needed 520 points from 720.She hit that mark last summer, and confirmed her passage to Paris in a three-stage series earlier this year, culminating on home turf in Florida, and that surprise celebration over lunch.Otto is very frank about what happened to her, and the struggles she faces in everyday life. But the Floridian is a vibrant and unabashed character who refuses to be cowed by the man who tried to take everything from her.\"I've had this feeling that there is a bigger picture about this situation,\" she says. \"I have always wanted to leave an impact on this world, and be a light. There is so much darkness and hate, I can't justify not talking about and being an example for people hurt like me. \"I can't just lie down and take it, lie down and die.\"Honestly it's exhausting. I'm very lucky that I have Ricky to help me, to make sure I am OK. But it is really hard, even picking something up, it reminds me of what happened to me. Your body does not work any more in the way it should.\"But there is a light at the end of the tunnel, and that is that I worked through it and have learned so much about it along the way. \"My life is so much better now, much more colourful and full of love and laughter than it was before.\"",
        "Paralysed by an ex-boyfriend, Otto rises as Paralympian",
        "This article contains descriptions and details of domestic violence. If you have been affected by any of the issues raised, BBC Action Line can provide contacts to find help.",
        "Tracy Otto was just tucking into her lunch when she was surprised by the news that she is going to the Paralympics.",
        "\"They gave Ricky [Riessle], my boyfriend, this box with a hat in it, saying 'you're qualified',\" the 28-year-old tells BBC Sport.",
        "\"When he presented it to me I was eating, I had food in my mouth. So I was eating and crying, and there were cameras everywhere.\"",
        "Otto had been selected for the United States archery team, external at Paris 2024, where she will shoot in both the mixed teams with partner Jason Tabansky and in qualification for the W1 open individuals competition.",
        "\"It's so cool,\" Otto says from her Tampa home with a gigantic grin on her face.",
        "\"From being on my deathbed to the Paralympics is just a crazy journey. I am in awe of myself and my team.\"",
        "Otto is not exaggerating when she talks about being on her deathbed.",
        "In October 2019, Otto was attacked at her home by her ex-boyfriend.",
        "She was left paralysed from the chest down with limited use of her arms and hands, and lost her left eye. She can also no longer sweat or regulate her body temperature properly.",
        "Otto is willing to talk about the night which changed her life in remarkably honest detail in order, in her own words, to \"be a light, a beacon of hope in this world\".",
        "She wants to let other women who have suffered violence at the hands of a partner or an ex know they are not alone.",
        "Otto had to learn how to swallow, eat and sit up again after being attacked in her own home",
        "In September 2019, Otto broke up with a boyfriend. A month previously, he had been arrested for attacking her at their home in Riverview, Florida.",
        "Otto was ready to move on with her life, and had met someone new.",
        "“I had just started talking to Ricky,\" she told the BBC World Service's Sportshour programme. \"We met on 26 September 2019, and we went on a couple of dates.",
        "\"I had broken up with my ex, kicked him out, told him to leave, he gathered all of his things, he was gone and I had changed all of the locks on my house. Everything was done.",
        "\"That night it was 24 October 2019, we had another little date, and we go off to bed. I remember rolling over and getting comfortable in bed and drifting off to sleep.",
        "\"And then all of a sudden, I hear this loud noise and I see a flashlight in my face and I was so confused.",
        "\"And then I heard his voice, and I realised it was my ex.",
        "\"He had parked his car at the front of my house, went around the back of the house and looked through my bedroom window. We were sleeping, and he had decided to go to purchase a high-powered pellet gun.",
        "\"He did the best that he could to get as close to a real gun as possible. And a knife and a set of handcuffs.",
        "\"And he comes back to my house, breaks in and wakes us up, screaming at us to get out of bed.",
        "\"He tells us that he's going to kill us and that if he didn't kill himself, he was going to call the police.",
        "\"So, he outright told us what he was going to do. This is where everything gets kind of blurry because it happened so quickly. I can tell you what I know happened, I just don't have it first-hand because my brain just kind of blocked everything out.\"",
        "The attacker punched Otto multiple times before shooting Riessle twice in the face and stabbing him in the back, causing his lung to collapse.",
        "He then shot Otto through the left eye, before stabbing her in the back of the neck, leaving her paralysed. He then sexually assaulted her.",
        "\"And he ends up calling the police on himself and tells them that 'this is my name, this is where I'm at'. He calls me his girlfriend, but then later admits to the police that we had broken up,\" Otto says.",
        "\"And he was like ''I just killed my girlfriend and her new boyfriend'. They show up, he's sitting in the driveway, and he gets taken away.\"",
        "In January 2023, the ex-boyfriend pleaded guilty to two counts of burglary with assault, two counts of attempted murder in the first degree, one count of sexual battery and two counts of aggravated bodily harm.",
        "He was sentenced to 40 years in jail.",
        "Otto's boyfriend Ricky Riessle supported her through her lengthy stay in hospital",
        "The attack changed Otto's life forever. Nearly five years on, she is still re-learning how her body works.",
        "\"It's more than just the paralysis and the wheelchair that you see on the outside, there's a lot going on the inside that doesn't function any more,\" she says.",
        "\"So, for example, my diaphragm is paralysed as well, my body doesn't also regulate its temperature any more. I can't thermally regulate, and that means I can't sweat any more.",
        "\"So, if I sit out in the sun, like I do for archery, my body and my internal temperature gets incredibly high, so we have to do everything that we can to make sure I don't overheat and have a heatstroke.",
        "\"And there's also bowel and bladder issues where that doesn't function any more, so I have to find alternate ways of relieving myself.",
        "\"Because my brain can't communicate with the rest of my body, if something is wrong below my level of injury, I can't feel it. And it can be literally anything.",
        "\"I could have to go to the bathroom, I could have a scratch, my clothes may be too tight, I could have an ingrown toenail, anything.",
        "\"If something happens below my level of injury that's an unwanted stimuli, my body  immediately goes into fight-or-flight mode and escalates my blood pressure.",
        "\"That's my body’s way of saying 'hey, something is wrong' but it gets dangerously high, and I can have a seizure, heart attack, stroke and ultimately die within minutes. And it can happen at any time.\"",
        "Otto had ambitions to be a fitness model before she was attacked and paralysed",
        "For most people, just attempting to return to everyday life after something so traumatic would be enough. But Otto, formerly an aspiring fitness model, wanted to get back to being active.",
        "So, in March 2021, she picked up a sport she had never tried before on a whim.",
        "\"I was in the car with Ricky, thinking about how I had lots of time on my hands - I can't work traditional jobs any more,\" she says.",
        "\"And I just thought 'why not try archery?' Ricky was like 'your hands don't work', but I just thought we'd figure it out. I did some research and found we have an adaptive archery course in our area. A week later I was shooting for the first time.\"",
        "Because of her disabilities, Otto has to shoot with a specially designed harness. She used to release arrows from her right shoulder, but now uses her mouth.",
        "\"I have an adaptive release that is on my wrist - it has a cable that goes up in through my hat and has a closed pin-type apparatus that I bite down on when I’m ready to release the arrow,” she says.",
        "\"And then I have a hat and glove that allows me to be able to hold the bow so I don't drop it when I release the arrow.\"",
        "Otto says she hit the target with the first arrow she ever shot, and was hooked.",
        "Otto uses a custom system involving her biting down on a small metal clip to release her arrows",
        "Soon, she had major ambitions.",
        "\"I wanted to go for Paralympics right away. In my second week of practice I was asking 'what does competing look like?'\" she says.",
        "Otto was soon touring the country, taking part in qualifying tournaments. As the only female American archer in her Paralympic category, she had to meet a minimum score - shooting 72 arrows, she needed 520 points from 720.",
        "She hit that mark last summer, and confirmed her passage to Paris in a three-stage series earlier this year, culminating on home turf in Florida, and that surprise celebration over lunch.",
        "Otto is very frank about what happened to her, and the struggles she faces in everyday life. But the Floridian is a vibrant and unabashed character who refuses to be cowed by the man who tried to take everything from her.",
        "\"I've had this feeling that there is a bigger picture about this situation,\" she says.",
        "\"I have always wanted to leave an impact on this world, and be a light. There is so much darkness and hate, I can't justify not talking about and being an example for people hurt like me.",
        "\"I can't just lie down and take it, lie down and die.",
        "\"Honestly it's exhausting. I'm very lucky that I have Ricky to help me, to make sure I am OK. But it is really hard, even picking something up, it reminds me of what happened to me. Your body does not work any more in the way it should.",
        "\"But there is a light at the end of the tunnel, and that is that I worked through it and have learned so much about it along the way.",
        "\"My life is so much better now, much more colourful and full of love and laughter than it was before.\"",
        "Riessle supports Otto whenever she competes",
        "How a Facebook advert changed a life and the look of a sport",
        "An Olympic friendship that defied Hitler",
        "Inside the gym building champions - and community",
        "Chasing the 'Ghost' - a superstar struck down by lightning"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/archery/articles/cnl04eq9plpo",
      "main_category": "sport",
      "detailed_category": "archery",
      "topic": "Paralympics 2024: A guide to Para-archery at the Paris Games",
      "content": [
        "Dates: 29 August-5 SeptemberVenue: InvalidesGold medals on offer: Nine",
        "Archers compete in three classes - W1, open compound and open recurve.The W1 classification is for the most impaired archers, who may have an impairment in their legs and use a wheelchair. They may shoot either a recurve or compound bow modified from standard rules but there are not separate competitions for the two disciplines.The open classification is for competitors with an impairment in either the top or bottom halves of their bodies. Some athletes may use a wheelchair but others who have balance issues may shoot resting on a stool or standing.The recurve bow is the more traditional style of bow - when the string is drawn back, the curves of the bow straighten to give leverage when it is released - while the compound bow uses a system of levers and pulleys in order to fire the arrows.In W1 competition, the compound bow draw weight is limited to 45lbs and archers are not allowed to use magnifying scopes or levelling bubbles in their sight but competitors in the compound open division can use them and the draw weight is 60lbs.Targets have a diameter of 122cm and open recurve competitors shoot from a distance of 70 metres while open compound and W1 competitors shoot from 50 metres.The target is marked with 10 concentric rings which increase in points value the smaller and the closer they get to the centre. A hit in the outermost zone is worth one point while a hit in the centre, the 'gold', is worth 10 points.Each event includes a ranking round where each archer shoots 72 arrows (12 ends of six arrows each) before the archers enter the elimination rounds.The winner in the elimination phase in the open compound and W1 events is the athlete who scores the most points across the five ends of three arrows in each head-to-head match. In the open recurve event, the winner is the first archer to score to six points with two points given to the one who gets the highest score over each end of three arrows.In the event of a tie, an arrow-by-arrow shoot-off will be held, creating the possibility of a gold medal being decided by a single shot.In the individual events, the top performers in the ranking round will receive a bye in the first elimination round because of the number of entries.For the team events, teams are ranked according to the combined scores from the ranking round before proceeding to the knockout stages.",
        "Defending women's compound champion Phoebe Patterson-Pine will be hoping to retain her Tokyo title but among her challengers will be GB team-mate Jodie Grinham, who will be 28 weeks pregnant when she competes in Paris.Grinham, a team silver medallist in Rio, won the European Para Cup title earlier this year while the GB pair won European Championship bronze in the women's doubles and although that event isn't on the Paralympic programme, they are both in strong form.Nathan MacQueen is world number two in the men's compound and took silver at the 2023 Worlds as the former rugby player chases a medal at his third Paralympics, while Victoria Kingstone will be hoping to shine in the women's W1 event on her Games debut.",
        "China led the medal table both at Tokyo 2020 and last year's World Championships in the Czech Republic - although that event had a bigger programme than we will see in Paris.Having won just one bronze in Tokyo, India is starting to emerge as a strong nation in the sport.Among their leading challengers is teenager Sheetal Devi, who was born without upper limbs and uses her feet to manoeuvre the bow and shoot arrows. The 17-year-old won world compound silver last year and will be a big threat to Patterson-Pine and Grinham.David Drahoninsky of the Czech Republic, who will be competing at his fifth Games, will be bidding to continue his record of a medal from each in the men's W1 while former Para skier Kevin Mather will hope to maintain his dominance in the men's recurve, where he is Paralympic and world champion.",
        "Archery was part of the first edition of the Stoke Mandeville Games - the predecessor of the Paralympics. Sixteen injured servicemen and women competed in the event in July 1948 under the supervision of Ludwig Guttmann.",
        "Two - one gold (Phoebe Patterson-Pine) and one bronze (Victoria Rumary)",
        "American Matt Stutzman, who won silver at London 2012, uses his feet to shoot arrows",
        "Dates: 29 August-5 September",
        "Gold medals on offer: Nine",
        "Archers compete in three classes - W1, open compound and open recurve.",
        "The W1 classification is for the most impaired archers, who may have an impairment in their legs and use a wheelchair. They may shoot either a recurve or compound bow modified from standard rules but there are not separate competitions for the two disciplines.",
        "The open classification is for competitors with an impairment in either the top or bottom halves of their bodies. Some athletes may use a wheelchair but others who have balance issues may shoot resting on a stool or standing.",
        "The recurve bow is the more traditional style of bow - when the string is drawn back, the curves of the bow straighten to give leverage when it is released - while the compound bow uses a system of levers and pulleys in order to fire the arrows.",
        "In W1 competition, the compound bow draw weight is limited to 45lbs and archers are not allowed to use magnifying scopes or levelling bubbles in their sight but competitors in the compound open division can use them and the draw weight is 60lbs.",
        "Targets have a diameter of 122cm and open recurve competitors shoot from a distance of 70 metres while open compound and W1 competitors shoot from 50 metres.",
        "The target is marked with 10 concentric rings which increase in points value the smaller and the closer they get to the centre. A hit in the outermost zone is worth one point while a hit in the centre, the 'gold', is worth 10 points.",
        "Each event includes a ranking round where each archer shoots 72 arrows (12 ends of six arrows each) before the archers enter the elimination rounds.",
        "The winner in the elimination phase in the open compound and W1 events is the athlete who scores the most points across the five ends of three arrows in each head-to-head match. In the open recurve event, the winner is the first archer to score to six points with two points given to the one who gets the highest score over each end of three arrows.",
        "In the event of a tie, an arrow-by-arrow shoot-off will be held, creating the possibility of a gold medal being decided by a single shot.",
        "In the individual events, the top performers in the ranking round will receive a bye in the first elimination round because of the number of entries.",
        "For the team events, teams are ranked according to the combined scores from the ranking round before proceeding to the knockout stages.",
        "Defending women's compound champion Phoebe Patterson-Pine will be hoping to retain her Tokyo title but among her challengers will be GB team-mate Jodie Grinham, who will be 28 weeks pregnant when she competes in Paris.",
        "Grinham, a team silver medallist in Rio, won the European Para Cup title earlier this year while the GB pair won European Championship bronze in the women's doubles and although that event isn't on the Paralympic programme, they are both in strong form.",
        "Nathan MacQueen is world number two in the men's compound and took silver at the 2023 Worlds as the former rugby player chases a medal at his third Paralympics, while Victoria Kingstone will be hoping to shine in the women's W1 event on her Games debut.",
        "China led the medal table both at Tokyo 2020 and last year's World Championships in the Czech Republic - although that event had a bigger programme than we will see in Paris.",
        "Having won just one bronze in Tokyo, India is starting to emerge as a strong nation in the sport.",
        "Among their leading challengers is teenager Sheetal Devi, who was born without upper limbs and uses her feet to manoeuvre the bow and shoot arrows. The 17-year-old won world compound silver last year and will be a big threat to Patterson-Pine and Grinham.",
        "David Drahoninsky of the Czech Republic, who will be competing at his fifth Games, will be bidding to continue his record of a medal from each in the men's W1 while former Para skier Kevin Mather will hope to maintain his dominance in the men's recurve, where he is Paralympic and world champion.",
        "Archery was part of the first edition of the Stoke Mandeville Games - the predecessor of the Paralympics. Sixteen injured servicemen and women competed in the event in July 1948 under the supervision of Ludwig Guttmann.",
        "Two - one gold (Phoebe Patterson-Pine) and one bronze (Victoria Rumary)"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/olympics/articles/clygvj8gj1yo",
      "main_category": "sport",
      "detailed_category": "archery",
      "topic": "How did Team GB win their Olympic medals?",
      "content": [
        "Let the celebrations begin - Team Great Britain have finished Paris 2024 with 65 medals, beating their total from Tokyo by one.The total matches the team's medal haul from London 2012 and is the joint-third-highest for Team GB at a single Games behind Rio 2016 (67 medals) and London 1908 (146).But GB did get eight fewer golds than they did three years ago in Tokyo.In fact 14 golds was only good enough for seventh in the medal table, GB's lowest placing since Athens 2004.This is because the official medal table is ordered by golds won.So, was Paris 2024 a record-breaking Games or a backwards step? Let's go through the stats.",
        "British fans have been spoiled at recent Games. Third in London, second in Rio and fourth in Tokyo.Seventh almost feels like a disappointment.But if we change the table from most golds to total medals won, things suddenly look much better.And there is a precedent. The US media have been presenting Olympic medal tables this way for years. Below is BBC Sport's official medal table from the Paris 2024 ordered by golds. Then take a look at what it looks like in the US media...",
        "Plus, GB coming home with 14 golds would have been unthinkable 28 years ago.",
        "Sir Steve Redgrave and Matthew Pinsent won the rowing men's coxless pair at Atlanta 1996 for GB's only gold, in case you were wondering.",
        "On medals won it was cycling, but on golds alone rowing was Team GB's best sport at Paris 2024.",
        "Rowing last topped GB's medal table at Atlanta, but has joined cycling in number one.With equestrian being GB's third-best sport based on golds, Paris was the Olympics for sports which required British athletes to be sitting down.",
        "Money talks. UK Sport awarded £245,837,685 of funding for the Paris Olympic cycle.It means each GB medal cost, on average, £3,782,118.Cycling received £29,314,683, the most funding for any sport, followed by rowing (£23,794,482) and sailing (£22,800,520).",
        "Hockey (£13,689,907) had the most funding of any sport in which GB did not win a medal in Paris.UK Sport - funded by the government and National Lottery income - does not give Olympic funding to golf, making Tommy Fleetwood's silver GB's cheapest medal.The next cheapest medal was Kate Shortman and Izzy Thorpe's silver in the artistic swimming women's duet. Artistic swimming received just £467,250 from UK Sport.",
        "If we go by place of birth London was Britain's best source of medals with 32, just short of Germany's total of 33.The South East of England contributed 21, the West Midlands 14 and the North West of England and Yorkshire were locked together on 12. Yorkshire was briefly and famously above Australia in the London 2012 medal table. No such luck this time but a dozen medals was still the equal of Ukraine and one more than Sweden.Scotland took home 10, the same as Belgium, Wales seven like Croatia and Northern Ireland four, joining Portugal on that haul.",
        "Of course!In the battle of the sexes British male athletes won 31 medals, with female athletes winning 30. Four of GB's medals were in mixed events.The average age of British medallists was 27 years and three months. The youngest winner was 16-year-old skateboarder Sky Brown. The oldest was 57-year-old dressage rider Carl Hester.Thanks to McEwan, Pidcock, Dean, Digby, Ford, Daley, George and Fleetwood the most common first name for a GB medallist was Thomas.So, if you are a 23-year-old male rower living in London called Tom - get training now. You are our best hope for Los Angeles 2028!",
        "'Sensational' Paris Olympics come to an endEverything you need to know about LA 2028Ten viral moments from the Paris Olympics",
        "This video can not be played",
        "Olympics 2024: Every Team GB Olympic medal in Paris",
        "Let the celebrations begin - Team Great Britain have finished Paris 2024 with 65 medals, beating their total from Tokyo by one.",
        "The total matches the team's medal haul from London 2012 and is the joint-third-highest for Team GB at a single Games behind Rio 2016 (67 medals) and London 1908 (146).",
        "But GB did get eight fewer golds than they did three years ago in Tokyo.",
        "In fact 14 golds was only good enough for seventh in the medal table, GB's lowest placing since Athens 2004.",
        "This is because the official medal table is ordered by golds won.",
        "So, was Paris 2024 a record-breaking Games or a backwards step? Let's go through the stats.",
        "British fans have been spoiled at recent Games. Third in London, second in Rio and fourth in Tokyo.",
        "Seventh almost feels like a disappointment.",
        "But if we change the table from most golds to total medals won, things suddenly look much better.",
        "And there is a precedent. The US media have been presenting Olympic medal tables this way for years.",
        "Below is BBC Sport's official medal table from the Paris 2024 ordered by golds. Then take a look at what it looks like in the US media...",
        "Team GB move up to third on the total medals table of broadcaster NBC",
        "Plus, GB coming home with 14 golds would have been unthinkable 28 years ago.",
        "Sir Steve Redgrave and Matthew Pinsent won the rowing men's coxless pair at Atlanta 1996 for GB's only gold, in case you were wondering.",
        "On medals won it was cycling, but on golds alone rowing was Team GB's best sport at Paris 2024.",
        "Rowing last topped GB's medal table at Atlanta, but has joined cycling in number one.",
        "With equestrian being GB's third-best sport based on golds, Paris was the Olympics for sports which required British athletes to be sitting down.",
        "Money talks. UK Sport awarded £245,837,685 of funding for the Paris Olympic cycle.",
        "It means each GB medal cost, on average, £3,782,118.",
        "Cycling received £29,314,683, the most funding for any sport, followed by rowing (£23,794,482) and sailing (£22,800,520).",
        "Hockey (£13,689,907) had the most funding of any sport in which GB did not win a medal in Paris.",
        "UK Sport - funded by the government and National Lottery income - does not give Olympic funding to golf, making Tommy Fleetwood's silver GB's cheapest medal.",
        "The next cheapest medal was Kate Shortman and Izzy Thorpe's silver in the artistic swimming women's duet. Artistic swimming received just £467,250 from UK Sport.",
        "If we go by place of birth London was Britain's best source of medals with 32, just short of Germany's total of 33.",
        "The South East of England contributed 21, the West Midlands 14 and the North West of England and Yorkshire were locked together on 12. Yorkshire was briefly and famously above Australia in the London 2012 medal table. No such luck this time but a dozen medals was still the equal of Ukraine and one more than Sweden.",
        "Scotland took home 10, the same as Belgium, Wales seven like Croatia and Northern Ireland four, joining Portugal on that haul.",
        "In the battle of the sexes British male athletes won 31 medals, with female athletes winning 30. Four of GB's medals were in mixed events.",
        "The average age of British medallists was 27 years and three months. The youngest winner was 16-year-old skateboarder Sky Brown. The oldest was 57-year-old dressage rider Carl Hester.",
        "Thanks to McEwan, Pidcock, Dean, Digby, Ford, Daley, George and Fleetwood the most common first name for a GB medallist was Thomas.",
        "So, if you are a 23-year-old male rower living in London called Tom - get training now. You are our best hope for Los Angeles 2028!",
        "'Sensational' Paris Olympics come to an end",
        "Everything you need to know about LA 2028",
        "Ten viral moments from the Paris Olympics"
      ]
    },
    {
      "url": "https://www.bbc.co.uk/sport/olympics/articles/c3g6gl2y8j8o",
      "main_category": "sport",
      "detailed_category": "archery",
      "topic": "British teenager Havers knocked out in last-16",
      "content": [
        "Great Britain's hopes of a medal in the women's individual event in Paris ended with teenager Megan Havers after she was knocked out in the last-16.Havers, who at 16-years-old is the youngest archer at the Games, lost 6-1 to South Korea's top seed Lim Sihyeon at Les Invalides.Leicester-born Havers started well, tying the first set, but struggled to keep up with Sihyeon's consistency.“Finishing where I am and shooting how I have just has made me hungry for the next Olympics,\" she said after her exit.\"I can't wait to see what four years brings for me.\"Britons Penny Healey and Bryony Pitman were also knocked out of the individual event earlier this week and the trio did not progress past the first round in the team event.Sihyeon has already won two gold medals in the French capital with victory in the women's and mixed team events.",
        "Megan Havers completed her GCSEs this year",
        "Great Britain's hopes of a medal in the women's individual event in Paris ended with teenager Megan Havers after she was knocked out in the last-16.",
        "Havers, who at 16-years-old is the youngest archer at the Games, lost 6-1 to South Korea's top seed Lim Sihyeon at Les Invalides.",
        "Leicester-born Havers started well, tying the first set, but struggled to keep up with Sihyeon's consistency.",
        "“Finishing where I am and shooting how I have just has made me hungry for the next Olympics,\" she said after her exit.",
        "\"I can't wait to see what four years brings for me.\"",
        "Britons Penny Healey and Bryony Pitman were also knocked out of the individual event earlier this week and the trio did not progress past the first round in the team event.",
        "Sihyeon has already won two gold medals in the French capital with victory in the women's and mixed team events."
      ]
    }
  ]
}