{
  "scraped_at": "2025-10-27T18:56:59.770546",
  "total_articles": 16,
  "category": "commonwealth-games",
  "articles_per_category": 100,
  "articles": [
    {
      "url": "https://www.bbc.com/sport/articles/cp97x81mgrpo",
      "main_category": "sport",
      "detailed_category": "commonwealth-games",
      "topic": "Guernsey allocated 20 places for 2026 Commonwealth Games",
      "content": [
        "Guernsey competitors have been allocated 20 places for the 2026 Commonwealth Games in Glasgow.The Channel Island hopes to have representation in four sports - athletics, boxing, bowls and swimming.The island won two medals at the last games in Birmingham in 2022 - the most successful haul by the island since Edinburgh in 1986.Lucy Beere won silver in the women's singles bowls, while Alastair Chalmers took bronze in the 400m hurdles - the island's first ever athletics medal.Chalmers, who reached the semi-finals at the last Olympics, will be Guernsey's biggest medal hope in Glasgow next summer.The number is eight fewer than the team that went to the last games in Birmingham.Glasgow stepped in at short notice to hold a scaled-back version of the event after the Australian state of Victoria pulled out of hosting the event because of rising costs.It is the highest-profile muti-sport event that Guernsey, a British Crown Dependency, competes at under its own flag.Former shooter Peter Jory will be Guernsey's chef de mission in Glasgow with Karina Jackson serving as general team manager.",
        "Guernsey had 28 competitors at the last Commonwealth Games in Birmingham",
        "Guernsey competitors have been allocated 20 places for the 2026 Commonwealth Games in Glasgow.",
        "The Channel Island hopes to have representation in four sports - athletics, boxing, bowls and swimming.",
        "The island won two medals at the last games in Birmingham in 2022 - the most successful haul by the island since Edinburgh in 1986.",
        "Lucy Beere won silver in the women's singles bowls, while Alastair Chalmers took bronze in the 400m hurdles - the island's first ever athletics medal.",
        "Chalmers, who reached the semi-finals at the last Olympics, will be Guernsey's biggest medal hope in Glasgow next summer.",
        "The number is eight fewer than the team that went to the last games in Birmingham.",
        "Glasgow stepped in at short notice to hold a scaled-back version of the event after the Australian state of Victoria pulled out of hosting the event because of rising costs.",
        "It is the highest-profile muti-sport event that Guernsey, a British Crown Dependency, competes at under its own flag.",
        "Former shooter Peter Jory will be Guernsey's chef de mission in Glasgow with Karina Jackson serving as general team manager."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/articles/cyvq6pl4j33o",
      "main_category": "sport",
      "detailed_category": "commonwealth-games",
      "topic": "Seven nations plan 2030 & 2034 Commonwealth bids",
      "content": [
        "Fears that Glasgow 2026 might be the last-ever Commonwealth Games have been alleviated after seven nations lodged official expressions of interest to host in 2030 or 2034.Scotland's largest city stepped in last year with plans for a scaled-back Games next summer after the Australia state of Victoria withdrew for financial reasons.Those proposed changes to the event - fewer sports, fewer athletes, fewer venues - have lessened the cost and enticed other potential hosts to look at future stagings. Canada, India, Nigeria, plus two others have all publicly confirmed their interest in the centenary Games in 2030, while New Zealand are one of two nations looking at the 2034 edition.In January, the 74 Commonwealth Games Federation nations were invited to lodge notes of interest and the seven who responded positively - all from Africa, Asia, the Americas, and Oceania - will have the feasiblity of their bids examined over the next five months.It is expected that the hosts of the 2030 Games will be finalised in November.Commonwealth Sport chief executive Katie Sadleir said: \"We are thrilled with the incredible interest from four of our six regions.\"We cannot understate the hugely-significant role Scotland has played, having the foresight, tenacity and innovative thinking to step forward and host in 2026. \"We are confident that Glasgow's pioneering example will increase the breadth of countries able to host the Games in the decades ahead.\"Phil Batty, chief executive of Glasgow 2026, said the news shows that next summer's Games will be \"a pivotal moment\" in the event's history.\"I have every confidence Glasgow 2026 will pioneer a new model for the major event - one that delivers a successful Games on time, on budget and with high-quality sport at the heart of the experience,\" he added.",
        "Fears that Glasgow 2026 might be the last-ever Commonwealth Games have been alleviated after seven nations lodged official expressions of interest to host in 2030 or 2034.",
        "Scotland's largest city stepped in last year with plans for a scaled-back Games next summer after the Australia state of Victoria withdrew for financial reasons.",
        "Those proposed changes to the event - fewer sports, fewer athletes, fewer venues - have lessened the cost and enticed other potential hosts to look at future stagings.",
        "Canada, India, Nigeria, plus two others have all publicly confirmed their interest in the centenary Games in 2030, while New Zealand are one of two nations looking at the 2034 edition.",
        "In January, the 74 Commonwealth Games Federation nations were invited to lodge notes of interest and the seven who responded positively - all from Africa, Asia, the Americas, and Oceania - will have the feasiblity of their bids examined over the next five months.",
        "It is expected that the hosts of the 2030 Games will be finalised in November.",
        "Commonwealth Sport chief executive Katie Sadleir said: \"We are thrilled with the incredible interest from four of our six regions.",
        "\"We cannot understate the hugely-significant role Scotland has played, having the foresight, tenacity and innovative thinking to step forward and host in 2026.",
        "\"We are confident that Glasgow's pioneering example will increase the breadth of countries able to host the Games in the decades ahead.\"",
        "Phil Batty, chief executive of Glasgow 2026, said the news shows that next summer's Games will be \"a pivotal moment\" in the event's history.",
        "\"I have every confidence Glasgow 2026 will pioneer a new model for the major event - one that delivers a successful Games on time, on budget and with high-quality sport at the heart of the experience,\" he added.",
        "Mile races will be among more than 200 Glasgow 2026 golds",
        "Will Glasgow be last leg or clever rebirth for Commonwealths?",
        "Scotland agrees to host Commonwealth Games in 2026"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/cycling/articles/cwy8jd3018yo",
      "main_category": "sport",
      "detailed_category": "commonwealth-games",
      "topic": "'I don't want to be stopped eating a sausage roll'",
      "content": [
        "Sir Chris Hoy or Sir Andy Murray could not walk through the centre of Glasgow unrecognised. And Duncan Scott might draw a fair few second looks, even without the clank of his Olympic medals around his neck.But, earlier this week, Jack Carlin quite happily ambled around the middle of Scotland's largest city without anyone paying heed.Hoy and Scott are the only two of Carlin's male Scottish compatriots with more Olympic medals after his silver and bronze in Paris last summer. Even Murray is one short of his tally of four, albeit he can trump Carlin with two golds.Not that the ebullient cyclist is in the slightest bit bothered by his low profile.\"The last thing I want is to be stopped when I'm walking down the road eating a sausage roll,\" he says.\"Glasgow's got a very good way of not caring and I love that. I think, unless you play for one of the Old Firm, nobody's stopping you in the street. And, if they do, it's normally to have a go, isn't it?\"",
        "Glasgow and its denizens might care a bit more next summer, when the Commonwealth Games returns to the city.Cycling will be a key component of the reimagined event and Carlin, who was at the Sir Chris Hoy Velodrome as a fan in 2014, will be a central figure this time.As if a home Games - quite literally, given he now lives just up the road in the city's east end - wasn't motivation enough, the 28-year-old has a wrong to right.Carlin has stepped on the podium 19 times in global competition but has never clambered up to the top step.Sprint silver in Gold Coast, bronze in Birmingham, plus keirin silver three years ago, are the extent of his Commonwealth haul, while a broken ankle 12 weeks out from Paris compromised his chances at the last Olympics.Now back home after several months in Australia and south east Asia -  \"let's call it decompressing\" - his focus is on Glasgow 2026.\"If someone said to 17-year-old Jack, sitting in the stands at Glasgow 2014, 'listen, you'd be talking about a home Commonwealth Games, 12 years later, with four Olympic medals around your neck', I would never have believed you,\" he says.\"It's an exciting time to be Scottish and to be Glaswegian, for sure.\"I think, if we can emulate the success and legacy of 2014 - that was what really kick-started my career - and get one or two individuals who are like me in 2014 out of this one, that's a success.\"",
        "Jack Carlin is set to compete in his third Commonwealth Games in Glasgow next summer",
        "Sir Chris Hoy or Sir Andy Murray could not walk through the centre of Glasgow unrecognised. And Duncan Scott might draw a fair few second looks, even without the clank of his Olympic medals around his neck.",
        "But, earlier this week, Jack Carlin quite happily ambled around the middle of Scotland's largest city without anyone paying heed.",
        "Hoy and Scott are the only two of Carlin's male Scottish compatriots with more Olympic medals after his silver and bronze in Paris last summer. Even Murray is one short of his tally of four, albeit he can trump Carlin with two golds.",
        "Not that the ebullient cyclist is in the slightest bit bothered by his low profile.",
        "\"The last thing I want is to be stopped when I'm walking down the road eating a sausage roll,\" he says.",
        "\"Glasgow's got a very good way of not caring and I love that. I think, unless you play for one of the Old Firm, nobody's stopping you in the street. And, if they do, it's normally to have a go, isn't it?\"",
        "Carlin 'mucked up' but ok after keirin crash",
        "Carlin left listening again as Dutch call the tune in team sprint",
        "Glasgow and its denizens might care a bit more next summer, when the Commonwealth Games returns to the city.",
        "Cycling will be a key component of the reimagined event and Carlin, who was at the Sir Chris Hoy Velodrome as a fan in 2014, will be a central figure this time.",
        "As if a home Games - quite literally, given he now lives just up the road in the city's east end - wasn't motivation enough, the 28-year-old has a wrong to right.",
        "Carlin has stepped on the podium 19 times in global competition but has never clambered up to the top step.",
        "Sprint silver in Gold Coast, bronze in Birmingham, plus keirin silver three years ago, are the extent of his Commonwealth haul, while a broken ankle 12 weeks out from Paris compromised his chances at the last Olympics.",
        "Now back home after several months in Australia and south east Asia -  \"let's call it decompressing\" - his focus is on Glasgow 2026.",
        "\"If someone said to 17-year-old Jack, sitting in the stands at Glasgow 2014, 'listen, you'd be talking about a home Commonwealth Games, 12 years later, with four Olympic medals around your neck', I would never have believed you,\" he says.",
        "\"It's an exciting time to be Scottish and to be Glaswegian, for sure.",
        "\"I think, if we can emulate the success and legacy of 2014 - that was what really kick-started my career - and get one or two individuals who are like me in 2014 out of this one, that's a success.\""
      ]
    },
    {
      "url": "https://www.bbc.com/sport/articles/cvg7pvp158vo",
      "main_category": "sport",
      "detailed_category": "commonwealth-games",
      "topic": "Jenkins resigns as Commonwealth Sport president",
      "content": [
        "Welshman Chris Jenkins has resigned as president of Commonwealth Sport.He took the role in November 2023 after Australian state Victoria had pulled out of hosting the 2026 Games and Canadian province Alberta had withdrawn its interest for 2030.In 2024 Glasgow assumed responsibility for the 2026 event.Later that year, Jenkins set out the concept of Games being shared between multiple host cities or towns.Jenkins said he was \"particularly proud\" of having the opportunity to help development in sport \"and especially Para inclusion\".He also all his \"Commonwealth Games Association colleagues and friends for their support\".Commonwealth Sport chief executive Katie Sadleir confirmed Ugandan lawyer and sports administrator Dr Donald Rukare as interim Commonwealth Sport president with a new permanent role holder to be elected at its next general assembly in November 2025.Rukare said: \"We have come through a particularly challenging period in our Games history, and we are now building momentum towards an outstanding Commonwealth Games in Glasgow in 2026.\"",
        "Chris Jenkins competed for Wales at the 1984 Commonwealth Games as a rowing cox",
        "Welshman Chris Jenkins has resigned as president of Commonwealth Sport.",
        "He took the role in November 2023 after Australian state Victoria had pulled out of hosting the 2026 Games and Canadian province Alberta had withdrawn its interest for 2030.",
        "In 2024 Glasgow assumed responsibility for the 2026 event.",
        "Later that year, Jenkins set out the concept of Games being shared between multiple host cities or towns.",
        "Jenkins said he was \"particularly proud\" of having the opportunity to help development in sport \"and especially Para inclusion\".",
        "He also all his \"Commonwealth Games Association colleagues and friends for their support\".",
        "Commonwealth Sport chief executive Katie Sadleir confirmed Ugandan lawyer and sports administrator Dr Donald Rukare as interim Commonwealth Sport president with a new permanent role holder to be elected at its next general assembly in November 2025.",
        "Rukare said: \"We have come through a particularly challenging period in our Games history, and we are now building momentum towards an outstanding Commonwealth Games in Glasgow in 2026.\""
      ]
    },
    {
      "url": "https://www.bbc.com/sport/olympics/articles/ckgd4ddv25go",
      "main_category": "sport",
      "detailed_category": "commonwealth-games",
      "topic": "Kenny named youngest Commonwealth Games England president",
      "content": [
        "Track cycling great Dame Laura Kenny has been appointed Commonwealth Games England (CGE) president.At 32, she is the youngest president in the organisation's history and third consecutive woman to hold the role after Dame Kelly Holmes and Dame Denise Lewis.Kenny is Britain's most successful female Olympian, winning five golds and a silver, in addition to seven world titles and 14 European golds.She competed at three Commonwealth Games, winning gold at Glasgow 2014, and gold and bronze at Birmingham 2022 - the last medals before she retired in March 2024.CGE says Kenny will be a \"key ambassador\"  in the build-up to the next Games in Glasgow in 2026, while its chair John Steele adds the former cyclist will \"play a crucial role in helping us protect the future\" of the Commonwealth movement.Glasgow will host a scaled-down version of the multi-sport event, which was due to be held in Victoria, but the Australian state withdrew due to rising costs.\"I love the unique feel of the event and I'm thrilled to work with and support England's athletes as their prepare for Glasgow and future Commonwealth Youth Games too,\" said mother-of-two Kenny.\"I have devoted my life to cycling and while that sport will always be my passion, it is great to have the opportunity to pass on some of my experience to athletes from a wider range of sports.\"Steele added: \"Her passion for the Games is clear and her insights will be invaluable. She is one of our nation's greatest athletes and that experience at the very highest level of sport will inspire the next generation of Team England and assist the CGE in supporting them.\"She brings invaluable experience to our senior leadership team as we look to the future with renewed confidence.\"March is Commonwealth Day and marks 500 days to go until the opening ceremony of the Glasgow Games.",
        "Kenny competed at three Commonwealth Games, winning two golds and a bronze",
        "Track cycling great Dame Laura Kenny has been appointed Commonwealth Games England (CGE) president.",
        "At 32, she is the youngest president in the organisation's history and third consecutive woman to hold the role after Dame Kelly Holmes and Dame Denise Lewis.",
        "Kenny is Britain's most successful female Olympian, winning five golds and a silver, in addition to seven world titles and 14 European golds.",
        "She competed at three Commonwealth Games, winning gold at Glasgow 2014, and gold and bronze at Birmingham 2022 - the last medals before she retired in March 2024.",
        "CGE says Kenny will be a \"key ambassador\"  in the build-up to the next Games in Glasgow in 2026, while its chair John Steele adds the former cyclist will \"play a crucial role in helping us protect the future\" of the Commonwealth movement.",
        "Glasgow will host a scaled-down version of the multi-sport event, which was due to be held in Victoria, but the Australian state withdrew due to rising costs.",
        "\"I love the unique feel of the event and I'm thrilled to work with and support England's athletes as their prepare for Glasgow and future Commonwealth Youth Games too,\" said mother-of-two Kenny.",
        "\"I have devoted my life to cycling and while that sport will always be my passion, it is great to have the opportunity to pass on some of my experience to athletes from a wider range of sports.\"",
        "Steele added: \"Her passion for the Games is clear and her insights will be invaluable. She is one of our nation's greatest athletes and that experience at the very highest level of sport will inspire the next generation of Team England and assist the CGE in supporting them.",
        "\"She brings invaluable experience to our senior leadership team as we look to the future with renewed confidence.\"",
        "March is Commonwealth Day and marks 500 days to go until the opening ceremony of the Glasgow Games."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/articles/c20g84g2rz1o",
      "main_category": "sport",
      "detailed_category": "commonwealth-games",
      "topic": "Mile races will be among more than 200 Glasgow 2026 golds",
      "content": [
        "More than 200 gold medals will be contested at the scaled-back Glasgow 2026 Commonwealth Games.Swimming, track cycling and Para sports will each boast more medallists than in any of the previous 22 iterations of the Games.And athletics will have two new events - the mixed 4x400m relay and the Commonwealth Mile, which replaces the 1500m.Para sports will be fully integrated across six of the 10 disciplines, with a Games record of 47 medal events in total.",
        "The 10-sport Games programme will based at four venues within an eight-mile corridor of the city and be held across 10 days from 23 July to 2 August.While the overall number of sports has halved from 20 in Birmingham in 2022 to combat rising hosting costs and time demands, the schedule remains intense.A total of 26 cycling golds will be fought for at the Sir Chris Hoy Velodrome, with eight of those in Para-track cycling. That is double the amount on offer three years ago.And 56 will be on offer at Tollcross International Swimming Centre, with the men's 800m and women's 1500m freestyle races included for the first time.Omitting the 1500m - in which Scotland's Josh Kerr and Laura Muir are Olympic medallists - is a surprise move.It has been replaced by an event last run in 1966.Organisers say the Commonwealth Mile - the equivalent of 1609m - is a tribute to 'The Miracle Mile' run at the 1954 staging in Vancouver.On that occasion, England's Roger Bannister and Australian John Landy competed two months after the former became the first athlete to run a sub-four-minute mile.\"The mile is the quintessential Commonwealth athletics event whose return I very much welcome,\" said World Athletics President Sebastian Coe, who suggested the event to Glasgow organisers.\"From 1930 through to 1966, the mile was the blue-riband event of each Games and the magic of the mile continues to resonate.\"A ticket to watch its Commonwealth final will be one of the must-have seats in Glasgow next year.\"",
        "Glasgow Commonwealth Games 2026 logo",
        "More than 200 gold medals will be contested at the scaled-back Glasgow 2026 Commonwealth Games.",
        "Swimming, track cycling and Para sports will each boast more medallists than in any of the previous 22 iterations of the Games.",
        "And athletics will have two new events - the mixed 4x400m relay and the Commonwealth Mile, which replaces the 1500m.",
        "Para sports will be fully integrated across six of the 10 disciplines, with a Games record of 47 medal events in total.",
        "'Big names hugely positive about Commonwealth Games'",
        "Will Glasgow be last leg or clever rebirth for Commonwealths?",
        "The 10-sport Games programme will based at four venues within an eight-mile corridor of the city and be held across 10 days from 23 July to 2 August.",
        "While the overall number of sports has halved from 20 in Birmingham in 2022 to combat rising hosting costs and time demands, the schedule remains intense.",
        "A total of 26 cycling golds will be fought for at the Sir Chris Hoy Velodrome, with eight of those in Para-track cycling. That is double the amount on offer three years ago.",
        "And 56 will be on offer at Tollcross International Swimming Centre, with the men's 800m and women's 1500m freestyle races included for the first time.",
        "Omitting the 1500m - in which Scotland's Josh Kerr and Laura Muir are Olympic medallists - is a surprise move.",
        "It has been replaced by an event last run in 1966.",
        "Organisers say the Commonwealth Mile - the equivalent of 1609m - is a tribute to 'The Miracle Mile' run at the 1954 staging in Vancouver.",
        "On that occasion, England's Roger Bannister and Australian John Landy competed two months after the former became the first athlete to run a sub-four-minute mile.",
        "\"The mile is the quintessential Commonwealth athletics event whose return I very much welcome,\" said World Athletics President Sebastian Coe, who suggested the event to Glasgow organisers.",
        "\"From 1930 through to 1966, the mile was the blue-riband event of each Games and the magic of the mile continues to resonate.",
        "\"A ticket to watch its Commonwealth final will be one of the must-have seats in Glasgow next year.\""
      ]
    },
    {
      "url": "https://www.bbc.com/sport/articles/c8787dnj74vo",
      "main_category": "sport",
      "detailed_category": "commonwealth-games",
      "topic": "'Big names hugely positive about Commonwealth Games'",
      "content": [
        "The man charged with delivering Glasgow 2026 says the city will host a \"spectacular\" Commonwealth Games and that key athletes have already been \"hugely positive\" about competing.Phil Batty was director of Ceremonies, Culture and Queen's Baton Relay for the Birmingham Games three years ago and is now chief executive officer on the management team organising the event.Buy-in from high-profile athletes such as Olympic gold medallists Keely Hodgkinson and Duncan Scott as well as silver medallist Josh Kerr will be pivotal to the success of the Games - and Batty says things are off to a promising start in that regard.\"We've had a really warm reaction from athletes looking forward to competing,\" he tells BBC Scotland Sport.\"It's a great opportunity in the global calendar of sporting events. For those athletes considering competing in 2026, we're looking forward to welcoming you here. \"We've got an amazing sport programme and Para-sport programme and there's an amazing opportunity to put your competition forward on that global stage.  \"The reaction so far has been hugely positive and, as we lock in the daily competition schedule and the medal programme, we're looking forward to being able to make more firm plans about who will be here in 2026 to compete.\"The Games will, however, be battling for the attention of top athletes in a fairly crowded calendar, with the European Championships also scheduled for the end of July 2026.   It all makes for a hectic lead-in for the Glasgow 2026 executive team Batty heads, with little margin for error given the 'year to go' marker is a mere six months away.   Batty is however supremely confident the city, venues and volunteers will be ready to deliver a memorable event, 12 years after the city first hosted the Commonwealth Games.",
        "\"2026 is definitely a game-changing moment for the Commonwealth Sport movement,\" he adds.\"We've had such successful Games in previous years – in Birmingham, on the Gold Coast, in Glasgow.  \"I think people will be looking at Glasgow 2026 and seeing what happens here, and Scotland's contribution to the future of the movement as a really defining moment in the history of the Commonwealth Games.\"Had Glasgow not stepped in, there would be no Commonwealth Games next year after Victoria pulled out as host over spiralling costs.     If the movement is to survive as a concept, this scaled-down version of previous incarnations is likely to be a blueprint for the survival of the movement, which has its centenary year in 2030.\"I feel Glasgow's done a really important job in re-setting the Games for future host cities in 2030, 2034 and 2038,\" says Batty, who is involved in a world-leading drone light show business with expertise in staging global shows and events. \"This is a bridge to those new models of delivering the Games. There's no better place in the Commonwealth than Glasgow to be able to do that. \"We've got the expertise, we've got the venues, we've got the talent. I'm excited about how this is really going to take the Commonwealth sport movement forward. I see a really positive future for the Commonwealth Games. \"He is just days into his new role, but Batty already has a firm idea of what 'success' for the Games looks like.\"A really successful Games is sold-out venues, amazing sport, world-class cultural programming and a real sense of celebration in the city. I'm confident Glasgow will deliver a spectacular Games in 2026.\"",
        "Batty believes Glasgow has played an important role in re-setting the Games for future host cities",
        "The man charged with delivering Glasgow 2026 says the city will host a \"spectacular\" Commonwealth Games and that key athletes have already been \"hugely positive\" about competing.",
        "Phil Batty was director of Ceremonies, Culture and Queen's Baton Relay for the Birmingham Games three years ago and is now chief executive officer on the management team organising the event.",
        "Buy-in from high-profile athletes such as Olympic gold medallists Keely Hodgkinson and Duncan Scott as well as silver medallist Josh Kerr will be pivotal to the success of the Games - and Batty says things are off to a promising start in that regard.",
        "\"We've had a really warm reaction from athletes looking forward to competing,\" he tells BBC Scotland Sport.",
        "\"It's a great opportunity in the global calendar of sporting events. For those athletes considering competing in 2026, we're looking forward to welcoming you here.",
        "\"We've got an amazing sport programme and Para-sport programme and there's an amazing opportunity to put your competition forward on that global stage.",
        "\"The reaction so far has been hugely positive and, as we lock in the daily competition schedule and the medal programme, we're looking forward to being able to make more firm plans about who will be here in 2026 to compete.\"",
        "The Games will, however, be battling for the attention of top athletes in a fairly crowded calendar, with the European Championships also scheduled for the end of July 2026.",
        "It all makes for a hectic lead-in for the Glasgow 2026 executive team Batty heads, with little margin for error given the 'year to go' marker is a mere six months away.",
        "Batty is however supremely confident the city, venues and volunteers will be ready to deliver a memorable event, 12 years after the city first hosted the Commonwealth Games.",
        "We have to keep Commonwealth Games going - Kenny",
        "Will Glasgow be last leg or clever rebirth for Commonwealths?",
        "Scotland agrees to host Commonwealth Games in 2026",
        "\"2026 is definitely a game-changing moment for the Commonwealth Sport movement,\" he adds.",
        "\"We've had such successful Games in previous years – in Birmingham, on the Gold Coast, in Glasgow.",
        "\"I think people will be looking at Glasgow 2026 and seeing what happens here, and Scotland's contribution to the future of the movement as a really defining moment in the history of the Commonwealth Games.\"",
        "Had Glasgow not stepped in, there would be no Commonwealth Games next year after Victoria pulled out as host over spiralling costs.",
        "If the movement is to survive as a concept, this scaled-down version of previous incarnations is likely to be a blueprint for the survival of the movement, which has its centenary year in 2030.",
        "\"I feel Glasgow's done a really important job in re-setting the Games for future host cities in 2030, 2034 and 2038,\" says Batty, who is involved in a world-leading drone light show business with expertise in staging global shows and events.",
        "\"This is a bridge to those new models of delivering the Games. There's no better place in the Commonwealth than Glasgow to be able to do that.",
        "\"We've got the expertise, we've got the venues, we've got the talent. I'm excited about how this is really going to take the Commonwealth sport movement forward. I see a really positive future for the Commonwealth Games. \"",
        "He is just days into his new role, but Batty already has a firm idea of what 'success' for the Games looks like.",
        "\"A really successful Games is sold-out venues, amazing sport, world-class cultural programming and a real sense of celebration in the city. I'm confident Glasgow will deliver a spectacular Games in 2026.\"",
        "Glasgow 2026 executive team: L-R Jade Gallagher (chief operating officer, Phil Batty (CEO), Faye Shaw (corporate services), Martin Fitchie, Louisa Mahon (chief marketing and communications officer)"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/articles/ce3lp664701o",
      "main_category": "sport",
      "detailed_category": "commonwealth-games",
      "topic": "Multiple host cities possible for future Commonwealth Games",
      "content": [
        "Multiple host cities and indoor ceremonies could become a feature of a \"more affordable and more attractive\" Commonwealth Games in future.The Commonwealth Games Federation (CGF) president, Chris Jenkins, believes the new streamlined model taken on by Glasgow in 2026 will ensure the Games live on well past its 100-year anniversary in 2030.At the end of his first year as president, in a wide-ranging interview with BBC Sport Wales, Jenkins said:The Commonwealth Games model has been changed for good and he hopes it will encourage more hosts going forward.Future hosts are being told not to build or redevelop venues - but co-host with other cities or countries who have existing facilities.Athletes will stay in hotels and ceremonies could take place indoors at future Games.Jenkins is about to invite bids to host the next three Games to give nations, sports and athletes certainty over the event's future.The Games could become bigger again after Glasgow with up to 17 sports, rather than the 10 selected for 2026.",
        "When Chris Jenkins became president of the CGF in November 2023, their showpiece event was in something of an existential crisis.Australian state Victoria had pulled out of hosting the 2026 Games and Canadian province Alberta had withdrawn its interest for 2030.But after a year in office, Jenkins believes the Games remain an integral part of both the Commonwealth and wider sporting calendar.Glasgow has stepped in to put on a streamlined but \"exciting\" Games in 2026 and Jenkins is about to invite expressions of interest from nations to host the next three events from 2030 to 2038.\"We've changed the Games,\" he told BBC Sport Wales. \"So it's much more affordable, much more attractive.\"We're not the Olympics. We are not going to be the Olympics.\"We've learned over the last couple of years, we've analysed it, where we sit within the environment and we're really comfortable.\"We've reset and reframed the Games to exactly the sweet spot of where we should be.\"",
        "After going to the 1984 Games as a rowing cox for Wales and then eventually becoming chief executive of Commonwealth Games Wales for 16 years, Jenkins became so passionate about the Games' future he even wrote a PhD on how to make the Games more sustainable.He is now bringing that research into his work as the CGF's president - and he is confident of the progress he has made.Jenkins' first big task was securing a host for 2026. It came in the form of Glasgow, who will put on an event of ten sports over four venues.No road events will take place, such as the marathon or cycling road events. Existing accommodation - including some hotels - will be used to house the athletes.\"I think Glasgow's the start,\" said Jenkins. \"Glasgow's showing how you can co-create.\"We've taken 50-plus percent of the costs out. It's going to be a very, very compact Games.\"But also I think it is going to showcase the first phase of the reset. Using existing accommodation, existing venues, using indoor facilities really well - perhaps for ceremonies.\"So that's one aspect of what I find exciting about Glasgow.\"But while Glasgow is being praised for offering a \"compact\" Games, in future they could be anything but.Games spread over multiple cities and even countries are possible going forward.For Jenkins, one of the main ways to make the event cheaper is not to build anything. He wants prospective hosts to first look at what they could put on themselves and then ask a neighbouring city - or nation - to pick up other events if they have existing facilities.It could open the possibility of the Games coming back to Wales for the first time since Cardiff hosted the then-British Empire Games in 1958.\"Some cities can host a whole Games,\" Jenkins maintained.\"Or a country could host it. I don't want to name a country but there are several I can think of where it'd be better spread over a country. If we hosted in Wales it probably would be a few cities or a few towns in Wales.\"But also, taking it a step further, there are some countries where they have some facilities and their neighbour has the other. What we'd say is: don't build, use existing venues, use existing accommodation. That could be co-hosting.\"So that does change the model quite dramatically and that's got a lot of enthusiasm among our members.\"",
        "The smaller Games in Glasgow will be much closer to the model going forward, but Jenkins believes it will not always be so streamlined.His aim is around 15 to 17 sports at future Games. That's compared to the 19 at Birmingham 2022 and the 22 Victoria had been planning for 2026.So he is encouraging sports excluded from 2026, such as hockey, table tennis and triathlon, not to give up hope.Glasgow received more than £100m from the CGF's compensation from Victoria to help it stage the Games with no cost to the taxpayer.But Jenkins confirmed the CGF would not have any money available to offer future hosts.Expressions of interest for the next three Games open early in 2025.He added: \"We are basically saying, 'look, we are not the Olympics, let's set our standards at World Championships level'.\"We've spoken to sports, our members, so we're very confident that we've analysed the environment and we've got the Games, our product, right. So we can go out and start marketing it to potential hosts with a lot of confidence that we're in the right place.\"After struggles to find hosts for the past two Games - and with every event being held in either the UK or Australia since Delhi in 2010 - this feels like make or break for the Commonwealth Games.But Jenkins is convinced the event still has plenty of life in it yet.",
        "Grand ceremonies in redeveloped stadiums could be a thing of the past at the Commonwealth Games",
        "Multiple host cities and indoor ceremonies could become a feature of a \"more affordable and more attractive\" Commonwealth Games in future.",
        "The Commonwealth Games Federation (CGF) president, Chris Jenkins, believes the new streamlined model taken on by Glasgow in 2026 will ensure the Games live on well past its 100-year anniversary in 2030.",
        "At the end of his first year as president, in a wide-ranging interview with BBC Sport Wales, Jenkins said:",
        "The Commonwealth Games model has been changed for good and he hopes it will encourage more hosts going forward.",
        "Future hosts are being told not to build or redevelop venues - but co-host with other cities or countries who have existing facilities.",
        "Athletes will stay in hotels and ceremonies could take place indoors at future Games.",
        "Jenkins is about to invite bids to host the next three Games to give nations, sports and athletes certainty over the event's future.",
        "The Games could become bigger again after Glasgow with up to 17 sports, rather than the 10 selected for 2026.",
        "This video can not be played",
        "Commonwealth Games still 'vitally important' - Jenkins",
        "When Chris Jenkins became president of the CGF in November 2023, their showpiece event was in something of an existential crisis.",
        "Australian state Victoria had pulled out of hosting the 2026 Games and Canadian province Alberta had withdrawn its interest for 2030.",
        "But after a year in office, Jenkins believes the Games remain an integral part of both the Commonwealth and wider sporting calendar.",
        "Glasgow has stepped in to put on a streamlined but \"exciting\" Games in 2026 and Jenkins is about to invite expressions of interest from nations to host the next three events from 2030 to 2038.",
        "\"We've changed the Games,\" he told BBC Sport Wales. \"So it's much more affordable, much more attractive.",
        "\"We're not the Olympics. We are not going to be the Olympics.",
        "\"We've learned over the last couple of years, we've analysed it, where we sit within the environment and we're really comfortable.",
        "\"We've reset and reframed the Games to exactly the sweet spot of where we should be.\"",
        "Will Glasgow be last leg or clever rebirth for Commonwealths?",
        "We have to keep Commonwealth Games going - Kenny",
        "After going to the 1984 Games as a rowing cox for Wales and then eventually becoming chief executive of Commonwealth Games Wales for 16 years, Jenkins became so passionate about the Games' future he even wrote a PhD on how to make the Games more sustainable.",
        "He is now bringing that research into his work as the CGF's president - and he is confident of the progress he has made.",
        "Jenkins' first big task was securing a host for 2026. It came in the form of Glasgow, who will put on an event of ten sports over four venues.",
        "No road events will take place, such as the marathon or cycling road events. Existing accommodation - including some hotels - will be used to house the athletes.",
        "\"I think Glasgow's the start,\" said Jenkins. \"Glasgow's showing how you can co-create.",
        "\"We've taken 50-plus percent of the costs out. It's going to be a very, very compact Games.",
        "\"But also I think it is going to showcase the first phase of the reset. Using existing accommodation, existing venues, using indoor facilities really well - perhaps for ceremonies.",
        "\"So that's one aspect of what I find exciting about Glasgow.\"",
        "But while Glasgow is being praised for offering a \"compact\" Games, in future they could be anything but.",
        "Games spread over multiple cities and even countries are possible going forward.",
        "For Jenkins, one of the main ways to make the event cheaper is not to build anything. He wants prospective hosts to first look at what they could put on themselves and then ask a neighbouring city - or nation - to pick up other events if they have existing facilities.",
        "It could open the possibility of the Games coming back to Wales for the first time since Cardiff hosted the then-British Empire Games in 1958.",
        "\"Some cities can host a whole Games,\" Jenkins maintained.",
        "\"Or a country could host it. I don't want to name a country but there are several I can think of where it'd be better spread over a country. If we hosted in Wales it probably would be a few cities or a few towns in Wales.",
        "\"But also, taking it a step further, there are some countries where they have some facilities and their neighbour has the other. What we'd say is: don't build, use existing venues, use existing accommodation. That could be co-hosting.",
        "\"So that does change the model quite dramatically and that's got a lot of enthusiasm among our members.\"",
        "The Commonwealth Games offer an almost unique opportunity to represent your home nation, rather than Great Britain",
        "The smaller Games in Glasgow will be much closer to the model going forward, but Jenkins believes it will not always be so streamlined.",
        "His aim is around 15 to 17 sports at future Games. That's compared to the 19 at Birmingham 2022 and the 22 Victoria had been planning for 2026.",
        "So he is encouraging sports excluded from 2026, such as hockey, table tennis and triathlon, not to give up hope.",
        "Glasgow received more than £100m from the CGF's compensation from Victoria to help it stage the Games with no cost to the taxpayer.",
        "But Jenkins confirmed the CGF would not have any money available to offer future hosts.",
        "Expressions of interest for the next three Games open early in 2025.",
        "He added: \"We are basically saying, 'look, we are not the Olympics, let's set our standards at World Championships level'.",
        "\"We've spoken to sports, our members, so we're very confident that we've analysed the environment and we've got the Games, our product, right. So we can go out and start marketing it to potential hosts with a lot of confidence that we're in the right place.\"",
        "After struggles to find hosts for the past two Games - and with every event being held in either the UK or Australia since Delhi in 2010 - this feels like make or break for the Commonwealth Games.",
        "But Jenkins is convinced the event still has plenty of life in it yet."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/articles/c8j7y09j49no",
      "main_category": "sport",
      "detailed_category": "commonwealth-games",
      "topic": "Will Glasgow be last leg or clever rebirth for Commonwealths?",
      "content": [
        "The last time Glasgow was in contention to stage the Commonwealth Games, the bid team called on the services of 007.Back in 2007, former James Bond actor Sir Sean Connery pulled out his exploding pen and wrote personal letters to each of the Commonwealth Games Federation (CGF) delegates to explain why they should pick Scotland's largest city over Abuja, Nigeria.He was joined by another knight of the realm - Sir Steve Redgrave, the first British athlete to win five Olympic golds - in backing Glasgow's bid.In total, more than one-and-a-half million people signed up to commit their support to hosting the 2014 Games.Securing the 2026 Games has not required such a high-profile campaign.Glasgow has not had to turn on the charm. Instead, it has had to convince itself of the merits of being host.The 2026 edition was supposed to be staged in Victoria. At Birmingham 2022's closing ceremony, four indigenous elders from the Australian state were handed the flag as the next hosts.Within a year, they had handed it back.The budget for the Games had rocketed. State Premier Daniel Andrews said that, for all the loss of face, he did not have to think long about cancelling on the CGF.Describing the Games as \"all cost and no benefit\", Andrews said \"I've made a lot of very difficult decisions in this job - this is not one of them\".",
        "So, why does Glasgow think it is an event still worth having?Firstly, they believe the numbers add up. Glasgow's calculations are that a combination of CGF funds, a financial sweetener from Victoria and private investment will avoid the use of any UK public money.The 2026 Games programme will also be slimmed down to lighten the load on the bottom line.The plan is to stage as few as 10 sports, compared to the 18-strong schedule in 2014, and to use existing venues rather than build from scratch.The way Birmingham projected a feel-good face onto England's second city shows the success the Games can be.However, the city's subsequent financial struggles, with its council effectively declaring bankruptcy in September 2023, also underlines the stakes involved.Clare Hartley is the co-founder of Arc Event Consultancy and has worked with multi-sport event organisers, including Manchester 2006 and Birmingham 2022, for nearly 25 years,\"It is just very hard to put these multi-sport events on,\" she says.\"They are very expensive, they require a lot of different venues and logistically they are very challenging.\"Multi-sport events are huge projects that take up so much money and time and more countries and cities are weighing up more carefully whether it is worth hosting them.\"The sporting calendar is far busier than it was in 1930, when the first Commonwealth Games took place, offering star athletes lucrative alternatives but also giving potential hosts the chance to put on events that better suit local tastes and budgets.The Commonwealth Games - which has necessary infrastructure and a variety of venues comparable to an Olympics, without the bumper broadcasting receipts or global sponsorship deals to offset them - will always be a tricky proposition.\"You look at Singapore,\" says Hartley.\"It is a sporting nation, part of the Commonwealth, a prosperous nation, and they are hosting the World Aquatics Championships next year, rather than bidding for the Commonwealths.\"There are so many sporting opportunities out there, nations can pick and choose a little bit and the Commonwealth Games has not been of as much interest.\"",
        "There is understandable concern about a reduced roster of sports on show.Tamsin Greenway, who won netball  bronze with England at Delhi 2010, said the Commonwealths remains \"absolutely special\" for her sport.\"It's our version of the Olympics,\" she said. \"We're not in the Olympic Games and it gives an opportunity to shine as a stand alone sport which is incredible.\"But Hartley believes that paring back the programme of sports for 2026 could give organisers the chance to define the Commonwealth Game more clearly, as well as reducing costs.\"It could be a chance for the Commonwealth Games to really have a think about it,\" she says.\"They could focus on sports where the Commonwealth Games is still the highest level of competition, such as netball or, certainly before it gets it shot at the Olympics in 2028, squash.\"Could it be positioned it as a junior-level event in things like athletics and swimming and a showcase for those other sports? There may be a niche for it there.\"But there may not be.",
        "Glasgow would be just the latest stop-gap host. Birmingham staged the 2022 Games only after a shortage of funds forced original host Durban to pull out.Alberta, the Canadian province that was pencilled in for 2030, has also ditched its plans to put on the Games.Hosting of the Commonwealth Games is now caught in a presumably unsustainable shuttle between Australia and Great Britain, with Glasgow 2026 making it six of the last seven events staged in one of the two nations.However it rejigs itself in the future, the Games also has an inescapable past. Originally launched as the British Empire Games, it is rooted in an era very remote from modern sensibilities.It may be that ultimately too much competition and too little relevance will see time run out on the Commonwealth Games.\"I think it is in danger of coming to the end of its cycle,\" says Hartley.\"The European Games is still quite new, it hasn't quite found its footing yet, but it could get stronger.\"It has the weight of a lot of international federations and links into the European Broadcasting Union [a continental organisation of public service media organisations] and the Olympic Games.\"You look at the success of the Pan American and Pan Asian games – they are huge – and it could be that they overtakes the Commonwealth Games.\"If the race is run on a near century-long Commonwealth Games history, it will leave a gap behind.A pinnacle will be missing in some sports' skyline. A chance to represent their home nation will be gone for British athletes. A valuable platform for disability sport will have disappeared.For now, though, it continues.When Glasgow bid for the 2014 Games, its pitch included a promise to care for the Commonwealths \"not just for 11 days or even for four years but... for generations to come\".The authors could not have known what a difficult task that would be. Or what a central role their city would end up playing in it.",
        "Usain Bolt brought superstar charisma to Glasgow in 2014 - but the 2026 Games may struggle to draw such major figures in sport",
        "The last time Glasgow was in contention to stage the Commonwealth Games, the bid team called on the services of 007.",
        "Back in 2007, former James Bond actor Sir Sean Connery pulled out his exploding pen and wrote personal letters to each of the Commonwealth Games Federation (CGF) delegates to explain why they should pick Scotland's largest city over Abuja, Nigeria.",
        "He was joined by another knight of the realm - Sir Steve Redgrave, the first British athlete to win five Olympic golds - in backing Glasgow's bid.",
        "In total, more than one-and-a-half million people signed up to commit their support to hosting the 2014 Games.",
        "Securing the 2026 Games has not required such a high-profile campaign.",
        "Glasgow has not had to turn on the charm. Instead, it has had to convince itself of the merits of being host.",
        "The 2026 edition was supposed to be staged in Victoria. At Birmingham 2022's closing ceremony, four indigenous elders from the Australian state were handed the flag as the next hosts.",
        "Within a year, they had handed it back.",
        "The budget for the Games had rocketed. State Premier Daniel Andrews said that, for all the loss of face, he did not have to think long about cancelling on the CGF.",
        "Describing the Games as \"all cost and no benefit\", Andrews said \"I've made a lot of very difficult decisions in this job - this is not one of them\".",
        "Scotland agrees to host Commonwealth Games in 2026",
        "McClenaghan pleased Glasgow will host Commonwealth Games",
        "What do athletes think about Glasgow 2026?",
        "Governor of Victoria Linda Deesau accepts the Commonwealth Games flag during the Birmingham 2022 closing ceremony",
        "So, why does Glasgow think it is an event still worth having?",
        "Firstly, they believe the numbers add up. Glasgow's calculations are that a combination of CGF funds, a financial sweetener from Victoria and private investment will avoid the use of any UK public money.",
        "The 2026 Games programme will also be slimmed down to lighten the load on the bottom line.",
        "The plan is to stage as few as 10 sports, compared to the 18-strong schedule in 2014, and to use existing venues rather than build from scratch.",
        "The way Birmingham projected a feel-good face onto England's second city shows the success the Games can be.",
        "However, the city's subsequent financial struggles, with its council effectively declaring bankruptcy in September 2023, also underlines the stakes involved.",
        "Clare Hartley is the co-founder of Arc Event Consultancy and has worked with multi-sport event organisers, including Manchester 2006 and Birmingham 2022, for nearly 25 years,",
        "\"It is just very hard to put these multi-sport events on,\" she says.",
        "\"They are very expensive, they require a lot of different venues and logistically they are very challenging.",
        "\"Multi-sport events are huge projects that take up so much money and time and more countries and cities are weighing up more carefully whether it is worth hosting them.\"",
        "The sporting calendar is far busier than it was in 1930, when the first Commonwealth Games took place, offering star athletes lucrative alternatives but also giving potential hosts the chance to put on events that better suit local tastes and budgets.",
        "The Commonwealth Games - which has necessary infrastructure and a variety of venues comparable to an Olympics, without the bumper broadcasting receipts or global sponsorship deals to offset them - will always be a tricky proposition.",
        "\"You look at Singapore,\" says Hartley.",
        "\"It is a sporting nation, part of the Commonwealth, a prosperous nation, and they are hosting the World Aquatics Championships next year, rather than bidding for the Commonwealths.",
        "\"There are so many sporting opportunities out there, nations can pick and choose a little bit and the Commonwealth Games has not been of as much interest.\"",
        "England's netball victory over favourites Australia was one of the moments of the 2018 Games on the Gold Coast",
        "There is understandable concern about a reduced roster of sports on show.",
        "Tamsin Greenway, who won netball  bronze with England at Delhi 2010, said the Commonwealths remains \"absolutely special\" for her sport.",
        "\"It's our version of the Olympics,\" she said.",
        "\"We're not in the Olympic Games and it gives an opportunity to shine as a stand alone sport which is incredible.\"",
        "But Hartley believes that paring back the programme of sports for 2026 could give organisers the chance to define the Commonwealth Game more clearly, as well as reducing costs.",
        "\"It could be a chance for the Commonwealth Games to really have a think about it,\" she says.",
        "\"They could focus on sports where the Commonwealth Games is still the highest level of competition, such as netball or, certainly before it gets it shot at the Olympics in 2028, squash.",
        "\"Could it be positioned it as a junior-level event in things like athletics and swimming and a showcase for those other sports? There may be a niche for it there.\"",
        "But there may not be.",
        "Glasgow would be just the latest stop-gap host. Birmingham staged the 2022 Games only after a shortage of funds forced original host Durban to pull out.",
        "Alberta, the Canadian province that was pencilled in for 2030, has also ditched its plans to put on the Games.",
        "Hosting of the Commonwealth Games is now caught in a presumably unsustainable shuttle between Australia and Great Britain, with Glasgow 2026 making it six of the last seven events staged in one of the two nations.",
        "However it rejigs itself in the future, the Games also has an inescapable past.",
        "Originally launched as the British Empire Games, it is rooted in an era very remote from modern sensibilities.",
        "It may be that ultimately too much competition and too little relevance will see time run out on the Commonwealth Games.",
        "\"I think it is in danger of coming to the end of its cycle,\" says Hartley.",
        "\"The European Games is still quite new, it hasn't quite found its footing yet, but it could get stronger.",
        "\"It has the weight of a lot of international federations and links into the European Broadcasting Union [a continental organisation of public service media organisations] and the Olympic Games.",
        "\"You look at the success of the Pan American and Pan Asian games – they are huge – and it could be that they overtakes the Commonwealth Games.\"",
        "If the race is run on a near century-long Commonwealth Games history, it will leave a gap behind.",
        "A pinnacle will be missing in some sports' skyline. A chance to represent their home nation will be gone for British athletes. A valuable platform for disability sport will have disappeared.",
        "For now, though, it continues.",
        "When Glasgow bid for the 2014 Games, its pitch included a promise to care for the Commonwealths \"not just for 11 days or even for four years but... for generations to come\".",
        "The authors could not have known what a difficult task that would be. Or what a central role their city would end up playing in it."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/shooting/articles/cvgwxl73l0zo",
      "main_category": "sport",
      "detailed_category": "commonwealth-games",
      "topic": "Jersey shooters saddened by Commonwealth omission",
      "content": [
        "The head of the Jersey Pistol Association says he is disappointed shooting has not been included in the 2026 Commonwealth Games.Glasgow this week unveiled the 10 sports it will host in a slimmed-down event, having stepped in to host the Games after the Australian state of Victoria pulled out.It is the second successive Games not to include shooting - a sport in which Jersey won their most recent Commonwealth medals in 1990.\"It's very sad for us because the Commonwealth Games are the pinnacle for Jersey,\" Gregory Guida told BBC Radio Jersey.\"We do understand why, Glasgow got it in extremis because the Australians were not going to do it, and it's nice that it is still happening.\"But it is very sad that we cannot send people to shoot - we normally have six to seven people at every Commonwealth Games.\"",
        "Sports including diving, badminton, hockey, table tennis and triathlon have also failed to make the cut for 2026.It is a double blow for Jersey's shooters, who will have little international competition in the next few years.Next summer's Island Games in Orkney will not include shooting while Guida expects there to be little, if any, shooting at the games in the Faroe Islands in 2027 and Isle of Man in 2029.\"Not to have it happen is a problem,\" added Guida.\"So we're looking at other ways of gathering and probably just doing specific shooting events.\"We are talking among the islands to try and get something going.\"I know Gibraltar is very, very keen to have something happen [there] and they are well-geared for it as they have fantastic ranges.\"Jersey has done it in the past extremely well and could do it again, so we are looking at having our own competitions.\"",
        "Jersey shooter Nicola Holmes was among the island's representatives at the 2018 Commonwealth Games",
        "The head of the Jersey Pistol Association says he is disappointed shooting has not been included in the 2026 Commonwealth Games.",
        "Glasgow this week unveiled the 10 sports it will host in a slimmed-down event, having stepped in to host the Games after the Australian state of Victoria pulled out.",
        "It is the second successive Games not to include shooting - a sport in which Jersey won their most recent Commonwealth medals in 1990.",
        "\"It's very sad for us because the Commonwealth Games are the pinnacle for Jersey,\" Gregory Guida told BBC Radio Jersey.",
        "\"We do understand why, Glasgow got it in extremis because the Australians were not going to do it, and it's nice that it is still happening.",
        "\"But it is very sad that we cannot send people to shoot - we normally have six to seven people at every Commonwealth Games.\"",
        "Channel Island joy at Commonwealth Games decision",
        "Badminton and hockey miss out as  Commonwealth Games sports confirmed",
        "Sports including diving, badminton, hockey, table tennis and triathlon have also failed to make the cut for 2026.",
        "It is a double blow for Jersey's shooters, who will have little international competition in the next few years.",
        "Next summer's Island Games in Orkney will not include shooting while Guida expects there to be little, if any, shooting at the games in the Faroe Islands in 2027 and Isle of Man in 2029.",
        "\"Not to have it happen is a problem,\" added Guida.",
        "\"So we're looking at other ways of gathering and probably just doing specific shooting events.",
        "\"We are talking among the islands to try and get something going.",
        "\"I know Gibraltar is very, very keen to have something happen [there] and they are well-geared for it as they have fantastic ranges.",
        "\"Jersey has done it in the past extremely well and could do it again, so we are looking at having our own competitions.\""
      ]
    },
    {
      "url": "https://www.bbc.com/sport/cycling/articles/cly5gp15q3jo",
      "main_category": "sport",
      "detailed_category": "commonwealth-games",
      "topic": "We have to keep Commonwealth Games going - Kenny",
      "content": [
        "Dame Laura Kenny hopes that a city steps up to host the 2030 Commonwealth Games, with Glasgow to host a scaled-back 2026 edition.The Scottish city was named official host after the Australian state of Victoria withdrew due to rising costs, but a number of events may not take place at the Glasgow Games.Kenny, Great Britain's most decorated female Olympian, said that unless cities make a big effort to host the event in its entirety, the long-term future of the Commonwealth Games is at risk.\"I really hope that someone steps up and says 'we'll take the next one', because when sporting events disappear, you very rarely see them come back,\" Kenny told BBC Breakfast.\"I think we have to think about the history. The Commonwealth Games have been going for so long, it seems such a shame to just leave it and just forget about the history of the sport. \"It brings so many nations together, it's a multi-sport event and it's on a huge stage, we have to keep it going.\"The plan is to stage as few as 10 sports in Glasgow, though it is not yet clear which sports will be cut. Kenny, who won Commonwealth track cycling gold in 2014 and 2022, said there should be focus on prioritising sports that are not included at the Olympics.\"I just hope that they take into consideration non-Olympic sports, because the Commonwealths for the likes of netball are actually the only light that they really get shone on their sport,\" Kenny added.\"For me, when they think 'we'll pull this one or pull that one', [it is important] it is done in a way that is fair I guess, because the Olympics is huge and that is where a lot people will watch.\"Ultimately, the Commonwealth Games for a lot of these sports are their Olympics.\"",
        "Dame Laura Kenny is a two-time Commonwealth Games gold medal winner",
        "Dame Laura Kenny hopes that a city steps up to host the 2030 Commonwealth Games, with Glasgow to host a scaled-back 2026 edition.",
        "The Scottish city was named official host after the Australian state of Victoria withdrew due to rising costs, but a number of events may not take place at the Glasgow Games.",
        "Kenny, Great Britain's most decorated female Olympian, said that unless cities make a big effort to host the event in its entirety, the long-term future of the Commonwealth Games is at risk.",
        "\"I really hope that someone steps up and says 'we'll take the next one', because when sporting events disappear, you very rarely see them come back,\" Kenny told BBC Breakfast.",
        "\"I think we have to think about the history. The Commonwealth Games have been going for so long, it seems such a shame to just leave it and just forget about the history of the sport.",
        "\"It brings so many nations together, it's a multi-sport event and it's on a huge stage, we have to keep it going.\"",
        "The plan is to stage as few as 10 sports in Glasgow, though it is not yet clear which sports will be cut.",
        "Kenny, who won Commonwealth track cycling gold in 2014 and 2022, said there should be focus on prioritising sports that are not included at the Olympics.",
        "\"I just hope that they take into consideration non-Olympic sports, because the Commonwealths for the likes of netball are actually the only light that they really get shone on their sport,\" Kenny added.",
        "\"For me, when they think 'we'll pull this one or pull that one', [it is important] it is done in a way that is fair I guess, because the Olympics is huge and that is where a lot people will watch.",
        "\"Ultimately, the Commonwealth Games for a lot of these sports are their Olympics.\"",
        "Will Glasgow be last leg or clever rebirth for Commonwealths?"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/articles/c98ydr0300yo",
      "main_category": "sport",
      "detailed_category": "commonwealth-games",
      "topic": "Grey-Thompson 'delighted' by Glasgow 2026 Games deal",
      "content": [
        "Baroness Grey-Thompson says it is vital the 2026 Commonwealth Games were rescued following confirmation Glasgow will host the next edition of the event.The Australian state of Victoria had originally been due to host the Games but withdrew as a result of rising costs.Glasgow is set to hold a scaled-down version of the event, featuring fewer sports and athletes.Despite the fact some athletes will miss out on competing, Baroness Grey-Thompson said the format change represents the \"start of something new\".\"I think it's really important the Commonwealth Games are being kept. It gives the federation time to look at where the next can be held,\" the 11-time Paralympic gold medallist told BBC Radio Wales Breakfast.\"The big Games are looking at sustainability. They are looking at what events should and shouldn't be held there. So I think it's the start of something new and different.\"",
        "The 2026 Games will see see 10 sports take place across four venues in the city of Glasgow.The budget for the Games is expected to be about £114m.A total of 17 sports took place when Glasgow last hosted the Games in 2014, at a cost of £543m.And Gareth Davies, chair for Team Wales at Commonwealth Games Wales, believes the successful Glasgow bid represents a triumph given the finances involved to host a Games.\"Everyone's very happy with the news that came through,\" he told Dros Frecwast.\"It's a period to look at a different model now.\"Lots of ideas have been thrown in, for example, do the Games have to happen in one centre?\"There's plenty of support for the Games, but like many things in life at the moment, the problem is the money.\"",
        "This video can not be played",
        "Baroness Grey-Thompson is \"delighted\" with the Glasgow 2026 Commonwealth Games deal",
        "Baroness Grey-Thompson says it is vital the 2026 Commonwealth Games were rescued following confirmation Glasgow will host the next edition of the event.",
        "The Australian state of Victoria had originally been due to host the Games but withdrew as a result of rising costs.",
        "Glasgow is set to hold a scaled-down version of the event, featuring fewer sports and athletes.",
        "Despite the fact some athletes will miss out on competing, Baroness Grey-Thompson said the format change represents the \"start of something new\".",
        "\"I think it's really important the Commonwealth Games are being kept. It gives the federation time to look at where the next can be held,\" the 11-time Paralympic gold medallist told BBC Radio Wales Breakfast.",
        "\"The big Games are looking at sustainability. They are looking at what events should and shouldn't be held there. So I think it's the start of something new and different.\"",
        "The 2026 Games will see see 10 sports take place across four venues in the city of Glasgow.",
        "The budget for the Games is expected to be about £114m.",
        "A total of 17 sports took place when Glasgow last hosted the Games in 2014, at a cost of £543m.",
        "And Gareth Davies, chair for Team Wales at Commonwealth Games Wales, believes the successful Glasgow bid represents a triumph given the finances involved to host a Games.",
        "\"Everyone's very happy with the news that came through,\" he told Dros Frecwast.\"It's a period to look at a different model now.",
        "\"Lots of ideas have been thrown in, for example, do the Games have to happen in one centre?",
        "\"There's plenty of support for the Games, but like many things in life at the moment, the problem is the money.\""
      ]
    },
    {
      "url": "https://www.bbc.com/sport/athletics/articles/cn8jl9wq0gyo",
      "main_category": "sport",
      "detailed_category": "commonwealth-games",
      "topic": "Commonwealth Games: Why is it so special to be part of Team Scotland?",
      "content": [
        "There's the girl you know from your home town. The guy you went to university with. The fella who trains in the same gym as you every day. And your best pal and training partner is there, too.None of you are having to speak slowly, to clip your Rs, or accentuate your vowels. You understand the patter, know what sqwerr sausage is, and can fluently punctuate by swearing.It's like being among family and friends, with all the tender aggression and familiar hinterland that brings.That is the atmosphere within Team Scotland, a diverse - yet similar - collection of athletes and staff who represent the country once every four years at the Commonwealth Games, and will do so again in Glasgow in 2026.\"There's just something about being Scottish - we all just get it and that identity really resonates with us,\" says swimmer and Olympic and Commonwealth Games veteran Ross Murdoch.\"It's a completely different dynamic to Team GB. Everyone's just… it's a breath of fresh air,\" adds Olympic silver and bronze-winning cyclist Jack Carlin.\"It's warmer and more intimate,\" says Commonwealth badminton medallist Kirsty Gilmour. \"With GB, and you need to put your extrovert mask on and try to make new friends, but you just feel more at ease in Team Scotland.\"",
        "Those three athletes also compete for Britain and are at pains to make it clear that they enjoy, and even relish, doing so. But the Commonwealths are a rare chance to represent Scotland. Their country. Where they are from.For most, the divergence is not political either. Instead it is something far less tangible. A feeling. That's why explaining it isn't easy, particular for people whose sporting talents are their primary means of expression.Of the 25 or so athletes asked by BBC Scotland why it was special to represent Scotland, most immediately reached for the rarity of the opportunity.In some sports, it only happens once every four years. For competitors such as Laura Muir, who missed out on the Gold Coast Games in 2018 because of her university exams, it has been even more scarce.But there must be more to it than that? Not least because the Commonwealths lacks a little of the cachet of other events.\"Something just feels different when you're running for Scotland,\" says distance runner Eilish McColgan, who won a stunning gold medal in the Women's 10,000m in Birmingham in 2022. \"It's like I'm representing my home town - Dundee - a little bit more.\"You're around people you've known since you were wee - the athletes you've grown up with, the coaches, the support staff. And when you were young, it wasn't about running for GB. It was about running for Scotland. So it just reminds you of home.\"The feeling is rooted in childhood for Murdoch, too.\"Just putting on the Scotland kit brings me back to being a wee boy,\" he says. \"I'm from a wee estate in the Vale of Leven, and I remember watching Scotland winning medals at the 2006 Commonwealths and that seemed as big as the world could get.\"From then on, that was all I wanted to do, so for this hobby of mine to get totally out of hand and me do this three times… I can't even put that into words.\"Hammer thrower Mark Dry has - like Murdoch, Carlin, McColgan and Gilmour - been to Olympics and world championships and is \"proud\" to have represented Britain. But none of those occasions, while materially more illustrious, have made him feel \"anything like competing for Scotland does\".\"It means everything to me,\" he says. \"Other championships, you're doing it for yourself, but at the Commonwealths, you're doing it for Scotland.\"Boxer Reese Lynch, who made his Games debut in Birmingham, is of a similar mind. \"Even when I'm competing for GB, I'm still representing Scotland,\" he says. \"It's where I'm from and it's who I am.\"",
        "The identity is one aspect of it, then. But the environment plays a part, too.Being inside the Team GB machine at an Olympics can be a stifling, lonely and isolated experience. It is a very serious business, where everyone has \"their game-face on\", according to Gilmour.Given these are athletes at the very pinnacle of their sport, that is perhaps how it should be. But it is also telling how many athletes will mention the atmosphere inside the Team Scotland camp as being something they crave every four years.\"For me, it's really good fun,\" says swimmer Duncan Scott.That's not to say that the business of winning medals is taken lightly, though. \"It's more of a fun rivalry,\" says one of Scotland's most decorated Games athletes, Para-cyclist Neil Fachie.\"You've got your British team-mates there, and the Australians seem to get up for it a bit more, but the stress level is slightly lower, and the fun's a bit higher.\"\"There's no pressure,\" adds wheelchair racer Sammi Kinghorn, who won five medals including one gold at the recent Paralympics. \"There is such a spread of athletes and abilities and we are all so grateful to be there. If you win a medal, you come back to the village and everyone is so excited for you.\"\"It's what I'd call hype vibes,\" says Olympic shooter Seonaid McIntosh. \"Because it's a smaller team than GB, we all know each other and want everyone else to have success. That's a really lovely culture and environment to be in.\"",
        "Perhaps the greatest testimony to that atmosphere is not from those who were born and raised in Scotland, but rather from those who choose to identify as Scots.Take wrestler Christelle Lemofack. She competed for Cameroon at Glasgow 2014, but enjoyed the experience so much that she never went home. In Birmingham, she represented Scotland.\"I've made a life here and Scotland gave me that opportunity, so I feel like I have to give something back,\" she said before the last Games. \"I've dreamed about this and now it's come true. I have to fight for my new flag.\"Lemofack might not have the ginger hair that Olympic judoka Sarah Adlington boasts as part of her credentials to compete for Scotland, but elements of their stories are the same.\"You can't choose where you were born, but you can choose where you live and I've chosen to live my whole adult life in Scotland,\" says the 2014 Commonwealth gold medallist. \"I feel Scottish, my coaches and team-mates are Scottish, and I wouldn't want to compete for anyone else.\"This article was originally published on 27 July 2022.",
        "Eilish McColgan won one of 13 gold medals for Scotland at the 2022 Commonwealth Games in Birmingham",
        "There's the girl you know from your home town. The guy you went to university with. The fella who trains in the same gym as you every day. And your best pal and training partner is there, too.",
        "None of you are having to speak slowly, to clip your Rs, or accentuate your vowels. You understand the patter, know what sqwerr sausage is, and can fluently punctuate by swearing.",
        "It's like being among family and friends, with all the tender aggression and familiar hinterland that brings.",
        "That is the atmosphere within Team Scotland, a diverse - yet similar - collection of athletes and staff who represent the country once every four years at the Commonwealth Games, and will do so again in Glasgow in 2026.",
        "\"There's just something about being Scottish - we all just get it and that identity really resonates with us,\" says swimmer and Olympic and Commonwealth Games veteran Ross Murdoch.",
        "\"It's a completely different dynamic to Team GB. Everyone's just… it's a breath of fresh air,\" adds Olympic silver and bronze-winning cyclist Jack Carlin.",
        "\"It's warmer and more intimate,\" says Commonwealth badminton medallist Kirsty Gilmour. \"With GB, and you need to put your extrovert mask on and try to make new friends, but you just feel more at ease in Team Scotland.\"",
        "Scotland agrees to host Commonwealth Games in 2026",
        "What do athletes think about Glasgow 2026?",
        "Those three athletes also compete for Britain and are at pains to make it clear that they enjoy, and even relish, doing so. But the Commonwealths are a rare chance to represent Scotland. Their country. Where they are from.",
        "For most, the divergence is not political either. Instead it is something far less tangible. A feeling. That's why explaining it isn't easy, particular for people whose sporting talents are their primary means of expression.",
        "Of the 25 or so athletes asked by BBC Scotland why it was special to represent Scotland, most immediately reached for the rarity of the opportunity.",
        "In some sports, it only happens once every four years. For competitors such as Laura Muir, who missed out on the Gold Coast Games in 2018 because of her university exams, it has been even more scarce.",
        "But there must be more to it than that? Not least because the Commonwealths lacks a little of the cachet of other events.",
        "\"Something just feels different when you're running for Scotland,\" says distance runner Eilish McColgan, who won a stunning gold medal in the Women's 10,000m in Birmingham in 2022. \"It's like I'm representing my home town - Dundee - a little bit more.",
        "\"You're around people you've known since you were wee - the athletes you've grown up with, the coaches, the support staff. And when you were young, it wasn't about running for GB. It was about running for Scotland. So it just reminds you of home.\"",
        "The feeling is rooted in childhood for Murdoch, too.",
        "\"Just putting on the Scotland kit brings me back to being a wee boy,\" he says. \"I'm from a wee estate in the Vale of Leven, and I remember watching Scotland winning medals at the 2006 Commonwealths and that seemed as big as the world could get.",
        "\"From then on, that was all I wanted to do, so for this hobby of mine to get totally out of hand and me do this three times… I can't even put that into words.\"",
        "Hammer thrower Mark Dry has - like Murdoch, Carlin, McColgan and Gilmour - been to Olympics and world championships and is \"proud\" to have represented Britain. But none of those occasions, while materially more illustrious, have made him feel \"anything like competing for Scotland does\".",
        "\"It means everything to me,\" he says. \"Other championships, you're doing it for yourself, but at the Commonwealths, you're doing it for Scotland.\"",
        "Boxer Reese Lynch, who made his Games debut in Birmingham, is of a similar mind. \"Even when I'm competing for GB, I'm still representing Scotland,\" he says. \"It's where I'm from and it's who I am.\"",
        "Swimmer Duncan Scott has won 13 Commonwealth medals for Scotland",
        "The identity is one aspect of it, then. But the environment plays a part, too.",
        "Being inside the Team GB machine at an Olympics can be a stifling, lonely and isolated experience. It is a very serious business, where everyone has \"their game-face on\", according to Gilmour.",
        "Given these are athletes at the very pinnacle of their sport, that is perhaps how it should be. But it is also telling how many athletes will mention the atmosphere inside the Team Scotland camp as being something they crave every four years.",
        "\"For me, it's really good fun,\" says swimmer Duncan Scott.",
        "That's not to say that the business of winning medals is taken lightly, though. \"It's more of a fun rivalry,\" says one of Scotland's most decorated Games athletes, Para-cyclist Neil Fachie.",
        "\"You've got your British team-mates there, and the Australians seem to get up for it a bit more, but the stress level is slightly lower, and the fun's a bit higher.\"",
        "\"There's no pressure,\" adds wheelchair racer Sammi Kinghorn, who won five medals including one gold at the recent Paralympics. \"There is such a spread of athletes and abilities and we are all so grateful to be there. If you win a medal, you come back to the village and everyone is so excited for you.\"",
        "\"It's what I'd call hype vibes,\" says Olympic shooter Seonaid McIntosh. \"Because it's a smaller team than GB, we all know each other and want everyone else to have success. That's a really lovely culture and environment to be in.\"",
        "Perhaps the greatest testimony to that atmosphere is not from those who were born and raised in Scotland, but rather from those who choose to identify as Scots.",
        "Take wrestler Christelle Lemofack. She competed for Cameroon at Glasgow 2014, but enjoyed the experience so much that she never went home. In Birmingham, she represented Scotland.",
        "\"I've made a life here and Scotland gave me that opportunity, so I feel like I have to give something back,\" she said before the last Games. \"I've dreamed about this and now it's come true. I have to fight for my new flag.\"",
        "Lemofack might not have the ginger hair that Olympic judoka Sarah Adlington boasts as part of her credentials to compete for Scotland, but elements of their stories are the same.",
        "\"You can't choose where you were born, but you can choose where you live and I've chosen to live my whole adult life in Scotland,\" says the 2014 Commonwealth gold medallist. \"I feel Scottish, my coaches and team-mates are Scottish, and I wouldn't want to compete for anyone else.\"",
        "This article was originally published on 27 July 2022."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/articles/cdx9xpnexzgo",
      "main_category": "sport",
      "detailed_category": "commonwealth-games",
      "topic": "Commonwealth Games change 'huge loss' for Guernsey",
      "content": [
        "The reduction of the Commonwealth Games 2026 programme to 10 sports is a  \"huge loss\" for Guernsey athletes, according to the chair of the island's Games association.A stripped-back programme has been announced for the next Games, after Glasgow stepped in to host the event when the Australian state of Victoria pulled out due to rising costs.Hockey, squash, cricket, rugby sevens, road cycling, table tennis, triathlon and diving are among the sports cut.\"With fewer sports it is disappointing for many Guernsey athletes who will not have the opportunity in 2026 to compete at a multi-cultural and multi-sport event,\" said Angela Stuart, chair of the Guernsey Commonwealth Games Association.\"A Commonwealth Games is the highest level a Guernsey athlete can compete, so missing out on this quadrennial event is a huge loss in their sporting calendar.\" Guernsey won two medals at the 2022 Commonwealth Games in Birmingham. Bowler Lucy Beere won a silver medal in the women's singles and Alastair Chalmers won bronze in the 400m hurdles - the islands first-ever athletics medal.",
        "Both athletics and para-athletics - track and field only - and bowls and para-bowls are among the 10 sports chosen for the Games, which will take place across four venues between 23 July and 2 August 2026.Artistic gymnastics, track cycling and para-track cycling, netball, weightlifting and para-powerlifting, boxing, judo and 3x3 basketball and 3x3 wheelchair basketball complete the programme.\"The CGF [Commonwealth Games Federation] believes that this new Games model will lead the way for others to follow to enable all Commonwealth Countries and Nations to host future Games,\" Stuart said.\"A new model Games will involve change that we will embrace to support athletes in the sports included.\"",
        "Alastair Chalmers won Guernsey's first-ever Commonwealth Games athletics medal at the 2022 event in Birmingham",
        "The reduction of the Commonwealth Games 2026 programme to 10 sports is a  \"huge loss\" for Guernsey athletes, according to the chair of the island's Games association.",
        "A stripped-back programme has been announced for the next Games, after Glasgow stepped in to host the event when the Australian state of Victoria pulled out due to rising costs.",
        "Hockey, squash, cricket, rugby sevens, road cycling, table tennis, triathlon and diving are among the sports cut.",
        "\"With fewer sports it is disappointing for many Guernsey athletes who will not have the opportunity in 2026 to compete at a multi-cultural and multi-sport event,\" said Angela Stuart, chair of the Guernsey Commonwealth Games Association.",
        "\"A Commonwealth Games is the highest level a Guernsey athlete can compete, so missing out on this quadrennial event is a huge loss in their sporting calendar.\"",
        "Guernsey won two medals at the 2022 Commonwealth Games in Birmingham.",
        "Bowler Lucy Beere won a silver medal in the women's singles and Alastair Chalmers won bronze in the 400m hurdles - the islands first-ever athletics medal.",
        "Who are the Commonwealth Games winners and losers?",
        "Will Glasgow be last leg or clever rebirth for Commonwealths?",
        "Guernsey medallists worry over Commonwealth Games",
        "Both athletics and para-athletics - track and field only - and bowls and para-bowls are among the 10 sports chosen for the Games, which will take place across four venues between 23 July and 2 August 2026.",
        "Artistic gymnastics, track cycling and para-track cycling, netball, weightlifting and para-powerlifting, boxing, judo and 3x3 basketball and 3x3 wheelchair basketball complete the programme.",
        "\"The CGF [Commonwealth Games Federation] believes that this new Games model will lead the way for others to follow to enable all Commonwealth Countries and Nations to host future Games,\" Stuart said.",
        "\"A new model Games will involve change that we will embrace to support athletes in the sports included.\""
      ]
    },
    {
      "url": "https://www.bbc.com/sport/articles/cx289kpp8qqo",
      "main_category": "sport",
      "detailed_category": "commonwealth-games",
      "topic": "What do athletes think about Glasgow 2026?",
      "content": [
        "A scaled-back Commonwealth Games is coming to Glasgow in 2026.Ten sports will be on the reduced programme, meaning it will be a smaller spectacle compared to the last time the event came to Scotland in 2014.Despite that, many of Scotland's top athletes are in favour of the Games being back in Glasgow, as BBC Sport Scotland discovered.",
        "For many, the Commonwealth Games remains the only championships during which they can represent the nation rather than be part of a wider Great Britain team.Former 1500m world champion Jake Wightman said the loss of that opportunity would be \"one of the saddest\" things about the Games ceasing to exist.\"We rarely get the chance to and it's always a nice chance for us to give back to Scotland and what they have done to develop us,\" he added.Eilish McColgan, a 10,000m gold medallist at the 2022 Games in Birmingham, said it was \"incredible\" to be part of the 2014 edition in Glasgow.\"I felt proud to be from Scotland - having heard all the athletes from so many different nations say how much they enjoyed coming to Glasgow, the atmosphere and how friendly everyone was,\" McColgan said.\"There's nothing like having that crowd behind you,\" said two-time badminton medallist Kirsty Gilmour, whose sport will miss out this time.And Olympic medal-winning track cyclist Neah Evans revealed the last Glasgow Games was the reason she got into cycling.\"If there hadn’t been a velodrome in Glasgow I probably would have never tried it,\" she said.\"So I wonder who else could be inspired from the Commonwealth Games coming back?\"",
        "However, athletes are also aware of the context around the event, first held in 1930 as the British Empire Games.Sitting below world championships and Olympics, and in a changing world, the Commonwealths have diminished in stature.As such, the slimmed-down plan is the right approach, according to McColgan.\"There needs to be changes made to the current format because at the moment it just isn't feasible,\" she said.\"It needs to be scaled down. More affordable. And venues need to be re-used. Athletes hosted in empty university accommodations.\"Diver Grace Reid, a two-time Commonwealth gold medallist, agrees change is the right approach.\"In this day and age, sport has to diversify to match the climate,\" the 28-year-old said, speaking before her sport missed the cut for Glasgow 2026.\"We have to think about the athletes but we have to think about the countries that have to fund them.\"Gilmour has concerns about the short time frame to organise a Games.\"I just really hope that we have enough time to build that atmosphere and anticipation for the athletes and fans,\" she said.\"I've got no doubt Commonwealth Games Scotland and the Commonwealth Games Federation will do absolutely everything in their power to make it spectacular.\"They have to organise logistics, venues, personnel, transport etc. I'm hopeful but it's a tough task.\"",
        "From a sporting perspective, McColgan thinks the Commonwealth Games play a \"really important\" role for young Scottish athletes.The 33-year-old said the event provides an opportunity for them to compete on a lesser stage than the world events while finding their way.\"It bridges the gap and gives athletes the opportunity to experience a multi-event Games before [hopefully] representing Team GB at a global championships,\" McColgan explained. \"It's a great pathway.\"Swimmer Ross Murdoch, a breakthrough star in 2014, agreed the Games are an important \"stepping stone\".\"The Commonwealth Games was the real start to my career,\" he said.\"It's not a pointless meet on the way to the Olympics. It's an opportunity to preserve something that allows athletes to grow towards something they might never have thought they could achieve.\"Wightman, meanwhile, added that children can take inspiration from seeing compatriots compete at home.\"It would be great to keep this moment rolling in Scottish athletics and Scottish sport,\" he said. \"Another generation can be inspired.\"Reid believes the benefits are wider than purely sporting.She said: \"They are incredibly important for all those young kids that get to watch some incredible sport and all the benefits that brings to Glasgow - it could be a really exciting prospect.\"",
        "Eilish McColgan, Jake Wightman and Kirsty Gilmour spoke about the prospects for Glasgow 2026",
        "A scaled-back Commonwealth Games is coming to Glasgow in 2026.",
        "Ten sports will be on the reduced programme, meaning it will be a smaller spectacle compared to the last time the event came to Scotland in 2014.",
        "Despite that, many of Scotland's top athletes are in favour of the Games being back in Glasgow, as BBC Sport Scotland discovered.",
        "For many, the Commonwealth Games remains the only championships during which they can represent the nation rather than be part of a wider Great Britain team.",
        "Former 1500m world champion Jake Wightman said the loss of that opportunity would be \"one of the saddest\" things about the Games ceasing to exist.",
        "\"We rarely get the chance to and it's always a nice chance for us to give back to Scotland and what they have done to develop us,\" he added.",
        "Eilish McColgan, a 10,000m gold medallist at the 2022 Games in Birmingham, said it was \"incredible\" to be part of the 2014 edition in Glasgow.",
        "\"I felt proud to be from Scotland - having heard all the athletes from so many different nations say how much they enjoyed coming to Glasgow, the atmosphere and how friendly everyone was,\" McColgan said.",
        "\"There's nothing like having that crowd behind you,\" said two-time badminton medallist Kirsty Gilmour, whose sport will miss out this time.",
        "And Olympic medal-winning track cyclist Neah Evans revealed the last Glasgow Games was the reason she got into cycling.",
        "\"If there hadn’t been a velodrome in Glasgow I probably would have never tried it,\" she said.",
        "\"So I wonder who else could be inspired from the Commonwealth Games coming back?\"",
        "However, athletes are also aware of the context around the event, first held in 1930 as the British Empire Games.",
        "Sitting below world championships and Olympics, and in a changing world, the Commonwealths have diminished in stature.",
        "As such, the slimmed-down plan is the right approach, according to McColgan.",
        "\"There needs to be changes made to the current format because at the moment it just isn't feasible,\" she said.",
        "\"It needs to be scaled down. More affordable. And venues need to be re-used. Athletes hosted in empty university accommodations.\"",
        "Diver Grace Reid, a two-time Commonwealth gold medallist, agrees change is the right approach.",
        "\"In this day and age, sport has to diversify to match the climate,\" the 28-year-old said, speaking before her sport missed the cut for Glasgow 2026.",
        "\"We have to think about the athletes but we have to think about the countries that have to fund them.\"",
        "Gilmour has concerns about the short time frame to organise a Games.",
        "\"I just really hope that we have enough time to build that atmosphere and anticipation for the athletes and fans,\" she said.",
        "\"I've got no doubt Commonwealth Games Scotland and the Commonwealth Games Federation will do absolutely everything in their power to make it spectacular.",
        "\"They have to organise logistics, venues, personnel, transport etc. I'm hopeful but it's a tough task.\"",
        "Murdoch was a surprise gold medallist in the 200m breaststroke in 2014",
        "From a sporting perspective, McColgan thinks the Commonwealth Games play a \"really important\" role for young Scottish athletes.",
        "The 33-year-old said the event provides an opportunity for them to compete on a lesser stage than the world events while finding their way.",
        "\"It bridges the gap and gives athletes the opportunity to experience a multi-event Games before [hopefully] representing Team GB at a global championships,\" McColgan explained. \"It's a great pathway.\"",
        "Swimmer Ross Murdoch, a breakthrough star in 2014, agreed the Games are an important \"stepping stone\".",
        "\"The Commonwealth Games was the real start to my career,\" he said.",
        "\"It's not a pointless meet on the way to the Olympics. It's an opportunity to preserve something that allows athletes to grow towards something they might never have thought they could achieve.\"",
        "Wightman, meanwhile, added that children can take inspiration from seeing compatriots compete at home.",
        "\"It would be great to keep this moment rolling in Scottish athletics and Scottish sport,\" he said. \"Another generation can be inspired.\"",
        "Reid believes the benefits are wider than purely sporting.",
        "She said: \"They are incredibly important for all those young kids that get to watch some incredible sport and all the benefits that brings to Glasgow - it could be a really exciting prospect.\""
      ]
    },
    {
      "url": "https://www.bbc.com/sport/articles/clylywd7dyjo",
      "main_category": "sport",
      "detailed_category": "commonwealth-games",
      "topic": "Australia offer extra funding for Glasgow 2026 bid",
      "content": [
        "Glasgow's protracted bid to rescue the 2026 Commonwealth Games has taken a further twist after Australian authorities promised \"a multi-million pound investment\" to help finalise the deal.Earlier this week, it emerged that the UK government offered £2.3m to help cover safety and security costs associated with the scaled-down, privately-funded event, but asked the Scottish government to match that figure.However, Holyrood politicians remain concerned by what cabinet minister Neil Gray called the \"reputational risk and financial risk\" of the bid.Glasgow hosted the Games in 2014, but the 2026 proposal would feature 10 sports across four venues, instead of the 18 that took place a decade ago.",
        "While the stasis continues - and the timescales becoming increasingly pressing - Commonwealth Games Australia have offered to bridge any shortfall.They have told both their Scottish counterparts and the Scottish government that they are prepared to invest some of the compensation they received when the Australian state of Victoria withdrew as hosts last year due to financial issues.“We want to do all that we can to make Glasgow 2026 a reality,” president Ben Houston said.“We appreciate that the model is different and that that creates perceived financial and reputational challenges, but we have every confidence in the model.“Now is not the time to walk away from a Games that has inspired for generations, and we look forward to working collaboratively toward an outcome that benefits Commonwealth nations, their athletes, coaches and fans.”Commonwealth Games Scotland - who are behind the Glasgow bid - have welcomed the offer.In a statement they said the Australians' \"willingness to invest, to further alleviate concerns of perceived financial and reputational risk, shows the high regard on which our cost-effective proposal is held within the global sport and events community.”",
        "Glasgow 2026 would be a smaller-scale event than in 2014",
        "Glasgow's protracted bid to rescue the 2026 Commonwealth Games has taken a further twist after Australian authorities promised \"a multi-million pound investment\" to help finalise the deal.",
        "Earlier this week, it emerged that the UK government offered £2.3m to help cover safety and security costs associated with the scaled-down, privately-funded event, but asked the Scottish government to match that figure.",
        "However, Holyrood politicians remain concerned by what cabinet minister Neil Gray called the \"reputational risk and financial risk\" of the bid.",
        "Glasgow hosted the Games in 2014, but the 2026 proposal would feature 10 sports across four venues, instead of the 18 that took place a decade ago.",
        "Will the Commonwealth Games return to Glasgow in 2026?",
        "What do athletes think about Glasgow 2026 bid?",
        "UK government offers to share financial risk for Glasgow Games",
        "While the stasis continues - and the timescales becoming increasingly pressing - Commonwealth Games Australia have offered to bridge any shortfall.",
        "They have told both their Scottish counterparts and the Scottish government that they are prepared to invest some of the compensation they received when the Australian state of Victoria withdrew as hosts last year due to financial issues.",
        "“We want to do all that we can to make Glasgow 2026 a reality,” president Ben Houston said.",
        "“We appreciate that the model is different and that that creates perceived financial and reputational challenges, but we have every confidence in the model.",
        "“Now is not the time to walk away from a Games that has inspired for generations, and we look forward to working collaboratively toward an outcome that benefits Commonwealth nations, their athletes, coaches and fans.”",
        "Commonwealth Games Scotland - who are behind the Glasgow bid - have welcomed the offer.",
        "In a statement they said the Australians' \"willingness to invest, to further alleviate concerns of perceived financial and reputational risk, shows the high regard on which our cost-effective proposal is held within the global sport and events community.”"
      ]
    }
  ]
}