{
  "scraped_at": "2025-10-27T18:56:59.821546",
  "total_articles": 2,
  "category": "volleyball",
  "articles_per_category": 100,
  "articles": [
    {
      "url": "https://www.bbc.com/sport/articles/c4gzyvlzzvno",
      "main_category": "sport",
      "detailed_category": "volleyball",
      "topic": "'It always feels like David v Goliath on court'",
      "content": [
        "Twin brothers Javier and Joaquin Bello have always felt like David going up against Goliath whenever they step on court.And just like the fearless Biblical shepherd boy, the 24-year-olds produced the ultimate giant-killing to battle through qualifying on their way to becoming the first ever British players to win an elite international beach volleyball event.It's another milestone for the brothers from south-west London, who won England's first ever Commonwealth Games medal when they claimed bronze in Birmingham two years ago.But they wouldn't have even made it to Brazil had they not taken a big gamble. \"It's a very, very expensive tournament and our budget has already run out for the year, so we paid for that ourselves,\" Javier said.\"If you lose the first round qualifier, you go home with nothing. No prize money, no place to stay that night, nothing. \"We had the opportunity to go and we didn't want to feel any regret.\"We always feel a little bit like David v Goliath on court.\"",
        "Born in Madrid, the Bellos began playing volleyball aged six and moved with their family to London at the age of 10.Their father and coach Luis Bello was a professional indoor volleyball player, while their cousin, Miguel Angel De Amo, was a world champion beach player at youth level and plays for the Spanish indoor national team.The sport is in their blood and they knew at an early age that was the career they wanted to pursue. They live together, play together and travel together.\"We have a connection [as twins] and that's definitely a big - probably our biggest - strength,\" Javier said. \"Not only in a technical and tactical sense, but also in the emotional sense, we feel very united.\"The Bellos train on an open-air court at Barn Elms Sports Centre, a London 2012 legacy venue close to the River Thames, and are predominantly self-funded.\"We don't have funding to that level [of players in other nations],\" Javier said.\"So we created our own kind of high performance centre in our house, in our living room and with our family.\"Most of our support group is there, so that's a big advantage - probably the only reason that we are where we are today is because of their support, their sacrifices.\"",
        "One condition of their parents supporting their dream was both brothers would get qualifications so they had alternative careers to fall back on.Joaquin has a degree in medicine, while Javier is in his final year of study for a masters degree in strategic communications.After winning Commonwealth bronze in 2022, the brothers started playing full-time in March this year.They came close to securing a place on the sand next to the Eiffel Tower in Paris, where they would have been the first British male pair to qualify for an Olympic Games.\"Unfortunately this cycle caught us a little bit early,\" said Joaquin. \"If we'd been able to start full-time a few months earlier I think we would easily have been in because of the level we're playing at now.\"Any disappointment was short-lived though with their stunning victory in Rio at the Volleyball World Beach Pro Tour - Elite 16 tournament.There they shocked the Olympic gold and bronze medal-winning Norwegian team of Anders Mol and Christian Sorum - currently ranked second in the world - in the semi-finals.A 2-1 win in the final over Argentinian brothers Nicolas and Tomas Capogrosso secured the trophy and is set to move them up to 16th in the world rankings.",
        "Currently in the Philippines for their next event, the brothers have now qualified for the Beach Tour Pro finals in Doha, Qatar, next month.Focus will then turn to qualifying for the world championships in Adelaide, Australia, next year.\"We should be reaching a physical peak in the next Olympic cycle, perhaps even the next one after that as well,\" Javier said.\"What we're working on now is just consistency and being able to get those top results more often.\"It's still a long time, hopefully, left in our careers and we're trying to get our project to be more sustainable financially.\"With a successful King and Queen of the Court event held in London's Canary Wharf in September and more events potentially coming to the capital next year, Javier and Joaquin feel the sport is in a good position to grow in the UK for younger generations to follow in their footsteps.But they won't have a chance to defend, or improve on, their Commonwealth bronze medal in Glasgow in 2026, after beach volleyball was left off the reduced list of sports for the rearranged Games.\"It's a shame because we think it would be really successful at these Games,\" Javier said.Joaquin added: \"Now we're at the stage where we were aiming for gold. But [in] maybe 2030, we'll see.\"",
        "Javier [left] and Joaquin Bello went through qualifying to win the Volleyball World Beach Pro Tour - Elite 16 tournament in Rio de Janeiro",
        "Twin brothers Javier and Joaquin Bello have always felt like David going up against Goliath whenever they step on court.",
        "And just like the fearless Biblical shepherd boy, the 24-year-olds produced the ultimate giant-killing to battle through qualifying on their way to becoming the first ever British players to win an elite international beach volleyball event.",
        "It's another milestone for the brothers from south-west London, who won England's first ever Commonwealth Games medal when they claimed bronze in Birmingham two years ago.",
        "But they wouldn't have even made it to Brazil had they not taken a big gamble.",
        "\"It's a very, very expensive tournament and our budget has already run out for the year, so we paid for that ourselves,\" Javier said.",
        "\"If you lose the first round qualifier, you go home with nothing. No prize money, no place to stay that night, nothing.",
        "\"We had the opportunity to go and we didn't want to feel any regret.",
        "\"We always feel a little bit like David v Goliath on court.\"",
        "Born in Madrid, the Bellos began playing volleyball aged six and moved with their family to London at the age of 10.",
        "Their father and coach Luis Bello was a professional indoor volleyball player, while their cousin, Miguel Angel De Amo, was a world champion beach player at youth level and plays for the Spanish indoor national team.",
        "The sport is in their blood and they knew at an early age that was the career they wanted to pursue. They live together, play together and travel together.",
        "\"We have a connection [as twins] and that's definitely a big - probably our biggest - strength,\" Javier said.",
        "\"Not only in a technical and tactical sense, but also in the emotional sense, we feel very united.\"",
        "The Bellos train on an open-air court at Barn Elms Sports Centre, a London 2012 legacy venue close to the River Thames, and are predominantly self-funded.",
        "\"We don't have funding to that level [of players in other nations],\" Javier said.",
        "\"So we created our own kind of high performance centre in our house, in our living room and with our family.",
        "\"Most of our support group is there, so that's a big advantage - probably the only reason that we are where we are today is because of their support, their sacrifices.\"",
        "Bello twins win historic beach volleyball bronze",
        "Who are the Commonwealth Games winners and losers?",
        "The Bello brothers won bronze for England at the 2022 Commonwealth Games in Birmingham",
        "One condition of their parents supporting their dream was both brothers would get qualifications so they had alternative careers to fall back on.",
        "Joaquin has a degree in medicine, while Javier is in his final year of study for a masters degree in strategic communications.",
        "After winning Commonwealth bronze in 2022, the brothers started playing full-time in March this year.",
        "They came close to securing a place on the sand next to the Eiffel Tower in Paris, where they would have been the first British male pair to qualify for an Olympic Games.",
        "\"Unfortunately this cycle caught us a little bit early,\" said Joaquin. \"If we'd been able to start full-time a few months earlier I think we would easily have been in because of the level we're playing at now.\"",
        "Any disappointment was short-lived though with their stunning victory in Rio at the Volleyball World Beach Pro Tour - Elite 16 tournament.",
        "There they shocked the Olympic gold and bronze medal-winning Norwegian team of Anders Mol and Christian Sorum - currently ranked second in the world - in the semi-finals.",
        "A 2-1 win in the final over Argentinian brothers Nicolas and Tomas Capogrosso secured the trophy and is set to move them up to 16th in the world rankings.",
        "Currently in the Philippines for their next event, the brothers have now qualified for the Beach Tour Pro finals in Doha, Qatar, next month.",
        "Focus will then turn to qualifying for the world championships in Adelaide, Australia, next year.",
        "\"We should be reaching a physical peak in the next Olympic cycle, perhaps even the next one after that as well,\" Javier said.",
        "\"What we're working on now is just consistency and being able to get those top results more often.",
        "\"It's still a long time, hopefully, left in our careers and we're trying to get our project to be more sustainable financially.\"",
        "With a successful King and Queen of the Court event held in London's Canary Wharf in September and more events potentially coming to the capital next year, Javier and Joaquin feel the sport is in a good position to grow in the UK for younger generations to follow in their footsteps.",
        "But they won't have a chance to defend, or improve on, their Commonwealth bronze medal in Glasgow in 2026, after beach volleyball was left off the reduced list of sports for the rearranged Games.",
        "\"It's a shame because we think it would be really successful at these Games,\" Javier said.",
        "Joaquin added: \"Now we're at the stage where we were aiming for gold. But [in] maybe 2030, we'll see.\"",
        "Beach volleyball will not be one of the sports at the next Commonwealth Games in Glasgow in 2026"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/volleyball/articles/cq55r0dp581o",
      "main_category": "sport",
      "detailed_category": "volleyball",
      "topic": "Volleyball at the Paris 2024 Olympics",
      "content": [
        "Here's all you need to know about volleyball at Paris 2024.",
        "The volleyball matches run from 27 July to 11 August. The competition will take place at the South Paris Arena.South Paris Arena – or Paris Expo Porte de Versailles as it’s known outside of the Olympics – is one of France’s biggest exhibition centres and was built 101 years ago to host the annual Paris Fair. Volleyball takes place in Hall 1, with a capacity for 12,000 spectators.The medal matches for both the men’s and women’s events are from 9 to 11 August.",
        "There are six players in a volleyball team.",
        "Blisteringly fast and full throttle, volleyball will be one of the most popular sports in Paris as France’s men are defending champions. Each team can touch the ball (with any part of their body) up to three times before returning it over the net. Matches are best-of-five sets, with 25 points needed to win a set – or 15 in a deciding fifth set. The top two in each pool, plus the two best third-placed teams, advance to the last eight.The round-robin phase is now three pools of four instead of two pools of six, with fewer matches designed to keep the players fresh. A new ranking system to determine the quarter-final seedings has been introduced. A non-competing 13th player can be used for medical/injury reasons.",
        "Volleyball has been an Olympic sport since the 1964 Games in Tokyo.",
        "Team GB have not qualified for Paris 2024. Their only Olympic appearance in the sport came at London 2012, where the women's finished ninth and the men 11th.",
        "France and USA won gold in the men's and women's events at the Tokyo Games. Brazil, the Soviet Union and Italy have won the most medals in men's Olympic volleyball (six each), with Brazil topping the table with three golds and three silvers.In women's Olympic volleyball, six countries have won gold with the Soviet Union leading the overall medals table with six (four golds and two silvers).Great Britain have never won an Olympic volleyball medal.",
        "France won the men's volleyball gold medal at the Tokyo Olympics",
        "Here's all you need to know about volleyball at Paris 2024.",
        "The volleyball matches run from 27 July to 11 August. The competition will take place at the South Paris Arena.",
        "South Paris Arena – or Paris Expo Porte de Versailles as it’s known outside of the Olympics – is one of France’s biggest exhibition centres and was built 101 years ago to host the annual Paris Fair. Volleyball takes place in Hall 1, with a capacity for 12,000 spectators.",
        "The medal matches for both the men’s and women’s events are from 9 to 11 August.",
        "There are six players in a volleyball team.",
        "Blisteringly fast and full throttle, volleyball will be one of the most popular sports in Paris as France’s men are defending champions.",
        "Each team can touch the ball (with any part of their body) up to three times before returning it over the net. Matches are best-of-five sets, with 25 points needed to win a set – or 15 in a deciding fifth set.",
        "The top two in each pool, plus the two best third-placed teams, advance to the last eight.",
        "The round-robin phase is now three pools of four instead of two pools of six, with fewer matches designed to keep the players fresh.",
        "A new ranking system to determine the quarter-final seedings has been introduced. A non-competing 13th player can be used for medical/injury reasons.",
        "Volleyball has been an Olympic sport since the 1964 Games in Tokyo.",
        "When do the Olympics start?",
        "Great Britain's team for 2024 Paris Olympics",
        "Team GB have not qualified for Paris 2024. Their only Olympic appearance in the sport came at London 2012, where the women's finished ninth and the men 11th.",
        "France and USA won gold in the men's and women's events at the Tokyo Games.",
        "Brazil, the Soviet Union and Italy have won the most medals in men's Olympic volleyball (six each), with Brazil topping the table with three golds and three silvers.",
        "In women's Olympic volleyball, six countries have won gold with the Soviet Union leading the overall medals table with six (four golds and two silvers).",
        "Great Britain have never won an Olympic volleyball medal."
      ]
    }
  ]
}