{
  "scraped_at": "2025-10-27T18:56:59.814547",
  "total_articles": 13,
  "category": "squash",
  "articles_per_category": 100,
  "articles": [
    {
      "url": "https://www.bbc.com/sport/squash/articles/c62wy4x9z7xo",
      "main_category": "sport",
      "detailed_category": "squash",
      "topic": "Wales' Murphy and Makin claim third British titles",
      "content": [
        "Wales' Tesni Murphy and Joel Makin took the spoils at the British National Championships with wins in successive finals.Murphy (nee Evans) reclaimed the title she won in 2018 and 2019 by beating England's Torrie Malik 3-1 in the women's final at St George's Hill Lawn Tennis Club, WeybridgeThe world-ranked 21st Murphy dropped one set in the 11-0, 11-5, 7-11, 11-9 triumph, completed in 45 minutes.It was a second successive title - and also a third national men's crown - for world number four Makin, who needed 43 minutes to beat fifth seed Nick Wall 11-4, 12-10, 11-3.",
        "Tesni Murphy and Joel Makin have competed for Wales at Commonwealth Games",
        "Wales' Tesni Murphy and Joel Makin took the spoils at the British National Championships with wins in successive finals.",
        "Murphy (nee Evans) reclaimed the title she won in 2018 and 2019 by beating England's Torrie Malik 3-1 in the women's final at St George's Hill Lawn Tennis Club, Weybridge",
        "The world-ranked 21st Murphy dropped one set in the 11-0, 11-5, 7-11, 11-9 triumph, completed in 45 minutes.",
        "It was a second successive title - and also a third national men's crown - for world number four Makin, who needed 43 minutes to beat fifth seed Nick Wall 11-4, 12-10, 11-3."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/squash/articles/cvgwpx0ez92o",
      "main_category": "sport",
      "detailed_category": "squash",
      "topic": "Makin makes history with PSA Squash Tour Finals title win",
      "content": [
        "British number one Joel Makin has become the first Welsh player to win the PSA Squash Tour Finals after he beat world number one Mostafa Asal at Toronto's Revival Film Studios.The 30-year-old won the first two games 11-10, 11-7, before Asal, 24, retired from the match due to an ankle injury after the Egyptian went 1-0 behind in the third game. Makin was appearing in the first major PSA final of his career and he has now won the 10th - and biggest - title of his career. It is Makin's second title of the season after also winning the Silicon Valley Open in October 2024.\"I've just been chipping away, and it's not been a short process, that's for sure,\" said Makin.\"It was a really high quality one, the same as last night [against Diego Elias]. We had two really good games, it was frustrating in the third that we didn't get to keep going. \"At sudden death again in the first game, it was really high quality. It's upsetting that he [Asal] wasn't right.\"I'm happy to win, but I want that challenge, I want to win. I want to see how I am against him when he's playing well. \"It's been another good week, it wasn't my best stuff in the group stages, but you've just got to keep trying, keep on getting better and come out and bring my best performance on the night.\"World number one Nouran Gohar of Egypt won the women's trophy after beating world number four Olivia Weaver of the United States 11-10, 9-11, 11-8, 11-3.The PSA Squash Tour Finals brings the curtain down on the PSA Squash Tour campaign, with the 2025-26 season set to begin in August.",
        "Joel Makin is the first Welsh player to win the PSA Squash Tour Finals",
        "British number one Joel Makin has become the first Welsh player to win the PSA Squash Tour Finals after he beat world number one Mostafa Asal at Toronto's Revival Film Studios.",
        "The 30-year-old won the first two games 11-10, 11-7, before Asal, 24, retired from the match due to an ankle injury after the Egyptian went 1-0 behind in the third game.",
        "Makin was appearing in the first major PSA final of his career and he has now won the 10th - and biggest - title of his career.",
        "It is Makin's second title of the season after also winning the Silicon Valley Open in October 2024.",
        "\"I've just been chipping away, and it's not been a short process, that's for sure,\" said Makin.",
        "\"It was a really high quality one, the same as last night [against Diego Elias]. We had two really good games, it was frustrating in the third that we didn't get to keep going.",
        "\"At sudden death again in the first game, it was really high quality. It's upsetting that he [Asal] wasn't right.",
        "\"I'm happy to win, but I want that challenge, I want to win. I want to see how I am against him when he's playing well.",
        "\"It's been another good week, it wasn't my best stuff in the group stages, but you've just got to keep trying, keep on getting better and come out and bring my best performance on the night.\"",
        "World number one Nouran Gohar of Egypt won the women's trophy after beating world number four Olivia Weaver of the United States 11-10, 9-11, 11-8, 11-3.",
        "The PSA Squash Tour Finals brings the curtain down on the PSA Squash Tour campaign, with the 2025-26 season set to begin in August."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/squash/articles/cy8n20lmdl9o",
      "main_category": "sport",
      "detailed_category": "squash",
      "topic": "Makin overcomes Crouin to reach British Open semis",
      "content": [
        "Joel Makin reached the British Open semi-final for the second time in his career with a 3-1 comeback win over Victor Crouin at the Birmingham Repertory Theatre.French world number 13 Crouin took the opening game of their quarter-final 11-7 before the British number one hit back to take the next three games 11-5, 11-5, 11-6.Makin, very much the local favourite having lived in Birmingham for the last 12 years, admitted he was needled by Crouin's approach in the 70-minute match.\"I can't lose to a man who fist pumps at 0-0 in the first game,\" said the world number four. \"Not my kind of thing that, it got my adrenaline up.\"Welshman Makin, 30, will take on defending champion and world number one Mostafa Asal in the semi-final, with their match scheduled for Saturday, 7 June at 15:00 BST.The 24-year-old Egyptian won his quarter-final in straight games, beating compatriot Youssef Ibrahim 11-7, 11-8, 11-7 in 54 minutes.",
        "\"For the semi against Asal, if I hit my lines I know I can cause him some issues, but he's been hitting his lines and just won the World Champs so his aggressive hitting has been top quality,\" said Makin.\"I'm going to get stuck in, these are the benchmarks in my career, you either get to a British Open final or you come up short again. These are the big moments that you're looking forward to and put in all the work for.\"Fellow British players Marwan ElShorbagy and brother Mohamed ElShorbagy are in action on Friday bidding to join Makin in the last four, taking on respectively Paul Coll of New Zealand and Peru's Diego Elias.",
        "Joel Makin (left) needed to show the fitness levels for which he is well known to come from behind against Victor Crouin",
        "Joel Makin reached the British Open semi-final for the second time in his career with a 3-1 comeback win over Victor Crouin at the Birmingham Repertory Theatre.",
        "French world number 13 Crouin took the opening game of their quarter-final 11-7 before the British number one hit back to take the next three games 11-5, 11-5, 11-6.",
        "Makin, very much the local favourite having lived in Birmingham for the last 12 years, admitted he was needled by Crouin's approach in the 70-minute match.",
        "\"I can't lose to a man who fist pumps at 0-0 in the first game,\" said the world number four. \"Not my kind of thing that, it got my adrenaline up.\"",
        "Welshman Makin, 30, will take on defending champion and world number one Mostafa Asal in the semi-final, with their match scheduled for Saturday, 7 June at 15:00 BST.",
        "The 24-year-old Egyptian won his quarter-final in straight games, beating compatriot Youssef Ibrahim 11-7, 11-8, 11-7 in 54 minutes.",
        "\"For the semi against Asal, if I hit my lines I know I can cause him some issues, but he's been hitting his lines and just won the World Champs so his aggressive hitting has been top quality,\" said Makin.",
        "\"I'm going to get stuck in, these are the benchmarks in my career, you either get to a British Open final or you come up short again. These are the big moments that you're looking forward to and put in all the work for.\"",
        "Fellow British players Marwan ElShorbagy and brother Mohamed ElShorbagy are in action on Friday bidding to join Makin in the last four, taking on respectively Paul Coll of New Zealand and Peru's Diego Elias."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/squash/articles/c62nkxr2r1do",
      "main_category": "sport",
      "detailed_category": "squash",
      "topic": "Makin beats Steinmann to reach British Open quarters",
      "content": [
        "Joel Makin reached his second consecutive British Open quarter-final after outplaying Swiss world number 18 Dimitri Steinmann 11-5 11-4 11-4 at the Birmingham Repertory Theatre.In the first meeting between the pair, Making - the British number one and world number four - took the initiative early on, spending the majority of the opening game in front of Steinmann and forcing the Swiss number one into long, lung-busting rallies and desperate scrambling recoveries.After taking the 23-minute first game 11-5, Makin doubled his lead after dominating the second 11-4, with the Welshman looking fully at home in his adopted city where he studied and has lived for the last 12 years.Steinmann started game three more brightly, upping the tempo and volleying more to get the ball past Makin more consistently.Makin, though, was soon able to adapt and wore Steinmann down with some typically brutal rallies, complemented by some smart finishes at the front of the court as he brought the contest to a close with another 11-4 win.\"It was great, I love playing here. I've been here for 12 years now and it feels like home. People have been coming out and supporting, it's great and I've loved the atmosphere here,\" Makin said.Makin will play France's Victor Crouin in the quarter-finals, with their match scheduled for Thursday, 5 June at 20:15 BST.Fellow British players Marwan ElShorbagy and brother Mohamed ElShorbagy are in action on Wednesday bidding to join Makin in the last eight, taking on respectively Youssef Soliman and his Egyptian compatriot Mohamad Zakaria.In the women's draw, England's Sarah-Jane Perry aims to keep British hopes alive against Nour ElSherbini of Egypt in what is her final competition after announcing that she will be retiring afterwards.",
        "Joel Makin (right) was always in control of his first meeting with Dimitri Steinmann",
        "Joel Makin reached his second consecutive British Open quarter-final after outplaying Swiss world number 18 Dimitri Steinmann 11-5 11-4 11-4 at the Birmingham Repertory Theatre.",
        "In the first meeting between the pair, Making - the British number one and world number four - took the initiative early on, spending the majority of the opening game in front of Steinmann and forcing the Swiss number one into long, lung-busting rallies and desperate scrambling recoveries.",
        "After taking the 23-minute first game 11-5, Makin doubled his lead after dominating the second 11-4, with the Welshman looking fully at home in his adopted city where he studied and has lived for the last 12 years.",
        "Steinmann started game three more brightly, upping the tempo and volleying more to get the ball past Makin more consistently.",
        "Makin, though, was soon able to adapt and wore Steinmann down with some typically brutal rallies, complemented by some smart finishes at the front of the court as he brought the contest to a close with another 11-4 win.",
        "\"It was great, I love playing here. I've been here for 12 years now and it feels like home. People have been coming out and supporting, it's great and I've loved the atmosphere here,\" Makin said.",
        "Makin will play France's Victor Crouin in the quarter-finals, with their match scheduled for Thursday, 5 June at 20:15 BST.",
        "Fellow British players Marwan ElShorbagy and brother Mohamed ElShorbagy are in action on Wednesday bidding to join Makin in the last eight, taking on respectively Youssef Soliman and his Egyptian compatriot Mohamad Zakaria.",
        "In the women's draw, England's Sarah-Jane Perry aims to keep British hopes alive against Nour ElSherbini of Egypt in what is her final competition after announcing that she will be retiring afterwards."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/squash/articles/cedly6vg1pwo",
      "main_category": "sport",
      "detailed_category": "squash",
      "topic": "ElShorbagy beats Cardenas to win Canadian Open",
      "content": [
        "England's Mohamed ElShorbagy won his second title of the PSA Squash Tour season with victory over Mexico's Leonel Cardenas in the Canadian Open in Calgary.ElShorbagy, the world number eight, defeated Cardenas, ranked 16, 11-5 11-5 11-7.The 36-minute win gave the former world champion the 51st PSA Tour title of his career and follows his China Open win in November.The 34-year-old started strongly, winning seven of the opening eight points and wrapping up the first game after only seven minutes.Although Cardenas tried to add more duration into the rallies into the second and third games, ElShorbagy proved too strong.\"I was really happy with the level of my focus this week,\" he said.\"I arrived this week on paper as quite a heavy favourite, but that doesn't mean anything. I have shown sometimes in the past that I would lose focus in some of these matches, drop games, and get myself into trouble. That was something that I really wanted to focus on this week.\"",
        "The win secured ElShorbagy's 51st PSA Tour title",
        "England's Mohamed ElShorbagy won his second title of the PSA Squash Tour season with victory over Mexico's Leonel Cardenas in the Canadian Open in Calgary.",
        "ElShorbagy, the world number eight, defeated Cardenas, ranked 16, 11-5 11-5 11-7.",
        "The 36-minute win gave the former world champion the 51st PSA Tour title of his career and follows his China Open win in November.",
        "The 34-year-old started strongly, winning seven of the opening eight points and wrapping up the first game after only seven minutes.",
        "Although Cardenas tried to add more duration into the rallies into the second and third games, ElShorbagy proved too strong.",
        "\"I was really happy with the level of my focus this week,\" he said.",
        "\"I arrived this week on paper as quite a heavy favourite, but that doesn't mean anything. I have shown sometimes in the past that I would lose focus in some of these matches, drop games, and get myself into trouble. That was something that I really wanted to focus on this week.\""
      ]
    },
    {
      "url": "https://www.bbc.com/sport/squash/articles/cvgwyjr7xz9o",
      "main_category": "sport",
      "detailed_category": "squash",
      "topic": "Makin targets world top five after 'massive' title win",
      "content": [
        "Joel Makin has won the biggest title of his career with victory at the 2024 Silicon Valley Open.World number eight Makin beat Egyptian Youssef Soliman 12-10, 12-10, 8-11, 11-3 in the final in San Francisco.The 29-year-old Welshman - who won his second British title earlier this year - says he is now targetting a place in the top five of the world rankings.The game he lost in his 80 minute final against 11th-ranked Soliman was the only one he dropped on his way to success in the $122,000 (£94,000) Gold level event.“It’s massive, I’ve obviously lost in the final of a couple of Gold events, so it’s nice to get one done,\" said Makin.\"It’s a nice achievement and a nice milestone. I’ve obviously just gone to eight in the world last week, so hopefully this win will help me go towards seven or six in the world over the next couple of months.“I think there’s a group of us competing between that five and ten spots. I think the top four have consolidated themselves in terms of points and wins, but I’m going to look to try get to five and then challenge from there. \"",
        "Joel Makin won silver for Wales at the 2022 Commonwealth Games",
        "Joel Makin has won the biggest title of his career with victory at the 2024 Silicon Valley Open.",
        "World number eight Makin beat Egyptian Youssef Soliman 12-10, 12-10, 8-11, 11-3 in the final in San Francisco.",
        "The 29-year-old Welshman - who won his second British title earlier this year - says he is now targetting a place in the top five of the world rankings.",
        "The game he lost in his 80 minute final against 11th-ranked Soliman was the only one he dropped on his way to success in the $122,000 (£94,000) Gold level event.",
        "“It’s massive, I’ve obviously lost in the final of a couple of Gold events, so it’s nice to get one done,\" said Makin.",
        "\"It’s a nice achievement and a nice milestone. I’ve obviously just gone to eight in the world last week, so hopefully this win will help me go towards seven or six in the world over the next couple of months.",
        "“I think there’s a group of us competing between that five and ten spots. I think the top four have consolidated themselves in terms of points and wins, but I’m going to look to try get to five and then challenge from there. \""
      ]
    },
    {
      "url": "https://www.bbc.com/sport/squash/articles/ce9jnjz9e0go",
      "main_category": "sport",
      "detailed_category": "squash",
      "topic": "'I wondered if I would walk normally again'",
      "content": [
        "Scotland's Lisa Aitken wondered if she would ever walk normally again as she battled back from a career-threatening knee injury.The 34-year-old has had surgery three times after fully rupturing the anterior cruciate and medial collateral ligaments as well as tearing the meniscus in her knee during a match in late 2022.Almost two years on, Aitken - who has competed in three Commonwealth Games - will make her comeback at next week's Qatar Classic at Khalifa International Squash Complex in Doha.\"Just having to have two follow-up surgeries, I was thinking 'will I ever be able to walk normally again?' There was a significant period of time where I was limping,\" she told BBC Sport Scotland.\"The more time went on, the more I became aware I might not be able to return to sport at an elite level and then my mindset probably had a little shift to 'I just want to walk again, I just want to be able to run after my kids one day' and rehab the knee from that point of view.\"But that was very short lived. The way athletes are wired, you always want to defy the odds, you always want to achieve great things even if they are impossible, so that very quickly changed to 'I just want to get back on tour'.\"I am probably real about the goals I want to achieve now; just getting back on tour and being able to put on that dress, have the sweat bands on, have a referee call out my name and the score is simply the short-term goal.\"",
        "The injury came at a time when Aitken's career was very much on the up – she had just reached a career high of 21 in the world ranking.The Montrose athlete admits she found the mental torment during the gruelling battle back tougher than the physical fight.Aitken highlighted dealing with \"the grieving process around losing your identity for a period of time, losing your career, your job, your salary\".She added: \"When you are an athlete your name is very much associated with the player, with the competitor and that was gone.\"Not knowing when that was going to come back, if that was going to comeback was really tough. Going through the thoughts of: 'Who am I?' 'What is my purpose now?' 'What do I do if I can't get back?'\"I have a couple of psychologists I work with and I am very grateful for them. Had I not had them I probably wouldn't be returning to the sport at all.\"The physical pain you can handle, it is the mental challenges that bring it – not making money, not knowing who you are and if you are going to be able to get that back.\"While thrilled to be back in action, Aitken believes \"it is going to be apparent very quickly whether I am going to be able to compete at the level I am used to or not\".\"I will know within about six to eight months,\" she explained. \"I will be very honest, if I am not feeling like I can compete at a level I am happy with, I will call it a day.\"I have goals of being the Scottish number one again. We have the Commonwealth Games in two years' time, hopefully squash can be included in Glasgow.\"Then, not beating around the bush, we have been included in the Olympics for the first time in LA '28.\"I will be 38, that is a very long shot of a target but so long as I am healthy and if the season goes well this year, that may become a target for me.\"I was out in my mid-20s for two-and-a-half years with the effects of Dengue fever and I have now been out for a couple of years with this knee injury, so I feel like even though I am 34, I have years in the bank that are unused.\"",
        "And the Scot has opened up on her decision to put her dreams of becoming a parent on hold while she bids to try and turn those of the Olympic variety in to reality.\"I think probably the team would be decided quite a while out from LA 28 so maybe early 2027 I would know by then so it is honestly not too long away, but you put everything into this sport, it would be crazy not to give the Olympics a shot,\" she added.\"A lot will depend how this first couple of seasons go back on tour that will give me a realistic idea of whether or not I can compete for a spot.\"First and foremost for me is, is that going to be an achievable goal based on this rehab I have gone through? If so, of course those conversations will be had around, for example, freezing eggs and saving motherhood for later down the line.\"I think 37, 38 is young to still become a mum for the first time and it is also doable to be an athlete, you either strive and leave no stone unturned and become and Olympian, which is pretty cool, or you don’t and you have peace over knowing you gave it absolutely everything or you become a mum and both those things are really quite cool.\"",
        "Lisa Aitken competing at the Birmingham 2022 Commonwealth Games",
        "Scotland's Lisa Aitken wondered if she would ever walk normally again as she battled back from a career-threatening knee injury.",
        "The 34-year-old has had surgery three times after fully rupturing the anterior cruciate and medial collateral ligaments as well as tearing the meniscus in her knee during a match in late 2022.",
        "Almost two years on, Aitken - who has competed in three Commonwealth Games - will make her comeback at next week's Qatar Classic at Khalifa International Squash Complex in Doha.",
        "\"Just having to have two follow-up surgeries, I was thinking 'will I ever be able to walk normally again?' There was a significant period of time where I was limping,\" she told BBC Sport Scotland.",
        "\"The more time went on, the more I became aware I might not be able to return to sport at an elite level and then my mindset probably had a little shift to 'I just want to walk again, I just want to be able to run after my kids one day' and rehab the knee from that point of view.",
        "\"But that was very short lived. The way athletes are wired, you always want to defy the odds, you always want to achieve great things even if they are impossible, so that very quickly changed to 'I just want to get back on tour'.",
        "\"I am probably real about the goals I want to achieve now; just getting back on tour and being able to put on that dress, have the sweat bands on, have a referee call out my name and the score is simply the short-term goal.\"",
        "Squash breakthrough spurs Aitken on for LA 2028",
        "The injury came at a time when Aitken's career was very much on the up – she had just reached a career high of 21 in the world ranking.",
        "The Montrose athlete admits she found the mental torment during the gruelling battle back tougher than the physical fight.",
        "Aitken highlighted dealing with \"the grieving process around losing your identity for a period of time, losing your career, your job, your salary\".",
        "She added: \"When you are an athlete your name is very much associated with the player, with the competitor and that was gone.",
        "\"Not knowing when that was going to come back, if that was going to comeback was really tough. Going through the thoughts of: 'Who am I?' 'What is my purpose now?' 'What do I do if I can't get back?'",
        "\"I have a couple of psychologists I work with and I am very grateful for them. Had I not had them I probably wouldn't be returning to the sport at all.",
        "\"The physical pain you can handle, it is the mental challenges that bring it – not making money, not knowing who you are and if you are going to be able to get that back.\"",
        "While thrilled to be back in action, Aitken believes \"it is going to be apparent very quickly whether I am going to be able to compete at the level I am used to or not\".",
        "\"I will know within about six to eight months,\" she explained. \"I will be very honest, if I am not feeling like I can compete at a level I am happy with, I will call it a day.",
        "\"I have goals of being the Scottish number one again. We have the Commonwealth Games in two years' time, hopefully squash can be included in Glasgow.",
        "\"Then, not beating around the bush, we have been included in the Olympics for the first time in LA '28.",
        "\"I will be 38, that is a very long shot of a target but so long as I am healthy and if the season goes well this year, that may become a target for me.",
        "\"I was out in my mid-20s for two-and-a-half years with the effects of Dengue fever and I have now been out for a couple of years with this knee injury, so I feel like even though I am 34, I have years in the bank that are unused.\"",
        "And the Scot has opened up on her decision to put her dreams of becoming a parent on hold while she bids to try and turn those of the Olympic variety in to reality.",
        "\"I think probably the team would be decided quite a while out from LA 28 so maybe early 2027 I would know by then so it is honestly not too long away, but you put everything into this sport, it would be crazy not to give the Olympics a shot,\" she added.",
        "\"A lot will depend how this first couple of seasons go back on tour that will give me a realistic idea of whether or not I can compete for a spot.",
        "\"First and foremost for me is, is that going to be an achievable goal based on this rehab I have gone through? If so, of course those conversations will be had around, for example, freezing eggs and saving motherhood for later down the line.",
        "\"I think 37, 38 is young to still become a mum for the first time and it is also doable to be an athlete, you either strive and leave no stone unturned and become and Olympian, which is pretty cool, or you don’t and you have peace over knowing you gave it absolutely everything or you become a mum and both those things are really quite cool.\""
      ]
    },
    {
      "url": "https://www.bbc.com/sport/squash/articles/c4gd313j7x5o",
      "main_category": "sport",
      "detailed_category": "squash",
      "topic": "Makin crowned British champion",
      "content": [
        "Joel Makin beat Mohamed ElShorbagy in a five-game thriller to win his second men's British title.The 29-year-old Welshman saw off the number one seed and defending champion 8-11, 15-13, 11-3, 8-11, 11-2 in Weybridge.British number one Georgina Kennedy was crowned women's British champion for the first time after beating three-time champion Sarah-Jane Perry.Perry won the title in 2015, 2020 and 2021 but lost 11-9, 11-8, 9-11, 11-9 to Kennedy, with the world number six avenging her loss in that 2021 final.",
        "Joel Makin first won the British title in 2021",
        "Joel Makin beat Mohamed ElShorbagy in a five-game thriller to win his second men's British title.",
        "The 29-year-old Welshman saw off the number one seed and defending champion 8-11, 15-13, 11-3, 8-11, 11-2 in Weybridge.",
        "British number one Georgina Kennedy was crowned women's British champion for the first time after beating three-time champion Sarah-Jane Perry.",
        "Perry won the title in 2015, 2020 and 2021 but lost 11-9, 11-8, 9-11, 11-9 to Kennedy, with the world number six avenging her loss in that 2021 final."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/articles/c6p2qm2gv97o",
      "main_category": "sport",
      "detailed_category": "squash",
      "topic": "Isle of Man confirmed as 2029 Island Games host",
      "content": [
        "The Isle of Man has been confirmed as the host of the Island Games in 2029.There was unanimous backing for the Manx bid at the International Island Games Association's annual general meeting at the weekend.The gathering also saw the Faroe Islands cemented as hosts in 2027, following the withdrawal of Ynys Mon in December.Interim chairman of the association Andrew Inkster said the games had “grown steadily” since first being held in 1985 and he was confident the Isle of Man would build on that success.The Manx branch of the association hosted those inaugural games and again welcomed athletes from other small islands in 2001.Education, Sport and Culture Minister Daphne Caine previously said about £1.9m would need to be spent to improve facilities ahead of 2029.Welcoming the official confirmation of the Manx bid, Ms Caine said: “I am confident that the Isle of Man will deliver a games to remember.”",
        "The Isle of Man made its bid to host the games during the last event, held in Guernsey a year ago.Sports included in the 2029 games will be archery, athletics, badminton, basketball, cycling, football, golf, gymnastics, squash, swimming, table-tennis, tennis, triathlon and volleyball.Mr Inkster said: “We are delighted to see these future Host Island arrangements confirmed… and we look forward to seeing more progress in their arrangements.“With a number of other member islands also showing serious interest in becoming a host, we are confident that our games are secure for the future.\"Gotland in Sweden, which hosted the event in 1999 and 2017, was confirmed as the preferred bidder for the 2031 iteration of the games.",
        "The Isle of Man team claimed a total of 63 medals when the games were held in Guernsey in 2023",
        "The Isle of Man has been confirmed as the host of the Island Games in 2029.",
        "There was unanimous backing for the Manx bid at the International Island Games Association's annual general meeting at the weekend.",
        "The gathering also saw the Faroe Islands cemented as hosts in 2027, following the withdrawal of Ynys Mon in December.",
        "Interim chairman of the association Andrew Inkster said the games had “grown steadily” since first being held in 1985 and he was confident the Isle of Man would build on that success.",
        "The Manx branch of the association hosted those inaugural games and again welcomed athletes from other small islands in 2001.",
        "Education, Sport and Culture Minister Daphne Caine previously said about £1.9m would need to be spent to improve facilities ahead of 2029.",
        "Welcoming the official confirmation of the Manx bid, Ms Caine said: “I am confident that the Isle of Man will deliver a games to remember.”",
        "Andrew Inkster (second left) welcomed a delegation from the Isle of Man at the association's AGM",
        "The Isle of Man made its bid to host the games during the last event, held in Guernsey a year ago.",
        "Sports included in the 2029 games will be archery, athletics, badminton, basketball, cycling, football, golf, gymnastics, squash, swimming, table-tennis, tennis, triathlon and volleyball.",
        "Mr Inkster said: “We are delighted to see these future Host Island arrangements confirmed… and we look forward to seeing more progress in their arrangements.",
        "“With a number of other member islands also showing serious interest in becoming a host, we are confident that our games are secure for the future.\"",
        "Gotland in Sweden, which hosted the event in 1999 and 2017, was confirmed as the preferred bidder for the 2031 iteration of the games.",
        "Shooters left disappointed as sport axed from games",
        "Sports in Manx 2029 Island Games bid revealed",
        "Pledge to improve Manx facilities for Island Games",
        "Official bid to bring Games back to Manx soil",
        "International Island Games Association"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/squash/articles/cv22vq02vw8o",
      "main_category": "sport",
      "detailed_category": "squash",
      "topic": "Makin run ends in British Open semis",
      "content": [
        "Joel Makin was beaten by world number one Ali Farag in the semi-finals of the British Open in Birmingham.Makin had produced a memorable run to reach the last four, claiming a stunning victory over world champion Diego Elias in the quarter-finals.But there was no repeat against the impressive Farag, who triumphed with a 11-3, 11-9, 11-7 scoreline.Makin, 29, was the first Welshman to reach the semi-finals of the prestigious event since David Evans was crowned champion in 2000.Makin had produced one of his finest displays against Elias, who he beat 11-9, 11-9, 4-11, 11-8 at the Birmingham Rep Theatre.Before this week, Birmingham-based Makin had not recorded a single win at the British Open despite appearing every year since 2017.",
        "Joel Makin is the first Welshman to reach the British Open semis since David Evans won the tournament in 2000",
        "Joel Makin was beaten by world number one Ali Farag in the semi-finals of the British Open in Birmingham.",
        "Makin had produced a memorable run to reach the last four, claiming a stunning victory over world champion Diego Elias in the quarter-finals.",
        "But there was no repeat against the impressive Farag, who triumphed with a 11-3, 11-9, 11-7 scoreline.",
        "Makin, 29, was the first Welshman to reach the semi-finals of the prestigious event since David Evans was crowned champion in 2000.",
        "Makin had produced one of his finest displays against Elias, who he beat 11-9, 11-9, 4-11, 11-8 at the Birmingham Rep Theatre.",
        "Before this week, Birmingham-based Makin had not recorded a single win at the British Open despite appearing every year since 2017.",
        "British Open will showcase city, squash player says",
        "'Am I going to need the bathroom?'",
        "England men win European team squash gold"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/squash/articles/c0344lj73z4o",
      "main_category": "sport",
      "detailed_category": "squash",
      "topic": "'Am I going to need the bathroom?'",
      "content": [
        "Georgina Kennedy spends her pre-match warm-ups asking herself one question: \"Am I going to need the bathroom?\"England’s number one squash player has been forced to skip tournaments because of heavy bleeding and \"excruciating\" pain from a condition that means she passes stools “30 to 40 times a day”.In 2022, she became the first Englishwoman to win a Commonwealth Games singles title, but off the court her struggle with ulcerative colitis - a form of inflammatory bowel disease (IBD) - has been holding her back.\"When it’s bad, you’re bed-bound,\" Kennedy, 27, told BBC Sport.\"You can’t go on a walk because obviously you're passing stools all the time so it's pretty debilitating.\"She has been battling the condition for eight years but her symptoms worsened after the Commonwealth Games two years ago in Birmingham.\"With the magnitude of the event and the emotions that came with it... it's been really difficult to get under control, in and out of hospital visits,\" she said.\"I had to pull out of a few events when it was really bad.\"",
        "Travelling the world for tournaments is particularly difficult, especially when sometimes she might not even make a 30-minute drive without needing the toilet.And she finds the condition can be \"quite isolating\".\"I can’t leave my room, because I’m too anxious about what’s going to happen,\" Kennedy said.\"So sharing rooms becomes incredibly stressful.\"If I’m going out for dinner with my friends, I often have to say I can't go.\"The NHS, external defines ulcerative colitis as a long-term autoimmune condition in which the colon and rectum become inflamed, with symptoms including stomach pains and frequent bowel movements.A UK Crohn's and Colitis charity reported that at least one in every 227 people in the UK has been diagnosed with ulcerative colitis, most often people between the ages of 15 and 25.Often, those diagnosed can have 'flare-ups' when the symptoms are worse for a period of time.Kennedy, who has 11 PSA Tour titles, says the condition has had a \"massive effect\" on her career but has never made her want to quit.\"There's always light at the end of the tunnel,\" said Kennedy, who is currently ranked at a career-high sixth in the world.\"There are people who can perform to the best of their abilities and reach the top level with these diseases.\"Other athletes have discussed their experiences of ulcerative colitis, including Olympic swimmer Siobhan Marie O'Connor, who retired because of the condition, and Exeter City footballer Jack Fitzwater.",
        "Kennedy aims to be ranked in the top five in the world one day, and she is focused on winning an Olympic medal.The England number one said squash's inclusion in the 2028 Los Angeles summer Olympics will be \"game-changing\".\"I think in every possible way it’s going to be a huge, huge benefit for squash,\"  Kennedy told BBC Sport.She added that Olympic inclusion will \"increase the popularity\" of the sport and \"100% improve it\".\"More people are going to be aware of it, more people are going to have eyes on it and understand it,\" she said.Kennedy also hopes it will funnel more junior players to the game and \"keep those kids in it for as long as possible\".\"It's been a big goal of mine,\" said sixth-ranked Kennedy on breaking into the top five.She has already beaten the world's fourth-ranked player, Belgium's Nele Gilis, to secure her German Open victory, and Egypt's Nour El Tayeb, who is ranked fifth.And Kennedy said she will \"keep chipping away\" at her goal to achieve a \"big win\" against one of the top three - the Egyptian trio of Nour El Sherbini, Nouran Gohar and Hania El Hammamy.Kennedy's next tournament will be the Manchester Open, which takes place from 22-26 May.",
        "Georgina Kennedy is the first Englishwoman to win a Commonwealth Games squash  medal",
        "Georgina Kennedy spends her pre-match warm-ups asking herself one question: \"Am I going to need the bathroom?\"",
        "England’s number one squash player has been forced to skip tournaments because of heavy bleeding and \"excruciating\" pain from a condition that means she passes stools “30 to 40 times a day”.",
        "In 2022, she became the first Englishwoman to win a Commonwealth Games singles title, but off the court her struggle with ulcerative colitis - a form of inflammatory bowel disease (IBD) - has been holding her back.",
        "\"When it’s bad, you’re bed-bound,\" Kennedy, 27, told BBC Sport.",
        "\"You can’t go on a walk because obviously you're passing stools all the time so it's pretty debilitating.\"",
        "She has been battling the condition for eight years but her symptoms worsened after the Commonwealth Games two years ago in Birmingham.",
        "\"With the magnitude of the event and the emotions that came with it... it's been really difficult to get under control, in and out of hospital visits,\" she said.",
        "\"I had to pull out of a few events when it was really bad.\"",
        "Kennedy won the 2024 German Open earlier this year",
        "Travelling the world for tournaments is particularly difficult, especially when sometimes she might not even make a 30-minute drive without needing the toilet.",
        "And she finds the condition can be \"quite isolating\".",
        "\"I can’t leave my room, because I’m too anxious about what’s going to happen,\" Kennedy said.",
        "\"So sharing rooms becomes incredibly stressful.",
        "\"If I’m going out for dinner with my friends, I often have to say I can't go.\"",
        "The NHS, external defines ulcerative colitis as a long-term autoimmune condition in which the colon and rectum become inflamed, with symptoms including stomach pains and frequent bowel movements.",
        "A UK Crohn's and Colitis charity reported that at least one in every 227 people in the UK has been diagnosed with ulcerative colitis, most often people between the ages of 15 and 25.",
        "Often, those diagnosed can have 'flare-ups' when the symptoms are worse for a period of time.",
        "Kennedy, who has 11 PSA Tour titles, says the condition has had a \"massive effect\" on her career but has never made her want to quit.",
        "\"There's always light at the end of the tunnel,\" said Kennedy, who is currently ranked at a career-high sixth in the world.",
        "\"There are people who can perform to the best of their abilities and reach the top level with these diseases.\"",
        "Other athletes have discussed their experiences of ulcerative colitis, including Olympic swimmer Siobhan Marie O'Connor, who retired because of the condition, and Exeter City footballer Jack Fitzwater.",
        "Squash will be included in the Olympic Games from 2028",
        "Kennedy aims to be ranked in the top five in the world one day, and she is focused on winning an Olympic medal.",
        "The England number one said squash's inclusion in the 2028 Los Angeles summer Olympics will be \"game-changing\".",
        "\"I think in every possible way it’s going to be a huge, huge benefit for squash,\"  Kennedy told BBC Sport.",
        "She added that Olympic inclusion will \"increase the popularity\" of the sport and \"100% improve it\".",
        "\"More people are going to be aware of it, more people are going to have eyes on it and understand it,\" she said.",
        "Kennedy also hopes it will funnel more junior players to the game and \"keep those kids in it for as long as possible\".",
        "\"It's been a big goal of mine,\" said sixth-ranked Kennedy on breaking into the top five.",
        "She has already beaten the world's fourth-ranked player, Belgium's Nele Gilis, to secure her German Open victory, and Egypt's Nour El Tayeb, who is ranked fifth.",
        "And Kennedy said she will \"keep chipping away\" at her goal to achieve a \"big win\" against one of the top three - the Egyptian trio of Nour El Sherbini, Nouran Gohar and Hania El Hammamy.",
        "Kennedy's next tournament will be the Manchester Open, which takes place from 22-26 May."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/squash/articles/c72p7wm1kw7o",
      "main_category": "sport",
      "detailed_category": "squash",
      "topic": "Scots men win promotion as women finish fifth in top Euro tier",
      "content": [
        "Scotland’s women finished fifth in Division 1 while their men's team have won promotion back to the top tier at the first time of asking after winning their Division 2 at the European Team Squash Championships.Scottish Squash elite performance coach Paul Bell concluded that \"it has been a great event\" for his team in Switzerland.The men, relegated last year, defeated Portugal, Poland, Denmark and Israel convincingly en route to their final against Hungary.Scottish number one Greg Lobban secured a notable win over world number 44 Farkas Balasz, while fellow Inverness players Alasdair Prott and Martin Ross also won their ties.Scotland’s women recorded wins over the hosts, Czech Republic and Spain before beating the latter opponents again in the fifth-sixth place play-off, with Georgia Adderley and Katriona Ross winning their matches.\"The women’s team have done brilliantly,\" Bell added. \"It was always going to be tough for them in Division 1, but they’ve shown that they belong here.\"",
        "Martin Ross completed Scotland's crucial win over Hungary",
        "Scotland’s women finished fifth in Division 1 while their men's team have won promotion back to the top tier at the first time of asking after winning their Division 2 at the European Team Squash Championships.",
        "Scottish Squash elite performance coach Paul Bell concluded that \"it has been a great event\" for his team in Switzerland.",
        "The men, relegated last year, defeated Portugal, Poland, Denmark and Israel convincingly en route to their final against Hungary.",
        "Scottish number one Greg Lobban secured a notable win over world number 44 Farkas Balasz, while fellow Inverness players Alasdair Prott and Martin Ross also won their ties.",
        "Scotland’s women recorded wins over the hosts, Czech Republic and Spain before beating the latter opponents again in the fifth-sixth place play-off, with Georgia Adderley and Katriona Ross winning their matches.",
        "\"The women’s team have done brilliantly,\" Bell added. \"It was always going to be tough for them in Division 1, but they’ve shown that they belong here.\""
      ]
    },
    {
      "url": "https://www.bbc.com/sport/squash/articles/c4n14z814r7o",
      "main_category": "sport",
      "detailed_category": "squash",
      "topic": "England men win European team squash gold",
      "content": [
        "Marwan ElShorbagy proved the hero as England's men won gold at the European Squash Team Championships with victory over France.With England trailing 2-1 in the final in Switzerland, ElShorbagy - who last year followed older brother Mohamed in switching allegiance from Egypt to England - won the deciding match 3-1.It sealed an 8-7 win for England on games countback after Mohamed ElShorbagy had won his match, but team-mates Curtis Malik and Tom Walsh had lost theirs.In the women's final, England won silver after being beaten 2-1 by Belgium, denying them a 41st title from 43 championships.“I want to thank my team. Each one of us had a job to do this week and we did that and more, so I’m very proud of all of them,\" said England men's captain and former world number one Mohamed ElShorbagy. \"This year we came with a younger team and had many challenges thrown our way, but credit to the team for coming through them and defending the title.”",
        "Victory marked England's 44th men's title at the European Squash  Team Championships",
        "Marwan ElShorbagy proved the hero as England's men won gold at the European Squash Team Championships with victory over France.",
        "With England trailing 2-1 in the final in Switzerland, ElShorbagy - who last year followed older brother Mohamed in switching allegiance from Egypt to England - won the deciding match 3-1.",
        "It sealed an 8-7 win for England on games countback after Mohamed ElShorbagy had won his match, but team-mates Curtis Malik and Tom Walsh had lost theirs.",
        "In the women's final, England won silver after being beaten 2-1 by Belgium, denying them a 41st title from 43 championships.",
        "“I want to thank my team. Each one of us had a job to do this week and we did that and more, so I’m very proud of all of them,\" said England men's captain and former world number one Mohamed ElShorbagy.",
        "\"This year we came with a younger team and had many challenges thrown our way, but credit to the team for coming through them and defending the title.”"
      ]
    }
  ]
}