{
  "scraped_at": "2025-10-27T18:56:59.820545",
  "total_articles": 11,
  "category": "triathlon",
  "articles_per_category": 100,
  "articles": [
    {
      "url": "https://www.bbc.com/sport/triathlon/articles/czxn5zwn7r1o",
      "main_category": "sport",
      "detailed_category": "triathlon",
      "topic": "Tertsch beats Britain's Potter to world title",
      "content": [
        "Lisa Tertsch claimed the world triathlon title for the first time as Great Britain's Beth Potter had to settle for third place in the overall standings.Tertsch won gold in the World Triathlon Championship finals in Wollongong, Australia, with a time of one hour 56 minutes 50 seconds.The 26-year-old German finished 14 seconds clear of Italy's Bianca Seregni, with  France's Emma Lombardi a further 12 seconds back.Tertsch collected 1,250 points for winning the event, which took her overall tally to 3886.26 as she leapfrogged defending champion Cassandre Beaugrand (3577.04) of France and Potter (3313.18) into top spot.Olympic bronze medal winner Potter was bidding to win the title for a second time, following victory in 2023, but could only finish 16th in the final event.The 33-year-old Scot was joint leader with Beaugrand before the event began but Tertsch, who had been fourth, produced a superb performance to seal victory. Beaugrand lost ground early in the 10km run, in hot and blustery conditions, while Potter failed to keep pace with the leading pack - which allowed Tertsch to cash in as she excelled on a steep course.In the men's event, Australian Matt Hauser capped a dominant season as he won gold in a time of 1:42:42 to clinch his first world title success.Hauser finished with 4,250 points, comfortably clear of Brazil's Miguel Hidalgo and Portugal's Vasco Vilaca.",
        "Lisa Tertsch was part of the Germany team which won gold in the triathlon mixed relay event at Paris 2024",
        "Lisa Tertsch claimed the world triathlon title for the first time as Great Britain's Beth Potter had to settle for third place in the overall standings.",
        "Tertsch won gold in the World Triathlon Championship finals in Wollongong, Australia, with a time of one hour 56 minutes 50 seconds.",
        "The 26-year-old German finished 14 seconds clear of Italy's Bianca Seregni, with  France's Emma Lombardi a further 12 seconds back.",
        "Tertsch collected 1,250 points for winning the event, which took her overall tally to 3886.26 as she leapfrogged defending champion Cassandre Beaugrand (3577.04) of France and Potter (3313.18) into top spot.",
        "Olympic bronze medal winner Potter was bidding to win the title for a second time, following victory in 2023, but could only finish 16th in the final event.",
        "The 33-year-old Scot was joint leader with Beaugrand before the event began but Tertsch, who had been fourth, produced a superb performance to seal victory.",
        "Beaugrand lost ground early in the 10km run, in hot and blustery conditions, while Potter failed to keep pace with the leading pack - which allowed Tertsch to cash in as she excelled on a steep course.",
        "In the men's event, Australian Matt Hauser capped a dominant season as he won gold in a time of 1:42:42 to clinch his first world title success.",
        "Hauser finished with 4,250 points, comfortably clear of Brazil's Miguel Hidalgo and Portugal's Vasco Vilaca."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/triathlon/articles/cn40yge0gkzo",
      "main_category": "sport",
      "detailed_category": "triathlon",
      "topic": "Potter eyes world title after 'toll' of Olympics",
      "content": [
        "Beth Potter says she has felt less pressure this year as she seeks to clinch a second world triathlon title on Sunday.The British Olympic bronze medallist is joint leader with defending champion Cassandre Beaugrand of France before the final event in Australia.Potter admitted the build-up to the 2024 Paris Olympics and event itself took its toll.\"I was going in as one of the favourites to win Olympic gold and there was a lot of pressure and expectation on that one day,\" said the Scottish triathlete, 33.\"It was really hard and I felt like I could never really get into my groove last year.\"I struggled when I got off the bike to feel like myself running and it was really frustrating as there was no reason for it, because it wasn't like that in training.\"It just shows how much pressure I put on myself that year to come away with a medal. I don't think I've ever dug as deep as I did in that Olympic race to get that medal and it meant so much to me to just get the bronze.\"She won the World Triathlon Championship Series from Beaugrand in 2023 before roles were reversed last year.Potter has tried a new coaching set-up this year and spent nearly a month at altitude in the Swiss alpine resort of St Moritz.\"I just never found any part of my running easy last year and that was the one thing I always relied on to get myself out of trouble in races. It took me longer than I thought to recover off the back of that Olympic race,\" she said.\"Even just to enjoy doing triathlons again, it took me a good few months of off-season and getting back into the new season to actually think I wanted to be on the start line and race, and enjoy it. That was quite hard for me as it's my job, my livelihood.\"It's taken me a bit of time at the start of the year to get to grips with some new training and part of it was mentally getting over the toll last year took on my mind and body. I'm really enjoying the new training methods and trying something a little different. It's the lowest risk year to try something.\"Potter is tied with Olympic champion Beaugrand on 2,925 points but insists Sunday's finale in Wollangong is \"not a two-horse-race.There is a gap of more than 200 points to the chasing pack led by Jeanne Lehair, ahead of Lisa Tertsch and Leonie Periault, with 1,250 points on offer to the winner in Australia.The Scot will be cheered on by several family members - including two aunts who live nearby - as she takes on the 1.5km swim, 40km bike ride and 10km run.",
        "When Potter is pushing to cross the line, she will remember her friend Sam O'Shea. He died after being hit by a motorbike while cycling in France last month.She found motivation in the tragedy just days after it happened when victorious in the Czech Republic, the first of two race wins this season.\"When I was really hurting in that race and was a minute behind coming off the bike, a big part of it was to do it because I could and there was some extra motivation because of Sam,\" she said.\"It would be nice to do the same this weekend, but I just want to go out and enjoy it because I am able to.\"O'Shea, 27, the partner of fellow triathlete Lucy Byram, represented Gibraltar at the 2022 Commonwealth Games and was part of the triathlon squad in Leeds where Potter is based.\"It was a hard couple of days leading into that race. Sam was quite a big part of our training group. He was one of the coaches poolside, a bike mechanic who often sorted my bikes out. I spent many happy mornings on cafe rides with him,\" she said.\"He was very dry, fun to be around. He was a great support, kind, generous and would go out of his way to help other people. He is going be very much missed.\"It was emotional for me, for the rest of the team, just seeing how devastating it had been, especially for his loved ones. It was really tragic.\"It made me realise life is really precious and you only get one shot.\"After the weekend, Potter is setting no immediate targets although the 2028 Los Angeles Olympics is likely to be a long-term goal.\"I'm taking one season at a time. I'll get Sunday out of the way first,\" she said.\"I've achieved more than I thought I would in this sport. Nothing will match the level of pressure I felt last year. It almost seems like a bit of a relief for it to be 2025.\"I've enjoyed my racing this year. Hopefully I can hang on to that form for a couple of days.\"",
        "Potter is a former 10,000m runner who switched to triathlon",
        "Beth Potter says she has felt less pressure this year as she seeks to clinch a second world triathlon title on Sunday.",
        "The British Olympic bronze medallist is joint leader with defending champion Cassandre Beaugrand of France before the final event in Australia.",
        "Potter admitted the build-up to the 2024 Paris Olympics and event itself took its toll.",
        "\"I was going in as one of the favourites to win Olympic gold and there was a lot of pressure and expectation on that one day,\" said the Scottish triathlete, 33.",
        "\"It was really hard and I felt like I could never really get into my groove last year.",
        "\"I struggled when I got off the bike to feel like myself running and it was really frustrating as there was no reason for it, because it wasn't like that in training.",
        "\"It just shows how much pressure I put on myself that year to come away with a medal. I don't think I've ever dug as deep as I did in that Olympic race to get that medal and it meant so much to me to just get the bronze.\"",
        "She won the World Triathlon Championship Series from Beaugrand in 2023 before roles were reversed last year.",
        "Potter has tried a new coaching set-up this year and spent nearly a month at altitude in the Swiss alpine resort of St Moritz.",
        "\"I just never found any part of my running easy last year and that was the one thing I always relied on to get myself out of trouble in races. It took me longer than I thought to recover off the back of that Olympic race,\" she said.",
        "\"Even just to enjoy doing triathlons again, it took me a good few months of off-season and getting back into the new season to actually think I wanted to be on the start line and race, and enjoy it. That was quite hard for me as it's my job, my livelihood.",
        "\"It's taken me a bit of time at the start of the year to get to grips with some new training and part of it was mentally getting over the toll last year took on my mind and body. I'm really enjoying the new training methods and trying something a little different. It's the lowest risk year to try something.\"",
        "Potter is tied with Olympic champion Beaugrand on 2,925 points but insists Sunday's finale in Wollangong is \"not a two-horse-race.",
        "There is a gap of more than 200 points to the chasing pack led by Jeanne Lehair, ahead of Lisa Tertsch and Leonie Periault, with 1,250 points on offer to the winner in Australia.",
        "The Scot will be cheered on by several family members - including two aunts who live nearby - as she takes on the 1.5km swim, 40km bike ride and 10km run.",
        "Potter wins to share overall World Triathlon lead",
        "Not good enough for athletics medal, but Potter proves good enough in triathlon",
        "'Eight years ago today, I was sat on the Copacabana hating athletics'",
        "Potter was third behind gold medal winner Beaugrand and Switzerland's Julie Derron in the individual triathlon at the 2024 Olympics",
        "When Potter is pushing to cross the line, she will remember her friend Sam O'Shea. He died after being hit by a motorbike while cycling in France last month.",
        "She found motivation in the tragedy just days after it happened when victorious in the Czech Republic, the first of two race wins this season.",
        "\"When I was really hurting in that race and was a minute behind coming off the bike, a big part of it was to do it because I could and there was some extra motivation because of Sam,\" she said.",
        "\"It would be nice to do the same this weekend, but I just want to go out and enjoy it because I am able to.\"",
        "O'Shea, 27, the partner of fellow triathlete Lucy Byram, represented Gibraltar at the 2022 Commonwealth Games and was part of the triathlon squad in Leeds where Potter is based.",
        "\"It was a hard couple of days leading into that race. Sam was quite a big part of our training group. He was one of the coaches poolside, a bike mechanic who often sorted my bikes out. I spent many happy mornings on cafe rides with him,\" she said.",
        "\"He was very dry, fun to be around. He was a great support, kind, generous and would go out of his way to help other people. He is going be very much missed.",
        "\"It was emotional for me, for the rest of the team, just seeing how devastating it had been, especially for his loved ones. It was really tragic.",
        "\"It made me realise life is really precious and you only get one shot.\"",
        "After the weekend, Potter is setting no immediate targets although the 2028 Los Angeles Olympics is likely to be a long-term goal.",
        "\"I'm taking one season at a time. I'll get Sunday out of the way first,\" she said.",
        "\"I've achieved more than I thought I would in this sport. Nothing will match the level of pressure I felt last year. It almost seems like a bit of a relief for it to be 2025.",
        "\"I've enjoyed my racing this year. Hopefully I can hang on to that form for a couple of days.\""
      ]
    },
    {
      "url": "https://www.bbc.com/sport/articles/c9q1ll85y3yo",
      "main_category": "sport",
      "detailed_category": "triathlon",
      "topic": "Briton Conway crowned U23 triathlon world champion",
      "content": [
        "Britain's Oliver Conway has won the men's Under-23 World Triathlon Championship title after cruising to victory in Wollongong, Australia.Making his debut in the finals, the 20-year-old demolished the field by crossing the line in one hour 42 minutes and 54 seconds.Conway finished 99 seconds clear of second-placed Hungarian Marton Kropko and Euan de Nigro of Italy in third.After a strong swim and cycle, Conway stayed in touch and ran an incredible 10km of 29:35 to cap off a superb performance.Five Britons competed in the race in Australia, with Jack Stanton-Stock next highest in 16th.Conway said after his victory: \"I don't think the race could have gone any better. Race-by-race this season I've just been gaining confidence, it's great to see it all coming together.\"Britain won medals in the men's and women's triathlon at the Paris 2024 Olympics, with Alex Yee taking gold and Beth Potter clinching bronze.In the senior female finale on Sunday, Potter will win the world title if she finishes ahead of defending champion Cassandre Beaugrand - last year's Olympic gold medallist - assuming they are both on the podium.",
        "Oliver Conway is ranked 37th in the world",
        "Britain's Oliver Conway has won the men's Under-23 World Triathlon Championship title after cruising to victory in Wollongong, Australia.",
        "Making his debut in the finals, the 20-year-old demolished the field by crossing the line in one hour 42 minutes and 54 seconds.",
        "Conway finished 99 seconds clear of second-placed Hungarian Marton Kropko and Euan de Nigro of Italy in third.",
        "After a strong swim and cycle, Conway stayed in touch and ran an incredible 10km of 29:35 to cap off a superb performance.",
        "Five Britons competed in the race in Australia, with Jack Stanton-Stock next highest in 16th.",
        "Conway said after his victory: \"I don't think the race could have gone any better. Race-by-race this season I've just been gaining confidence, it's great to see it all coming together.\"",
        "Britain won medals in the men's and women's triathlon at the Paris 2024 Olympics, with Alex Yee taking gold and Beth Potter clinching bronze.",
        "In the senior female finale on Sunday, Potter will win the world title if she finishes ahead of defending champion Cassandre Beaugrand - last year's Olympic gold medallist - assuming they are both on the podium."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/triathlon/articles/cx202197l1zo",
      "main_category": "sport",
      "detailed_category": "triathlon",
      "topic": "GB's Matthews second at Ironman World Championship",
      "content": [
        "Britain's Kat Matthews claimed silver at the World Ironman Championship, but compatriot Lucy Charles-Barclay was forced to pull out while leading as competitors battled sweltering conditions in Kona, Hawaiʻi.Matthews benefited from the late withdrawals of Charles-Barclay and American Taylor Knibb to finish second behind Norway's Solveig Lovseth, who claimed her first Ironman world title.Charles-Barclay, the 2023 champion, was leading after 10 miles of the marathon but visibly began to struggle as temperatures pushed 28C with 70% humidity.She eventually pulled out with about nine miles remaining after consulting with her husband at the side of the road.That seemingly left the path clear for Knibb to take the title, but the 27-year-old withdrew with four miles left, sitting down on the tarmac as Lovseth and Matthews ran past her.Matthews finished strongly and completed the marathon in a course record two hours, 47 minutes, but it was not enough to reel in Lovseth.The Norwegian crossed the line in a time of eight hours, 28 minutes and 27 seconds, with Matthews just 35 seconds behind for her third Ironman silver medal. Germany's Laura Philipp was more than eight minutes further back in third.\"I worked really hard and I'm very proud of my finish,\" said Matthews. \"I'm happy for Solveig, she was incredible to watch. I had a very up and down day.\"The Ironman course consists of a 2.4-mile (3.8 km) swim, 112 miles (180 km) cycling  and the final marathon, which is 26.2 miles (42.2 km), for a total distance of 140.6 miles.Meanwhile, the men's and women's World Championships will reunify in 2026 after three years as separate events.The Championships were split in 2023 to ease entry back-logs caused by the Covid-19 pandemic.",
        "Kat Matthews has now finished second at three Ironman World Championships",
        "Britain's Kat Matthews claimed silver at the World Ironman Championship, but compatriot Lucy Charles-Barclay was forced to pull out while leading as competitors battled sweltering conditions in Kona, Hawaiʻi.",
        "Matthews benefited from the late withdrawals of Charles-Barclay and American Taylor Knibb to finish second behind Norway's Solveig Lovseth, who claimed her first Ironman world title.",
        "Charles-Barclay, the 2023 champion, was leading after 10 miles of the marathon but visibly began to struggle as temperatures pushed 28C with 70% humidity.",
        "She eventually pulled out with about nine miles remaining after consulting with her husband at the side of the road.",
        "That seemingly left the path clear for Knibb to take the title, but the 27-year-old withdrew with four miles left, sitting down on the tarmac as Lovseth and Matthews ran past her.",
        "Matthews finished strongly and completed the marathon in a course record two hours, 47 minutes, but it was not enough to reel in Lovseth.",
        "The Norwegian crossed the line in a time of eight hours, 28 minutes and 27 seconds, with Matthews just 35 seconds behind for her third Ironman silver medal. Germany's Laura Philipp was more than eight minutes further back in third.",
        "\"I worked really hard and I'm very proud of my finish,\" said Matthews. \"I'm happy for Solveig, she was incredible to watch. I had a very up and down day.\"",
        "The Ironman course consists of a 2.4-mile (3.8 km) swim, 112 miles (180 km) cycling  and the final marathon, which is 26.2 miles (42.2 km), for a total distance of 140.6 miles.",
        "Meanwhile, the men's and women's World Championships will reunify in 2026 after three years as separate events.",
        "The Championships were split in 2023 to ease entry back-logs caused by the Covid-19 pandemic."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/triathlon/articles/c0q74544n73o",
      "main_category": "sport",
      "detailed_category": "triathlon",
      "topic": "Potter wins to share overall World Triathlon lead",
      "content": [
        "Britain's Beth Potter claimed her second gold in two weeks to become joint leader in the World Triathlon Championship series.After claiming her first 2025 gold in the Czech Republic, the 33-year-old's second successive win in Weihai, China, puts pressure on 2024 series champion Cassandre Beaugrand of France, with the pair tied on 2925 points.No one in the women's section apart from Potter and Beaugrand has topped the podium twice this series, meaning their fates lie in their own hands as they head into the grand final in Wollagong, Australia next month.Potter took the finish tape 16 seconds ahead of second and third-placed German duo Lisa Tertsch and Tanja Neubert, after quickly building a gap at the front during the first of four laps of the 10km run.",
        "The Paris 2024 double bronze medallist held the lead, allowing her to ease off for the victory lap and comfortably cross for her second series gold. \"I'm just thinking about myself, about my race processes and I'm really happy with that,\" Potter said.\"I don't take winning for granted so it's great to back up my win in Karlovy just 12 days later.\"I'm feeling quietly confident and good in myself, trusting the training and it's coming good.\"In hot, humid conditions in Weihai, Potter's compatriot Sophie Alden earned a sixth-place finish on her debut at this level while in the men's race, Jack Willis and Connor Bentley ran in 11th and 13th respectively for Great Britain.\"Beth once again delivered a masterclass and showed that she's getting right back to her very best,\" British Triathlon performance director Mike Cavendish said.The 2025 World Triathlon Championship series will conclude in Australia on 15 October.",
        "Beth Potter won the 2023 World Triathlon Championship series",
        "Britain's Beth Potter claimed her second gold in two weeks to become joint leader in the World Triathlon Championship series.",
        "After claiming her first 2025 gold in the Czech Republic, the 33-year-old's second successive win in Weihai, China, puts pressure on 2024 series champion Cassandre Beaugrand of France, with the pair tied on 2925 points.",
        "No one in the women's section apart from Potter and Beaugrand has topped the podium twice this series, meaning their fates lie in their own hands as they head into the grand final in Wollagong, Australia next month.",
        "Potter took the finish tape 16 seconds ahead of second and third-placed German duo Lisa Tertsch and Tanja Neubert, after quickly building a gap at the front during the first of four laps of the 10km run.",
        "Turner returning home to race in Jersey Marathon",
        "The Paris 2024 double bronze medallist held the lead, allowing her to ease off for the victory lap and comfortably cross for her second series gold.",
        "\"I'm just thinking about myself, about my race processes and I'm really happy with that,\" Potter said.",
        "\"I don't take winning for granted so it's great to back up my win in Karlovy just 12 days later.",
        "\"I'm feeling quietly confident and good in myself, trusting the training and it's coming good.\"",
        "In hot, humid conditions in Weihai, Potter's compatriot Sophie Alden earned a sixth-place finish on her debut at this level while in the men's race, Jack Willis and Connor Bentley ran in 11th and 13th respectively for Great Britain.",
        "\"Beth once again delivered a masterclass and showed that she's getting right back to her very best,\" British Triathlon performance director Mike Cavendish said.",
        "The 2025 World Triathlon Championship series will conclude in Australia on 15 October."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/triathlon/articles/cz08n93dy8eo",
      "main_category": "sport",
      "detailed_category": "triathlon",
      "topic": "Turner returning home to race in Jersey Marathon",
      "content": [
        "Triathlete Ollie Turner said he is excited to be racing in Jersey for the first time in four years.The 26-year-old will compete in next month's Jersey Marathon as he prepares to race his first full-length Ironman event in December.Turner, who competed for the island at the last Commonwealth Games, has recovered from a serious blood disorder that had hampered his season. \"I've not raced in Jersey since [the] 2021 Triathlon Super League,\" Turner told BBC Radio Jersey.\"It's just nice to come back and race in front of a home crowd, be at home, sleep in my bedroom when I was a child [and] have time with my family and my friends.\"It's extra special racing at home.\"As well as suffering from Immune Thrombocytopenic Purpura (ITP), a disorder which lowers the amount of platelets in your blood which are vital for clotting, Turner also had an injury in his upper leg which sidelined him during the first half of the year. \"I've always described it as being someone who's been relatively lucky regarding injuries and illnesses and that sort of stuff,\" he said.\"I've been training full-time now for five years, and I haven't really had anything too drastic go wrong injury or illness-wise, and then 2025 just threw me everything at once, basically.",
        "\"It was pretty rough but these things happen and you just have to roll with the punches.\"At the end of the day, I always think if I can just deal with what I can control in this particular scenario, that [the illness and injury] was out of my control, so I just took the advice of the doctors.\"I was back on track relatively quick I would say. I'm still kind of in the back end of the bloods, I've still not been signed off, but I'm no longer on medication. My body seems to be holding out quite well.\"Turner is hopeful that running the Jersey Marathon will be a good part of his preparation for a race in Australia at the end of the year, when he will run a marathon after a 180km (112 miles) cycle race and an opening swim of 3.9km (2.4 miles). \"It was an idea that I had when I was stagnant at home looking for things that I could do,\" he said.\"It's fantastic preparation to run the marathon in Jersey, to run the distance and get familiar with that effort and that kind of distance.\"I'm coming back to Jersey so I'm going to get to watch the build up, watch them build the start line, the expo, all the exciting parts that run along parallel with the actual race itself, so it'd be nice to be there early and embrace it.\"",
        "Ollie Turner finished 15th in the 2022 Commonwealth Games triathlon",
        "Triathlete Ollie Turner said he is excited to be racing in Jersey for the first time in four years.",
        "The 26-year-old will compete in next month's Jersey Marathon as he prepares to race his first full-length Ironman event in December.",
        "Turner, who competed for the island at the last Commonwealth Games, has recovered from a serious blood disorder that had hampered his season.",
        "\"I've not raced in Jersey since [the] 2021 Triathlon Super League,\" Turner told BBC Radio Jersey.",
        "\"It's just nice to come back and race in front of a home crowd, be at home, sleep in my bedroom when I was a child [and] have time with my family and my friends.",
        "\"It's extra special racing at home.\"",
        "As well as suffering from Immune Thrombocytopenic Purpura (ITP), a disorder which lowers the amount of platelets in your blood which are vital for clotting, Turner also had an injury in his upper leg which sidelined him during the first half of the year.",
        "\"I've always described it as being someone who's been relatively lucky regarding injuries and illnesses and that sort of stuff,\" he said.",
        "\"I've been training full-time now for five years, and I haven't really had anything too drastic go wrong injury or illness-wise, and then 2025 just threw me everything at once, basically.",
        "Turner aims for World Ironman after battling illness",
        "\"It was pretty rough but these things happen and you just have to roll with the punches.",
        "\"At the end of the day, I always think if I can just deal with what I can control in this particular scenario, that [the illness and injury] was out of my control, so I just took the advice of the doctors.",
        "\"I was back on track relatively quick I would say. I'm still kind of in the back end of the bloods, I've still not been signed off, but I'm no longer on medication. My body seems to be holding out quite well.\"",
        "Turner is hopeful that running the Jersey Marathon will be a good part of his preparation for a race in Australia at the end of the year, when he will run a marathon after a 180km (112 miles) cycle race and an opening swim of 3.9km (2.4 miles).",
        "\"It was an idea that I had when I was stagnant at home looking for things that I could do,\" he said.",
        "\"It's fantastic preparation to run the marathon in Jersey, to run the distance and get familiar with that effort and that kind of distance.",
        "\"I'm coming back to Jersey so I'm going to get to watch the build up, watch them build the start line, the expo, all the exciting parts that run along parallel with the actual race itself, so it'd be nice to be there early and embrace it.\""
      ]
    },
    {
      "url": "https://www.bbc.com/sport/triathlon/articles/c75q1n3k157o",
      "main_category": "sport",
      "detailed_category": "triathlon",
      "topic": "World's best triathletes race on Jersey's Waterfront",
      "content": [
        "Hungary's Csongor Lehmann and Luxembourg's Jeanne Lehair won the Supertri triathlon on Jersey's Waterfront. Lehmann, who won last year's European title, finished in 49 minutes 44 seconds, five seconds ahead of Portugal's Vasco Vilaca, while Great Britain's Oliver Conway was third. Lehair - the 2023 European champion - took the women's elite race in a time of 54:35.She was eight seconds in front of France's 2020 Olympic bronze medallist Leonie Periault, and a further eight seconds in front of British Olympic team gold medallist Georgia Taylor-Brown.In holding the event, Jersey became the first place to host a Supertri race for the fifth time. \"It's crazy that I could win a race like this, because this is the cherry on top in triathlon, so I'm really happy,\" Lehman told BBC Radio Jersey.\"You're already pushing yourself to the limits in the first round, and then you still have two to do - swimming is especially hard.\"Women's winner Lehair was especially pleased by the crowd that turned out to watch the race.Bad weather earlier in the day had made her fear that they would have few people spectating. \"At the beginning of the day it was raining, so I was not expecting too many people, but at the end it was nice and it was helping us,\" she said.\"Even though it was better weather at the beginning of the race, the motivation was pretty low, but at the end it was a good day.\"",
        "Jersey's Commonwealth Youth Games bronze medallist Siena Stephens was called up to the elite race on the morning of the event.The 18-year-old, who heads off to university on Monday, had completed a 10km training run in the morning before being told that she would be racing alongside some of the world's best. \"It's been the most amazing experience,\" she told BBC Radio Jersey after being the first racer eliminated.\"I was ready to be here as a fan, but even that, having it back in Jersey was again incredible.\"When it was here a few years ago I was the biggest fan and got autographs of everyone.\"The Jersey fanbase is incredible - I had so many people I know out - friends and family.\"They don't get to see me race too often as I do a lot of racing in the UK, so it's been  a dream really.\"Stephens' fellow Commonwealth Youth Games medallist Luke Holmes was also called up to race in the men's event and was eliminated during the bike leg.",
        "Jersey became the first place to host a Supertri event for the fifth time",
        "Hungary's Csongor Lehmann and Luxembourg's Jeanne Lehair won the Supertri triathlon on Jersey's Waterfront.",
        "Lehmann, who won last year's European title, finished in 49 minutes 44 seconds, five seconds ahead of Portugal's Vasco Vilaca, while Great Britain's Oliver Conway was third.",
        "Lehair - the 2023 European champion - took the women's elite race in a time of 54:35.",
        "She was eight seconds in front of France's 2020 Olympic bronze medallist Leonie Periault, and a further eight seconds in front of British Olympic team gold medallist Georgia Taylor-Brown.",
        "In holding the event, Jersey became the first place to host a Supertri race for the fifth time.",
        "\"It's crazy that I could win a race like this, because this is the cherry on top in triathlon, so I'm really happy,\" Lehman told BBC Radio Jersey.",
        "\"You're already pushing yourself to the limits in the first round, and then you still have two to do - swimming is especially hard.\"",
        "Women's winner Lehair was especially pleased by the crowd that turned out to watch the race.",
        "Bad weather earlier in the day had made her fear that they would have few people spectating.",
        "\"At the beginning of the day it was raining, so I was not expecting too many people, but at the end it was nice and it was helping us,\" she said.",
        "\"Even though it was better weather at the beginning of the race, the motivation was pretty low, but at the end it was a good day.\"",
        "Siena Stephens was called up to the elite race in the morning",
        "Jersey's Commonwealth Youth Games bronze medallist Siena Stephens was called up to the elite race on the morning of the event.",
        "The 18-year-old, who heads off to university on Monday, had completed a 10km training run in the morning before being told that she would be racing alongside some of the world's best.",
        "\"It's been the most amazing experience,\" she told BBC Radio Jersey after being the first racer eliminated.",
        "\"I was ready to be here as a fan, but even that, having it back in Jersey was again incredible.",
        "\"When it was here a few years ago I was the biggest fan and got autographs of everyone.",
        "\"The Jersey fanbase is incredible - I had so many people I know out - friends and family.",
        "\"They don't get to see me race too often as I do a lot of racing in the UK, so it's been  a dream really.\"",
        "Stephens' fellow Commonwealth Youth Games medallist Luke Holmes was also called up to race in the men's event and was eliminated during the bike leg."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/articles/cx2jxpzm7npo",
      "main_category": "sport",
      "detailed_category": "triathlon",
      "topic": "Hofmann wins as thousands take on  Ironman Wales",
      "content": [
        "Germany's Franziska Hofmann triumphed in the women's professional race as Tenby welcomed back Ironman Wales.Britain's Rosie Wild came in second with compatriot Kate Phipkin third on a weekend in which more than 2,700 competitors line up alongside the elite women triathletes in Pembrokeshire for the 140.6 mile triathlon.Hofmann said: \"It's my second Ironman race and it's one of the toughest races I can imagine.\"Today it all fit together. I don't know how but it worked and I was feeling so good.\"Runner-up Wild said: \"I've cried and I've laughed but I'm so proud of myself. \"I was going to aim high and for my best but I didn't think that (finishing second) was going to happen today.\"Lewis Eccleston triumphed in the men's event with Princess Shaddick the non-professional women's winner.\"To come away with a win with everything that has gone into it and all the people who help out is a massive reward for everybody, not just myself,\" said Eccleston.",
        "Widely regarded as one of the toughest races of its kind in the world, the course in west Wales challenged athletes with a choppy sea swim, more than 2,500m of elevation on the bike, and a marathon that was anything but flat.The race began with 2.4mile swim, followed by a gruelling uphill transition via the Zig-Zag and through Tenby town to the bike racks. From there, athletes traded goggles and wetsuits for cleats and aero helmets as they tackled a 112 mile bike course across Pembrokeshire, before lacing up their trainers for a 26.2 mile marathon.The race slogan \"Face the Dragon\" has been inspired by the rugged coastline and unpredictable weather that forces 100s of athletes to withdraw each year.",
        "Former Wales and British and Irish Lions wing Shane Williams was among the competitors, the eighth time he has taken on the challenge.He said: \"I honestly think it gets better and better, this is probably the best support I've seen. When you've got the support like that on both sides it's incredible. I can't explain how much I absolutely love it.\"I think my favourite today was the run and that was purely because of the support. It's an Ironman - it's all hard, but you enjoy it at the same time.\"Before the 2025 edition, race director Rebecca Sutherland said the event is the \"jewel in the crown of our UK race season\". She added: \"The Welsh spectator support throughout Tenby and Pembrokeshire is always incredible to witness. Athletes get to experience a challenging course with one of the best atmospheres on earth.\"Those who made it to the finish line were rewarded with a trip up the infamous red carpet. First-timers had the chance to ring the bell to mark their achievement, before hearing the four words every endurance athlete longs for: \"You are an Ironman!\"",
        "As well as Williams, ex-Wales women's rugby international Sioned Harries also took part as well as former Ireland rugby league and Leeds Rhinos player turned endurance athlete Luke Ambler.Ambler was attempting to complete every UK full-distance and 70.3 Ironman in a single year. His campaign, Mission Possible, concluded in Tenby in support of Andysmanclub, a mental health charity that aims to break stigma, spark conversation, and encourage men to talk.",
        "• Nikki Bartlett (GBR)• Jeanne Collogne (FRA)• Ruth Astle (GBR)• Mena Suter (CHE)• Lydia Dant (GBR)• Shiva Leisner (DNK)• Rosie Wild (GBR)• Franziska Hofmann (DEU)• Nikita Paskiewicz (FRA)• Claire Weller (GBR)• Kaja Bergwitz-Larsen (NOR)• Tara Rooney (USA)• Katie Phipkin (GBR)• Maja Indermühle (CHE)",
        "For the professional field, a share of the $50,000 prize pot and qualification for the 2026 Ironman World Championships was on the line",
        "Germany's Franziska Hofmann triumphed in the women's professional race as Tenby welcomed back Ironman Wales.",
        "Britain's Rosie Wild came in second with compatriot Kate Phipkin third on a weekend in which more than 2,700 competitors line up alongside the elite women triathletes in Pembrokeshire for the 140.6 mile triathlon.",
        "Hofmann said: \"It's my second Ironman race and it's one of the toughest races I can imagine.",
        "\"Today it all fit together. I don't know how but it worked and I was feeling so good.\"",
        "Runner-up Wild said: \"I've cried and I've laughed but I'm so proud of myself.",
        "\"I was going to aim high and for my best but I didn't think that (finishing second) was going to happen today.\"",
        "Lewis Eccleston triumphed in the men's event with Princess Shaddick the non-professional women's winner.",
        "\"To come away with a win with everything that has gone into it and all the people who help out is a massive reward for everybody, not just myself,\" said Eccleston.",
        "In Pictures: Ironman Wales in Tenby",
        "Widely regarded as one of the toughest races of its kind in the world, the course in west Wales challenged athletes with a choppy sea swim, more than 2,500m of elevation on the bike, and a marathon that was anything but flat.",
        "The race began with 2.4mile swim, followed by a gruelling uphill transition via the Zig-Zag and through Tenby town to the bike racks.",
        "From there, athletes traded goggles and wetsuits for cleats and aero helmets as they tackled a 112 mile bike course across Pembrokeshire, before lacing up their trainers for a 26.2 mile marathon.",
        "The race slogan \"Face the Dragon\" has been inspired by the rugged coastline and unpredictable weather that forces 100s of athletes to withdraw each year.",
        "This video can not be played",
        "\"That's Ironman Wales in a nutshell\" - Shane Williams explains exactly what faced him and the rest of the field in Tenby",
        "Former Wales and British and Irish Lions wing Shane Williams was among the competitors, the eighth time he has taken on the challenge.",
        "He said: \"I honestly think it gets better and better, this is probably the best support I've seen. When you've got the support like that on both sides it's incredible. I can't explain how much I absolutely love it.",
        "\"I think my favourite today was the run and that was purely because of the support. It's an Ironman - it's all hard, but you enjoy it at the same time.\"",
        "Before the 2025 edition, race director Rebecca Sutherland said the event is the \"jewel in the crown of our UK race season\".",
        "She added: \"The Welsh spectator support throughout Tenby and Pembrokeshire is always incredible to witness. Athletes get to experience a challenging course with one of the best atmospheres on earth.\"",
        "Those who made it to the finish line were rewarded with a trip up the infamous red carpet.",
        "First-timers had the chance to ring the bell to mark their achievement, before hearing the four words every endurance athlete longs for: \"You are an Ironman!\"",
        "As well as Williams, ex-Wales women's rugby international Sioned Harries also took part as well as former Ireland rugby league and Leeds Rhinos player turned endurance athlete Luke Ambler.",
        "Ambler was attempting to complete every UK full-distance and 70.3 Ironman in a single year. His campaign, Mission Possible, concluded in Tenby in support of Andysmanclub, a mental health charity that aims to break stigma, spark conversation, and encourage men to talk.",
        "• Nikki Bartlett (GBR)",
        "• Jeanne Collogne (FRA)",
        "• Shiva Leisner (DNK)",
        "• Franziska Hofmann (DEU)",
        "• Nikita Paskiewicz (FRA)",
        "• Claire Weller (GBR)",
        "• Kaja Bergwitz-Larsen (NOR)",
        "• Katie Phipkin (GBR)",
        "• Maja Indermühle (CHE)"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/triathlon/articles/cdx22kwzdpko",
      "main_category": "sport",
      "detailed_category": "triathlon",
      "topic": "In Pictures: Ironman Wales 2025 in Tenby",
      "content": [
        "BBC Sport and Getty Images present a selection of some of the most striking sports photographs taken at Ironman Wales in Tenby:",
        "All photographs licensed by Getty Images and subject to copyright.",
        "BBC Sport and Getty Images present a selection of some of the most striking sports photographs taken at Ironman Wales in Tenby:",
        "Waiting for the off...",
        "Crowds gathered on Tenby's North Beach for the swimming leg",
        "Hofmann wins as thousands take on  Ironman Wales",
        "Heading to transition",
        "Finding a way through",
        "A rare moment of quiet in Tenby",
        "Women's pro-athletes winner Franziska Hofmann salutes the crowd",
        "Lewis Eccleston wins the men's race",
        "All photographs licensed by Getty Images and subject to copyright."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/triathlon/articles/cdx22y7z5llo",
      "main_category": "sport",
      "detailed_category": "triathlon",
      "topic": "Charles-Barclay tops all-British T100 Spain podium",
      "content": [
        "Great Britain's Lucy Charles-Barclay picked up her second T100 triathlon title, topping an all-British podium in Oropesa del Mar, Spain.After securing her maiden T100 win in London last month, Charles-Barclay crossed the line in Spain in a time of three hours 29 minutes 29 seconds to beat fellow Britons Kate Waugh and Jess Learmonth to first place.The 32-year-old was at the front of the race in the swim and bike before easing clear of compatriot Waugh on the fourth of six laps during the run.It was a repeat of the result at T100 London when Charles-Barclay caught Waugh late on and the two now sit joint-top of the overall standings with three races to go.\"The Brits were pretty strong today with a 1-2-3,\" said Charles-Barclay. \"I knew I was riding strong. The other girls were right there as well. \"I'm feeling strong and I feel like as the season's progressed I've definitely got stronger.\"Launched in January 2024 by the Professional Triathletes Organisation and governing body World Triathlon, the T100 has shorter races than Ironman's 3.5km swim, 180km bike and 42km run but longer than the Olympic distances of 1500m, 40km and 10km.The T100 series continues in Wollongong, Australia on 18 October, with the finals taking place in Qatar in December.",
        "Lucy Charles-Barclay is the first woman to win two T100 races this season",
        "Great Britain's Lucy Charles-Barclay picked up her second T100 triathlon title, topping an all-British podium in Oropesa del Mar, Spain.",
        "After securing her maiden T100 win in London last month, Charles-Barclay crossed the line in Spain in a time of three hours 29 minutes 29 seconds to beat fellow Britons Kate Waugh and Jess Learmonth to first place.",
        "The 32-year-old was at the front of the race in the swim and bike before easing clear of compatriot Waugh on the fourth of six laps during the run.",
        "It was a repeat of the result at T100 London when Charles-Barclay caught Waugh late on and the two now sit joint-top of the overall standings with three races to go.",
        "\"The Brits were pretty strong today with a 1-2-3,\" said Charles-Barclay. \"I knew I was riding strong. The other girls were right there as well.",
        "\"I'm feeling strong and I feel like as the season's progressed I've definitely got stronger.\"",
        "Launched in January 2024 by the Professional Triathletes Organisation and governing body World Triathlon, the T100 has shorter races than Ironman's 3.5km swim, 180km bike and 42km run but longer than the Olympic distances of 1500m, 40km and 10km.",
        "The T100 series continues in Wollongong, Australia on 18 October, with the finals taking place in Qatar in December."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/triathlon/articles/c9dxjx7l3nxo",
      "main_category": "sport",
      "detailed_category": "triathlon",
      "topic": "Potter wins first World Triathlon race since 2023",
      "content": [
        "Great Britain's Olympic bronze medalist Beth Potter has claimed her first victory in the World Triathlon Series since 2023.   The 33-year-old Scot put in a commanding performance in all three disciplines - swim, bike and run - to win by 13 seconds in the Czech spa town of Karlovy Vary.She reeled in second-placed American Taylor Spivey in the final lap of the run before opening enough breathing space to afford time to high-five spectators as she crossed the finish line. Germany's Lisa Tertsch was 55 seconds behind Potter in third place, while Britain's Olivia Mathias was ninth and Sian Rainsley 10th. Potter clinched the overall title with her last win in the finale of the 2023 World Triathlon Series in Spain.She was second overall in 2024, behind France's Olympic champion Cassandre Beaugrand.Britain's Oliver Conway finished fourth in his World Triathlon Series debut in the men's race, which was won by Germany's Henry Graf.",
        "Beth Potter won bronze medals in both the women's triathlon and mixed relay at the 2024 Olympic Games in Paris",
        "Great Britain's Olympic bronze medalist Beth Potter has claimed her first victory in the World Triathlon Series since 2023.",
        "The 33-year-old Scot put in a commanding performance in all three disciplines - swim, bike and run - to win by 13 seconds in the Czech spa town of Karlovy Vary.",
        "She reeled in second-placed American Taylor Spivey in the final lap of the run before opening enough breathing space to afford time to high-five spectators as she crossed the finish line.",
        "Germany's Lisa Tertsch was 55 seconds behind Potter in third place, while Britain's Olivia Mathias was ninth and Sian Rainsley 10th.",
        "Potter clinched the overall title with her last win in the finale of the 2023 World Triathlon Series in Spain.",
        "She was second overall in 2024, behind France's Olympic champion Cassandre Beaugrand.",
        "Britain's Oliver Conway finished fourth in his World Triathlon Series debut in the men's race, which was won by Germany's Henry Graf."
      ]
    }
  ]
}