{
  "scraped_at": "2025-10-27T18:56:59.779545",
  "total_articles": 10,
  "category": "fencing",
  "articles_per_category": 100,
  "articles": [
    {
      "url": "https://www.bbc.com/sport/fencing/articles/c1devd1k2x2o",
      "main_category": "sport",
      "detailed_category": "fencing",
      "topic": "Stutchbury, 19, makes British fencing history",
      "content": [
        "Teenager Carolina Stutchbury has become Great Britain's first woman fencer to win a European Championship silver medal.The 19-year-old reached the individual women's foil final in Genoa after strong performances throughout the day, but suffered a 15-13 loss to France's world number nine Eva Lacheray.It meant United States-based Stutchbury went one better than last year when she took European bronze.That had made her the only British female fencer to have claimed a place on the podium since the event was re-established in 1981.\"I'm delighted to have bettered my bronze medal from last year,\" said Stutchbury.",
        "\"To medal twice in a row gives me confidence in my ability to perform consistently at major events and I am looking forward to the World Champs in Tbilisi in July.\"British Fencing president Pat Aiyenuro said: \"We could not be more proud of what Carolina has achieved in becoming the first British woman to win a senior European Championship silver medal.\"",
        "Carolina Stutchbury bettered her bronze at last year's event",
        "Teenager Carolina Stutchbury has become Great Britain's first woman fencer to win a European Championship silver medal.",
        "The 19-year-old reached the individual women's foil final in Genoa after strong performances throughout the day, but suffered a 15-13 loss to France's world number nine Eva Lacheray.",
        "It meant United States-based Stutchbury went one better than last year when she took European bronze.",
        "That had made her the only British female fencer to have claimed a place on the podium since the event was re-established in 1981.",
        "\"I'm delighted to have bettered my bronze medal from last year,\" said Stutchbury.",
        "\"To medal twice in a row gives me confidence in my ability to perform consistently at major events and I am looking forward to the World Champs in Tbilisi in July.\"",
        "British Fencing president Pat Aiyenuro said: \"We could not be more proud of what Carolina has achieved in becoming the first British woman to win a senior European Championship silver medal.\""
      ]
    },
    {
      "url": "https://www.bbc.com/sport/fencing/articles/cpdzv76gl49o",
      "main_category": "sport",
      "detailed_category": "fencing",
      "topic": "Fencer takes knee in protest against transgender opponent",
      "content": [
        "A fencer was disqualified from a women's competition in the United States after refusing to compete against a transgender opponent.Stephanie Turner took a knee in protest after standing on the piste before her bout against Redmond Sullivan at the University of Maryland.She was shown a black card and informed she would not be allowed to continue in the women's foil tournament.International Fencing Federation (FIE) rules state a fencer is not permitted to refuse to fence another properly entered fencer for any reason.USA Fencing, which enacted its transgender and non-binary policy in 2023, said: \"The policy is based on the principle that everyone should have the ability to participate in sports and was based upon the research available of the day.\"It added: \"USA Fencing will always err on the side of inclusion, and we're committed to amending the policy as more relevant evidence-based research emerges, or as policy changes take effect in the wider Olympic and Paralympic movement.\"Explaining her decision, Turner - of the Fencing Academy of Philadelphia - told Fox News, external: \"I saw that I was going to be in a pool with Redmond, and from there I said: 'OK, let's do it. I'm going to take the knee.'\"I knew what I had to do because USA Fencing had not been listening to women's objections regarding [its gender eligibility policy],\" she added.\"When I took the knee, I looked at the ref and I said: 'I'm sorry, I cannot do this. I am a woman, and this is a man, and this is a women's tournament. And I will not fence this individual.'\"Responding to Turner's disqualification on 30 March, USA Fencing said: \"In the case of Stephanie Turner, her disqualification, which applies to this tournament only, was not related to any personal statement but was merely the direct result of her decision to decline to fence an eligible opponent, which the FIE rules clearly prohibit. \"USA Fencing is obligated to follow the letter of those rules and ensure that participants respect the standards set at the international level. We remain committed to inclusivity within our sport while also upholding every requirement dictated by our governing body.\"While The Cherry Blossom competition was held at the University of Maryland, it was not an NCAA event.In February, the NCAA changed its policy to say that only \"student-athletes assigned female at birth\" will be allowed to take part in collegiate competitions, after US President Donald Trump signed an executive order preventing transgender women from competing in female categories of sports.Turner has competed in more than 200 fencing matches, including the national championships, while Sullivan, of Wagner College, has won 18 of her 45 previous bouts. She placed 24th out of 39 fencers at the Maryland event.",
        "Stephanie Turner (right) refused to compete against her opponent",
        "A fencer was disqualified from a women's competition in the United States after refusing to compete against a transgender opponent.",
        "Stephanie Turner took a knee in protest after standing on the piste before her bout against Redmond Sullivan at the University of Maryland.",
        "She was shown a black card and informed she would not be allowed to continue in the women's foil tournament.",
        "International Fencing Federation (FIE) rules state a fencer is not permitted to refuse to fence another properly entered fencer for any reason.",
        "USA Fencing, which enacted its transgender and non-binary policy in 2023, said: \"The policy is based on the principle that everyone should have the ability to participate in sports and was based upon the research available of the day.\"",
        "It added: \"USA Fencing will always err on the side of inclusion, and we're committed to amending the policy as more relevant evidence-based research emerges, or as policy changes take effect in the wider Olympic and Paralympic movement.\"",
        "Explaining her decision, Turner - of the Fencing Academy of Philadelphia - told Fox News, external: \"I saw that I was going to be in a pool with Redmond, and from there I said: 'OK, let's do it. I'm going to take the knee.'",
        "\"I knew what I had to do because USA Fencing had not been listening to women's objections regarding [its gender eligibility policy],\" she added.",
        "\"When I took the knee, I looked at the ref and I said: 'I'm sorry, I cannot do this. I am a woman, and this is a man, and this is a women's tournament. And I will not fence this individual.'\"",
        "Responding to Turner's disqualification on 30 March, USA Fencing said: \"In the case of Stephanie Turner, her disqualification, which applies to this tournament only, was not related to any personal statement but was merely the direct result of her decision to decline to fence an eligible opponent, which the FIE rules clearly prohibit.",
        "\"USA Fencing is obligated to follow the letter of those rules and ensure that participants respect the standards set at the international level. We remain committed to inclusivity within our sport while also upholding every requirement dictated by our governing body.\"",
        "While The Cherry Blossom competition was held at the University of Maryland, it was not an NCAA event.",
        "In February, the NCAA changed its policy to say that only \"student-athletes assigned female at birth\" will be allowed to take part in collegiate competitions, after US President Donald Trump signed an executive order preventing transgender women from competing in female categories of sports.",
        "Turner has competed in more than 200 fencing matches, including the national championships, while Sullivan, of Wagner College, has won 18 of her 45 previous bouts. She placed 24th out of 39 fencers at the Maryland event."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/fencing/articles/c805jg1937mo",
      "main_category": "sport",
      "detailed_category": "fencing",
      "topic": "The 'baby Olympian' and the pregnancy that stunned the world",
      "content": [
        "\"I was thinking about my baby, that I want my baby to be an Olympian.\" That was the extra motivation that Egyptian fencer Nada Hafez needed when she took to the piste at Paris 2024.Only a select few knew she was competing while seven months pregnant until she revealed the news on social media following her last-16 exit from her event. It made headlines the world over.The whirlwind reaction was like nothing Hafez had experienced before.\"I was just posting on my personal account - proud, saying I'm in the top 16 in the world while pregnant,\" Hafez told BBC Sport Africa. \"I didn't expect this would go viral. I didn't know what was going on.\"The 27-year-old says the majority of responses to her message were positive.\"When the post went up, and I was an inspiration for everyone, this was a big thing for me.\"Hafez, who is a clinical pathologist, says she had been given clearance from doctors to fence at the Games and wanted to show the world what a woman's body can do.\"This was a really important message for me - an Egyptian Arab woman - to tell all women that your body can surprise you,\" she said.\"Sometimes you need to see an example in front of you to know that you can do it. \"Because maybe a pregnant woman, she's afraid to do anything, and now she tells herself: 'There's a woman who competes at the Olympics while pregnant. So I can do whatever'.\"",
        "But not everyone was so supportive of Hafez revealing that she fenced in the women's individual sabre at the Grand Palais while carrying a baby.A day later Hafez put out another Instagram post to emphasise she was not the first pregnant woman to appear at an Olympics and that she had wanted to \"shed light on the strength, perseverance and relentlessness\" of Egyptian women.That strength came to the fore when dealing with negativity online.\"Some people don't want to see you succeed,\" she reflected.\"It's easy to put a comment and run. You don't face me.\"I wanted to clarify that I'm a doctor and this (competing while pregnant) is something that is not against any medical issues.\"Some people were saying I should have given the place to someone else. But this was not an option because I qualified.\"My mum told me 'Don't be sad if you read anything' - but I'm proud of what I did. I achieved something and it was very challenging.\"With fencing being a combat sport using swords, could that have provoked the negative comments?\"For me, fencing is not as it looks - it has this sense of touch. My doctor assured me that it's not unsafe.\"",
        "Cairo-based Hafez, who pursued her passion for fencing while studying for her medical degree, became an Egyptian sabre champion and went to both the Rio 2016 and Tokyo 2020 Games. So, having qualified for Paris 2024, did she consider pulling out when she discovered she was pregnant? \"Yes, of course. I knew I was pregnant a week before a World Cup [event], and I said, 'Okay, I won't chance it because it's my first pregnancy',\" she explained.\"I didn't know how I would feel. \"I was waiting for my husband [a cardiothoracic surgeon] to tell me to stop and take rest. But he told me: 'We'll go to the doctor. Whatever he says, we'll do.'\"And the doctor said: 'You don't have a disease. You're just pregnant. If you're okay and everything is normal, you can do whatever you want.'\"With that reassurance, Hafez felt ready to resume training. Mindful of the spotlight falling on her nation if the news came out, she kept it as quiet as she could.\"I didn't have to tell anyone, because it's not against Olympic regulations,\" she said.\"I just told the people who needed to know. The most important thing was not to go against any laws or health conditions.\"I didn't know if I would make it so I took it step by step until I reached the Olympics.\"Egypt's National Olympic Committee told BBC Sport Africa it has no rules barring pregnant women from training or competing.\"But it has to be a safe environment and we have to make sure there is no risk involved,\" an official said.",
        "Now a mum to four-month-old baby Zaina, Hafez can reflect on the part her daughter played in her achievements in Paris.\"I worked with my mental coach. I wanted to do something different for my baby,\" she said.\"I tried not to think that I have my excuse not to win. I thought differently: 'I'm pregnant and I will win', and I did it.\"Hafez went on to upset the seventh seed, Elizabeth Tartakovsky, 15-13.\"It's one of the best results for female Egyptian Olympians,\" Hafez added.\"I was crying with happiness. This is something for my baby to be proud of.\"She then lost 15-7 to Jeon Hayoung of South Korea in the last 16.Neither of her opponents knew Hafez was expecting. \"It's unfair if someone knows. Maybe they'd be afraid to put a touch or something, so no need to tell them.\"",
        "Hafez, who is studying for a masters degree alongside being a new mum, is aiming to use her platform to stand up for women's rights in sport.She has not yet decided whether she wants to try and qualify for Los Angeles 2028.For now, she is still processing what she achieved in Paris.\"Young girls told me, 'You've inspired us so much. We want to go to medical school and continue in sports',\" she said.\"And that made me happiest.\"Whenever I get a message from anyone telling me I'm a role model it sets my heart on fire - because that's what I'm working on for my whole life.\"I'm still young. I'm aiming to do more and be a good example as a mum.\"I hope my daughter will be an Olympian one day. She's a baby Olympian - and maybe she'll be an adult Olympian.\"",
        "Nada Hafez competed for Egypt in the women's individual sabre fencing event at the Paris Olympics while seven months pregnant",
        "\"I was thinking about my baby, that I want my baby to be an Olympian.\"",
        "That was the extra motivation that Egyptian fencer Nada Hafez needed when she took to the piste at Paris 2024.",
        "Only a select few knew she was competing while seven months pregnant until she revealed the news on social media following her last-16 exit from her event.",
        "It made headlines the world over.",
        "The whirlwind reaction was like nothing Hafez had experienced before.",
        "\"I was just posting on my personal account - proud, saying I'm in the top 16 in the world while pregnant,\" Hafez told BBC Sport Africa.",
        "\"I didn't expect this would go viral. I didn't know what was going on.\"",
        "The 27-year-old says the majority of responses to her message were positive.",
        "\"When the post went up, and I was an inspiration for everyone, this was a big thing for me.\"",
        "Hafez, who is a clinical pathologist, says she had been given clearance from doctors to fence at the Games and wanted to show the world what a woman's body can do.",
        "\"This was a really important message for me - an Egyptian Arab woman - to tell all women that your body can surprise you,\" she said.",
        "\"Sometimes you need to see an example in front of you to know that you can do it.",
        "\"Because maybe a pregnant woman, she's afraid to do anything, and now she tells herself: 'There's a woman who competes at the Olympics while pregnant. So I can do whatever'.\"",
        "Hafez upset the seventh seed, Elizabeth Tartakovsky of the United States, in her first match at Paris 2024",
        "But not everyone was so supportive of Hafez revealing that she fenced in the women's individual sabre at the Grand Palais while carrying a baby.",
        "A day later Hafez put out another Instagram post to emphasise she was not the first pregnant woman to appear at an Olympics and that she had wanted to \"shed light on the strength, perseverance and relentlessness\" of Egyptian women.",
        "That strength came to the fore when dealing with negativity online.",
        "\"Some people don't want to see you succeed,\" she reflected.",
        "\"It's easy to put a comment and run. You don't face me.",
        "\"I wanted to clarify that I'm a doctor and this (competing while pregnant) is something that is not against any medical issues.",
        "\"Some people were saying I should have given the place to someone else. But this was not an option because I qualified.",
        "\"My mum told me 'Don't be sad if you read anything' - but I'm proud of what I did. I achieved something and it was very challenging.\"",
        "With fencing being a combat sport using swords, could that have provoked the negative comments?",
        "\"For me, fencing is not as it looks - it has this sense of touch. My doctor assured me that it's not unsafe.\"",
        "Hafez took up fencing aged 12 and has appeared at the past three editions of the Olympic Games",
        "Cairo-based Hafez, who pursued her passion for fencing while studying for her medical degree, became an Egyptian sabre champion and went to both the Rio 2016 and Tokyo 2020 Games.",
        "So, having qualified for Paris 2024, did she consider pulling out when she discovered she was pregnant?",
        "\"Yes, of course. I knew I was pregnant a week before a World Cup [event], and I said, 'Okay, I won't chance it because it's my first pregnancy',\" she explained.",
        "\"I didn't know how I would feel.",
        "\"I was waiting for my husband [a cardiothoracic surgeon] to tell me to stop and take rest. But he told me: 'We'll go to the doctor. Whatever he says, we'll do.'",
        "\"And the doctor said: 'You don't have a disease. You're just pregnant. If you're okay and everything is normal, you can do whatever you want.'\"",
        "With that reassurance, Hafez felt ready to resume training.",
        "Mindful of the spotlight falling on her nation if the news came out, she kept it as quiet as she could.",
        "\"I didn't have to tell anyone, because it's not against Olympic regulations,\" she said.",
        "\"I just told the people who needed to know. The most important thing was not to go against any laws or health conditions.",
        "\"I didn't know if I would make it so I took it step by step until I reached the Olympics.\"",
        "Egypt's National Olympic Committee told BBC Sport Africa it has no rules barring pregnant women from training or competing.",
        "\"But it has to be a safe environment and we have to make sure there is no risk involved,\" an official said.",
        "Nada Hafez was full of emotion after she made it through to the last 16 of the Paris Games, her third Olympics having also competed at at Rio 2016 and Tokyo 2020",
        "Now a mum to four-month-old baby Zaina, Hafez can reflect on the part her daughter played in her achievements in Paris.",
        "\"I worked with my mental coach. I wanted to do something different for my baby,\" she said.",
        "\"I tried not to think that I have my excuse not to win. I thought differently: 'I'm pregnant and I will win', and I did it.\"",
        "Hafez went on to upset the seventh seed, Elizabeth Tartakovsky, 15-13.",
        "\"It's one of the best results for female Egyptian Olympians,\" Hafez added.",
        "\"I was crying with happiness. This is something for my baby to be proud of.\"",
        "She then lost 15-7 to Jeon Hayoung of South Korea in the last 16.",
        "Neither of her opponents knew Hafez was expecting.",
        "\"It's unfair if someone knows. Maybe they'd be afraid to put a touch or something, so no need to tell them.\"",
        "Hafez, who is studying for a masters degree alongside being a new mum, is aiming to use her platform to stand up for women's rights in sport.",
        "She has not yet decided whether she wants to try and qualify for Los Angeles 2028.",
        "For now, she is still processing what she achieved in Paris.",
        "\"Young girls told me, 'You've inspired us so much. We want to go to medical school and continue in sports',\" she said.",
        "\"And that made me happiest.",
        "\"Whenever I get a message from anyone telling me I'm a role model it sets my heart on fire - because that's what I'm working on for my whole life.",
        "\"I'm still young. I'm aiming to do more and be a good example as a mum.",
        "\"I hope my daughter will be an Olympian one day. She's a baby Olympian - and maybe she'll be an adult Olympian.\""
      ]
    },
    {
      "url": "https://www.bbc.com/sport/olympics/articles/c3rqn5prp8go",
      "main_category": "sport",
      "detailed_category": "fencing",
      "topic": "History in Paris, cycling glory and Ivorian joy - 2024 in African sport",
      "content": [
        "As 2024 draws to a close, Biniam Girmay will be among the Africans proudly reflecting on etching their names into sporting history.The Eritrean cyclist enjoyed unprecedented success at the Tour de France, before the Paris 2024 Olympics and Paralympics provided other memorable landmarks for the continent.Ivory Coast's footballers ultimately delivered on home soil, yet South Africa's cricketers will be among those mulling over missed chances.BBC Sport Africa rounds up the main highlights of the past 12 months.",
        "Beatrice Chebet was a stand-out performer at the Olympics, with the 24-year-old winning the women's 5,000m and 10,000m double to help Kenya finish top of Africa's medal table once again.Algerian teenager Kaylia Nemour created history as the continent's first medallist in artistic gymnastics by securing a stunning gold in the uneven bars.Meanwhile, Letsile Tebogo became the first athlete from Botswana to top the podium as well as Africa's first Olympic sprint champion, setting a new continental record of 19.46 seconds as he stormed to victory in the men's 200m.Barriers were broken in basketball as Nigeria's women became the first African side to reach the Olympic knockout stages, while South Sudan's appearance brought pride to the world's youngest nation.One third of the continent's 39 medals were gold, while Nada Hafez epitomised the Olympic movement's spirit when the Egyptian fenced while seven months pregnant.",
        "At the Paralympics, Raoua Tlili continued her global dominance - with her F41 discus and shot put titles making her Tunisia's most-decorated Para-athlete with 10 medals earned across five different editions of the Games.Algerian sprinter Skander Djamil Athmani also returned home with two golds and Nigerian teenager Mariam Eniola Bolaji became the first African to win a Paralympic or Olympic medal in badminton.There was history for Mauritius too, as Yovanni Philippe won the island nation's first Paralympic medal when he took bronze in the men's T20 400m.",
        "Girmay has cemented himself as the poster boy of African cycling over the past three years and broke further barriers at the sport's highest level.The 24-year-old became the first black African to win a stage at the Tour de France, and two more stage victories helped him capture the green jersey for the highest points scorer - a first for anyone from the continent.Cycling-mad Eritrea is also beginning to dominate at continental level, with the small East African nation finishing top of the medal table at October's African Road Championships.",
        "Football's Africa Cup of Nations (Afcon) regularly delivers compelling storylines, but this year's delayed 2023 edition proved a cut above.Hosts Ivory Coast sacked coach Jean-Louis Gasset as they appeared set for an embarrassing group-stage exit, but interim boss Emerse Fae then masterminded a fairytale run which ended with the Elephants lifting the trophy.Their route through the knockout rounds was dramatic in the extreme, while Sebastien Haller scored decisive goals in the semi-final and final to cap his own remarkable comeback from testicular cancer.In November the line-up for the 2025 Afcon was decided, with Sudan and Botswana surprise qualifiers for the finals in Morocco.",
        "Nigeria's Ademola Lookman picked up the men's African Footballer of the Year award after coming 14th in the global Ballon d'Or vote.The 27-year-old was named in the Afcon team of the tournament and then became the first man in 49 years to score a hat-trick in a European final, as his treble against Bayer Leverkusen secured Atalanta the Europa League title.Al Ahly's men registered a record-extending 12th African Champions League title while TP Mazembe won the women's equivalent for the first time.Barbra Banda was voted the BBC Women's Footballer of the Year on the back of her impressive form with Orlando Pride and then became the first Zambian woman to be named the continent's best.However, it was her Copper Queens team-mate Racheal Kundananji who became the most expensive female player of all time when she joined Banda in the United States, moving to Bay FC in February.",
        "Ghana hosted the delayed 2023 African Games in March after an outlay of almost $250m (£200m).The competition, with events in 29 disciplines, endured teething issues amid a time of economic turmoil in the West African nation and many big names in athletics did not attend.Later in the year, Chebet was one of six Kenyans to win Diamond League titles while her compatriot Ruth Chepngetich smashed the women's marathon world record in Chicago.The 30-year-old's time of two hours nine minutes and 57 seconds surpassed the previous record, held by Ethiopia's Tigst Assefa, by nearly two minutes.Ethiopian Yomif Kejelcha lowered the bar with a world record in the men's half marathon, clocking 57 minutes 30 seconds in Valencia.",
        "Francis Ngannou's year in combat sports was overshadowed by the death of his 15-month-old son Kobe.That sad news came in April, a month after the Cameroonian was knocked out by Anthony Joshua in the second round of their boxing bout in Saudi Arabia.Ngannou recorded a first-round stoppage of Renan Ferreira on his return to action in October, in what was his first mixed martial arts (MMA) contest in nearly three years.The 38-year-old shed tears as he dedicated the victory to Kobe.\"I went to fight for him. I hope they can remember his name because without Kobe, I wouldn't have fought.\"Elsewhere in MMA, Dricus du Plessis came out on top in the UFC's 'Battle for Africa' against Israel Adesanya, with the South African forcing his opponent to submit in the fourth round to retain his middleweight title.",
        "South Africa secured their first Rugby Championship title since 2019 before flanker Pieter-Steph du Toit was crowned World Rugby player of the year, becoming the first Springbok to win the award twice.But the curse of major tournaments once again struck the country's cricketers in two T20 World Cup finals.The Proteas men suffered an agonising seven-run defeat against India in June, while the women were beaten by New Zealand by 32 runs in October.In tennis, South Africa's Kgothatso Montjane added the Wimbledon women's wheelchair doubles trophy to her cabinet.But Ons Jabeur appears further away from her first Grand Slam triumph after an injury-hit year saw her slide down the women's rankings.The 30-year-old's best showing came at the French Open, where the Tunisian exited in the quarter-finals.In squash, Nouran Gohar won an all-Egyptian Women's World Championship final, defeating seven-time winner Nour El Sherbini to claim a first title. But Mostafa Asal could not make it a clean sweep on home soil in Cairo as he was beaten in the men's final.",
        "Ivory Coast winger Simon Adingra, Paralympian Raoua Tlili and cyclist Biniam Girmay all had reason to celebrate over the past 12 months",
        "As 2024 draws to a close, Biniam Girmay will be among the Africans proudly reflecting on etching their names into sporting history.",
        "The Eritrean cyclist enjoyed unprecedented success at the Tour de France, before the Paris 2024 Olympics and Paralympics provided other memorable landmarks for the continent.",
        "Ivory Coast's footballers ultimately delivered on home soil, yet South Africa's cricketers will be among those mulling over missed chances.",
        "BBC Sport Africa rounds up the main highlights of the past 12 months.",
        "Beatrice Chebet was a stand-out performer at the Olympics, with the 24-year-old winning the women's 5,000m and 10,000m double to help Kenya finish top of Africa's medal table once again.",
        "Algerian teenager Kaylia Nemour created history as the continent's first medallist in artistic gymnastics by securing a stunning gold in the uneven bars.",
        "Meanwhile, Letsile Tebogo became the first athlete from Botswana to top the podium as well as Africa's first Olympic sprint champion, setting a new continental record of 19.46 seconds as he stormed to victory in the men's 200m.",
        "Barriers were broken in basketball as Nigeria's women became the first African side to reach the Olympic knockout stages, while South Sudan's appearance brought pride to the world's youngest nation.",
        "One third of the continent's 39 medals were gold, while Nada Hafez epitomised the Olympic movement's spirit when the Egyptian fenced while seven months pregnant.",
        "Yovanni Philippe made history by winning Mauritius' first Paralympic medal",
        "At the Paralympics, Raoua Tlili continued her global dominance - with her F41 discus and shot put titles making her Tunisia's most-decorated Para-athlete with 10 medals earned across five different editions of the Games.",
        "Algerian sprinter Skander Djamil Athmani also returned home with two golds and Nigerian teenager Mariam Eniola Bolaji became the first African to win a Paralympic or Olympic medal in badminton.",
        "There was history for Mauritius too, as Yovanni Philippe won the island nation's first Paralympic medal when he took bronze in the men's T20 400m.",
        "How can Africa improve its performance for LA 2028?",
        "African para-sport at crossroads after Paris 2024 haul",
        "Girmay has cemented himself as the poster boy of African cycling over the past three years and broke further barriers at the sport's highest level.",
        "The 24-year-old became the first black African to win a stage at the Tour de France, and two more stage victories helped him capture the green jersey for the highest points scorer - a first for anyone from the continent.",
        "Cycling-mad Eritrea is also beginning to dominate at continental level, with the small East African nation finishing top of the medal table at October's African Road Championships.",
        "The African Tour de France cyclist racking up historic wins",
        "Eritrean cyclists in pursuit of inspirational Girmay",
        "Football's Africa Cup of Nations (Afcon) regularly delivers compelling storylines, but this year's delayed 2023 edition proved a cut above.",
        "Hosts Ivory Coast sacked coach Jean-Louis Gasset as they appeared set for an embarrassing group-stage exit, but interim boss Emerse Fae then masterminded a fairytale run which ended with the Elephants lifting the trophy.",
        "Their route through the knockout rounds was dramatic in the extreme, while Sebastien Haller scored decisive goals in the semi-final and final to cap his own remarkable comeback from testicular cancer.",
        "In November the line-up for the 2025 Afcon was decided, with Sudan and Botswana surprise qualifiers for the finals in Morocco.",
        "Haller caps return from cancer with Afcon trophy",
        "Afcon glory is 'revenge' for Ivory Coast coach Fae",
        "Zambia captain Barbra Banda was named BBC Women's Footballer of the Year after helping Orlando Pride to the NWSL title and netting four goals at the Olympic Games",
        "Nigeria's Ademola Lookman picked up the men's African Footballer of the Year award after coming 14th in the global Ballon d'Or vote.",
        "The 27-year-old was named in the Afcon team of the tournament and then became the first man in 49 years to score a hat-trick in a European final, as his treble against Bayer Leverkusen secured Atalanta the Europa League title.",
        "Al Ahly's men registered a record-extending 12th African Champions League title while TP Mazembe won the women's equivalent for the first time.",
        "Barbra Banda was voted the BBC Women's Footballer of the Year on the back of her impressive form with Orlando Pride and then became the first Zambian woman to be named the continent's best.",
        "However, it was her Copper Queens team-mate Racheal Kundananji who became the most expensive female player of all time when she joined Banda in the United States, moving to Bay FC in February.",
        "How Lookman went from 'failure' to Africa's best",
        "Lookman and Banda named African players of the year",
        "Ghana hosted the delayed 2023 African Games in March after an outlay of almost $250m (£200m).",
        "The competition, with events in 29 disciplines, endured teething issues amid a time of economic turmoil in the West African nation and many big names in athletics did not attend.",
        "Later in the year, Chebet was one of six Kenyans to win Diamond League titles while her compatriot Ruth Chepngetich smashed the women's marathon world record in Chicago.",
        "The 30-year-old's time of two hours nine minutes and 57 seconds surpassed the previous record, held by Ethiopia's Tigst Assefa, by nearly two minutes.",
        "Ethiopian Yomif Kejelcha lowered the bar with a world record in the men's half marathon, clocking 57 minutes 30 seconds in Valencia.",
        "Francis Ngannou (centre) recorded an emotional victory at the PFL Super Fights event in Riyadh, Saudi Arabia",
        "Francis Ngannou's year in combat sports was overshadowed by the death of his 15-month-old son Kobe.",
        "That sad news came in April, a month after the Cameroonian was knocked out by Anthony Joshua in the second round of their boxing bout in Saudi Arabia.",
        "Ngannou recorded a first-round stoppage of Renan Ferreira on his return to action in October, in what was his first mixed martial arts (MMA) contest in nearly three years.",
        "The 38-year-old shed tears as he dedicated the victory to Kobe.",
        "\"I went to fight for him. I hope they can remember his name because without Kobe, I wouldn't have fought.\"",
        "Elsewhere in MMA, Dricus du Plessis came out on top in the UFC's 'Battle for Africa' against Israel Adesanya, with the South African forcing his opponent to submit in the fourth round to retain his middleweight title.",
        "Laura Wolvaardt and her South Africa team-mates missed out on T20 World Cup glory",
        "South Africa secured their first Rugby Championship title since 2019 before flanker Pieter-Steph du Toit was crowned World Rugby player of the year, becoming the first Springbok to win the award twice.",
        "But the curse of major tournaments once again struck the country's cricketers in two T20 World Cup finals.",
        "The Proteas men suffered an agonising seven-run defeat against India in June, while the women were beaten by New Zealand by 32 runs in October.",
        "In tennis, South Africa's Kgothatso Montjane added the Wimbledon women's wheelchair doubles trophy to her cabinet.",
        "But Ons Jabeur appears further away from her first Grand Slam triumph after an injury-hit year saw her slide down the women's rankings.",
        "The 30-year-old's best showing came at the French Open, where the Tunisian exited in the quarter-finals.",
        "In squash, Nouran Gohar won an all-Egyptian Women's World Championship final, defeating seven-time winner Nour El Sherbini to claim a first title. But Mostafa Asal could not make it a clean sweep on home soil in Cairo as he was beaten in the men's final."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/fencing/articles/cy08vkdxyp5o",
      "main_category": "sport",
      "detailed_category": "fencing",
      "topic": "Paralympics 2024: A guide to wheelchair fencing at the Paris Games",
      "content": [
        "Dates: 3-7 SeptemberVenue: Grand PalaisGold medals on offer: 16",
        "There are three disciplines in wheelchair fencing based on the type of sword used - the foil, the epee and the sabre.The epee is the heaviest weapon at 770g and is more rigid than the other swords, the foil is lighter and highly flexible while the sabre has a short, flexible blade.In the foil event, fencers are only permitted to strike the trunk area of the opponent, while in the sabre and epee, anywhere above the waist is a valid target area.Hits are recorded by striking an opponent cleanly in the valid area, with successful hits recorded by the electronic equipment.Fencers wear metal aprons to ensure that hits to off-target areas are not counted.During a contest, the fencers' wheelchairs are fastened into metal frames on the floor at an angle of 110 degrees. This allows freedom of the upper body only and allows the fencers' sword arms to oppose each other. The distance between the fencers is dependent on the fighter with the shorter arm reach.Bouts last a maximum of three minutes in the preliminary pool stages of the competition, with victory going to the first fencer to score five valid hits or the one with the most hits at the end of the three minutes.The preliminary round results form the seedings for the knockout stages. Here, bouts consist of three rounds of three minutes. The winner is the first to score 15 hits, or the highest scorer at the completion of the contest. In the event of a tie, an extra one-minute sudden death bout is held, with the first person to score a valid hit taking the contest.In team events, teams are made up of three fencers. Each fencer faces each opponent in the other team in a single bout of three minutes. The winning team is the one with the most points when the time is up, or the first to reach a cumulative score of 45 points.Classification divisions are based on impairment. Category A fencers have good trunk control, whereas Category B athletes have an impairment that impacts their trunk or their fencing arm.",
        "Piers Gilliver and Dimitri Coutya will both be hoping to add to their Paralympic medal haul.Gilliver's victory in the Epee A event in Tokyo gave GB their first gold medal in the sport since 1988 and he goes into Paris as world and European champion.Coutya, who won two individual bronzes three years ago, is a challenger in the Epee B and Foil B events where he is European champion and world medallist and will be hoping to improve on his Tokyo performance.Gilliver and Coutya will combine with Oliver Lam-Watson as GB chase team medals while Gemma Collis has a chance of a medal in the women's epee A event.",
        "China won 11 of the 16 gold medals on offer at Tokyo 2020 with Tan Shumei leading the charge with three (two individual and one team) and they were dominant again at last year's World Championships in Italy.Italy's Beatrice (Bebe) Vio Grandis, one of the stars of the Rising Phoenix documentary, returned from two years out to win gold in the Foil B event and will be hoping to retain her Paralympic crown.Elsewhere, France's Maxime Valet (Foil B) and Poland's Adrian Castro (Sabre B) will be among those hoping to stop the Chinese dominance.",
        "Thailand's Saysunee Jana created sporting history at the Athens Paralympics in 2004 when she became her nation's first female gold medallist when she triumphed in the Epee B event.Since then, she has gone on to win a medal at each subsequent Games - another gold at London 2012, silver in Rio and bronze in Beijing and Tokyo - and she will be aiming to keep up that medal record in Paris.",
        "Five - one gold (Piers Gilliver), one silver (team foil) and three bronze (Dimitri Coutya x 2, team epee)",
        "Wheelchair fencing bouts are fast, furious and intense",
        "Gold medals on offer: 16",
        "There are three disciplines in wheelchair fencing based on the type of sword used - the foil, the epee and the sabre.",
        "The epee is the heaviest weapon at 770g and is more rigid than the other swords, the foil is lighter and highly flexible while the sabre has a short, flexible blade.",
        "In the foil event, fencers are only permitted to strike the trunk area of the opponent, while in the sabre and epee, anywhere above the waist is a valid target area.",
        "Hits are recorded by striking an opponent cleanly in the valid area, with successful hits recorded by the electronic equipment.",
        "Fencers wear metal aprons to ensure that hits to off-target areas are not counted.",
        "During a contest, the fencers' wheelchairs are fastened into metal frames on the floor at an angle of 110 degrees. This allows freedom of the upper body only and allows the fencers' sword arms to oppose each other. The distance between the fencers is dependent on the fighter with the shorter arm reach.",
        "Bouts last a maximum of three minutes in the preliminary pool stages of the competition, with victory going to the first fencer to score five valid hits or the one with the most hits at the end of the three minutes.",
        "The preliminary round results form the seedings for the knockout stages. Here, bouts consist of three rounds of three minutes. The winner is the first to score 15 hits, or the highest scorer at the completion of the contest. In the event of a tie, an extra one-minute sudden death bout is held, with the first person to score a valid hit taking the contest.",
        "In team events, teams are made up of three fencers. Each fencer faces each opponent in the other team in a single bout of three minutes. The winning team is the one with the most points when the time is up, or the first to reach a cumulative score of 45 points.",
        "Classification divisions are based on impairment. Category A fencers have good trunk control, whereas Category B athletes have an impairment that impacts their trunk or their fencing arm.",
        "Piers Gilliver and Dimitri Coutya will both be hoping to add to their Paralympic medal haul.",
        "Gilliver's victory in the Epee A event in Tokyo gave GB their first gold medal in the sport since 1988 and he goes into Paris as world and European champion.",
        "Coutya, who won two individual bronzes three years ago, is a challenger in the Epee B and Foil B events where he is European champion and world medallist and will be hoping to improve on his Tokyo performance.",
        "Gilliver and Coutya will combine with Oliver Lam-Watson as GB chase team medals while Gemma Collis has a chance of a medal in the women's epee A event.",
        "China won 11 of the 16 gold medals on offer at Tokyo 2020 with Tan Shumei leading the charge with three (two individual and one team) and they were dominant again at last year's World Championships in Italy.",
        "Italy's Beatrice (Bebe) Vio Grandis, one of the stars of the Rising Phoenix documentary, returned from two years out to win gold in the Foil B event and will be hoping to retain her Paralympic crown.",
        "Elsewhere, France's Maxime Valet (Foil B) and Poland's Adrian Castro (Sabre B) will be among those hoping to stop the Chinese dominance.",
        "Thailand's Saysunee Jana created sporting history at the Athens Paralympics in 2004 when she became her nation's first female gold medallist when she triumphed in the Epee B event.",
        "Since then, she has gone on to win a medal at each subsequent Games - another gold at London 2012, silver in Rio and bronze in Beijing and Tokyo - and she will be aiming to keep up that medal record in Paris.",
        "Five - one gold (Piers Gilliver), one silver (team foil) and three bronze (Dimitri Coutya x 2, team epee)"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/olympics/articles/c1vdd3x5pndo",
      "main_category": "sport",
      "detailed_category": "fencing",
      "topic": "Fencing win gives Ukraine first gold at Paris 2024",
      "content": [
        "Ukraine won their first gold medal at Paris 2024 with a thrilling victory in the women's sabre team event final over South Korea.Olga Kharlan, who won Ukraine's first medal in Paris with individual bronze on Monday, put in an inspired performance to clinch team gold in the last leg.The Ukraine team had trailed 40-37, but Kharlan helped secure a 45-42 win, scoring 22 total touches across the final.It was 33-year-old Kharlan's sixth Olympic medal in total and her second gold, having also won the team event title with Ukraine in 2008.After the final touch, Kharlan celebrated by removing her mask and dropping to her knees.Former Ukrainian president Petro Poroshenko wrote on X: \"Steel nerves! Incredible skill! A very intense competition, a fight to the very last seconds, great work of our athletes. Crazy emotions, a historic result.\"Japan defeated hosts France 45-40 in the bronze medal bout.",
        "Ukraine took silver in the women's sabre team event at Rio 2016 but missed out on a medal in Tokyo three years ago",
        "Ukraine won their first gold medal at Paris 2024 with a thrilling victory in the women's sabre team event final over South Korea.",
        "Olga Kharlan, who won Ukraine's first medal in Paris with individual bronze on Monday, put in an inspired performance to clinch team gold in the last leg.",
        "The Ukraine team had trailed 40-37, but Kharlan helped secure a 45-42 win, scoring 22 total touches across the final.",
        "It was 33-year-old Kharlan's sixth Olympic medal in total and her second gold, having also won the team event title with Ukraine in 2008.",
        "After the final touch, Kharlan celebrated by removing her mask and dropping to her knees.",
        "Former Ukrainian president Petro Poroshenko wrote on X: \"Steel nerves! Incredible skill! A very intense competition, a fight to the very last seconds, great work of our athletes. Crazy emotions, a historic result.\"",
        "Japan defeated hosts France 45-40 in the bronze medal bout.",
        "Today's Olympics guide",
        "Full Paris Olympics schedule",
        "BBC's Paris Olympics TV schedule"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/olympics/articles/clwyejq5nvjo",
      "main_category": "sport",
      "detailed_category": "fencing",
      "topic": "Fencer competes at Olympics while seven months pregnant",
      "content": [
        "Egyptian fencer Nada Hafez has revealed she competed at the Paris Olympics on Monday while seven months pregnant.The 26-year-old won her first match in the women's individual sabre competition, but was then knocked out in the last 16.\"What appears to you as two players on the podium, they were actually three! It was me, my competitor, and my yet to come to our world little baby!\" Hafez said in a post on Instagram.Hafez, who is from Cairo and was appearing at her third Olympics, said \"pride fills my being\" after taking to the piste while expecting.She beat Elizabeth Tartakovsky of the United States 15-13 before losing 15-7 to Jeon Hayoung of South Korea at the Grand Palais in the French capital.\"My baby and I had our fair share of challenges, be it both physical and emotional,\" she added.\"The rollercoaster of pregnancy is tough on its own, but having to fight to keep the balance of life and sports was nothing short of strenuous, however worth it.\"I'm lucky to have shared the trust of my husband (Ibrahim Ihab) and that of my family to be able to come this far.\"",
        "Hafez's revelation came just a couple of hours before Tatjana Smith won Africa's first gold medal of the Paris 2024 Games, as the South African triumphed in the women's 100m breaststroke.The 27-year-old qualified fastest for the final, and a strong second length saw her win the third Olympic medal of her career in a time of one minute and 5.28 seconds at La Defense Arena.\"It took a village to get me where I am today,\" Smith said.\"I swam for everyone that has been there for me, that has believed with me, and for my country as well.\"Smith won 100m breaststroke silver and 200m breaststroke gold in Tokyo three years ago while competing under her maiden name of Schoenmaker.\"There is always something to learn out of every race, and for me with Tokyo the only thing I wanted to change was to really just focus on my own race,\" she added.\"I gave it my best and I am so grateful that I am walking away with the gold medal.\"Smith, from Johannesburg, will begin the defence of her 200m breaststroke title on Wednesday morning.However, there was disappointment in the pool for compatriot Pieter Coetze, who finished fifth in the men's 100m backstroke final despite setting a new African record of 52.58 seconds.Earlier on Monday South Africa's Alan Hatherly won bronze in the men’s mountain bike cross-country race.The 28-year-old, who had finished eighth in Tokyo three years ago, crossed the line 11 seconds behind gold medallist Tom Pidcock of Great Britain, and two seconds behind second-placed Victor Koretzky of France.South Africa lead Africa's medal table on Day 3 of the Games, with one gold and two bronzes.Tunisia have a silver from Fares Ferjani in the men's individual sabre, while Mohamed Elsayed won bronze for Egypt in the men's individual epee on Sunday.",
        "Egypt's Nada Hafez was competing in the women's individual sabre for the third successive Olympics",
        "Egyptian fencer Nada Hafez has revealed she competed at the Paris Olympics on Monday while seven months pregnant.",
        "The 26-year-old won her first match in the women's individual sabre competition, but was then knocked out in the last 16.",
        "\"What appears to you as two players on the podium, they were actually three! It was me, my competitor, and my yet to come to our world little baby!\" Hafez said in a post on Instagram.",
        "Hafez, who is from Cairo and was appearing at her third Olympics, said \"pride fills my being\" after taking to the piste while expecting.",
        "She beat Elizabeth Tartakovsky of the United States 15-13 before losing 15-7 to Jeon Hayoung of South Korea at the Grand Palais in the French capital.",
        "\"My baby and I had our fair share of challenges, be it both physical and emotional,\" she added.",
        "\"The rollercoaster of pregnancy is tough on its own, but having to fight to keep the balance of life and sports was nothing short of strenuous, however worth it.",
        "\"I'm lucky to have shared the trust of my husband (Ibrahim Ihab) and that of my family to be able to come this far.\"",
        "Tatjana Smith added 100m breaststroke gold to her two medals from Tokyo 2020",
        "Hafez's revelation came just a couple of hours before Tatjana Smith won Africa's first gold medal of the Paris 2024 Games, as the South African triumphed in the women's 100m breaststroke.",
        "The 27-year-old qualified fastest for the final, and a strong second length saw her win the third Olympic medal of her career in a time of one minute and 5.28 seconds at La Defense Arena.",
        "\"It took a village to get me where I am today,\" Smith said.",
        "\"I swam for everyone that has been there for me, that has believed with me, and for my country as well.\"",
        "Smith won 100m breaststroke silver and 200m breaststroke gold in Tokyo three years ago while competing under her maiden name of Schoenmaker.",
        "\"There is always something to learn out of every race, and for me with Tokyo the only thing I wanted to change was to really just focus on my own race,\" she added.",
        "\"I gave it my best and I am so grateful that I am walking away with the gold medal.\"",
        "Smith, from Johannesburg, will begin the defence of her 200m breaststroke title on Wednesday morning.",
        "However, there was disappointment in the pool for compatriot Pieter Coetze, who finished fifth in the men's 100m backstroke final despite setting a new African record of 52.58 seconds.",
        "Earlier on Monday South Africa's Alan Hatherly won bronze in the men’s mountain bike cross-country race.",
        "The 28-year-old, who had finished eighth in Tokyo three years ago, crossed the line 11 seconds behind gold medallist Tom Pidcock of Great Britain, and two seconds behind second-placed Victor Koretzky of France.",
        "South Africa lead Africa's medal table on Day 3 of the Games, with one gold and two bronzes.",
        "Tunisia have a silver from Fares Ferjani in the men's individual sabre, while Mohamed Elsayed won bronze for Egypt in the men's individual epee on Sunday."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/olympics/articles/c4ngj5wklz3o",
      "main_category": "sport",
      "detailed_category": "fencing",
      "topic": "Tunisian fencer Ferjani takes silver at Paris 2024",
      "content": [
        "Tunisia’s Fares Ferjani missed out on becoming Africa’s first gold medallist at the Paris 2024 Olympics after defeat in the final of the men’s individual sabre.The 27-year-old had to settle for silver after being beaten 15-11 by South Korea’s Oh Sanguk at the Grand Palais in the French capital.Ferjani, seeded 13th, had seen off the world number one Ziad Elsissy in the semi-finals but could not produce another upset against Oh.The Tunisian, who was born in Tunis but is now based in New York, had finished 22nd at Tokyo 2020 and 25th at the Rio de Janeiro Games in 2016.His best previous result on the senior world stage in individual sabre competition was an 8th-placed ranking at the World Championships in Wuxi, China, in 2018.Ferjani’s success gave Tunisia its 16th Olympic medal (five golds, four silvers and seven bronzes) since first competing as an independent nation in Rome in 1960.Tunisia has sent its smallest delegation to the Olympics for two decades, with 26 athletes qualifying for Paris compared the team of 63 for Tokyo.Meanwhile, there was more disappointment for top seed Elsissy as the Egyptian was beaten to bronze by Luigi Samele, with the Italian winning 15-12 in their meeting.The 29-year-old will have another chance to pick up a medal when Egypt begin their team sabre campaign on Wednesday.",
        "Earlier on Saturday, South Africa won the continent’s first medal of the Games, taking bronze in the men’s rugby sevens.The Blitzboks beat Australia 26-19 in a pulsating encounter at the Stade de France, with a last-gasp converted try from Shaun Williams securing the win after Australia’s Nick Malouf had been sent off in the second half.South Africa had been beaten 19-5 by France in the semi-finals, with the hosts going on to beat two-time defending champions Fiji to gold.The Blitzboks, bronze medallists at the 2016 Olympics in Rio, were the last nation to qualify for the men's event for Paris 2024 after winning a repechage in Monaco last month.\"A lot of people didn’t give us a chance,\" said forward Ryan Oosthuizen.\"We only qualified for the Games by repechage, and if someone had said ‘You will be standing on the podium at the end’, I never would have believed them.“We had an argument after day one about our standards. But we came together and said, ‘We have to fight for South Africa’.\"We are defiant people and we did it. I am so glad.\"South Africa's women begin their rugby sevens campaign on Sunday, with group matches against Australia and Ireland.",
        "Fares Ferjani could not mount a dramatic comeback after trailing 14-5 in the final",
        "Tunisia’s Fares Ferjani missed out on becoming Africa’s first gold medallist at the Paris 2024 Olympics after defeat in the final of the men’s individual sabre.",
        "The 27-year-old had to settle for silver after being beaten 15-11 by South Korea’s Oh Sanguk at the Grand Palais in the French capital.",
        "Ferjani, seeded 13th, had seen off the world number one Ziad Elsissy in the semi-finals but could not produce another upset against Oh.",
        "The Tunisian, who was born in Tunis but is now based in New York, had finished 22nd at Tokyo 2020 and 25th at the Rio de Janeiro Games in 2016.",
        "His best previous result on the senior world stage in individual sabre competition was an 8th-placed ranking at the World Championships in Wuxi, China, in 2018.",
        "Ferjani’s success gave Tunisia its 16th Olympic medal (five golds, four silvers and seven bronzes) since first competing as an independent nation in Rome in 1960.",
        "Tunisia has sent its smallest delegation to the Olympics for two decades, with 26 athletes qualifying for Paris compared the team of 63 for Tokyo.",
        "Meanwhile, there was more disappointment for top seed Elsissy as the Egyptian was beaten to bronze by Luigi Samele, with the Italian winning 15-12 in their meeting.",
        "The 29-year-old will have another chance to pick up a medal when Egypt begin their team sabre campaign on Wednesday.",
        "Six African competitors to watch at Paris 2024",
        "Selvyn Davids (left) handed the ball to Shaun Williams (right) to score the winning try for South Africa in the men's rugby sevens bronze medal match",
        "Earlier on Saturday, South Africa won the continent’s first medal of the Games, taking bronze in the men’s rugby sevens.",
        "The Blitzboks beat Australia 26-19 in a pulsating encounter at the Stade de France, with a last-gasp converted try from Shaun Williams securing the win after Australia’s Nick Malouf had been sent off in the second half.",
        "South Africa had been beaten 19-5 by France in the semi-finals, with the hosts going on to beat two-time defending champions Fiji to gold.",
        "The Blitzboks, bronze medallists at the 2016 Olympics in Rio, were the last nation to qualify for the men's event for Paris 2024 after winning a repechage in Monaco last month.",
        "\"A lot of people didn’t give us a chance,\" said forward Ryan Oosthuizen.",
        "\"We only qualified for the Games by repechage, and if someone had said ‘You will be standing on the podium at the end’, I never would have believed them.",
        "“We had an argument after day one about our standards. But we came together and said, ‘We have to fight for South Africa’.",
        "\"We are defiant people and we did it. I am so glad.\"",
        "South Africa's women begin their rugby sevens campaign on Sunday, with group matches against Australia and Ireland.",
        "Rugby sevens has 'bright future' in Africa - Habana"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/fencing/articles/cj50d00ype2o",
      "main_category": "sport",
      "detailed_category": "fencing",
      "topic": "Olympic fencer and model champions body positivity",
      "content": [
        "Not many athletes have switched from competing for Germany to Kenya, but then Alexandra Ndolo – a former military veteran-turned-model who is eyeing Africa’s first Olympic fencing gold medal – is not one to take the easy option.Add in the fact that she’s trying to perform well enough in Paris to ensure she receives funding from Kenyan authorities to continue competing, and it’s clear the 37-year-old has plenty to focus on as her childhood Olympic dream finally materialises.The first Kenyan fencer to compete at the Olympics, she will take to the piste in epee as a serious contender, having won a World Fencing Championships silver medal for Germany in 2022.Just two months later, she stunned many by switching allegiance to Kenya in honour of her late father, who was raised in the East African nation.“I feel like even when it has been hard, he's with me every step of the way,” Ndolo told BBC Sport Africa.“I know he would be proud of me, and [I believe] he's watching.”Africa has won just two Olympic fencing medals, with Egypt’s Alaaeldin Abouelkassem taking silver in 2012 in the men’s individual foil before Tunisian Ines Boubakri won bronze in the women’s foil four years later.“I don't see it as a burden, I see it as a chance to bring some joy and pride to the continent,” Ndolo said.Ndolo – who also has a silver and bronze from the 2017 and 2019 European championships respectively – also wants to shine in order to spread a message dear to her heart.Having suffered as a mixed-race girl growing up in Germany, Ndolo is desperate to boost body positivity among the next generation with African roots.“I hope that I will reach an even bigger audience with the Olympics – and that I will inspire not just East African black and brown girls, but black and brown girls all over the world.”",
        "When Ndolo appeared on the front cover of the Playboy Olympic magazine for Tokyo 2020, as a woman proudly displaying her African roots it was a major stop on an ongoing journey.For growing up with a white Polish mother and an African father in a country where neither had roots, Ndolo found herself considering her identity early on.Seen as a black woman in Germany but often identified as white in Kenya, she has long struggled to escape the beauty standards projected on her by the two cultures she inhabits.“In Kenya, we have a beauty standard with more curves so I might be not slim enough for the European beauty standards and not curvy enough for the Kenyan beauty standard,” she explained.“That's where I'm like: ‘Can we just accept our bodies the way they are?’”Ndolo says she started experiencing body shaming as she reached her teens in Germany, when she realised she did not have a popular look with the boys while some girls badly bullied her.“They were zooming in on my hair, my skin, the shape of my nose – it was basically an everyday campaign for a whole school year, telling me that I was not pretty.”",
        "Two decades on, Ndolo became the first black athlete to appear on the Playboy Olympic cover.During the shoot, she insisted on having her hair natural – as many Africans would have – and not straight.“I made the conscious decision to have my hair curly,” she recalled.“I wanted young adult women to see someone looking just like them on the cover of such an important magazine. I want black women in general to know they are beautiful just the way you are.”“I want them to know it's not important what the Western world might think is beautiful and that they don't need to chemically change their hair or skin to be lighter to be beautiful.”“Your body is not a trend, it should never be a trend.”Playboy aside, Ndolo has also posted nude photos on social media, in what she hopes is an artistic way, as she continues her messages of empowerment.She has received her fair share of negative comments but, after 11 years in the Germany military, has the mental resilience to ride it out.“I do it because I want other women to see that body positivity in an African sense exists, and I'm so happy when I get messages from women thanking me for representing them.”",
        "The military drills Ndolo undertook over the years also helped her adapt to the 2022 switch from the relative pampering and lifestyle of a European athlete to the financial hardship of an African one.“I left this really strong, secure German support system where basically I just had to come with my bags packed to the airport and everything was ready,” she explained.“That's very different to my situation now because I'm booking everything, with my mum and I paying for 99% of the things. There were some nights I was really crying and [wondering] how to get through the next month.”She estimates that it has cost at least $50,000 (£38,700), most of which was provided by her mother, to qualify for Paris 2024.“We said she’ll help me until the Olympics but afterwards things need to change because I can't keep going like this – you can't ask your retired parents to pay to raise the Kenyan flag.”Whether or not she medals in Paris, there seems every chance she will leave a mark on Kenyan fencing.“I would like to have a fencing club in every county and want to see fencing in high schools and universities,” said Ndolo, who would also like to see fencing integrated into the Kenyan army.A founding member of Kenya’s fencing federation in 2019, Ndolo has helped open fencing schools in the capital Nairobi, where some athletes receive scholarships to study coaching courses in South Africa.A Kenyan gold in Paris would push the sport even further.“I want to be remembered as a trailblazer. I can't wait to raise the Kenyan flag high.”",
        "Kenyan fencer Alexandra Ndolo won silver at the 2022 World Fencing Championships when representing Germany",
        "Not many athletes have switched from competing for Germany to Kenya, but then Alexandra Ndolo – a former military veteran-turned-model who is eyeing Africa’s first Olympic fencing gold medal – is not one to take the easy option.",
        "Add in the fact that she’s trying to perform well enough in Paris to ensure she receives funding from Kenyan authorities to continue competing, and it’s clear the 37-year-old has plenty to focus on as her childhood Olympic dream finally materialises.",
        "The first Kenyan fencer to compete at the Olympics, she will take to the piste in epee as a serious contender, having won a World Fencing Championships silver medal for Germany in 2022.",
        "Just two months later, she stunned many by switching allegiance to Kenya in honour of her late father, who was raised in the East African nation.",
        "“I feel like even when it has been hard, he's with me every step of the way,” Ndolo told BBC Sport Africa.",
        "“I know he would be proud of me, and [I believe] he's watching.”",
        "Africa has won just two Olympic fencing medals, with Egypt’s Alaaeldin Abouelkassem taking silver in 2012 in the men’s individual foil before Tunisian Ines Boubakri won bronze in the women’s foil four years later.",
        "“I don't see it as a burden, I see it as a chance to bring some joy and pride to the continent,” Ndolo said.",
        "Ndolo – who also has a silver and bronze from the 2017 and 2019 European championships respectively – also wants to shine in order to spread a message dear to her heart.",
        "Having suffered as a mixed-race girl growing up in Germany, Ndolo is desperate to boost body positivity among the next generation with African roots.",
        "“I hope that I will reach an even bigger audience with the Olympics – and that I will inspire not just East African black and brown girls, but black and brown girls all over the world.”",
        "Born to a Kenyan father and a Polish mother, Ndolo grew up in a conservative town in Germany",
        "When Ndolo appeared on the front cover of the Playboy Olympic magazine for Tokyo 2020, as a woman proudly displaying her African roots it was a major stop on an ongoing journey.",
        "For growing up with a white Polish mother and an African father in a country where neither had roots, Ndolo found herself considering her identity early on.",
        "Seen as a black woman in Germany but often identified as white in Kenya, she has long struggled to escape the beauty standards projected on her by the two cultures she inhabits.",
        "“In Kenya, we have a beauty standard with more curves so I might be not slim enough for the European beauty standards and not curvy enough for the Kenyan beauty standard,” she explained.",
        "“That's where I'm like: ‘Can we just accept our bodies the way they are?’”",
        "Ndolo says she started experiencing body shaming as she reached her teens in Germany, when she realised she did not have a popular look with the boys while some girls badly bullied her.",
        "“They were zooming in on my hair, my skin, the shape of my nose – it was basically an everyday campaign for a whole school year, telling me that I was not pretty.”",
        "Ndolo has been posting revealing photos online - in an 'artistic way', she hopes - in a bid to boost body positivity amoung younger women",
        "Two decades on, Ndolo became the first black athlete to appear on the Playboy Olympic cover.",
        "During the shoot, she insisted on having her hair natural – as many Africans would have – and not straight.",
        "“I made the conscious decision to have my hair curly,” she recalled.",
        "“I wanted young adult women to see someone looking just like them on the cover of such an important magazine. I want black women in general to know they are beautiful just the way you are.”",
        "“I want them to know it's not important what the Western world might think is beautiful and that they don't need to chemically change their hair or skin to be lighter to be beautiful.”",
        "“Your body is not a trend, it should never be a trend.”",
        "Playboy aside, Ndolo has also posted nude photos on social media, in what she hopes is an artistic way, as she continues her messages of empowerment.",
        "She has received her fair share of negative comments but, after 11 years in the Germany military, has the mental resilience to ride it out.",
        "“I do it because I want other women to see that body positivity in an African sense exists, and I'm so happy when I get messages from women thanking me for representing them.”",
        "Ndolo won her second successive African title in Morocco earlier this year",
        "The military drills Ndolo undertook over the years also helped her adapt to the 2022 switch from the relative pampering and lifestyle of a European athlete to the financial hardship of an African one.",
        "“I left this really strong, secure German support system where basically I just had to come with my bags packed to the airport and everything was ready,” she explained.",
        "“That's very different to my situation now because I'm booking everything, with my mum and I paying for 99% of the things. There were some nights I was really crying and [wondering] how to get through the next month.”",
        "She estimates that it has cost at least $50,000 (£38,700), most of which was provided by her mother, to qualify for Paris 2024.",
        "“We said she’ll help me until the Olympics but afterwards things need to change because I can't keep going like this – you can't ask your retired parents to pay to raise the Kenyan flag.”",
        "Whether or not she medals in Paris, there seems every chance she will leave a mark on Kenyan fencing.",
        "“I would like to have a fencing club in every county and want to see fencing in high schools and universities,” said Ndolo, who would also like to see fencing integrated into the Kenyan army.",
        "A founding member of Kenya’s fencing federation in 2019, Ndolo has helped open fencing schools in the capital Nairobi, where some athletes receive scholarships to study coaching courses in South Africa.",
        "A Kenyan gold in Paris would push the sport even further.",
        "“I want to be remembered as a trailblazer. I can't wait to raise the Kenyan flag high.”",
        "Fencing at the Paris 2024 Olympics"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/fencing/articles/cqee4l169n0o",
      "main_category": "sport",
      "detailed_category": "fencing",
      "topic": "Fencing at the Paris 2024 Olympics",
      "content": [
        "Here's all you need to know about fencing at Paris 2024.",
        "The fencing events run from 27 July to 4 August at the Grand Palais.There are 12 medal events - women's individual épée, foil and sabre, men's individual épée, foil and sabre, women's team épée, foil and sabre and men's team épée, foil and sabre.The medal bouts for the women’s individual épée and men’s individual sabre take place on 27 July.The medal bouts for the women's individual épée individual and men’s individual sabre take place on 28 July.The medal bouts for the women's individual foil and men’s individual épée take place on 29 July.The medal bouts for the women's individual sabre and men’s individual foil take place on 30 July.The medal bouts for the women's épée team take place on 31 July.The medal bouts for the men's sabre team take place on 1 August.The medal bouts for the women's foil team take place on 2 August.The medal bouts for the men's épée team and women's sabre team take place on 3 August.The medal bouts for the men's foil team take place on 4 August.",
        "In fencing, two competitors, each holding a weapon in one hand, face each other to strike their opponent on a valid target area of the body. The rules differ according to the type of weapon used.There are 12 events in Olympic fencing, with three types of weapon used: foil, épée and sabre.The first fencer to reach 15 points, or scores the most points at the completion of three three-minute rounds, wins the match. In team fencing, the first team to score 45 points, or the team leading when time runs out, wins.",
        "Fencing has been on the Olympic programme since the inaugural modern Games in Athens in 1896. Women's fencing entered the Olympics in 1924 at Paris.",
        "Italy have won the most Olympic fencing medals with 130 (49 gold), with France second with 123 (44 gold).Great Britain have won nine Olympic fencing medals, one gold and eight silver.",
        "Julia Beljajeva, Irina Embrich, Erika Kirpu and Katrina Lehis win gold for Estonia in the women's épée team at the Tokyo Olympics",
        "Here's all you need to know about fencing at Paris 2024.",
        "The fencing events run from 27 July to 4 August at the Grand Palais.",
        "There are 12 medal events - women's individual épée, foil and sabre, men's individual épée, foil and sabre, women's team épée, foil and sabre and men's team épée, foil and sabre.",
        "The medal bouts for the women’s individual épée and men’s individual sabre take place on 27 July.",
        "The medal bouts for the women's individual épée individual and men’s individual sabre take place on 28 July.",
        "The medal bouts for the women's individual foil and men’s individual épée take place on 29 July.",
        "The medal bouts for the women's individual sabre and men’s individual foil take place on 30 July.",
        "The medal bouts for the women's épée team take place on 31 July.",
        "The medal bouts for the men's sabre team take place on 1 August.",
        "The medal bouts for the women's foil team take place on 2 August.",
        "The medal bouts for the men's épée team and women's sabre team take place on 3 August.",
        "The medal bouts for the men's foil team take place on 4 August.",
        "In fencing, two competitors, each holding a weapon in one hand, face each other to strike their opponent on a valid target area of the body. The rules differ according to the type of weapon used.",
        "There are 12 events in Olympic fencing, with three types of weapon used: foil, épée and sabre.",
        "The first fencer to reach 15 points, or scores the most points at the completion of three three-minute rounds, wins the match. In team fencing, the first team to score 45 points, or the team leading when time runs out, wins.",
        "When do the Olympics start?",
        "Great Britain's team for 2024 Paris Olympics",
        "Fencing has been on the Olympic programme since the inaugural modern Games in Athens in 1896. Women's fencing entered the Olympics in 1924 at Paris.",
        "Italy have won the most Olympic fencing medals with 130 (49 gold), with France second with 123 (44 gold).",
        "Great Britain have won nine Olympic fencing medals, one gold and eight silver."
      ]
    }
  ]
}