{
  "scraped_at": "2025-10-27T18:56:59.764546",
  "total_articles": 11,
  "category": "basketball",
  "articles_per_category": 100,
  "articles": [
    {
      "url": "https://www.bbc.com/sport/basketball/articles/c3epn7zqkqno",
      "main_category": "sport",
      "detailed_category": "basketball",
      "topic": "Wembanyama makes NBA history as Spurs beat Nets",
      "content": [
        "Victor Wembanyama became the first player in NBA history to record 100 points and 15 blocks in the first three games of the regular season as the San Antonio Spurs beat the Brooklyn Nets in Texas.  San Antonio recovered from blowing a 26-point lead to maintain their unbeaten start to the campaign with a 118-107 win. The home side led 81-55 with nine minutes left in the third quarter but a 26-7 run in the Nets' favour reduced the deficit to 88-81.But a strong display in the fourth quarter - which included a 10-0 run - helped the Spurs seal the win. Frenchman Wembanyama put up 31 points, 14 rebounds, four assists, three steals and six blocks in 36 minutes of action. The 21-year-old, the number one draft pick in 2023, is averaging 33.3 points, 13.3 rebounds and six blocks from his three matches this season. The 7ft 4in centre returned from eight months out at the start of the campaign following surgery on his shoulder for deep vein thrombosis in February.",
        "Austin Reaves put up a career-high 51 points as the Los Angeles Lakers beat the Sacramento Kings 127-120.Without the injured Luka Doncic and LeBron James, Reaves took a leading role to surpass his previous best tally of 45 against the Indiana Pacers in February. Elsewhere, Anthony Davis scored 25 points and recorded 10 rebounds as the Dallas Mavericks beat the Toronto Raptors 139-129, while Kawhi Leonard managed 30 points and James Harden scored 20 as the Los Angeles Clippers saw off the Portland Trail Blazers 114-107. Giannis Antetokounmpo managed 40 points, 14 rebounds and nine assists but could not prevent the Milwaukee Bucks from falling to a 118-113 defeat against the Cleveland Cavaliers. NBA results in full.",
        "Victor Wembanyama returned from eight months out at the start of the season",
        "Victor Wembanyama became the first player in NBA history to record 100 points and 15 blocks in the first three games of the regular season as the San Antonio Spurs beat the Brooklyn Nets in Texas.",
        "San Antonio recovered from blowing a 26-point lead to maintain their unbeaten start to the campaign with a 118-107 win.",
        "The home side led 81-55 with nine minutes left in the third quarter but a 26-7 run in the Nets' favour reduced the deficit to 88-81.",
        "But a strong display in the fourth quarter - which included a 10-0 run - helped the Spurs seal the win.",
        "Frenchman Wembanyama put up 31 points, 14 rebounds, four assists, three steals and six blocks in 36 minutes of action.",
        "The 21-year-old, the number one draft pick in 2023, is averaging 33.3 points, 13.3 rebounds and six blocks from his three matches this season.",
        "The 7ft 4in centre returned from eight months out at the start of the campaign following surgery on his shoulder for deep vein thrombosis in February.",
        "Austin Reaves put up a career-high 51 points as the Los Angeles Lakers beat the Sacramento Kings 127-120.",
        "Without the injured Luka Doncic and LeBron James, Reaves took a leading role to surpass his previous best tally of 45 against the Indiana Pacers in February.",
        "Elsewhere, Anthony Davis scored 25 points and recorded 10 rebounds as the Dallas Mavericks beat the Toronto Raptors 139-129, while Kawhi Leonard managed 30 points and James Harden scored 20 as the Los Angeles Clippers saw off the Portland Trail Blazers 114-107.",
        "Giannis Antetokounmpo managed 40 points, 14 rebounds and nine assists but could not prevent the Milwaukee Bucks from falling to a 118-113 defeat against the Cleveland Cavaliers."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/basketball/articles/c5ypg5e2707o",
      "main_category": "sport",
      "detailed_category": "basketball",
      "topic": "Heat & Trail Blazers win first games since arrests",
      "content": [
        "Miami Heat claimed a crushing 146-114 win over the Memphis Grizzlies in their first  NBA game since guard Terry Rozier was arrested over alleged illegal sports betting.Portland Trail Blazers coach Chauncey Billups was also detained as part of a sweeping FBI investigation into illegal gambling. Both men deny the allegations.But the Heat were not distracted as they put up 86 first-half points to lead Memphis by 39 after two quarters, the biggest half-time advantage in the franchise's 37-year history.Bam Adebayo led the way with 24 points and afterwards said Rozier had the team's full backing.\"We stand behind him. Full support,\" Adebayo said. \"You support him through and through. That's our brother at the end of the day.\"Heat coach Erik Spoelstra added: \"Terry is somebody who is very dear to all of us. He's had a real positive impact on our locker room. \"We send our thoughts and our care for him as he goes through this.\"Portland also won their first game since the arrests, with Brazilian Tiago Splitter stepping in as interim coach in Billups' absence and leading the team to a convincing 139-119 victory over the Golden State Warriors.\"We all had great experiences with Chauncey and how he coached,\" Splitter said. \"We're thinking of him and his family but we have a job to do.\"",
        "Speaking about the arrests for the first time, NBA commissioner Adam Silver said he was \"deeply disturbed\" by the events of the past few days.\"There's nothing more important to the league and its fans than the integrity of the competition,\" he told Amazon Prime. \"And so I had a pit in my stomach. It was very upsetting.\"Silver also said an NBA investigation into Rozier's actions in March 2023, when there was \"aberrational betting\" in a game he played for the Charlotte Hornets against the New Orleans Pelicans, found nothing untoward.\"It was brought to our attention by the regulators and the betting companies,\" he added.\"We then looked into that situation and were very transparent about it. And while there was that aberrational betting, we, frankly, couldn't find anything.\"The federal government has subpoena power... [it] can threaten to put people in jail, can do all kinds of things that the league office can't do.\"So, we've been working with them since then. And, of course, what they announced yesterday was an indictment.\"And two and a half years later, he still hasn't been convicted of anything, in fairness to Terry.\"Obviously, it doesn't look good, but he's been put on administrative leave, and so it is a balance here between protecting people's rights and investigating.\"",
        "Elsewhere, Los Angeles Lakers star Luka Doncic scored more than 40 points for the second game in a row to start the season.After racking up 43 points in a season-opening loss to the Warriors, the Slovenian put up 49 points - to go with 11 rebounds and eight assists - as the Lakers beat the Minnesota Timberwolves 128-110.Greek forward Giannis Antetokounmpo also had a big night with 31 points, 20 rebounds and seven assists in the Milwaukee Bucks' 122-116 win at the Toronto Raptors.Houston Rockets were beaten 115-111 by the Detroit Pistons despite 37 points from Kevin Durant, while Victor Wembanyama had 29 points, 11 rebounds and nine blocks in the San Antonio Spurs' overtime win against the Pelicans.Meanwhile, Great Britain's Amari Williams made his NBA debut late on in the Boston Celtics' 105-95 loss to the New York Knicks.",
        "The Miami Heat scored 86 first-half points against the Memphis Grizzlies",
        "Miami Heat claimed a crushing 146-114 win over the Memphis Grizzlies in their first  NBA game since guard Terry Rozier was arrested over alleged illegal sports betting.",
        "Portland Trail Blazers coach Chauncey Billups was also detained as part of a sweeping FBI investigation into illegal gambling. Both men deny the allegations.",
        "But the Heat were not distracted as they put up 86 first-half points to lead Memphis by 39 after two quarters, the biggest half-time advantage in the franchise's 37-year history.",
        "Bam Adebayo led the way with 24 points and afterwards said Rozier had the team's full backing.",
        "\"We stand behind him. Full support,\" Adebayo said. \"You support him through and through. That's our brother at the end of the day.\"",
        "Heat coach Erik Spoelstra added: \"Terry is somebody who is very dear to all of us. He's had a real positive impact on our locker room.",
        "\"We send our thoughts and our care for him as he goes through this.\"",
        "Portland also won their first game since the arrests, with Brazilian Tiago Splitter stepping in as interim coach in Billups' absence and leading the team to a convincing 139-119 victory over the Golden State Warriors.",
        "\"We all had great experiences with Chauncey and how he coached,\" Splitter said. \"We're thinking of him and his family but we have a job to do.\"",
        "Speaking about the arrests for the first time, NBA commissioner Adam Silver said he was \"deeply disturbed\" by the events of the past few days.",
        "\"There's nothing more important to the league and its fans than the integrity of the competition,\" he told Amazon Prime. \"And so I had a pit in my stomach. It was very upsetting.\"",
        "Silver also said an NBA investigation into Rozier's actions in March 2023, when there was \"aberrational betting\" in a game he played for the Charlotte Hornets against the New Orleans Pelicans, found nothing untoward.",
        "\"It was brought to our attention by the regulators and the betting companies,\" he added.",
        "\"We then looked into that situation and were very transparent about it. And while there was that aberrational betting, we, frankly, couldn't find anything.",
        "\"The federal government has subpoena power... [it] can threaten to put people in jail, can do all kinds of things that the league office can't do.",
        "\"So, we've been working with them since then. And, of course, what they announced yesterday was an indictment.",
        "\"And two and a half years later, he still hasn't been convicted of anything, in fairness to Terry.",
        "\"Obviously, it doesn't look good, but he's been put on administrative leave, and so it is a balance here between protecting people's rights and investigating.\"",
        "Elsewhere, Los Angeles Lakers star Luka Doncic scored more than 40 points for the second game in a row to start the season.",
        "After racking up 43 points in a season-opening loss to the Warriors, the Slovenian put up 49 points - to go with 11 rebounds and eight assists - as the Lakers beat the Minnesota Timberwolves 128-110.",
        "Greek forward Giannis Antetokounmpo also had a big night with 31 points, 20 rebounds and seven assists in the Milwaukee Bucks' 122-116 win at the Toronto Raptors.",
        "Houston Rockets were beaten 115-111 by the Detroit Pistons despite 37 points from Kevin Durant, while Victor Wembanyama had 29 points, 11 rebounds and nine blocks in the San Antonio Spurs' overtime win against the Pelicans.",
        "Meanwhile, Great Britain's Amari Williams made his NBA debut late on in the Boston Celtics' 105-95 loss to the New York Knicks."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/basketball/articles/c80374kz80eo",
      "main_category": "sport",
      "detailed_category": "basketball",
      "topic": "Curry & Green react to NBA gambling scandal",
      "content": [
        "Golden State Warriors superstar Stephen Curry says he \"wouldn't worry\" about the NBA's integrity despite an FBI investigation into illegal sports betting.Miami Heat player Terry Rozier and Portland Trail Blazers head coach Chauncey Billups are among dozens of people arrested as part of a sweeping investigation that also includes allegedly rigged, mafia-linked poker games.Rozier and Billups were named by federal prosecutors in two separate indictments on Thursday. Both men deny the allegations.Rozier, 31, is among six people arrested over alleged betting irregularities. They include NBA players being accused of faking injuries to influence gambling markets.There is concern about the impact of gambling on the integrity of American sports, with most US states having legalised sports betting since the US Supreme Court overturned the Professional and Amateur Sports Protection Act in 2018.\"I think on the whole, everybody's very mindful of what to do, what not to do, and understanding the landscape of sports right now in general,\" said Curry, who has twice been the NBA's Most Valuable Player.\"And that's not just a NBA thing, this is new territory for everybody. So I think, on the whole, we all are very responsible.\"The integrity of the game is fine, and then obviously we let the situation play out, whatever happens. But I wouldn't worry about that too much.\"Warriors team-mate Draymond Green, who has won four NBA championships with Curry, added: \"I was shocked. It's a tough moment for the individuals involved, a tough moment for the league.\"But I'm not going to sit here and be like, 'man, you all partner with a gambling company, you open a can of worms'. That can of worms can be open with partnering with gambling companies or not. \"Partnering with a gambling company is not going to make gambling more accessible to us. The accessibility is what it is.\"",
        "Billups oversaw his side's defeat to the Minnesota Timberwolves hours before his arrest. Rozier was in Orlando for the Heat's defeat to the Magic prior to his arrest but was not involved in the match.Former NBA player and coach Damon Jones was also arrested as part of the investigation, which has identified seven NBA matches between February 2023 and March 2024.Rozier is said to have been involved in leaking insider information and faking injuries to influence betting odds for a match between the Charlotte Hornets and the New Orleans Pelicans in March 2023. Rozier was a Hornets player at the time and played in that match.Jones, who ended his playing career in 2012, is alleged to have been involved in two matches - between the Los Angeles Lakers and the Milwaukee Bucks in February 2023 and the Lakers and the Oklahoma City Thunder in January 2024 - that were part of the scheme.The second indictment is related to illegal poker games with ties to organised crime that involved a total of 31 defendants, including Billups, who was inducted into the Hall of Fame last year.Charges as part of that case include robbery, extortion, wire fraud, bank fraud and illegal gambling.Billups and Rozier both appeared in court on Thursday and were placed \"on immediate leave\" from their positions by the NBA prior to their court appearances. Both Miami and Portland have matches on Friday.Earlier this week, NBA commissioner Adam Silver called for tougher regulations, external on gambling in the US.Article 35 of the NBA constitution says the commissioner has the power to \"direct the dismissal and perpetual disqualification\" of any player \"offering, agreeing, conspiring, aiding or attempting to cause any game of basketball to result otherwise than on its merits\".It adds that the penalty for \"any player who, directly or indirectly, wagers money or anything of value on the outcome of any game\" is down to the commissioner and \"may include a fine, suspension, expulsion and/or perpetual disqualification\".",
        "This video can not be played",
        "'I was shocked' - Warriors stars Curry & Green react to the NBA gambling scandal",
        "Golden State Warriors superstar Stephen Curry says he \"wouldn't worry\" about the NBA's integrity despite an FBI investigation into illegal sports betting.",
        "Miami Heat player Terry Rozier and Portland Trail Blazers head coach Chauncey Billups are among dozens of people arrested as part of a sweeping investigation that also includes allegedly rigged, mafia-linked poker games.",
        "Rozier and Billups were named by federal prosecutors in two separate indictments on Thursday. Both men deny the allegations.",
        "Rozier, 31, is among six people arrested over alleged betting irregularities. They include NBA players being accused of faking injuries to influence gambling markets.",
        "There is concern about the impact of gambling on the integrity of American sports, with most US states having legalised sports betting since the US Supreme Court overturned the Professional and Amateur Sports Protection Act in 2018.",
        "\"I think on the whole, everybody's very mindful of what to do, what not to do, and understanding the landscape of sports right now in general,\" said Curry, who has twice been the NBA's Most Valuable Player.",
        "\"And that's not just a NBA thing, this is new territory for everybody. So I think, on the whole, we all are very responsible.",
        "\"The integrity of the game is fine, and then obviously we let the situation play out, whatever happens. But I wouldn't worry about that too much.\"",
        "Warriors team-mate Draymond Green, who has won four NBA championships with Curry, added: \"I was shocked. It's a tough moment for the individuals involved, a tough moment for the league.",
        "\"But I'm not going to sit here and be like, 'man, you all partner with a gambling company, you open a can of worms'. That can of worms can be open with partnering with gambling companies or not.",
        "\"Partnering with a gambling company is not going to make gambling more accessible to us. The accessibility is what it is.\"",
        "What we know about arrests in FBI's illegal gambling investigation",
        "NBA stars and mafia among more than 30 arrested in illegal gambling crackdown",
        "Billups oversaw his side's defeat to the Minnesota Timberwolves hours before his arrest. Rozier was in Orlando for the Heat's defeat to the Magic prior to his arrest but was not involved in the match.",
        "Former NBA player and coach Damon Jones was also arrested as part of the investigation, which has identified seven NBA matches between February 2023 and March 2024.",
        "Rozier is said to have been involved in leaking insider information and faking injuries to influence betting odds for a match between the Charlotte Hornets and the New Orleans Pelicans in March 2023. Rozier was a Hornets player at the time and played in that match.",
        "Jones, who ended his playing career in 2012, is alleged to have been involved in two matches - between the Los Angeles Lakers and the Milwaukee Bucks in February 2023 and the Lakers and the Oklahoma City Thunder in January 2024 - that were part of the scheme.",
        "The second indictment is related to illegal poker games with ties to organised crime that involved a total of 31 defendants, including Billups, who was inducted into the Hall of Fame last year.",
        "Charges as part of that case include robbery, extortion, wire fraud, bank fraud and illegal gambling.",
        "Billups and Rozier both appeared in court on Thursday and were placed \"on immediate leave\" from their positions by the NBA prior to their court appearances. Both Miami and Portland have matches on Friday.",
        "Earlier this week, NBA commissioner Adam Silver called for tougher regulations, external on gambling in the US.",
        "Article 35 of the NBA constitution says the commissioner has the power to \"direct the dismissal and perpetual disqualification\" of any player \"offering, agreeing, conspiring, aiding or attempting to cause any game of basketball to result otherwise than on its merits\".",
        "It adds that the penalty for \"any player who, directly or indirectly, wagers money or anything of value on the outcome of any game\" is down to the commissioner and \"may include a fine, suspension, expulsion and/or perpetual disqualification\".",
        "Gilgeous-Alexander scores 55 points in Thunder win",
        "Wembanyama stars as Spurs dominate Mavericks"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/basketball/articles/c07m8lxl3k3o",
      "main_category": "sport",
      "detailed_category": "basketball",
      "topic": "What are the NBA's plans to take over Europe?",
      "content": [
        "The National Basketball Association (NBA) is making a big push to conquer Europe, both on and off the court.The 2025-26 season got under way this week and marks a major landmark in terms of how European players are a driving force in it, influencing the league's desire to do more in the continent.A record 135 international players started the NBA season as part of the opening night rosters. It included a record 71 European players, with the United Kingdom and France among countries with their highest number in starting rosters.Five of the NBA's last seven Most Valuable Player award winners have also been from Europe, including three for Serbia's Nikola Jokic with the Denver Nuggets.Basketball is the continent's fastest growing and second-most popular sport, with Germany currently Fiba's World Cup champions.Despite its popularity, though, it takes home less than 1% of Europe's $45bn (£33.7bn) sports media and sponsorship markets.The NBA is hosting three international regular season matches this season, with Berlin and London the stage in January, 2026.With a number of the league's best players coming from European nations and viewership continuing to grow, the NBA is looking to further make an impact.",
        "The NBA has regularly held regular season matches in Europe since 2011 and yearly since 2013.London had been the home for the NBA's annual regular season match in Europe between 2013 and 2019 and, prior to 2020, the only European host city for games.In 2020, that was switched to Paris who held a regular season game yearly until last season, where it hosted a double-header.For the next three seasons, the NBA announced it will host matches in two European cities that include a UK return.Berlin will host its first ever match on 15 January between the Memphis Grizzlies and Orlando Magic. Three days later, the two sides will face each other again in London.In 2027, Manchester and Paris will host one match each and, in 2028, Paris and Berlin will get one match each.Since 1984, 97 games that have involved NBA teams have been held in Europe, including pre-season gamesThere are also a number of programmes away from the game, such as Basketball Without Borders (BWB), taking place. This is a camp for the best young international basketball players to get to train with current NBA and WNBA players and coaches in front of scouts from across the league.The NBA recently announced an investment of £10m into the growth of basketball in the UK, with basketball currently the second-most participated sport in the country.",
        "The NBA is proposing the formation of a European league that will effectively serve as its own in the continent.Current plans, as confirmed by deputy commissioner Mark Tatum earlier this week, are to launch the league within the next two years.Unlike breakaway competitions in other sports, the NBA has been devising its plans alongside Fiba, the International Basketball Association, and are subject to approval from both boards.The Basketball Africa League (BAL) is a similar concept that has been run in partnership with the NBA since 2021.While BAL is a fully-open league, NBA Europe's proposals are a combination of the franchise system used in America and the European open model found in football to create a semi-open system.",
        "While plans are yet to become fully concrete, there is an idea of how the launch of an NBA Europe could look.Initial plans are for 10-12 set franchises that would stay in the league on an annual basis.A league of potentially 16 teams is being looked at, combining those set franchises with open spots that teams will be able to qualify for.The nuances of how teams can qualify is still to be worked out. Options include performances from teams in the Basketball Champions League, effectively European basketball's second-tier competition at present.Another option is teams qualifying by winning their domestic championships.The long-term plans are that all club teams would have the opportunity to qualify for this NBA Europe league in some capacity, similarly to football's continental club competitions.Unlike EuroLeague, who currently decides the entry format, the qualification to play in NBA Europe is set to be more open.Conversations between the NBA and EuroLeague remain open with the hope  the new plans can co-exist and help the growth in Europe.Tatum hopes the number of set franchises in the league will have doubled from its initial launch within seven-10 years.Talks with potential investors, stakeholders and teams are at a preliminary stage, but further talks are planned for the \"near and immediate future\".Tatum added the next eight weeks will give the NBA a \"good sense of where we are in terms of level of interest\".JP Morgan and The Raine Group have been appointed as advisers for the league's plans.",
        "Tatum said initial plans are for the franchises to consist of teams from the UK, France, Spain, Italy and Germany - the quintet also hold a major European prominence in football.Turkey and Greece could also have core franchises.The identities of those teams are set to be a mix of existing basketball clubs, new clubs and football teams who currently do and do not have basketball clubs aligned with them.Football teams Real Madrid, Barcelona and Bayern Munich all currently have basketball teams and currently in the 2025 EuroLeague.Olympiakos, Panathinaikos, Fenerbahce, Partizan Belgarde and Red Star Belgrade also have partnering basketball teams in the competition.Currently, there are no UK-based teams in the EuroLeague and the men's national team are currently banned from competing in international competitions by Fiba due to governance issues.Despite that, Tatum told BBC Sport: \"The UK is going to play a significant role in the proposed European league. For the first time ever, [there will be] permanent franchises in the UK that will play top tier league basketball across Europe.\"I think that will continue to fuel the growth of basketball in the UK.\"London, Manchester, Paris and Berlin - the four cities to host NBA games between 2026 and 2028 - have all been identified as being among the league's key cities to target and means franchises in all four are likely.Lyon, Rome, Milan, Istanbul, Athens are also among the cities that could have franchises, as well as Madrid, Barcelona and Munich.A move for English football clubs to become multi-sport are not uncommon either. Earlier this year, Nottingham Forest entered a team into the Netball Super League.BBC Sport understands Manchester City have expressed an interest in having a team and early conversations with the NBA have taken place.This article is the latest from BBC Sport's Ask Me Anything team.",
        "Ask Me Anything is a service dedicated to answering your questions.We want to reward your time by telling you things you do not know and reminding you of things you do.The team will find out everything you need to know and be able to call upon a network of contacts including our experts and pundits.We will be answering your questions from the heart of the BBC Sport newsroom, and going behind the scenes at some of the world's biggest sporting events.Our coverage will span the BBC Sport website, app, social media and YouTube accounts, plus BBC TV and radio.",
        "How does the NBA work and when does the season start?What are NBA debut patches?Why is NBA returning to China after six years?What we know about arrests in FBI's illegal gambling investigation",
        "The National Basketball Association (NBA) is making a big push to conquer Europe, both on and off the court.",
        "The 2025-26 season got under way this week and marks a major landmark in terms of how European players are a driving force in it, influencing the league's desire to do more in the continent.",
        "A record 135 international players started the NBA season as part of the opening night rosters.",
        "It included a record 71 European players, with the United Kingdom and France among countries with their highest number in starting rosters.",
        "Five of the NBA's last seven Most Valuable Player award winners have also been from Europe, including three for Serbia's Nikola Jokic with the Denver Nuggets.",
        "Basketball is the continent's fastest growing and second-most popular sport, with Germany currently Fiba's World Cup champions.",
        "Despite its popularity, though, it takes home less than 1% of Europe's $45bn (£33.7bn) sports media and sponsorship markets.",
        "The NBA is hosting three international regular season matches this season, with Berlin and London the stage in January, 2026.",
        "With a number of the league's best players coming from European nations and viewership continuing to grow, the NBA is looking to further make an impact.",
        "Send us your questions",
        "French forward Victor Wembanyama, who currently plays for the San Antonio Spurs, is one of the league's most popular and talented players",
        "The NBA has regularly held regular season matches in Europe since 2011 and yearly since 2013.",
        "London had been the home for the NBA's annual regular season match in Europe between 2013 and 2019 and, prior to 2020, the only European host city for games.",
        "In 2020, that was switched to Paris who held a regular season game yearly until last season, where it hosted a double-header.",
        "For the next three seasons, the NBA announced it will host matches in two European cities that include a UK return.",
        "Berlin will host its first ever match on 15 January between the Memphis Grizzlies and Orlando Magic. Three days later, the two sides will face each other again in London.",
        "In 2027, Manchester and Paris will host one match each and, in 2028, Paris and Berlin will get one match each.",
        "Since 1984, 97 games that have involved NBA teams have been held in Europe, including pre-season games",
        "There are also a number of programmes away from the game, such as Basketball Without Borders (BWB), taking place. This is a camp for the best young international basketball players to get to train with current NBA and WNBA players and coaches in front of scouts from across the league.",
        "The NBA recently announced an investment of £10m into the growth of basketball in the UK, with basketball currently the second-most participated sport in the country.",
        "Al Ahly Tripoli won the most recent season of the Basketball Africa League",
        "The NBA is proposing the formation of a European league that will effectively serve as its own in the continent.",
        "Current plans, as confirmed by deputy commissioner Mark Tatum earlier this week, are to launch the league within the next two years.",
        "Unlike breakaway competitions in other sports, the NBA has been devising its plans alongside Fiba, the International Basketball Association, and are subject to approval from both boards.",
        "The Basketball Africa League (BAL) is a similar concept that has been run in partnership with the NBA since 2021.",
        "While BAL is a fully-open league, NBA Europe's proposals are a combination of the franchise system used in America and the European open model found in football to create a semi-open system.",
        "Real Madrid have one of basketball's most successful sides in Europe",
        "While plans are yet to become fully concrete, there is an idea of how the launch of an NBA Europe could look.",
        "Initial plans are for 10-12 set franchises that would stay in the league on an annual basis.",
        "A league of potentially 16 teams is being looked at, combining those set franchises with open spots that teams will be able to qualify for.",
        "The nuances of how teams can qualify is still to be worked out. Options include performances from teams in the Basketball Champions League, effectively European basketball's second-tier competition at present.",
        "Another option is teams qualifying by winning their domestic championships.",
        "The long-term plans are that all club teams would have the opportunity to qualify for this NBA Europe league in some capacity, similarly to football's continental club competitions.",
        "Unlike EuroLeague, who currently decides the entry format, the qualification to play in NBA Europe is set to be more open.",
        "Conversations between the NBA and EuroLeague remain open with the hope  the new plans can co-exist and help the growth in Europe.",
        "Tatum hopes the number of set franchises in the league will have doubled from its initial launch within seven-10 years.",
        "Talks with potential investors, stakeholders and teams are at a preliminary stage, but further talks are planned for the \"near and immediate future\".",
        "Tatum added the next eight weeks will give the NBA a \"good sense of where we are in terms of level of interest\".",
        "JP Morgan and The Raine Group have been appointed as advisers for the league's plans.",
        "New York Knicks forward OG Anunoby is one of four UK players currently on the active roster of NBA sides",
        "Tatum said initial plans are for the franchises to consist of teams from the UK, France, Spain, Italy and Germany - the quintet also hold a major European prominence in football.",
        "Turkey and Greece could also have core franchises.",
        "The identities of those teams are set to be a mix of existing basketball clubs, new clubs and football teams who currently do and do not have basketball clubs aligned with them.",
        "Football teams Real Madrid, Barcelona and Bayern Munich all currently have basketball teams and currently in the 2025 EuroLeague.",
        "Olympiakos, Panathinaikos, Fenerbahce, Partizan Belgarde and Red Star Belgrade also have partnering basketball teams in the competition.",
        "Currently, there are no UK-based teams in the EuroLeague and the men's national team are currently banned from competing in international competitions by Fiba due to governance issues.",
        "Despite that, Tatum told BBC Sport: \"The UK is going to play a significant role in the proposed European league. For the first time ever, [there will be] permanent franchises in the UK that will play top tier league basketball across Europe.",
        "\"I think that will continue to fuel the growth of basketball in the UK.\"",
        "London, Manchester, Paris and Berlin - the four cities to host NBA games between 2026 and 2028 - have all been identified as being among the league's key cities to target and means franchises in all four are likely.",
        "Lyon, Rome, Milan, Istanbul, Athens are also among the cities that could have franchises, as well as Madrid, Barcelona and Munich.",
        "A move for English football clubs to become multi-sport are not uncommon either. Earlier this year, Nottingham Forest entered a team into the Netball Super League.",
        "BBC Sport understands Manchester City have expressed an interest in having a team and early conversations with the NBA have taken place.",
        "This article is the latest from BBC Sport's Ask Me Anything team.",
        "Ask Me Anything is a service dedicated to answering your questions.",
        "We want to reward your time by telling you things you do not know and reminding you of things you do.",
        "The team will find out everything you need to know and be able to call upon a network of contacts including our experts and pundits.",
        "We will be answering your questions from the heart of the BBC Sport newsroom, and going behind the scenes at some of the world's biggest sporting events.",
        "Our coverage will span the BBC Sport website, app, social media and YouTube accounts, plus BBC TV and radio.",
        "How does the NBA work and when does the season start?",
        "What are NBA debut patches?",
        "Why is NBA returning to China after six years?",
        "What we know about arrests in FBI's illegal gambling investigation"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/basketball/articles/cd67jl19ewwo",
      "main_category": "sport",
      "detailed_category": "basketball",
      "topic": "Gilgeous-Alexander scores 55 points in Thunder win",
      "content": [
        "Shai Gilgeous-Alexander scored a career-high 55 points to lead the Oklahoma City Thunder to a double-overtime victory against the Indiana Pacers in a rematch of last season's NBA Finals.The reigning NBA Most Valuable Player added eight rebounds and five assists as the defending champions claimed a 141-135 win.It came just hours after the league was rocked by an FBI investigation into illegal sports betting and an illegal poker ring tied to organised crime.Gilgeous-Alexander had scored the winning points in a double-overtime win against the Houston Rockets in the Thunder's season-opener on Wednesday.",
        "Once again the Canadian guard proved crucial, netting nine points in the second overtime as he beat his previous career-best of 54 points.\"This team has two great qualities,\" Gilgeous-Alexander said. \"It knows how to stay in the moment and it understands that the beginning of the season is just as important as the end of the season.\"The Thunder became the first team in NBA history to go into double overtime in their first two games of a campaign.Indiana have been without star guard Tyrese Haliburton, who tore his Achilles tendon in June, while they suffered another injury blow on Thursday when they lost guard Andrew Nembhard to a shoulder injury in the second quarter.Elsewhere on Thursday, Stephen Curry scored 42 points to lead Golden State Warriors to a 137-131 win in overtime against the Denver Nuggets.",
        "Shai Gilgeous-Alexander had his fifth NBA career 50-point game",
        "Shai Gilgeous-Alexander scored a career-high 55 points to lead the Oklahoma City Thunder to a double-overtime victory against the Indiana Pacers in a rematch of last season's NBA Finals.",
        "The reigning NBA Most Valuable Player added eight rebounds and five assists as the defending champions claimed a 141-135 win.",
        "It came just hours after the league was rocked by an FBI investigation into illegal sports betting and an illegal poker ring tied to organised crime.",
        "Gilgeous-Alexander had scored the winning points in a double-overtime win against the Houston Rockets in the Thunder's season-opener on Wednesday.",
        "Once again the Canadian guard proved crucial, netting nine points in the second overtime as he beat his previous career-best of 54 points.",
        "\"This team has two great qualities,\" Gilgeous-Alexander said.",
        "\"It knows how to stay in the moment and it understands that the beginning of the season is just as important as the end of the season.\"",
        "The Thunder became the first team in NBA history to go into double overtime in their first two games of a campaign.",
        "Indiana have been without star guard Tyrese Haliburton, who tore his Achilles tendon in June, while they suffered another injury blow on Thursday when they lost guard Andrew Nembhard to a shoulder injury in the second quarter.",
        "Elsewhere on Thursday, Stephen Curry scored 42 points to lead Golden State Warriors to a 137-131 win in overtime against the Denver Nuggets."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/basketball/articles/c20e1zde452o",
      "main_category": "sport",
      "detailed_category": "basketball",
      "topic": "Chess, monks & Nasa - Wembanyama's unusual pre-season",
      "content": [
        "The 2025 NBA All-Star Game in February was the last time Victor Wembanyama stepped on to an NBA court.Three days later, the 21-year-old French forward was ruled out for the remainder of the season with deep vein thrombosis in his right shoulder.It is a condition that can threaten both an athlete's career and their life.Eight months on, the 2024 NBA Rookie of the Year will start his third campaign as the San Antonio Spurs take on the Dallas Mavericks.Wembanyama is returning to the league as a man transformed and has been tipped to pick up from where he left off in February.Physically, he has had a growth spurt - officially listed with a height of 7ft 4in (2.24m) - one inch taller than last season. Some reports suggest he is closer to 7ft 5in.Wembanyama also has a listed weight of 16st 11lb (106.6kg), dropping two pounds since 2023, but he told actor Kevin Hart that he has actually gained \"probably like 30 pounds\" during his two years in the NBA.That growth in size and power has been downplayed by Wembanyama himself and Spurs officials, but it has only added to the excitement around the French star's return.With an average of 17 points, nearly nine rebounds and four assists in pre-season, 'Wemby' is playing as if he has never been away.",
        "In an off-season that started two months earlier than planned, due to injury, Wembanyama's popularity has continued to soar.En route to becoming the fastest player in NBA history to attract a combined total of one billion social media followers and likes on posts across platforms, Wembanyama made the most of his time off the court.Athletes often holiday in their downtime, but Wembanyama went one step further - spending 10 days at a Shaolin Temple in Zhengzhou, China, training with monks.His travelling did not stop there. Videos emerged of him playing football with locals in Costa Rica and Tokyo.Nicknamed 'the Alien', Wembanyama also visited Nasa's Johnson Space Centre, hosted a chess and basketball tournament at his own court in Le Chesnay in France and met Harry Potter star Daniel Radcliffe.Wembanyama is also an avid reader, often found engrossed in a book in the hours leading up to games.\"He is so intentional in the variety of ways that he tries to improve as a player and person,\" said Spurs head coach Mitch Johnson.\"It's constantly trying to push himself out of his comfort zone and learn new things.\"On the court, the 1994 NBA Most Valuable Player and 12-time NBA all-star Hakeem Olajuwon invited Wembanyama to train privately with him in one of the most exclusive camps in the sport. Previous attendees include LeBron James, Giannis Antetokounmpo and the late Kobe Bryant.He also trained with another great of the sport, Kevin Garnett, on his road to Wednesday's long-awaited return.While Wembanyama said all of his extra-curricular summer activities \"deserved respect\", he puts a return to full basketball fitness above them all - helped by time spent with Olajuwon and Garnett.\"I can assure you nobody has trained like I did this summer,\" added the French star. \"I think I've maxed out what I could do in one summer. Now, I need to play basketball.\"",
        "Wembanyama's absence led to him missing the last 30 games of the Spurs' season. In that time, they recorded only 11 victories.Despite missing 36 games in total last season, he made more blocks than any other player for a second straight season.Prior to his season-ending injury, the Spurs had a record of 23 wins and 29 losses, giving them at least a chance of making the post-season for the first time since 2021-22.But the Spurs have young stars that signal a clear path to the future. Their roster combines the youth of Stephon Castle, the 2024-25 NBA Rookie of the Year, with the experience of De'Aaron Fox, Kelly Olynyk and Harrison Barnes. A further influx of talent has arrived, in the form of 2025 first-round draft picks Dylan Harper, Carter Bryant and young Briton Jeremy Sochan.In pre-season, Wembanyama's in-game statistics remain at a level that shows promise for the new campaign - helping his side to four victories, including back-to-back wins over Eastern Conference champions the Indiana Pacers.He is among the early favourites to become the league's Most Valuable Player this season. It may not yet be his time, but his talent is unquestioned.But an MVP award at some point in his already stellar NBA career, providing his injury troubles do not return, feels more probable than possible.",
        "Victor Wembanyama has averaged 22.5 points, 3.8 assists and 10.8 rebounds per game across his 117 NBA appearances to date",
        "The 2025 NBA All-Star Game in February was the last time Victor Wembanyama stepped on to an NBA court.",
        "Three days later, the 21-year-old French forward was ruled out for the remainder of the season with deep vein thrombosis in his right shoulder.",
        "It is a condition that can threaten both an athlete's career and their life.",
        "Eight months on, the 2024 NBA Rookie of the Year will start his third campaign as the San Antonio Spurs take on the Dallas Mavericks.",
        "Wembanyama is returning to the league as a man transformed and has been tipped to pick up from where he left off in February.",
        "Physically, he has had a growth spurt - officially listed with a height of 7ft 4in (2.24m) - one inch taller than last season. Some reports suggest he is closer to 7ft 5in.",
        "Wembanyama also has a listed weight of 16st 11lb (106.6kg), dropping two pounds since 2023, but he told actor Kevin Hart that he has actually gained \"probably like 30 pounds\" during his two years in the NBA.",
        "That growth in size and power has been downplayed by Wembanyama himself and Spurs officials, but it has only added to the excitement around the French star's return.",
        "With an average of 17 points, nearly nine rebounds and four assists in pre-season, 'Wemby' is playing as if he has never been away.",
        "Wembanyama hosted a chess and basketball tournament called Hoop Gambit during the summer",
        "In an off-season that started two months earlier than planned, due to injury, Wembanyama's popularity has continued to soar.",
        "En route to becoming the fastest player in NBA history to attract a combined total of one billion social media followers and likes on posts across platforms, Wembanyama made the most of his time off the court.",
        "Athletes often holiday in their downtime, but Wembanyama went one step further - spending 10 days at a Shaolin Temple in Zhengzhou, China, training with monks.",
        "His travelling did not stop there. Videos emerged of him playing football with locals in Costa Rica and Tokyo.",
        "Nicknamed 'the Alien', Wembanyama also visited Nasa's Johnson Space Centre, hosted a chess and basketball tournament at his own court in Le Chesnay in France and met Harry Potter star Daniel Radcliffe.",
        "Wembanyama is also an avid reader, often found engrossed in a book in the hours leading up to games.",
        "\"He is so intentional in the variety of ways that he tries to improve as a player and person,\" said Spurs head coach Mitch Johnson.",
        "\"It's constantly trying to push himself out of his comfort zone and learn new things.\"",
        "On the court, the 1994 NBA Most Valuable Player and 12-time NBA all-star Hakeem Olajuwon invited Wembanyama to train privately with him in one of the most exclusive camps in the sport. Previous attendees include LeBron James, Giannis Antetokounmpo and the late Kobe Bryant.",
        "He also trained with another great of the sport, Kevin Garnett, on his road to Wednesday's long-awaited return.",
        "While Wembanyama said all of his extra-curricular summer activities \"deserved respect\", he puts a return to full basketball fitness above them all - helped by time spent with Olajuwon and Garnett.",
        "\"I can assure you nobody has trained like I did this summer,\" added the French star.",
        "\"I think I've maxed out what I could do in one summer. Now, I need to play basketball.\"",
        "Wembanyama's last appearances of the 2024-25 season were at all-star weekend, prior to being diagnosed with deep vein thrombosis in his right shoulder",
        "Wembanyama's absence led to him missing the last 30 games of the Spurs' season. In that time, they recorded only 11 victories.",
        "Despite missing 36 games in total last season, he made more blocks than any other player for a second straight season.",
        "Prior to his season-ending injury, the Spurs had a record of 23 wins and 29 losses, giving them at least a chance of making the post-season for the first time since 2021-22.",
        "But the Spurs have young stars that signal a clear path to the future. Their roster combines the youth of Stephon Castle, the 2024-25 NBA Rookie of the Year, with the experience of De'Aaron Fox, Kelly Olynyk and Harrison Barnes. A further influx of talent has arrived, in the form of 2025 first-round draft picks Dylan Harper, Carter Bryant and young Briton Jeremy Sochan.",
        "In pre-season, Wembanyama's in-game statistics remain at a level that shows promise for the new campaign - helping his side to four victories, including back-to-back wins over Eastern Conference champions the Indiana Pacers.",
        "He is among the early favourites to become the league's Most Valuable Player this season. It may not yet be his time, but his talent is unquestioned.",
        "But an MVP award at some point in his already stellar NBA career, providing his injury troubles do not return, feels more probable than possible."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/basketball/articles/cp98gm472jro",
      "main_category": "sport",
      "detailed_category": "basketball",
      "topic": "Can you name every team in the NBA in 10 minutes?",
      "content": [
        "The new NBA season gets under way on Tuesday, 21 October (00:30 BST Wednesday, 22 October) with 30 teams from across North America hoping this will be their year.To celebrate we're challenging you to name every team in the NBA.You have 10 minutes. Good luck!",
        "Fancy testing your knowledge? Go to our dedicated sport quizzes page and sign up for notifications to get the latest quizzes sent straight to your device.",
        "The new NBA season gets under way on Tuesday, 21 October (00:30 BST Wednesday, 22 October) with 30 teams from across North America hoping this will be their year.",
        "To celebrate we're challenging you to name every team in the NBA.",
        "You have 10 minutes. Good luck!",
        "Can you name every Champions League winner?",
        "Can you spot the Faithfuls in our Traitors-inspired quiz?",
        "Can you name every team in the NFL in 10 minutes?",
        "Fancy testing your knowledge? Go to our dedicated sport quizzes page and sign up for notifications to get the latest quizzes sent straight to your device."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/basketball/articles/c629gj352vgo",
      "main_category": "sport",
      "detailed_category": "basketball",
      "topic": "Wembanyama stars as Spurs dominate Mavericks",
      "content": [
        "Victor Wembanyama scored 40 points as the San Antonio Spurs started their season with a convincing 125-92 win over the Dallas Mavericks.The Frenchman, making his first appearance in the regular season since undergoing surgery on his shoulder for deep vein thrombosis in February, recorded the fifth 40-point match of his career.The 21-year-old's performance overshadowed a nervous start from Cooper Flagg on his NBA debut.The 18-year-old, the number one overall pick in the 2025 draft, became the second-youngest starter in NBA history behind LeBron James on his Mavs debut.But the teenager struggled to impose himself, failing to score until the second half and finishing on 10 points. Wembanyama, by contrast, had 21 points by half-time and displayed little rustiness after his eight-month absence.",
        "Philadelphia 76ers rookie VJ Edgecombe scored the third-most points of a debutant in NBA history in his side's 117-116 win over the Boston Celtics.His 34-point haul was the most any debutant has managed since Wilt Chamberlain hit 43 points on his Philadelphia Warriors bow in 1959.\"Man, yeah, that was crazy. That surpassed my expectation, to be honest,\" said Edgecombe.Elsewhere, OG Anunoby, who was born in England but moved to the US when he was four years old, hit 24 points and recorded 14 rebounds as the New York Knicks beat the Cleveland Cavaliers 119-111 to give Mike Brown victory on his first outing as head coach.NBA opening round results in full",
        "Victor Wenbanyama made his NBA debut in 2023",
        "Victor Wembanyama scored 40 points as the San Antonio Spurs started their season with a convincing 125-92 win over the Dallas Mavericks.",
        "The Frenchman, making his first appearance in the regular season since undergoing surgery on his shoulder for deep vein thrombosis in February, recorded the fifth 40-point match of his career.",
        "The 21-year-old's performance overshadowed a nervous start from Cooper Flagg on his NBA debut.",
        "The 18-year-old, the number one overall pick in the 2025 draft, became the second-youngest starter in NBA history behind LeBron James on his Mavs debut.",
        "But the teenager struggled to impose himself, failing to score until the second half and finishing on 10 points.",
        "Wembanyama, by contrast, had 21 points by half-time and displayed little rustiness after his eight-month absence.",
        "Chess, monks & Nasa - Wembanyama's unusual pre-season",
        "Philadelphia 76ers rookie VJ Edgecombe scored the third-most points of a debutant in NBA history in his side's 117-116 win over the Boston Celtics.",
        "His 34-point haul was the most any debutant has managed since Wilt Chamberlain hit 43 points on his Philadelphia Warriors bow in 1959.",
        "\"Man, yeah, that was crazy. That surpassed my expectation, to be honest,\" said Edgecombe.",
        "Elsewhere, OG Anunoby, who was born in England but moved to the US when he was four years old, hit 24 points and recorded 14 rebounds as the New York Knicks beat the Cleveland Cavaliers 119-111 to give Mike Brown victory on his first outing as head coach.",
        "NBA opening round results in full"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/basketball/articles/c051mpq4n6mo",
      "main_category": "sport",
      "detailed_category": "basketball",
      "topic": "How does the NBA work and when does the season start?",
      "content": [
        "The 2025-26 National Basketball Association (NBA) season started on Tuesday, 22 October when defending champions Oklahoma City Thunder beat Houston Rockets in an opening match thriller.The regular season, as well as the in-season NBA Cup, takes place between October and April.After that, the play-offs take place to determine the NBA champions, who are crowned in June.",
        "All 30 teams are evenly split into two conferences of 15 - creating the Eastern Conference and the Western Conference.Each team plays 82 regular season matches between October and April, with the top six teams from each conference qualifying directly into the NBA play-offs.The teams between seventh and 10th enter the play-in tournament, where two more play-offs spots from each conference are up for grabs.There are also three divisions in each conference, with teams playing every other team in their division four times in the regular season.Teams will then play six of the other sides in their conference four times, while taking on the remaining four franchises three times. They will then face all 15 teams in their opposing conference twice.While the regular season sees teams play against opposition in both the Eastern and Western Conferences, the play-offs are conference specific. All rounds of the play-offs are played in a best of seven-match series.The winner of the Eastern Conference will face the winner of the Western Conference in the NBA finals in June, with the winner being crowned NBA champions.",
        "Eastern Conference:Atlantic DivisionBrooklyn NetsBoston CelticsNew York KnicksPhiladelphia 76ersToronto RaptorsCentral DivisionChicago BullsCleveland CavaliersDetroit PistonsIndiana PacersMilwaukee BucksSoutheast DivisionAtlanta HawksCharlotte HornetsMiami HeatOrlando MagicWashington WizardsWestern Conference:Northwest DivisionDenver NuggetsMinnesota TimberwolvesOklahoma City ThunderPortland Trail BlazersUtah JazzPacific DivisionGolden State WarriorsLos Angeles ClippersLos Angeles LakersPhoenix SunsSacramento KingsSouthwest DivisionDallas MavericksHouston RocketsMemphis GrizzliesNew Orleans PelicansSan Antonio Spurs",
        "The NBA Cup is an in-season competition where teams compete for a trophy, but results also count towards the overall season standingsThe event starts on Friday, October 31, with the final taking place on Tuesday, December 16.Teams face four teams from their conference and the group winners, as well as the best runner-up from each conference, advance into the quarter-finals.Like the play-offs, teams only play against opposition in the same conference in the quarter-final and semi-final. Matches are also one-off knockouts, rather than a series.The winners of each conference will meet in the championship game to determine the NBA Cup winner.The Milwaukee Bucks are the defending NBA Cup champions, while the first edition in 2023 was won by the Lakers.",
        "A record number of four British players will start the 2025-26 season as part of active squads.Two of them, forwards OG Anunoby and Tosan Evbuomwan, are part of the New York Knicks' squad.Jeremy Sochan, who plays internationally for Poland, is officially recognised by the NBA as a British player having spent part of his upbringing in England. The San Antonio Spurs forward is heading into his fourth term with the Spurs.British centre Amari Williams was drafted by the Boston Celtics earlier this year and is on their official list for the start of the season.In the cases of Evbuomwan and Williams, both have been listed on two-way contracts, meaning they will rotate between their respective teams' NBA sides and G League franchises.Irish guard CJ Fulton has also been signed by the Minnesota Timberwolves, but was left out of the Timberwolves' opening night squad list. It means Fulton is likely to start the season as part of Minnesota's G League side, the Iowa Wolves.",
        "For the first time since 2019, regular season games will be held in the United Kingdom.In January 2026, the Orlando Magic will face the Memphis Grizzlies three days after the two teams meet in Berlin - the city's first regular season match.The Dallas Mavericks will also face the Detroit Pistons in Mexico City in November.NBA's 2025 international games:November 1, 2025: Detroit Pistons v Dallas Mavericks – Mexico City Arena, Mexico City, MexicoJanuary 15, 2026: Memphis Grizzlies v Orlando Magic – Uber Arena, Berlin, GermanyJanuary 18, 2026: Orlando Magic v Memphis Grizzlies – The O2 Arena, London, Great Britain",
        "Since the 2018-19 season, all of the last seven NBA campaigns have been won by different teams.Prior to that, the Warriors were the most successful franchise in recent years, winning four NBA titles since the 2014-2015 term.The Celtics, who were 2023-24 champions, are the most successful franchise in NBA history with 18 wins.Last seven NBA winning sides2024-25: Oklahoma City Thunder2023-24: Boston Celtics2022-23: Denver Nuggets2021-22: Golden State Warriors2020-21: Milwaukee Bucks2019-20: Los Angeles Lakers2018-19: Toronto RaptorsThis article is the latest from BBC Sport's Ask Me Anything team.",
        "Ask Me Anything is a service dedicated to answering your questions.We want to reward your time by telling you things you do not know and reminding you of things you do.The team will find out everything you need to know and be able to call upon a network of contacts including our experts and pundits.We will be answering your questions from the heart of the BBC Sport newsroom, and going behind the scenes at some of the world's biggest sporting events.Our coverage will span the BBC Sport website, app, social media and YouTube accounts, plus BBC TV and radio.",
        "What are NBA debut patches?Why has Rugby League Ashes waited so long for revival?When is the 2027 Women's World Cup qualification draw?What is the DLS method and how does it work?",
        "The 2025-26 National Basketball Association (NBA) season started on Tuesday, 22 October when defending champions Oklahoma City Thunder beat Houston Rockets in an opening match thriller.",
        "The regular season, as well as the in-season NBA Cup, takes place between October and April.",
        "After that, the play-offs take place to determine the NBA champions, who are crowned in June.",
        "Send us your questions",
        "The NBA's 2024-25 Most Valuable Player Shai GIlgeous-Alexander helped inspire Oklahoma City Thunder to a first NBA Championship since 1979",
        "All 30 teams are evenly split into two conferences of 15 - creating the Eastern Conference and the Western Conference.",
        "Each team plays 82 regular season matches between October and April, with the top six teams from each conference qualifying directly into the NBA play-offs.",
        "The teams between seventh and 10th enter the play-in tournament, where two more play-offs spots from each conference are up for grabs.",
        "There are also three divisions in each conference, with teams playing every other team in their division four times in the regular season.",
        "Teams will then play six of the other sides in their conference four times, while taking on the remaining four franchises three times. They will then face all 15 teams in their opposing conference twice.",
        "While the regular season sees teams play against opposition in both the Eastern and Western Conferences, the play-offs are conference specific. All rounds of the play-offs are played in a best of seven-match series.",
        "The winner of the Eastern Conference will face the winner of the Western Conference in the NBA finals in June, with the winner being crowned NBA champions.",
        "Minnesota Timberwolves",
        "Oklahoma City Thunder",
        "Portland Trail Blazers",
        "Golden State Warriors",
        "Giannis Antetokounmpo was part of the Milwaukee Bucks side that won the 2024 NBA Cup",
        "The NBA Cup is an in-season competition where teams compete for a trophy, but results also count towards the overall season standings",
        "The event starts on Friday, October 31, with the final taking place on Tuesday, December 16.",
        "Teams face four teams from their conference and the group winners, as well as the best runner-up from each conference, advance into the quarter-finals.",
        "Like the play-offs, teams only play against opposition in the same conference in the quarter-final and semi-final. Matches are also one-off knockouts, rather than a series.",
        "The winners of each conference will meet in the championship game to determine the NBA Cup winner.",
        "The Milwaukee Bucks are the defending NBA Cup champions, while the first edition in 2023 was won by the Lakers.",
        "London-born OG Anunoby is a key player for the New York Knicks",
        "A record number of four British players will start the 2025-26 season as part of active squads.",
        "Two of them, forwards OG Anunoby and Tosan Evbuomwan, are part of the New York Knicks' squad.",
        "Jeremy Sochan, who plays internationally for Poland, is officially recognised by the NBA as a British player having spent part of his upbringing in England. The San Antonio Spurs forward is heading into his fourth term with the Spurs.",
        "British centre Amari Williams was drafted by the Boston Celtics earlier this year and is on their official list for the start of the season.",
        "In the cases of Evbuomwan and Williams, both have been listed on two-way contracts, meaning they will rotate between their respective teams' NBA sides and G League franchises.",
        "Irish guard CJ Fulton has also been signed by the Minnesota Timberwolves, but was left out of the Timberwolves' opening night squad list. It means Fulton is likely to start the season as part of Minnesota's G League side, the Iowa Wolves.",
        "For the first time since 2019, regular season games will be held in the United Kingdom.",
        "In January 2026, the Orlando Magic will face the Memphis Grizzlies three days after the two teams meet in Berlin - the city's first regular season match.",
        "The Dallas Mavericks will also face the Detroit Pistons in Mexico City in November.",
        "NBA's 2025 international games:",
        "November 1, 2025: Detroit Pistons v Dallas Mavericks – Mexico City Arena, Mexico City, Mexico",
        "January 15, 2026: Memphis Grizzlies v Orlando Magic – Uber Arena, Berlin, Germany",
        "January 18, 2026: Orlando Magic v Memphis Grizzlies – The O2 Arena, London, Great Britain",
        "Since the 2018-19 season, all of the last seven NBA campaigns have been won by different teams.",
        "Prior to that, the Warriors were the most successful franchise in recent years, winning four NBA titles since the 2014-2015 term.",
        "The Celtics, who were 2023-24 champions, are the most successful franchise in NBA history with 18 wins.",
        "Last seven NBA winning sides",
        "2024-25: Oklahoma City Thunder",
        "2023-24: Boston Celtics",
        "2022-23: Denver Nuggets",
        "2021-22: Golden State Warriors",
        "2020-21: Milwaukee Bucks",
        "2019-20: Los Angeles Lakers",
        "2018-19: Toronto Raptors",
        "This article is the latest from BBC Sport's Ask Me Anything team.",
        "Ask Me Anything is a service dedicated to answering your questions.",
        "We want to reward your time by telling you things you do not know and reminding you of things you do.",
        "The team will find out everything you need to know and be able to call upon a network of contacts including our experts and pundits.",
        "We will be answering your questions from the heart of the BBC Sport newsroom, and going behind the scenes at some of the world's biggest sporting events.",
        "Our coverage will span the BBC Sport website, app, social media and YouTube accounts, plus BBC TV and radio.",
        "What are NBA debut patches?",
        "Why has Rugby League Ashes waited so long for revival?",
        "When is the 2027 Women's World Cup qualification draw?",
        "What is the DLS method and how does it work?"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/basketball/articles/clyzrj7x99yo",
      "main_category": "sport",
      "detailed_category": "basketball",
      "topic": "Maluach's rise from South Sudan to 10th pick at NBA Draft",
      "content": [
        "Khaman Maluach used to dream the impossible as he walked the dusty streets of Kawempe, a disadvantaged suburb on the outskirts of Uganda's capital Kampala.On Wednesday evening, that dream became a reality as the 18-year-old's name echoed through the Barclays Center in Brooklyn, having been announced as the 10th pick at the 2025 National Basketball Association (NBA) Draft.Forced to play his first games wearing Crocs after taking up the sport aged 13, Maluach's talent has already seen him represent South Sudan at the Fiba World Cup and the Olympic Games.Even so, the 7ft 1in centre was overcome with emotion - with tears clearly evident alongside his smile - when he posed on stage with NBA commissioner Adam Silver.\"I didn't think I was going to cry,\" Maluach said.\"But everything was just going through my head; my whole journey, my people and the continent I represent.\"I believed in myself. I was delusional about my dreams. No matter what the odds are against you, it shows that you can win.\"The teenager had worn a special suit jacket for the occasion, with lining which displayed the South Sudanese and Ugandan flags.Back home in Entebbe, Uganda, where his family is based, joy had erupted.His mother, Mary Aweng, elder brother Majok Madit Maluach and other siblings burst into a celebratory dance and said a heartfelt prayer as they heard his name called.Majok described the moment as \"a blessing\" for the family and for Africa.",
        "Maluach's family had planned to be by his side, but their visa applications were denied because of a United States travel ban affecting South Sudanese citizens.Only his sister Agum Madit, who is based in Australia, was able to attend the event in New York.Maluach's coach from the Solid Skills Academy in Kampala, the programme that first scouted him, was also meant to be there.\"That was really unfortunate. It has taken part of our joy,\" coach Wal Deng told BBC Sport Africa.\"But nevertheless, we're so, so proud of him.\"It's like a dream that's actually reality. Seeing how far he's come, from learning the basics of basketball to now joining the NBA, this is a moment of immense joy.\"Maluach's status in the USA now looks secure.After signing with Duke University he had obtained an F1 visa, the standard US student visa, which was subsequently paused for South Sudanese nationals in April.That F1 status had already shifted back to a tourist visa while Maluach awaited the NBA Draft.Now officially drafted, he will transition to a P1 visa, typically granted to professional athletes competing in major US leagues.Many of the NBA's international players remain on P1 visas for the duration of their careers.",
        "Born in 2006 in Rumbek, South Sudan, Maluach's family fled to neighbouring Uganda to escape conflict.Raised by his mother alongside six siblings in Kawempe, basketball only entered his life after a boda boda (motorcycle taxi) rider encouraged him to take up the sport because of his height.\"The closest court was a one-hour walk and I didn't even have shoes,\" Maluach told BBC Sport Africa last year.Yet his potential was quickly spotted by local coaches Deng and Aketch Garang.\"He learned so quickly,\" Deng said. \"I told Aketch this kid would be the next big thing.\"Within a year, Maluach had earned a scholarship to the NBA Academy Africa in Dakar, Senegal, his first major leap toward the global stage.The teenager credits competing against the best talent on the continent with helping him \"level up\".By 16, he was playing for South Sudan's national team, helping them qualify for their first-ever Olympics via their performances at the 2023 Fiba World Cup.His performances in the Basketball Africa League and MVP honours at the 2023 Basketball Without Borders Africa camp cemented his status as a top prospect, and he committed to playing for Duke.Five years after first stepping onto a court, Maluach is set to take the next step on a remarkable journey which has been built on belief and persistence.\"It's a day I'll never forget,\" he said after being selected by the Houston Rockets, and then immediately traded to the Phoenix Suns.Deng, watching from afar, beamed with pride.\"Seeing him go from learning the basics to the highest level is really something rare,\" he said.\"He's a sign of hope to every African kid that anything is possible.\"",
        "Maluach is keenly aware of his role beyond the court.\"I want to change the narrative of how people see Africa,\" he said.\"I'm thinking about showing them the great places in Africa like Kigali, Senegal, safaris. The cultures and the people we have is different from the stuff they see on TV.\"The centre is eager to get started in Phoenix.\"I'm going to learn how to navigate the league, how to get better and how to stay consistent all year,\" he said.\"I'm excited to put on the Suns jersey that says 'Maluach' on the back.\"His Duke team-mate Cooper Flagg may have been the top Draft pick, but Maluach has not hidden his own lofty ambitions of reaching the NBA Hall of Fame.He has modelled his game on the likes of Giannis Antetokounmpo and Joel Embiid, and he now hopes to share the court with those very idols.\"I believed in myself before anyone else did,\" he said. \"Let God take care of the rest.\"After making the dream journey from war-torn South Sudan to the NBA, millions of African children will be watching and believing they too can make it.",
        "Khaman Maluach was drafted by Houston Rockets but immediately traded to Phoenix Suns",
        "Khaman Maluach used to dream the impossible as he walked the dusty streets of Kawempe, a disadvantaged suburb on the outskirts of Uganda's capital Kampala.",
        "On Wednesday evening, that dream became a reality as the 18-year-old's name echoed through the Barclays Center in Brooklyn, having been announced as the 10th pick at the 2025 National Basketball Association (NBA) Draft.",
        "Forced to play his first games wearing Crocs after taking up the sport aged 13, Maluach's talent has already seen him represent South Sudan at the Fiba World Cup and the Olympic Games.",
        "Even so, the 7ft 1in centre was overcome with emotion - with tears clearly evident alongside his smile - when he posed on stage with NBA commissioner Adam Silver.",
        "\"I didn't think I was going to cry,\" Maluach said.",
        "\"But everything was just going through my head; my whole journey, my people and the continent I represent.",
        "\"I believed in myself. I was delusional about my dreams. No matter what the odds are against you, it shows that you can win.\"",
        "The teenager had worn a special suit jacket for the occasion, with lining which displayed the South Sudanese and Ugandan flags.",
        "Back home in Entebbe, Uganda, where his family is based, joy had erupted.",
        "His mother, Mary Aweng, elder brother Majok Madit Maluach and other siblings burst into a celebratory dance and said a heartfelt prayer as they heard his name called.",
        "Majok described the moment as \"a blessing\" for the family and for Africa.",
        "Maluach's family had planned to be by his side, but their visa applications were denied because of a United States travel ban affecting South Sudanese citizens.",
        "Only his sister Agum Madit, who is based in Australia, was able to attend the event in New York.",
        "Maluach's coach from the Solid Skills Academy in Kampala, the programme that first scouted him, was also meant to be there.",
        "\"That was really unfortunate. It has taken part of our joy,\" coach Wal Deng told BBC Sport Africa.",
        "\"But nevertheless, we're so, so proud of him.",
        "\"It's like a dream that's actually reality. Seeing how far he's come, from learning the basics of basketball to now joining the NBA, this is a moment of immense joy.\"",
        "Maluach's status in the USA now looks secure.",
        "After signing with Duke University he had obtained an F1 visa, the standard US student visa, which was subsequently paused for South Sudanese nationals in April.",
        "That F1 status had already shifted back to a tourist visa while Maluach awaited the NBA Draft.",
        "Now officially drafted, he will transition to a P1 visa, typically granted to professional athletes competing in major US leagues.",
        "Many of the NBA's international players remain on P1 visas for the duration of their careers.",
        "This video can not be played",
        "Meet Khaman Maluach - BBC Sport Africa profiles South Sudan centre before Paris 2024",
        "Born in 2006 in Rumbek, South Sudan, Maluach's family fled to neighbouring Uganda to escape conflict.",
        "Raised by his mother alongside six siblings in Kawempe, basketball only entered his life after a boda boda (motorcycle taxi) rider encouraged him to take up the sport because of his height.",
        "\"The closest court was a one-hour walk and I didn't even have shoes,\" Maluach told BBC Sport Africa last year.",
        "Yet his potential was quickly spotted by local coaches Deng and Aketch Garang.",
        "\"He learned so quickly,\" Deng said. \"I told Aketch this kid would be the next big thing.\"",
        "Within a year, Maluach had earned a scholarship to the NBA Academy Africa in Dakar, Senegal, his first major leap toward the global stage.",
        "The teenager credits competing against the best talent on the continent with helping him \"level up\".",
        "By 16, he was playing for South Sudan's national team, helping them qualify for their first-ever Olympics via their performances at the 2023 Fiba World Cup.",
        "His performances in the Basketball Africa League and MVP honours at the 2023 Basketball Without Borders Africa camp cemented his status as a top prospect, and he committed to playing for Duke.",
        "Five years after first stepping onto a court, Maluach is set to take the next step on a remarkable journey which has been built on belief and persistence.",
        "\"It's a day I'll never forget,\" he said after being selected by the Houston Rockets, and then immediately traded to the Phoenix Suns.",
        "Deng, watching from afar, beamed with pride.",
        "\"Seeing him go from learning the basics to the highest level is really something rare,\" he said.",
        "\"He's a sign of hope to every African kid that anything is possible.\"",
        "Tears were evident on Maluach's face as he greeted NBA commissioner Adam Silver on stage at the Barclays Centre",
        "Maluach is keenly aware of his role beyond the court.",
        "\"I want to change the narrative of how people see Africa,\" he said.",
        "\"I'm thinking about showing them the great places in Africa like Kigali, Senegal, safaris. The cultures and the people we have is different from the stuff they see on TV.\"",
        "The centre is eager to get started in Phoenix.",
        "\"I'm going to learn how to navigate the league, how to get better and how to stay consistent all year,\" he said.",
        "\"I'm excited to put on the Suns jersey that says 'Maluach' on the back.\"",
        "His Duke team-mate Cooper Flagg may have been the top Draft pick, but Maluach has not hidden his own lofty ambitions of reaching the NBA Hall of Fame.",
        "He has modelled his game on the likes of Giannis Antetokounmpo and Joel Embiid, and he now hopes to share the court with those very idols.",
        "\"I believed in myself before anyone else did,\" he said. \"Let God take care of the rest.\"",
        "After making the dream journey from war-torn South Sudan to the NBA, millions of African children will be watching and believing they too can make it."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/basketball/articles/cj0qg4g2nvpo",
      "main_category": "sport",
      "detailed_category": "basketball",
      "topic": "The Jordan shot that 'changed the world'",
      "content": [
        "There were 15 seconds left on the clock when a 19-year-old college basketball player launched a 16-foot winning shot that would change sports marketing forever.Watching that day was marketing executive and grassroots promoter Sonny Vaccaro. He was so impressed by what he saw that two years later he would bet his job at sports manufacturer Nike on backing this relatively untested player.That player was Michael Jordan.But not the Jordan we know now. At the point Vaccaro witnessed him score the shot that won the 1982 NCAA championship for North Carolina Tar Heels, Jordan was just a freshman.When, two years later, Vaccaro urged his bosses to spend their whole yearly basketball endorsement budget on him, Jordan was only 21 and had never competed in the NBA. And no-one was talking about his footwear.Vaccaro says his conviction in the youngster's potential was forged the moment he watched him take that shot at the Louisiana Superdome, New Orleans.\"That shot changed the world because of what Michael Jordan became,\" the 85-year-old told BBC Sport.\"When he took the shot, it convinced me that he would take any shot in the world.\"But it was Vaccaro who had to take a shot first.In his memoir, Legends and Soles, he describes how he had to convince his bosses to take a chance on an up-and-coming star, while competitors such as Converse were endorsing household names including Earvin 'Magic' Johnson.By that time, Vaccaro had established himself as a basketball insider with an extensive knowledge of young players. In 1964, aged 24, he established The Dapper Dan Roundball Classic - the first national high school all-star basketball game.The tournament ran under different guises until 2007, showcasing future NBA stars including Moses Malone, LeBron James, Kevin Garnett, Kevin Love, Kobe Bryant, Patrick Ewing and Shaquille O'Neal.He also founded the ABCD basketball summer camp in 1984 - an invitational that gathered the country's highest-ranked high school players.Nevertheless, Vaccaro told BBC Sport former Nike boss Phil Knight was not satisfied with the Jordan proposal \"until the last minute\".Their gamble turned the company's fortunes around, transformed the way basketball was viewed globally and left an indelible print on sneaker culture worldwide. The story was popularised in 2023 film Air, in which Vaccaro is played by Matt Damon.In his book, as well as detailing the Jordan deal, he describes how he was able to spot the potential in future stars including Bryant, Tracy McGrady and James, whom he narrowly missed out on signing to an endorsement in 2003.",
        "Nike's offer to Jordan in 1984 included a guaranteed $250,000 a year for five years, plus a stake in his own line of merchandise. It would make the 21-year-old, who was the third pick in the NBA draft that year, one of the richest athletes in the world.After signing that deal, Jordan went on to become arguably the greatest NBA player of all time, winning six championships, six Finals MVPs, five regular-season MVPs and a record 10 scoring titles.His partnership with Nike also catapulted the franchise from a company that mainly dealt in running shoes into a global behemoth worth just under $30bn, external (£23bn), with a monopoly over the NBA.\"My personal opinion is that if there is no Michael Jordan, you wouldn't even be talking about a Nike shoe company,\" Vaccaro said.\"That's the one deal that changed America's view of basketball players and endorsements. He was magnetic.\"Other people had endorsements with companies and they'd hold up a shoe and say: 'Wear this, I wear this.' Michael didn't have to hold up the shoe. He took the shot and then wore the shoe.\"The Air Jordan shoe, designed by Peter Moore, first retailed in 1985. By 1986, $100m, external worth of Air Jordan shoes and products had been sold.A pair of championship trainers worn by Jordan sold for $8m (£6.3m) at auction last year.",
        "In 1993, Vaccaro joined Adidas America. For the next decade, he battled with his former employer for the signatures of the nation's hottest up-and-coming NBA stars.One of the coups Vaccaro managed during his time with the German sportswear company was to sign 18-year-old Bryant to a $5m, five-year deal in 1996, a month before he entered the NBA straight from high school.The marketer first encountered the future five-time NBA champion when he was invited to play at one of Vaccaro's ABCD camps in 1994.\"It took Kobe all of a week to blast to the top of my 'gifted' list,\" he writes. \"Competing against the top 160 American players, along with a handful of prospects from places like China, France, Australia, Canada and Russia, Kobe was intimidated by no-one.\"What left a lasting impression on Vaccaro was the fact Bryant approached him at the end of the week to apologise for not having won the MVP award, despite only being 16.\"I knew that this kid had that hidden thing - drive, an ambition and a belief in himself,\" he told BBC Sport. \"He was the most confident, outward person I've ever been around in my life.\"Bryant returned to Vaccaro's summer camp the following year and won the MVP award.",
        "In 1997, Vaccaro signed McGrady, just as he was about to enter the NBA draft from high school as the ninth overall pick by the Toronto Raptors.McGrady, who would go on to become a seven-time NBA All-Star, had made an impression on the sports marketer at the 1996 ABCD camp. However, he almost was not included after his school coach kicked him off the team and advised Vaccaro not to deal with the youngster.\"We invited Tracy because of all the backlash,\" Vaccaro said. \"Those five days at camp changed the whole world. He was voted the number one player in camp. No-one knew his name!\"The story of Vaccaro's life seems to hinge on a number of these serendipitous moments.\"What if those people in Pittsburgh were to say no to me and the Dapper Dan in 1964?\" he said. \"One no and this life is over. You'd be looking for someone else to interview.\"",
        "This video can not be played",
        "Meet the man who convinced Nike to take a gamble on Michael Jordan",
        "There were 15 seconds left on the clock when a 19-year-old college basketball player launched a 16-foot winning shot that would change sports marketing forever.",
        "Watching that day was marketing executive and grassroots promoter Sonny Vaccaro. He was so impressed by what he saw that two years later he would bet his job at sports manufacturer Nike on backing this relatively untested player.",
        "That player was Michael Jordan.",
        "But not the Jordan we know now. At the point Vaccaro witnessed him score the shot that won the 1982 NCAA championship for North Carolina Tar Heels, Jordan was just a freshman.",
        "When, two years later, Vaccaro urged his bosses to spend their whole yearly basketball endorsement budget on him, Jordan was only 21 and had never competed in the NBA. And no-one was talking about his footwear.",
        "Vaccaro says his conviction in the youngster's potential was forged the moment he watched him take that shot at the Louisiana Superdome, New Orleans.",
        "\"That shot changed the world because of what Michael Jordan became,\" the 85-year-old told BBC Sport.",
        "\"When he took the shot, it convinced me that he would take any shot in the world.\"",
        "But it was Vaccaro who had to take a shot first.",
        "In his memoir, Legends and Soles, he describes how he had to convince his bosses to take a chance on an up-and-coming star, while competitors such as Converse were endorsing household names including Earvin 'Magic' Johnson.",
        "By that time, Vaccaro had established himself as a basketball insider with an extensive knowledge of young players. In 1964, aged 24, he established The Dapper Dan Roundball Classic - the first national high school all-star basketball game.",
        "The tournament ran under different guises until 2007, showcasing future NBA stars including Moses Malone, LeBron James, Kevin Garnett, Kevin Love, Kobe Bryant, Patrick Ewing and Shaquille O'Neal.",
        "He also founded the ABCD basketball summer camp in 1984 - an invitational that gathered the country's highest-ranked high school players.",
        "Nevertheless, Vaccaro told BBC Sport former Nike boss Phil Knight was not satisfied with the Jordan proposal \"until the last minute\".",
        "Their gamble turned the company's fortunes around, transformed the way basketball was viewed globally and left an indelible print on sneaker culture worldwide. The story was popularised in 2023 film Air, in which Vaccaro is played by Matt Damon.",
        "In his book, as well as detailing the Jordan deal, he describes how he was able to spot the potential in future stars including Bryant, Tracy McGrady and James, whom he narrowly missed out on signing to an endorsement in 2003.",
        "Nike's offer to Jordan in 1984 included a guaranteed $250,000 a year for five years, plus a stake in his own line of merchandise. It would make the 21-year-old, who was the third pick in the NBA draft that year, one of the richest athletes in the world.",
        "After signing that deal, Jordan went on to become arguably the greatest NBA player of all time, winning six championships, six Finals MVPs, five regular-season MVPs and a record 10 scoring titles.",
        "His partnership with Nike also catapulted the franchise from a company that mainly dealt in running shoes into a global behemoth worth just under $30bn, external (£23bn), with a monopoly over the NBA.",
        "\"My personal opinion is that if there is no Michael Jordan, you wouldn't even be talking about a Nike shoe company,\" Vaccaro said.",
        "\"That's the one deal that changed America's view of basketball players and endorsements. He was magnetic.",
        "\"Other people had endorsements with companies and they'd hold up a shoe and say: 'Wear this, I wear this.' Michael didn't have to hold up the shoe. He took the shot and then wore the shoe.\"",
        "The Air Jordan shoe, designed by Peter Moore, first retailed in 1985. By 1986, $100m, external worth of Air Jordan shoes and products had been sold.",
        "A pair of championship trainers worn by Jordan sold for $8m (£6.3m) at auction last year.",
        "This video can not be played",
        "How a young Kobe Bryant grabbed Vaccaro's attention in 1994",
        "In 1993, Vaccaro joined Adidas America. For the next decade, he battled with his former employer for the signatures of the nation's hottest up-and-coming NBA stars.",
        "One of the coups Vaccaro managed during his time with the German sportswear company was to sign 18-year-old Bryant to a $5m, five-year deal in 1996, a month before he entered the NBA straight from high school.",
        "The marketer first encountered the future five-time NBA champion when he was invited to play at one of Vaccaro's ABCD camps in 1994.",
        "\"It took Kobe all of a week to blast to the top of my 'gifted' list,\" he writes. \"Competing against the top 160 American players, along with a handful of prospects from places like China, France, Australia, Canada and Russia, Kobe was intimidated by no-one.\"",
        "What left a lasting impression on Vaccaro was the fact Bryant approached him at the end of the week to apologise for not having won the MVP award, despite only being 16.",
        "\"I knew that this kid had that hidden thing - drive, an ambition and a belief in himself,\" he told BBC Sport. \"He was the most confident, outward person I've ever been around in my life.\"",
        "Bryant returned to Vaccaro's summer camp the following year and won the MVP award.",
        "In 1997, Vaccaro signed McGrady, just as he was about to enter the NBA draft from high school as the ninth overall pick by the Toronto Raptors.",
        "McGrady, who would go on to become a seven-time NBA All-Star, had made an impression on the sports marketer at the 1996 ABCD camp. However, he almost was not included after his school coach kicked him off the team and advised Vaccaro not to deal with the youngster.",
        "\"We invited Tracy because of all the backlash,\" Vaccaro said. \"Those five days at camp changed the whole world. He was voted the number one player in camp. No-one knew his name!\"",
        "The story of Vaccaro's life seems to hinge on a number of these serendipitous moments.",
        "\"What if those people in Pittsburgh were to say no to me and the Dapper Dan in 1964?\" he said. \"One no and this life is over. You'd be looking for someone else to interview.\""
      ]
    }
  ]
}