{
  "scraped_at": "2025-10-27T18:56:59.779545",
  "total_articles": 10,
  "category": "equestrian",
  "articles_per_category": 100,
  "articles": [
    {
      "url": "https://www.bbc.com/sport/equestrian/articles/ce322pn5kwvo",
      "main_category": "sport",
      "detailed_category": "equestrian",
      "topic": "Ireland win first European eventing medal in 30 years",
      "content": [
        "Ireland won a first medal at the European Eventing Championships in 30 years as they claimed silver at Blenheim Palace.The Irish team, comprised of Padraig McCarthy riding Pomp N Circumstance, Robbie Kearns on Chance Encounter, Aoife Clark riding Full Monty De Lacense and Ian Cassells on Millridge Atlantis, finished second behind Germany with a score of 161.9.They were second in the standings in England after cross-country day on Saturday and performed well in the show jumping phase on Sunday to win a silver medal.Ireland's last European Championship team medal came in Italy in 1995 when the quartet of Mark Barry, Virginia McGrath, Eric Smiley and Lucy Thompson claimed the bronze medal.The gold medal was won by Germany, led by individual silver medallist Michael Jung on FischerChipmunk, who had a final score of 124.9, whilst France took home bronze as they finished on 167.5.Irish high performance manager Dag Albert expressed his delight at coming away with a silver medal and his team's performance across the weekend.\"What a result. We were quietly confident of coming here and performing well, with a medal of some sort the main aim,\" he said.\"Obviously before we came here, we knew that Germany would be strong. Eventing is a sport that will always surprise you and sometimes it's a war of attrition.\"They all jumped so well out there today, and with a bit of pressure on because the French were breathing down our necks and we needed to be careful.\"I need to thank so many people who have contributed to this medal win. It's a huge team effort and this one is for everyone.\"",
        "Padraig McCarthy was part of the Ireland team that won silver at Blenheim Palace",
        "Ireland won a first medal at the European Eventing Championships in 30 years as they claimed silver at Blenheim Palace.",
        "The Irish team, comprised of Padraig McCarthy riding Pomp N Circumstance, Robbie Kearns on Chance Encounter, Aoife Clark riding Full Monty De Lacense and Ian Cassells on Millridge Atlantis, finished second behind Germany with a score of 161.9.",
        "They were second in the standings in England after cross-country day on Saturday and performed well in the show jumping phase on Sunday to win a silver medal.",
        "Ireland's last European Championship team medal came in Italy in 1995 when the quartet of Mark Barry, Virginia McGrath, Eric Smiley and Lucy Thompson claimed the bronze medal.",
        "The gold medal was won by Germany, led by individual silver medallist Michael Jung on FischerChipmunk, who had a final score of 124.9, whilst France took home bronze as they finished on 167.5.",
        "Irish high performance manager Dag Albert expressed his delight at coming away with a silver medal and his team's performance across the weekend.",
        "\"What a result. We were quietly confident of coming here and performing well, with a medal of some sort the main aim,\" he said.",
        "\"Obviously before we came here, we knew that Germany would be strong. Eventing is a sport that will always surprise you and sometimes it's a war of attrition.",
        "\"They all jumped so well out there today, and with a bit of pressure on because the French were breathing down our necks and we needed to be careful.",
        "\"I need to thank so many people who have contributed to this medal win. It's a huge team effort and this one is for everyone.\""
      ]
    },
    {
      "url": "https://www.bbc.com/sport/equestrian/articles/cy5007exxe0o",
      "main_category": "sport",
      "detailed_category": "equestrian",
      "topic": "Collett wins European gold at Blenheim Palace",
      "content": [
        "Great Britain's Laura Collett won individual gold with team-mate Tom McEwen securing bronze at the European Eventing Championships at Blenheim Palace.Collett, who won two medals at last year's Paris Olympics, entered the final day of the individual competition ahead of Germany's Michael Jung and his horse Fischerchipmunk.Collett, 36, and her mount London 52, took to the showjumping course last on Sunday and a score of 27.0 overall was enough for her to take the individual title.McEwen - riding JL Dublin - completed a clear final round to ensure he stayed in third place.\"I can't tell you how much I have wanted this. I did not even dream this [would happen],\" an emotional Collett said after her victory.\"[It is] mainly for the horse because I feel like since he first made the team I've let him down. So to finally pull it off and get him the championship he deserves... the words aren't really there. This is for him.\"The first two days of the event saw competitors take part in the dressage with Germany maintaining a narrow lead over Great Britain in the team standings heading in to the weekend thanks to a superb late performance from Jung on Friday.But the team event ended in disappointment for GB as they were eliminated from the competition following falls from Yasmin Ingham and Piggy March during Saturday's cross-country phase.",
        "Laura Collett has won three Olympic medals - including two golds",
        "Great Britain's Laura Collett won individual gold with team-mate Tom McEwen securing bronze at the European Eventing Championships at Blenheim Palace.",
        "Collett, who won two medals at last year's Paris Olympics, entered the final day of the individual competition ahead of Germany's Michael Jung and his horse Fischerchipmunk.",
        "Collett, 36, and her mount London 52, took to the showjumping course last on Sunday and a score of 27.0 overall was enough for her to take the individual title.",
        "McEwen - riding JL Dublin - completed a clear final round to ensure he stayed in third place.",
        "\"I can't tell you how much I have wanted this. I did not even dream this [would happen],\" an emotional Collett said after her victory.",
        "\"[It is] mainly for the horse because I feel like since he first made the team I've let him down. So to finally pull it off and get him the championship he deserves... the words aren't really there. This is for him.\"",
        "The first two days of the event saw competitors take part in the dressage with Germany maintaining a narrow lead over Great Britain in the team standings heading in to the weekend thanks to a superb late performance from Jung on Friday.",
        "But the team event ended in disappointment for GB as they were eliminated from the competition following falls from Yasmin Ingham and Piggy March during Saturday's cross-country phase."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/equestrian/articles/cp3qenln3q7o",
      "main_category": "sport",
      "detailed_category": "equestrian",
      "topic": "Watch Eventing European Championships on BBC",
      "content": [
        "Great Britain will defend their European title on home soil at Blenheim Palace this weekend – and you can watch the action live on BBC Sport.Eventing involves all three equestrian disciplines of dressage, cross country and show jumping, with the lowest cumulative score from all three disciplines deciding the winner.Double Olympic team gold medallists Laura Collett  and Tom McEwen lead a strong British team, who are looking to secure their third consecutive European team gold medal.Reigning world champion Yasmin Ingham and two-time individual silver European medallist Piggy March make up the British team challenge.Former junior European champion Bubby Upton and 2024 Pau five-star winner Caroline Harris make their senior team debuts as individual competitors.Upton 26, broke her back in August 2023 following a schooling accident at home and was told there was a chance she would never walk again. However, following successful surgery Upton has made a triumphant return to top-level competition, including winning Bramham Horse Trials in June 2025.",
        "Germany's three-time Olympic champion Michael Jung is a favourite for the individual title with Paris ride fischerChipmunk FRH.Jung heads a competitive European field with representatives from 17 nations, including Turkey's first ever rider at a European Eventing Championships, Kumru Say. Great Britain are without defending European champion and Olympic gold medal winning team-mate Ros Canter. Canter 39, withdrew from selection after announcing her pregnancy with her second child in August following a hat-trick of five-star wins in 2025.Blenheim Palace last hosted the European Eventing Championships in 2005, when British royal family member Zara Tindall was crowned individual champion and Britain won the team title. Live coverage of the championships is on BBC iPlayer as well as the BBC Sport website and app.",
        "All times BST and subject to changeSaturday, 20 September Cross Country: 10:45-15:55 - BBC iPlayer, BBC Sport website and appSunday, 21 SeptemberJumping group one: 10:50-12:50 - BBC iPlayer, BBC Sport website and appJumping group two: 13:50-15:25 - BBC iPlayer, BBC Sport website and app",
        "Laura Collett and London 52 won team gold and individual bronze at the Paris Olympics",
        "Great Britain will defend their European title on home soil at Blenheim Palace this weekend – and you can watch the action live on BBC Sport.",
        "Eventing involves all three equestrian disciplines of dressage, cross country and show jumping, with the lowest cumulative score from all three disciplines deciding the winner.",
        "Double Olympic team gold medallists Laura Collett  and Tom McEwen lead a strong British team, who are looking to secure their third consecutive European team gold medal.",
        "Reigning world champion Yasmin Ingham and two-time individual silver European medallist Piggy March make up the British team challenge.",
        "Former junior European champion Bubby Upton and 2024 Pau five-star winner Caroline Harris make their senior team debuts as individual competitors.",
        "Upton 26, broke her back in August 2023 following a schooling accident at home and was told there was a chance she would never walk again. However, following successful surgery Upton has made a triumphant return to top-level competition, including winning Bramham Horse Trials in June 2025.",
        "This video can not be played",
        "Competing at a home championship is 'extra special' - Laura Collett",
        "Germany's three-time Olympic champion Michael Jung is a favourite for the individual title with Paris ride fischerChipmunk FRH.",
        "Jung heads a competitive European field with representatives from 17 nations, including Turkey's first ever rider at a European Eventing Championships, Kumru Say.",
        "Great Britain are without defending European champion and Olympic gold medal winning team-mate Ros Canter. Canter 39, withdrew from selection after announcing her pregnancy with her second child in August following a hat-trick of five-star wins in 2025.",
        "Blenheim Palace last hosted the European Eventing Championships in 2005, when British royal family member Zara Tindall was crowned individual champion and Britain won the team title.",
        "Live coverage of the championships is on BBC iPlayer as well as the BBC Sport website and app.",
        "All times BST and subject to change",
        "Saturday, 20 September",
        "Cross Country: 10:45-15:55 - BBC iPlayer, BBC Sport website and app",
        "Jumping group one: 10:50-12:50 - BBC iPlayer, BBC Sport website and app",
        "Jumping group two: 13:50-15:25 - BBC iPlayer, BBC Sport website and app"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/equestrian/articles/cwyn1gy1l63o",
      "main_category": "sport",
      "detailed_category": "equestrian",
      "topic": "GB riders win five European Para-dressage bronzes",
      "content": [
        "Mari Durward-Akhurst landed her second and Great Britain's fifth bronze medal at the European Para-Dressage Championships.She was third aboard Athene Lindebjerg in the Grade 1 freestyle on Sunday, having also picked up a medal in Friday's Grade 1 competition.There was double bronze too for Jemima Green and her horse Fantabulous on their championship debut.Green added a Grade 2 freestyle medal to her third place in the Grand Prix A test.Nicola Naylor also collected bronze, with Humberto L in the Grade 4 Grand Prix A.",
        "Mari Durward-Akhurst won a bronze medal at the 2024 Paralympic Games in Paris",
        "Mari Durward-Akhurst landed her second and Great Britain's fifth bronze medal at the European Para-Dressage Championships.",
        "She was third aboard Athene Lindebjerg in the Grade 1 freestyle on Sunday, having also picked up a medal in Friday's Grade 1 competition.",
        "There was double bronze too for Jemima Green and her horse Fantabulous on their championship debut.",
        "Green added a Grade 2 freestyle medal to her third place in the Grand Prix A test.",
        "Nicola Naylor also collected bronze, with Humberto L in the Grade 4 Grand Prix A."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/equestrian/articles/cqxzwgjzlj0o",
      "main_category": "sport",
      "detailed_category": "equestrian",
      "topic": "Pregnant Canter wins Burghley Horse Trials",
      "content": [
        "Ros Canter won a second successive Burghley Horse Trials, weeks after announcing she was expecting her second child.The Briton triumphed in her last event before taking a break from competition on Lordships Graffalo, who becomes the first horse in history to win Badminton and Burghley twice.Canter, 39, was also the first rider since Ginny Leng in 1989 to win Badminton and Burghley in the same year on the same horse.\"I am so grateful to Lordships Graffalo for some unbelievable experiences,\" she said. \"He is my horse of a lifetime and hopefully the horse of a lot of people's lifetimes.\"I hope he goes down as a legend of our sport, a legend of all time, not only but for his performances but for his character as well. He's an unbelievable horse to have at home and he thrives on these occasions.\"Watch highlights of the Burghley Horse Trials on BBC iPlayer.",
        "Canter won by nine penalties, with a final score of 23.6, from second-placed Irish rider Austin O'Connor and Colorado Blue after 1.2 time time faults in Sunday's showjumping finale.Britain's Harry Meade and Cavalier Crystal were third for the third year in a row. He was also fourth on Annaghmore Valoner and ninth on Et Hop Du Matz.Lincolnshire rider Canter won Burghley for the first time last season, just weeks after clinching team eventing gold at the Paris 2024 Olympics with Team GB.The reigning European individual champion won the Badminton Horse Trials for the second time in May and the Luhmuhlen Horse Trials in Germany a month later.Her Burghley triumph means Canter was the second rider to win three five-star events in one season after compatriot Pippa Funnell, who won the Grand Slam of Eventing in 2003.Canter withdrew from selection for the British team at the home European championships later this month due to her pregnancy, but chose to compete at Burghley as it is an individual competition so would not be letting anyone down if she pulled out.After Sunday's success, she added: \"It's a big deal announcing a pregnancy when you know you might be coming to an event like this.\"I can't believe I haven't had a single person saying, 'what are you doing?'. I've had a few people saying, 'are you sure?' and 'be careful', but on the whole I have had huge support. It has been amazing.\"As for the future, Canter said: \"You never know with childbirth, it can throw all sorts of spanners in the works, but the plan is to be at Badminton next year.",
        "Ros Canter won Olympic team gold with Great Britain in Paris last year",
        "Ros Canter won a second successive Burghley Horse Trials, weeks after announcing she was expecting her second child.",
        "The Briton triumphed in her last event before taking a break from competition on Lordships Graffalo, who becomes the first horse in history to win Badminton and Burghley twice.",
        "Canter, 39, was also the first rider since Ginny Leng in 1989 to win Badminton and Burghley in the same year on the same horse.",
        "\"I am so grateful to Lordships Graffalo for some unbelievable experiences,\" she said. \"He is my horse of a lifetime and hopefully the horse of a lot of people's lifetimes.",
        "\"I hope he goes down as a legend of our sport, a legend of all time, not only but for his performances but for his character as well. He's an unbelievable horse to have at home and he thrives on these occasions.\"",
        "Watch highlights of the Burghley Horse Trials on BBC iPlayer.",
        "Canter won by nine penalties, with a final score of 23.6, from second-placed Irish rider Austin O'Connor and Colorado Blue after 1.2 time time faults in Sunday's showjumping finale.",
        "Britain's Harry Meade and Cavalier Crystal were third for the third year in a row. He was also fourth on Annaghmore Valoner and ninth on Et Hop Du Matz.",
        "Lincolnshire rider Canter won Burghley for the first time last season, just weeks after clinching team eventing gold at the Paris 2024 Olympics with Team GB.",
        "The reigning European individual champion won the Badminton Horse Trials for the second time in May and the Luhmuhlen Horse Trials in Germany a month later.",
        "Her Burghley triumph means Canter was the second rider to win three five-star events in one season after compatriot Pippa Funnell, who won the Grand Slam of Eventing in 2003.",
        "Canter withdrew from selection for the British team at the home European championships later this month due to her pregnancy, but chose to compete at Burghley as it is an individual competition so would not be letting anyone down if she pulled out.",
        "After Sunday's success, she added: \"It's a big deal announcing a pregnancy when you know you might be coming to an event like this.",
        "\"I can't believe I haven't had a single person saying, 'what are you doing?'. I've had a few people saying, 'are you sure?' and 'be careful', but on the whole I have had huge support. It has been amazing.\"",
        "As for the future, Canter said: \"You never know with childbirth, it can throw all sorts of spanners in the works, but the plan is to be at Badminton next year."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/equestrian/articles/c3w4g666jl1o",
      "main_category": "sport",
      "detailed_category": "equestrian",
      "topic": "Dujardin free to compete after whipping ban",
      "content": [
        "Three-time Olympic dressage gold medallist Charlotte Dujardin plans to return to competition after serving her one-year ban from the sport.Dujardin, 40, was banned in December by the FEI - the world governing body of equestrian sports - and fined 10,000 Swiss francs (£8,886) for \"excessively\" whipping a horse.Video footage emerged in July - days before the start of the Paris 2024 Olympics - of her repeatedly striking the horse with a long whip around its legs.The international ban, also backed by British Equestrian and British Dressage, was backdated to 23 July 2024, when she was provisionally suspended.While BBC Sport understands Dujardin does plan to return to competition, it is not yet known when or where that will be.From Thursday, she can re-apply for British Dressage membership, which will permit her to enter its affiliated competitions.She was ineligible to receive public funding and publicly funded benefits through UK Sport while she served the ban, and she also lost sponsorship deals and ambassadorial roles.A UK Sport spokesperson told BBC Sport it is \"in the process of reviewing Charlotte's future eligibility to receive public funds\" - the outcome of which will determine if she can return to British Equestrian's World Class Performance Programme.It is understood representatives of Dujardin have spoken with British Equestrian and British Dressage about her return to the sport in recent days.British Dressage confirmed to BBC Sport it is in contact with Dujardin's team, while British Equestrian said it could not discuss its correspondence with athletes.Dujardin is not among the initial eight British entries put to the FEI to compete at August's Dressage European Championships.The final squad - of four rider and horse combinations from those initial eight - will be confirmed by British Equestrian later this month.",
        "Dujardin had been set to bid for a fourth gold medal at the Paris Olympics.But last July, just before the start of the Games, she released a statement saying she was withdrawing after a video emerged showing her \"making an error of judgement\".She was later provisionally suspended by the FEI, which said it had received footage showing Dujardin \"engaging in conduct contrary to the principles of horse welfare - during a training session conducted at Ms Dujardin's private stable\".The FEI said Dujardin confirmed she was the individual in the video, which was \"filmed several years ago\" and \"requested to be provisionally suspended pending the outcome of the investigations\".In announcing her ban in December, the FEI tribunal stated that the video showed Dujardin whipping the horse more than 20 times, mostly from behind on the hind legs, and also in between and from the front on the front legs and shoulders of the horse. It added the footage of the training session did not constitute any other rule violations and that there had not been any further complaints raised against Dujardin's conduct since the video emerged.At the time, she said she fully respected the FEI's verdict and would \"forever aim to do better\".",
        "Dujardin shot to prominence at the London 2012 Olympics on Valegro, winning gold medals in team and individual dressage.The pair picked up individual gold and team silver four years later in Rio.On a different horse, Gio, Dujardin won two bronze medals at the Covid-delayed Tokyo 2020 Games.History beckoned at the Paris Olympics, where a medal of any colour would have made her Britain's outright most decorated female Olympian - a title she shares with former cyclist Dame Laura Kenny, with both having six Olympic medals.She was set to compete on Imhotep, known as Pete - her first horse since Valegro to score more than 90% in international competition. The pair had been unbeaten since the 2023 European Championships.Imhotep has since been sold, as was always planned for, external after the Games, while Times Kismet, who Dujardin had identified as her next Olympic horse, has also been sold to Germany's Jessica von Bredow-Werndl - who successfully defended her individual dressage title in Paris.",
        "Charlotte Dujardin won individual dressage gold at the 2012 and 2016 Olympics, as well as team gold in London",
        "Three-time Olympic dressage gold medallist Charlotte Dujardin plans to return to competition after serving her one-year ban from the sport.",
        "Dujardin, 40, was banned in December by the FEI - the world governing body of equestrian sports - and fined 10,000 Swiss francs (£8,886) for \"excessively\" whipping a horse.",
        "Video footage emerged in July - days before the start of the Paris 2024 Olympics - of her repeatedly striking the horse with a long whip around its legs.",
        "The international ban, also backed by British Equestrian and British Dressage, was backdated to 23 July 2024, when she was provisionally suspended.",
        "While BBC Sport understands Dujardin does plan to return to competition, it is not yet known when or where that will be.",
        "From Thursday, she can re-apply for British Dressage membership, which will permit her to enter its affiliated competitions.",
        "She was ineligible to receive public funding and publicly funded benefits through UK Sport while she served the ban, and she also lost sponsorship deals and ambassadorial roles.",
        "A UK Sport spokesperson told BBC Sport it is \"in the process of reviewing Charlotte's future eligibility to receive public funds\" - the outcome of which will determine if she can return to British Equestrian's World Class Performance Programme.",
        "It is understood representatives of Dujardin have spoken with British Equestrian and British Dressage about her return to the sport in recent days.",
        "British Dressage confirmed to BBC Sport it is in contact with Dujardin's team, while British Equestrian said it could not discuss its correspondence with athletes.",
        "Dujardin is not among the initial eight British entries put to the FEI to compete at August's Dressage European Championships.",
        "The final squad - of four rider and horse combinations from those initial eight - will be confirmed by British Equestrian later this month.",
        "This video can not be played",
        "Charlotte Dujardin: Video shows Olympian whipping horse during training",
        "Dujardin had been set to bid for a fourth gold medal at the Paris Olympics.",
        "But last July, just before the start of the Games, she released a statement saying she was withdrawing after a video emerged showing her \"making an error of judgement\".",
        "She was later provisionally suspended by the FEI, which said it had received footage showing Dujardin \"engaging in conduct contrary to the principles of horse welfare - during a training session conducted at Ms Dujardin's private stable\".",
        "The FEI said Dujardin confirmed she was the individual in the video, which was \"filmed several years ago\" and \"requested to be provisionally suspended pending the outcome of the investigations\".",
        "In announcing her ban in December, the FEI tribunal stated that the video showed Dujardin whipping the horse more than 20 times, mostly from behind on the hind legs, and also in between and from the front on the front legs and shoulders of the horse.",
        "It added the footage of the training session did not constitute any other rule violations and that there had not been any further complaints raised against Dujardin's conduct since the video emerged.",
        "At the time, she said she fully respected the FEI's verdict and would \"forever aim to do better\".",
        "Dujardin shot to prominence at the London 2012 Olympics on Valegro, winning gold medals in team and individual dressage.",
        "The pair picked up individual gold and team silver four years later in Rio.",
        "On a different horse, Gio, Dujardin won two bronze medals at the Covid-delayed Tokyo 2020 Games.",
        "History beckoned at the Paris Olympics, where a medal of any colour would have made her Britain's outright most decorated female Olympian - a title she shares with former cyclist Dame Laura Kenny, with both having six Olympic medals.",
        "She was set to compete on Imhotep, known as Pete - her first horse since Valegro to score more than 90% in international competition. The pair had been unbeaten since the 2023 European Championships.",
        "Imhotep has since been sold, as was always planned for, external after the Games, while Times Kismet, who Dujardin had identified as her next Olympic horse, has also been sold to Germany's Jessica von Bredow-Werndl - who successfully defended her individual dressage title in Paris."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/equestrian/articles/cgrxv87l5ppo",
      "main_category": "sport",
      "detailed_category": "equestrian",
      "topic": "Brash wins silver at Jumping European Championship",
      "content": [
        "Great Britain's Scott Brash won individual silver at the 2025 Jumping European Championships in Spain.The Scot collected Britain's first individual show jumping medal since 2019 on Hello Folie with a score of 1.08.Germany's Richard Vogel, ranked world number nine, clinched gold on United Touch S, while Belgium's Gilles Thomas on Ermitage Kalone finished third.It was Brash and Hello Folie's second medal in A Coruna, having also won silver in Friday's team competition.That performance earned them a place in the individual final - along with four other Britons.",
        "Vogel and Brash started round two in first and second place respectively - following near-perfect first-round efforts - and remained there after a tense finale.\"She's shown the world how talented she is this week,\" said Brash. \"These are the biggest courses she's jumped so far. I feel she's grown up through the week and she's going to use this championship to grow for the future.\"GB's triple Olympic medallist Ben Maher finished fourth on Dallas Vegas Batilly, with defending European champion Steve Guerdat down in 12th.",
        "It is Hello Folie's championship debut at 10 years old",
        "Great Britain's Scott Brash won individual silver at the 2025 Jumping European Championships in Spain.",
        "The Scot collected Britain's first individual show jumping medal since 2019 on Hello Folie with a score of 1.08.",
        "Germany's Richard Vogel, ranked world number nine, clinched gold on United Touch S, while Belgium's Gilles Thomas on Ermitage Kalone finished third.",
        "It was Brash and Hello Folie's second medal in A Coruna, having also won silver in Friday's team competition.",
        "That performance earned them a place in the individual final - along with four other Britons.",
        "Vogel and Brash started round two in first and second place respectively - following near-perfect first-round efforts - and remained there after a tense finale.",
        "\"She's shown the world how talented she is this week,\" said Brash. \"These are the biggest courses she's jumped so far. I feel she's grown up through the week and she's going to use this championship to grow for the future.\"",
        "GB's triple Olympic medallist Ben Maher finished fourth on Dallas Vegas Batilly, with defending European champion Steve Guerdat down in 12th."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/equestrian/articles/cyvjll5lv1jo",
      "main_category": "sport",
      "detailed_category": "equestrian",
      "topic": "GB win team silver at Jumping European Championship",
      "content": [
        "Great Britain won a silver medal in the team competition at the 2025 Jumping European Championships in Spain. It is the first time GB has featured on the podium at the event, which happens every two years, since they finished third in 2019. The team - Ben Maher on Dallas Vegas Batilly, Matthew Sampson on Medoc de Toxandria, Donald Whitaker on Millfield Colette and Scott Brash on Hello Folie - were in first place after Thursday's first round, with Germany and Belgium occupying the other podium positions. However, both GB and Germany picked up four time faults in round two while Belgium only collected one. Gold medallists Belgium finished with a final score of 5.61, with Britain in second place with a score of 7.96 and Germany in third with 8.19. Ireland (12.39) finished in fourth place. It is the second time Belgium have been crowned European champions, having previously won the event in Rotterdam in 2019. Great Britain have appeared on the podium 15 times since the team event was introduced in 1975, winning five golds, six silvers, and four bronze medals.",
        "Great Britain have appeared on the podium 15 times in the team event since 1975",
        "Great Britain won a silver medal in the team competition at the 2025 Jumping European Championships in Spain.",
        "It is the first time GB has featured on the podium at the event, which happens every two years, since they finished third in 2019.",
        "The team - Ben Maher on Dallas Vegas Batilly, Matthew Sampson on Medoc de Toxandria, Donald Whitaker on Millfield Colette and Scott Brash on Hello Folie - were in first place after Thursday's first round, with Germany and Belgium occupying the other podium positions.",
        "However, both GB and Germany picked up four time faults in round two while Belgium only collected one.",
        "Gold medallists Belgium finished with a final score of 5.61, with Britain in second place with a score of 7.96 and Germany in third with 8.19. Ireland (12.39) finished in fourth place.",
        "It is the second time Belgium have been crowned European champions, having previously won the event in Rotterdam in 2019.",
        "Great Britain have appeared on the podium 15 times since the team event was introduced in 1975, winning five golds, six silvers, and four bronze medals."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/olympics/articles/c5ykjnlvk2eo",
      "main_category": "sport",
      "detailed_category": "equestrian",
      "topic": "FEI investigating Ryan for repeatedly whipping horse",
      "content": [
        "The FEI, equestrian sport's world governing body, has launched an investigation into Australian Olympian Heath Ryan after a video emerged that appeared to show him repeatedly whipping a horse.Ryan was suspended by Equestrian Australia last week after the video - said by Ryan to be about two years old - showed a man striking a horse about 40 times.The FEI has now also provisionally suspended the 66-year-old, who issued a statement after the video emerged to say he was acting in \"the horse's best interest\".But the FEI says it has opened an investigation \"following allegations of horse abuse reported to the FEI and Equestrian Australia, as well as the posting of a video on social media showing abusive training techniques\".\"The scenes depicted are profoundly disturbing and stand in stark opposition to the core values of FEI horse welfare,\" FEI secretary general Sabrina Ibanez said.\"The FEI has opened an investigation to thoroughly examine all the facts and determine further disciplinary action under the FEI rules and regulations. We are committed to ensuring that any behaviour which puts horse welfare at risk is dealt with firmly and fairly.\"",
        "Sam Jones, the CEO of Equestrian Australia, added: \"It is both appropriate and welcome that FEI leads the investigation of this matter.\"Equestrian Australia remains extremely concerned about the incident and allegations, and we will support the FEI in any way we can.\"We know our community is keen for answers, but we would ask for patience as the FEI rightly follows a thorough and fair process, in line with their policies and procedures.\"Ryan represented Australia in dressage at the Beijing Olympic Games in 2008 and finished seventh.He said the horse, named Nico, came to him after an accident which resulted in a female rider needing hospital treatment.The Australian said that Nico \"had always been a problem child and would just not stop\" and after the video he was able to rehome the horse.Ryan said, external: \"I am so sad this was caught on video. If I had been thinking of myself I would have immediately just gotten off and sent Nico to the knackery.\"That video was a life or death moment for Nico and I genuinely had to try my very hardest to see if Nico would consider other options.\"All of this transpired sincerely with the horse's best interests the sole consideration. Unbelievably it was so successful for everyone except me with the release of this video.\"Britain's three-time Olympic champion Charlotte Dujardin missed the Paris Games last year after a video emerged of her repeatedly striking a horse around its legs with a long whip. She was subsequently banned for a year by the FEI.",
        "Heath Ryan finished seventh with Australia in the team dressage event at the 2008 Olympics",
        "The FEI, equestrian sport's world governing body, has launched an investigation into Australian Olympian Heath Ryan after a video emerged that appeared to show him repeatedly whipping a horse.",
        "Ryan was suspended by Equestrian Australia last week after the video - said by Ryan to be about two years old - showed a man striking a horse about 40 times.",
        "The FEI has now also provisionally suspended the 66-year-old, who issued a statement after the video emerged to say he was acting in \"the horse's best interest\".",
        "But the FEI says it has opened an investigation \"following allegations of horse abuse reported to the FEI and Equestrian Australia, as well as the posting of a video on social media showing abusive training techniques\".",
        "\"The scenes depicted are profoundly disturbing and stand in stark opposition to the core values of FEI horse welfare,\" FEI secretary general Sabrina Ibanez said.",
        "\"The FEI has opened an investigation to thoroughly examine all the facts and determine further disciplinary action under the FEI rules and regulations. We are committed to ensuring that any behaviour which puts horse welfare at risk is dealt with firmly and fairly.\"",
        "Sam Jones, the CEO of Equestrian Australia, added: \"It is both appropriate and welcome that FEI leads the investigation of this matter.",
        "\"Equestrian Australia remains extremely concerned about the incident and allegations, and we will support the FEI in any way we can.",
        "\"We know our community is keen for answers, but we would ask for patience as the FEI rightly follows a thorough and fair process, in line with their policies and procedures.\"",
        "Ryan represented Australia in dressage at the Beijing Olympic Games in 2008 and finished seventh.",
        "He said the horse, named Nico, came to him after an accident which resulted in a female rider needing hospital treatment.",
        "The Australian said that Nico \"had always been a problem child and would just not stop\" and after the video he was able to rehome the horse.",
        "Ryan said, external: \"I am so sad this was caught on video. If I had been thinking of myself I would have immediately just gotten off and sent Nico to the knackery.",
        "\"That video was a life or death moment for Nico and I genuinely had to try my very hardest to see if Nico would consider other options.",
        "\"All of this transpired sincerely with the horse's best interests the sole consideration. Unbelievably it was so successful for everyone except me with the release of this video.\"",
        "Britain's three-time Olympic champion Charlotte Dujardin missed the Paris Games last year after a video emerged of her repeatedly striking a horse around its legs with a long whip.",
        "She was subsequently banned for a year by the FEI."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/equestrian/articles/ce8183y2emno",
      "main_category": "sport",
      "detailed_category": "equestrian",
      "topic": "Canter secures second five-star victory in six weeks",
      "content": [
        "Olympic gold medallist Ros Canter won the Luhmuhlen Horse Trials to secure a second five-star win in six weeks.Canter rode Izilot DHI to victory in Germany to claim her fifth five-star level win. The former world champion was second after the dressage and cross country phases behind Olympic team-mate Laura Collett, who won the 2023 event.But Collett, last out riding London 52, knocked down a rail in the showjumping finale to slip to third overall.\"It's hard to get my head around it to be honest. I'm very proud of it because it's not always about riding, it's confidence and I've had to work very hard at that,\" said Canter.",
        "The reigning European champion was part of the British eventing team to win gold at the Paris Olympics last summer and won the prestigious Badminton Horse Trials for a second time in May. Canter added: \"The dream was always there because I loved watching old videos of Badminton and Burghley but I didn't think it would ever be me.\"The 39-year-old also paid tribute to her coach and mentor Caroline Moore, who died in March.\"I think Caroline would have found this very special.\"",
        "Ros Canter won team eventing gold in Paris 2024",
        "Olympic gold medallist Ros Canter won the Luhmuhlen Horse Trials to secure a second five-star win in six weeks.",
        "Canter rode Izilot DHI to victory in Germany to claim her fifth five-star level win.",
        "The former world champion was second after the dressage and cross country phases behind Olympic team-mate Laura Collett, who won the 2023 event.",
        "But Collett, last out riding London 52, knocked down a rail in the showjumping finale to slip to third overall.",
        "\"It's hard to get my head around it to be honest. I'm very proud of it because it's not always about riding, it's confidence and I've had to work very hard at that,\" said Canter.",
        "The reigning European champion was part of the British eventing team to win gold at the Paris Olympics last summer and won the prestigious Badminton Horse Trials for a second time in May.",
        "Canter added: \"The dream was always there because I loved watching old videos of Badminton and Burghley but I didn't think it would ever be me.\"",
        "The 39-year-old also paid tribute to her coach and mentor Caroline Moore, who died in March.",
        "\"I think Caroline would have found this very special.\""
      ]
    }
  ]
}