{
  "scraped_at": "2025-10-27T18:56:59.818546",
  "total_articles": 34,
  "category": "tennis",
  "articles_per_category": 100,
  "articles": [
    {
      "url": "https://www.bbc.com/sport/tennis/articles/c1wlp5gl8qno",
      "main_category": "sport",
      "detailed_category": "tennis",
      "topic": "Norrie sets up meeting with Alcaraz in Paris",
      "content": [
        "Britain's Cameron Norrie is \"pumped\" at the prospect of facing world number one Carlos Alcaraz in the second round of the Paris Masters after beating Sebastian Baez in straight sets. The world number 31 beat Argentine Baez, ranked 12 places below him, 6-3 6-4 in a match which featured six breaks of serve. Fellow Briton Jacob Fearnley, 24, was less fortunate in the French capital, losing 6-1 6-4 to Russian 12th seed Andrey Rublev.Norrie won the opening three games before having his serve broken to 15 as Baez pulled it back to 3-3. However, the 30-year-old regrouped to win the next three games, converting his second set point. Norrie threatened to throw away a 3-0 lead again in the second set, saving a break point in the sixth game, and later saved four more in the 10th game before closing out the match at the first opportunity. \"I was really tight going to serve for the match. I said I was going to pretend it was 0-30 and then it was 0-30 and 0-40,\" Norrie told Sky Sports. \"It was about getting the job done and it was nice to face some adversity. It was not a typical match. He fought well.\"Norrie will meet Alcaraz, who exited last year's tournament in the third round, on Tuesday, with the Spaniard playing his first match on tour since beating Taylor Fritz in the Japan Open final at the end of September. Alcaraz has won five of their seven meetings, most recently beating Norrie in straight sets in this year's Wimbledon quarter-finals. Later on Centre Court, Fearnley struggled to make a dent in Rublev's game as the Briton was hindered by 11 double faults compared to the Rublev's two.Fearnley was ranked outside the world's leading 500 players little over a year ago, but has soared up the rankings - cracking the top 50 in June.However, by his own admission his form has been affected by nerves, particularly when serving, and he has subsequently slipped to 78th.The issue proved decisive against Rublev, who broke Fearnley's serve on five occasions to wrap up the victory after 78 minutes on court.The world number 17 will face American Learner Tien in the next round after the 19-year-old beat Nuno Borges of Portugal 6-2 7-6 (9-7).",
        "Norrie did not make the main draw in Paris in 2024 after failing to come through qualifying",
        "Britain's Cameron Norrie is \"pumped\" at the prospect of facing world number one Carlos Alcaraz in the second round of the Paris Masters after beating Sebastian Baez in straight sets.",
        "The world number 31 beat Argentine Baez, ranked 12 places below him, 6-3 6-4 in a match which featured six breaks of serve.",
        "Fellow Briton Jacob Fearnley, 24, was less fortunate in the French capital, losing 6-1 6-4 to Russian 12th seed Andrey Rublev.",
        "Norrie won the opening three games before having his serve broken to 15 as Baez pulled it back to 3-3.",
        "However, the 30-year-old regrouped to win the next three games, converting his second set point.",
        "Norrie threatened to throw away a 3-0 lead again in the second set, saving a break point in the sixth game, and later saved four more in the 10th game before closing out the match at the first opportunity.",
        "\"I was really tight going to serve for the match. I said I was going to pretend it was 0-30 and then it was 0-30 and 0-40,\" Norrie told Sky Sports.",
        "\"It was about getting the job done and it was nice to face some adversity. It was not a typical match. He fought well.\"",
        "Norrie will meet Alcaraz, who exited last year's tournament in the third round, on Tuesday, with the Spaniard playing his first match on tour since beating Taylor Fritz in the Japan Open final at the end of September.",
        "Alcaraz has won five of their seven meetings, most recently beating Norrie in straight sets in this year's Wimbledon quarter-finals.",
        "Later on Centre Court, Fearnley struggled to make a dent in Rublev's game as the Briton was hindered by 11 double faults compared to the Rublev's two.",
        "Fearnley was ranked outside the world's leading 500 players little over a year ago, but has soared up the rankings - cracking the top 50 in June.",
        "However, by his own admission his form has been affected by nerves, particularly when serving, and he has subsequently slipped to 78th.",
        "The issue proved decisive against Rublev, who broke Fearnley's serve on five occasions to wrap up the victory after 78 minutes on court.",
        "The world number 17 will face American Learner Tien in the next round after the 19-year-old beat Nuno Borges of Portugal 6-2 7-6 (9-7).",
        "Live scores, results and order of play",
        "Get tennis news sent straight to your phone"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/tennis/articles/cj41eqjg95no",
      "main_category": "sport",
      "detailed_category": "tennis",
      "topic": "Wrexham champion Xu wants to be world number one",
      "content": [
        "After winning the biggest title of her career, newly crowned Wrexham Open champion Mimi Xu has her sights set on the ultimate tennis goal.The 18-year-old from Swansea told Radio Wales Breakfast she wants to emulate her hero Serena Williams by winning a Grand Slam and becoming world number one.\"I believe in myself, I believe in the work that I put in every day,\" Xu said.\"I've been developing myself and my game - my confidence will build as well - I do see myself there some day.\"Xu's W100 title at the weekend capped a remarkable breakthrough year on the ladies senior tour which makes her dream seem all the more possible.",
        "Xu has enjoyed notable wins at tournaments in Birmingham, Ilkley and Nottingham which earned her a wildcard to become the first Welsh player to enter the main singles draw at Wimbledon in almost 20 years.She was met by fellow Brit and former US Open champion Emma Raducanu in the first round on a packed-out Court One.Despite losing 6-3 6-3, Xu showed composure and talent and also enjoyed a good run in the ladies doubles with Ella McDonald, who she won the doubles title with at Wrexham as well.\"I've had so many amazing experiences this year, a lot of firsts. Wimbledon was an absolute dream and then to win singles and doubles in Wrexham - and with international tennis coming back to Wales after a long time - I don't think I could have asked for anything else,\" she said.",
        "The Wrexham double represented a \"full circle moment\" in Xu's young career.\"I remember winning my first tournament in Wrexham when I was in eight and under in Welsh Champions and to yesterday get my biggest title, it honestly means so much to me,\" she said.Xu started last week with a WTA singles ranking of 309 which has now risen to a career-high of 269.\"I haven't looked too much at the rankings if I'm being completely honest, but I feel like I competed really well last week and played each match as it came. I'm just so happy with the result.\"There will be no rest for Xu as she heads to compete at the W75 Glasgow this week.Now that she has turned 18 there are no restrictions on the amount of tournaments she can play.\"I really enjoy playing the sport, I'm really lucky that this is now my job and it's amazing I can do that,\" Xu added.",
        "Mimi Xu remains the youngest player in the Open era to receive a Wimbledon wildcard into ladies qualifying at just 14",
        "After winning the biggest title of her career, newly crowned Wrexham Open champion Mimi Xu has her sights set on the ultimate tennis goal.",
        "The 18-year-old from Swansea told Radio Wales Breakfast she wants to emulate her hero Serena Williams by winning a Grand Slam and becoming world number one.",
        "\"I believe in myself, I believe in the work that I put in every day,\" Xu said.",
        "\"I've been developing myself and my game - my confidence will build as well - I do see myself there some day.\"",
        "Xu's W100 title at the weekend capped a remarkable breakthrough year on the ladies senior tour which makes her dream seem all the more possible.",
        "Xu wins singles and doubles titles at Wrexham Open",
        "Wales number one Story wins biggest career title",
        "Xu has enjoyed notable wins at tournaments in Birmingham, Ilkley and Nottingham which earned her a wildcard to become the first Welsh player to enter the main singles draw at Wimbledon in almost 20 years.",
        "She was met by fellow Brit and former US Open champion Emma Raducanu in the first round on a packed-out Court One.",
        "Despite losing 6-3 6-3, Xu showed composure and talent and also enjoyed a good run in the ladies doubles with Ella McDonald, who she won the doubles title with at Wrexham as well.",
        "\"I've had so many amazing experiences this year, a lot of firsts. Wimbledon was an absolute dream and then to win singles and doubles in Wrexham - and with international tennis coming back to Wales after a long time - I don't think I could have asked for anything else,\" she said.",
        "The Wrexham double represented a \"full circle moment\" in Xu's young career.",
        "\"I remember winning my first tournament in Wrexham when I was in eight and under in Welsh Champions and to yesterday get my biggest title, it honestly means so much to me,\" she said.",
        "Xu started last week with a WTA singles ranking of 309 which has now risen to a career-high of 269.",
        "\"I haven't looked too much at the rankings if I'm being completely honest, but I feel like I competed really well last week and played each match as it came. I'm just so happy with the result.\"",
        "There will be no rest for Xu as she heads to compete at the W75 Glasgow this week.",
        "Now that she has turned 18 there are no restrictions on the amount of tournaments she can play.",
        "\"I really enjoy playing the sport, I'm really lucky that this is now my job and it's amazing I can do that,\" Xu added.",
        "Live scores, results and order of play",
        "Get tennis news sent straight to your phone"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/tennis/articles/c201w6nx47qo",
      "main_category": "sport",
      "detailed_category": "tennis",
      "topic": "Sinner battles cramp to claim Vienna Open title",
      "content": [
        "Jannik Sinner fought back from a set down to claim his fourth title of the season with victory over Alexander Zverev in the Vienna Open final.The top seed, who is currently on a 21 match-winning streak on indoor hard courts, battled through early hamstring cramp to seal the 3-6 6-3 7-5 win in just under two and a half hours.It marks Sinner's second title of the month, having won the China Open at the start of October, while he also added to his Grand Slam haul with victories at the Australian Open and Wimbledon earlier in the year.\"It feels amazing,\" Sinner said after lifting his 22nd Tour-level title. \"It was such a difficult start for me. I tried to stick in there mentally, trying to play my best tennis when it counts.\"It has been such a special week. It is always the highlight of my calendar to come and play here in Vienna.\"Sunday's final was the pair's first meeting since Sinner beat Zverev in straight sets in the Melbourne final back in January.Zverev, the 2021 Vienna Open champion, looked to have a strong foothold in the final though, after gaining a double-break advantage at 4-1 in the first set. From there the German only needed to hold serve to seal the first set 6-3 in 46 minutes.But Sinner dug deep and looked revived in the second set, playing a number of well-placed winners to hold serve twice and break serve, opening up a 3-0 advantage.The rest of the second set was relatively straightforward for the world number two, but he and Zverev went toe-to-toe in the deciding set, before Sinner broke serve at 5-5.From there, he opened up three Championship points before Zverev netted a simple backhand into the net.\"I would like to congratulate Jannik Sinner, whose level has been off the charts for these last two years,\" said world number three Zverev.\"For me, he is currently the best player in the world. This week, he was simply the best player in Vienna.\"Earlier, Great Britain's Julian Cash and Lloyd Glasspool secured their seventh Tour-level title of the season with a 6-1 7-6 (8-6) win over Austria's Lucas Miedler and Portugal's Francisco Cabral.The Britons needed just 70 minutes to claim their first title since winning the Canadian Open on 7 August.",
        "Joao Fonseca has become the third-youngest ATP 500 champion since the series began in 1990 with a straight-set victory over Alejandro Davidovich Fokina at the Swiss Indoors.The 19-year-old continued his rapid rise up the rankings by scooping up the biggest title of his career with a 6-3 6-4 win over the Spaniard, who holds a 0-5 record in Tour-level finals.Fonseca also became the first Brazilian to win a title above ATP 250-level since Gustavo Kuerten claimed the ATP Masters 1000 title in Cincinnati in August 2001.\"It is crazy\" Fonseca said. \"My parents just got here from Brazil. They were going to Paris but changed their flights and came here one hour before the match.\"It is just amazing to have them here for the biggest title of my career.\"",
        "Jannik Sinner lifts his 22nd Tour-level title",
        "Jannik Sinner fought back from a set down to claim his fourth title of the season with victory over Alexander Zverev in the Vienna Open final.",
        "The top seed, who is currently on a 21 match-winning streak on indoor hard courts, battled through early hamstring cramp to seal the 3-6 6-3 7-5 win in just under two and a half hours.",
        "It marks Sinner's second title of the month, having won the China Open at the start of October, while he also added to his Grand Slam haul with victories at the Australian Open and Wimbledon earlier in the year.",
        "\"It feels amazing,\" Sinner said after lifting his 22nd Tour-level title. \"It was such a difficult start for me. I tried to stick in there mentally, trying to play my best tennis when it counts.",
        "\"It has been such a special week. It is always the highlight of my calendar to come and play here in Vienna.\"",
        "Sunday's final was the pair's first meeting since Sinner beat Zverev in straight sets in the Melbourne final back in January.",
        "Zverev, the 2021 Vienna Open champion, looked to have a strong foothold in the final though, after gaining a double-break advantage at 4-1 in the first set. From there the German only needed to hold serve to seal the first set 6-3 in 46 minutes.",
        "But Sinner dug deep and looked revived in the second set, playing a number of well-placed winners to hold serve twice and break serve, opening up a 3-0 advantage.",
        "The rest of the second set was relatively straightforward for the world number two, but he and Zverev went toe-to-toe in the deciding set, before Sinner broke serve at 5-5.",
        "From there, he opened up three Championship points before Zverev netted a simple backhand into the net.",
        "\"I would like to congratulate Jannik Sinner, whose level has been off the charts for these last two years,\" said world number three Zverev.",
        "\"For me, he is currently the best player in the world. This week, he was simply the best player in Vienna.\"",
        "Earlier, Great Britain's Julian Cash and Lloyd Glasspool secured their seventh Tour-level title of the season with a 6-1 7-6 (8-6) win over Austria's Lucas Miedler and Portugal's Francisco Cabral.",
        "The Britons needed just 70 minutes to claim their first title since winning the Canadian Open on 7 August.",
        "Joao Fonseca lifts his first ATP 500 title at 19 years old",
        "Joao Fonseca has become the third-youngest ATP 500 champion since the series began in 1990 with a straight-set victory over Alejandro Davidovich Fokina at the Swiss Indoors.",
        "The 19-year-old continued his rapid rise up the rankings by scooping up the biggest title of his career with a 6-3 6-4 win over the Spaniard, who holds a 0-5 record in Tour-level finals.",
        "Fonseca also became the first Brazilian to win a title above ATP 250-level since Gustavo Kuerten claimed the ATP Masters 1000 title in Cincinnati in August 2001.",
        "\"It is crazy\" Fonseca said. \"My parents just got here from Brazil. They were going to Paris but changed their flights and came here one hour before the match.",
        "\"It is just amazing to have them here for the biggest title of my career.\"",
        "Live scores, results and order of play",
        "Get tennis news sent straight to your phone"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/tennis/articles/cpwvqrnrvxno",
      "main_category": "sport",
      "detailed_category": "tennis",
      "topic": "Xu wins singles and doubles titles at Wrexham Open",
      "content": [
        "Welsh teenager Mimi Xu secured the biggest victory of her career so far by beating Mika Stojsavljevic to win the Lexus Wrexham Open.Xu defeated her fellow British teenager and former Junior Billie Jean King Cup team-mate 6-3 7-5 in the final.Later in the day Xu teamed up with Ella McDonald to win the doubles title.In the singles final, the 18-year-old from Swansea made a strong start, winning five games in a row and breaking three times to storm out to a 5-1 lead.Stojsavljevic proved more solid on serve in the second set and the young Brit saved seven break points to stay in contention.However, with the scores locked at 5-5, Xu managed to seal the all-important break before serving out a landmark victory on her third match point.\"It's honestly felt amazing,\" said Xu.\"It's been so good, the atmosphere, the crowd, the environment, I've loved every minute of it. I honestly have no words to describe how I feel at the moment.\"",
        "Stojsavljevic, 16, had reached her second consecutive final after winning the Lexus GB Pro Series Birmingham a week previously and had beaten Xu in the quarter-finals on her way to winning that title.The former US Open junior champion, had not dropped a set in reaching the Wrexham Open final.\"This is now my tenth match in a row in ten days or so, so I think physically I wasn't there 100 per cent today,\"Stojsavljevic said.\"But credit to Mimi, she played really great and I'm really happy for her. It was tough for me, but she did really well.\"Xu had little time to celebrate her win as she teamed up with McDonald in the doubles final against Amarni Banks and Valentina Ryser.",
        "The British pair beat fellow British player Amarni Banks and Switzerland's Valentina Ryser to win the doubles final 6-2, 6-4.",
        "Mimi Xu also won the Lexus GB Pro Series Aldershot trophy in 2024",
        "Welsh teenager Mimi Xu secured the biggest victory of her career so far by beating Mika Stojsavljevic to win the Lexus Wrexham Open.",
        "Xu defeated her fellow British teenager and former Junior Billie Jean King Cup team-mate 6-3 7-5 in the final.",
        "Later in the day Xu teamed up with Ella McDonald to win the doubles title.",
        "In the singles final, the 18-year-old from Swansea made a strong start, winning five games in a row and breaking three times to storm out to a 5-1 lead.",
        "Stojsavljevic proved more solid on serve in the second set and the young Brit saved seven break points to stay in contention.",
        "However, with the scores locked at 5-5, Xu managed to seal the all-important break before serving out a landmark victory on her third match point.",
        "\"It's honestly felt amazing,\" said Xu.",
        "\"It's been so good, the atmosphere, the crowd, the environment, I've loved every minute of it. I honestly have no words to describe how I feel at the moment.\"",
        "Stojsavljevic, 16, had reached her second consecutive final after winning the Lexus GB Pro Series Birmingham a week previously and had beaten Xu in the quarter-finals on her way to winning that title.",
        "The former US Open junior champion, had not dropped a set in reaching the Wrexham Open final.",
        "\"This is now my tenth match in a row in ten days or so, so I think physically I wasn't there 100 per cent today,\"Stojsavljevic said.",
        "\"But credit to Mimi, she played really great and I'm really happy for her. It was tough for me, but she did really well.\"",
        "Xu had little time to celebrate her win as she teamed up with McDonald in the doubles final against Amarni Banks and Valentina Ryser.",
        "The British pair beat fellow British player Amarni Banks and Switzerland's Valentina Ryser to win the doubles final 6-2, 6-4."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/tennis/articles/cddr28rddq9o",
      "main_category": "sport",
      "detailed_category": "tennis",
      "topic": "Bencic wins second WTA title since becoming a mother",
      "content": [
        "Belinda Bencic claimed her second WTA title since becoming a mother by beating Linda Noskova in the Pan Pacific Open final.Bencic, 28, who has now won 10 WTA tournaments, lost the final of this event to Agnieszka Radwanska in straight sets 10 years ago.But she dominated the Czech Republic's Noskova 6-2 6-3 to take the title this time around.Bencic's other WTA triumph this year came in Abu Dhabi just 10 months after the arrival of her first child - and less than four months since her return from more than a year out on maternity leave.\"I feel like Tokyo and Japan is a happy place in my career, a place where I've had good success and I just love being here,\" said Switzerland's Bencic, who won gold in the women's singles at the Tokyo Olympics.\"I had a deja vu moment on court. I had match point on the same side of the court, went for the same serve and was telling myself the same things. I had goosebumps, it was really special. It's great to win here again.\"When Bencic, a former world number four in 2020, returned to the sport in October 2024, her world ranking had dropped to 1,213.She has risen up to 13th in the rankings and earlier this year reached the semi-finals at Wimbledon before being beaten by eventual champion Iga Swiatek.\"I'm really enjoying my time back on tour and I think it's showing in the results,\" she added.\"I couldn't be more happy and I'm definitely surprised. This was definitely not planned.\"\"It's hard work but it's a lot of self-belief and a lot of mental belief as well.\"I'm really happy to have this confirmation with myself that I'm able to try to even beat my best ranking from before.\"Noskova, 20, also lost the China Open final at the start of the month and was looking to add to her solitary WTA win.",
        "Belinda Bencic is ranked 13th in the world",
        "Belinda Bencic claimed her second WTA title since becoming a mother by beating Linda Noskova in the Pan Pacific Open final.",
        "Bencic, 28, who has now won 10 WTA tournaments, lost the final of this event to Agnieszka Radwanska in straight sets 10 years ago.",
        "But she dominated the Czech Republic's Noskova 6-2 6-3 to take the title this time around.",
        "Bencic's other WTA triumph this year came in Abu Dhabi just 10 months after the arrival of her first child - and less than four months since her return from more than a year out on maternity leave.",
        "\"I feel like Tokyo and Japan is a happy place in my career, a place where I've had good success and I just love being here,\" said Switzerland's Bencic, who won gold in the women's singles at the Tokyo Olympics.",
        "\"I had a deja vu moment on court. I had match point on the same side of the court, went for the same serve and was telling myself the same things. I had goosebumps, it was really special. It's great to win here again.\"",
        "When Bencic, a former world number four in 2020, returned to the sport in October 2024, her world ranking had dropped to 1,213.",
        "She has risen up to 13th in the rankings and earlier this year reached the semi-finals at Wimbledon before being beaten by eventual champion Iga Swiatek.",
        "\"I'm really enjoying my time back on tour and I think it's showing in the results,\" she added.",
        "\"I couldn't be more happy and I'm definitely surprised. This was definitely not planned.\"",
        "\"It's hard work but it's a lot of self-belief and a lot of mental belief as well.",
        "\"I'm really happy to have this confirmation with myself that I'm able to try to even beat my best ranking from before.\"",
        "Noskova, 20, also lost the China Open final at the start of the month and was looking to add to her solitary WTA win.",
        "Live scores, results and order of play",
        "Get tennis news sent straight to your phone"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/tennis/articles/ce3k9kq9d4ko",
      "main_category": "sport",
      "detailed_category": "tennis",
      "topic": "Zverev sets up rematch with Sinner in Vienna final",
      "content": [
        "Alexander Zverev and Jannik Sinner will meet in Sunday's Vienna Open final for the first time since they battled it out for the Australian Open title in January. Zverev lost the Melbourne final in straight sets but is eager to test himself once more against the world number two after setting up the rematch with a 6-4 7-5 victory over Lorenzo Musetti in Saturday's second semi-final.Top seed Sinner had earlier reached his eighth ATP final of the season with a 6-3 6-4 victory over Alex de Minaur.\"I am looking forward to playing one of the two best players in the world to see where my level really is,\" said second seed Zverev, who has won four of their previous seven meetings, although his last victory over the Italian was two years ago.",
        "The 28-year-old German recorded his 300th victory on hard courts with an accomplished performance against Musetti.He played the key points well and made no mistake when serving out for the match after breaking the Italian fourth seed in the 11th game of the second set.Since losing to Sinner at the Australian Open, Zverev has gone on to reach just two more finals, winning on clay in Munich in April and losing on the grass in Stuttgart in June.That is in stark contrast to Sinner's record, with the Italian world number two becoming the first man since Novak Djokovic in 2015-16 to appear in eight finals in successive seasons.Sinner extended his winning streak on indoor hard courts to 20 matches and took his unbeaten record to 12 wins against Australian third seed De Minaur as he claimed a fourth consecutive straight-set victory at the ATP 500 tournament. He was broken twice - once in each set - but battled his way through what he described as a \"physical\" encounter. \"I am happy how I handled it,\" said the 2023 Vienna Open champion, who is aiming to secure a fourth title of the season after wins at the Australian Open, Wimbledon and China Open. \"I was a break up in the second and he broke me back. I tried to stay strong mentally so I am very happy about today's performance and obviously to be in another final.\"Elsewhere, 19-year-old Brazilian Joao Fonseca reached the first ATP 500 final of his career with a 7-6 (7-4) 7-5 victory over unseeded Spanish player Jaume Munar at the Swiss Indoors in Basel.He will play another Spaniard - Alejandro Davidovich Fokina - in the final after the eighth seed's opponent Frenchman Ugo Humbert retired while trailing 7-6 (7-4) 3-1 in their semi-final.",
        "Alexander Zverev has not beaten Jannik Sinner since the last 16 of the US Open in 2023",
        "Alexander Zverev and Jannik Sinner will meet in Sunday's Vienna Open final for the first time since they battled it out for the Australian Open title in January.",
        "Zverev lost the Melbourne final in straight sets but is eager to test himself once more against the world number two after setting up the rematch with a 6-4 7-5 victory over Lorenzo Musetti in Saturday's second semi-final.",
        "Top seed Sinner had earlier reached his eighth ATP final of the season with a 6-3 6-4 victory over Alex de Minaur.",
        "\"I am looking forward to playing one of the two best players in the world to see where my level really is,\" said second seed Zverev, who has won four of their previous seven meetings, although his last victory over the Italian was two years ago.",
        "The 28-year-old German recorded his 300th victory on hard courts with an accomplished performance against Musetti.",
        "He played the key points well and made no mistake when serving out for the match after breaking the Italian fourth seed in the 11th game of the second set.",
        "Since losing to Sinner at the Australian Open, Zverev has gone on to reach just two more finals, winning on clay in Munich in April and losing on the grass in Stuttgart in June.",
        "That is in stark contrast to Sinner's record, with the Italian world number two becoming the first man since Novak Djokovic in 2015-16 to appear in eight finals in successive seasons.",
        "Sinner extended his winning streak on indoor hard courts to 20 matches and took his unbeaten record to 12 wins against Australian third seed De Minaur as he claimed a fourth consecutive straight-set victory at the ATP 500 tournament.",
        "He was broken twice - once in each set - but battled his way through what he described as a \"physical\" encounter.",
        "\"I am happy how I handled it,\" said the 2023 Vienna Open champion, who is aiming to secure a fourth title of the season after wins at the Australian Open, Wimbledon and China Open.",
        "\"I was a break up in the second and he broke me back. I tried to stay strong mentally so I am very happy about today's performance and obviously to be in another final.\"",
        "Elsewhere, 19-year-old Brazilian Joao Fonseca reached the first ATP 500 final of his career with a 7-6 (7-4) 7-5 victory over unseeded Spanish player Jaume Munar at the Swiss Indoors in Basel.",
        "He will play another Spaniard - Alejandro Davidovich Fokina - in the final after the eighth seed's opponent Frenchman Ugo Humbert retired while trailing 7-6 (7-4) 3-1 in their semi-final.",
        "Live scores, results and order of play",
        "Get tennis news sent straight to your phone"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/tennis/articles/cnve15qme8lo",
      "main_category": "sport",
      "detailed_category": "tennis",
      "topic": "Rybakina pulls out of Pan Pacific Open semi-final",
      "content": [
        "Elena Rybakina pulled out of her Pan Pacific Open semi-final on Saturday citing back problems, a day after securing her spot in the season-ending WTA Finals.The 2022 Wimbledon champion was due to face Linda Noskova of the Czech Republic - who will now meet Belinda Bencic in Sunday's final in Tokyo.\"I'm very sorry I can't play today,\" Rybakina, 26, said in a statement.\"I have been having problems with my back this week and can't play 100%. I am disappointed that my fans will not see me today but I hope to see you next year.\"The Kazakh beat Victoria Mboko on Friday to seal the last spot for next month's WTA Finals, which feature the top eight singles players and doubles teams of the year.She had needed to reach at least the semi-finals in Tokyo to pass Russian 18-year-old Mirra Andreeva in the race for the eighth and final spot.Rybakina, who won the Ningbo Open in China last week, will rise to world number six when the rankings are updated on Monday.",
        "Several high-profile players have seen their seasons ended prematurely over recent weeks.Former women's world number one Iga Swiatek complained in September that the season is \"too long and too intense\" amid a string of injuries to players at the China Open.Bencic, meanwhile overcame American Sofia Kenin 7-6 (7-5) 3-6 6-2 to book her place in the final in the city where she won Olympic gold in 2021.Both players were strong on serve in the opening set before the Swiss won it on a tie-break. Former Australian Open champion Kenin then took the second set before Bencic dominated the decider - thanks in part to some sloppy play from Kenin - to progress.\"I think it was a very difficult match,\" said Bencic.\"I'm really exhausted at this point. I tried to shorten the points, take more risks and tried to go for it. Thankfully today it went my way.\"Bencic will be looking to win her second title of the season on Sunday, while Noskova - who lost in the China Open final to Amanda Anisimova at the start of the month - is aiming for her second WTA crown.",
        "Elena Rybakina will rise to world number six when the rankings are updated on Monday",
        "Elena Rybakina pulled out of her Pan Pacific Open semi-final on Saturday citing back problems, a day after securing her spot in the season-ending WTA Finals.",
        "The 2022 Wimbledon champion was due to face Linda Noskova of the Czech Republic - who will now meet Belinda Bencic in Sunday's final in Tokyo.",
        "\"I'm very sorry I can't play today,\" Rybakina, 26, said in a statement.",
        "\"I have been having problems with my back this week and can't play 100%. I am disappointed that my fans will not see me today but I hope to see you next year.\"",
        "The Kazakh beat Victoria Mboko on Friday to seal the last spot for next month's WTA Finals, which feature the top eight singles players and doubles teams of the year.",
        "She had needed to reach at least the semi-finals in Tokyo to pass Russian 18-year-old Mirra Andreeva in the race for the eighth and final spot.",
        "Rybakina, who won the Ningbo Open in China last week, will rise to world number six when the rankings are updated on Monday.",
        "Several high-profile players have seen their seasons ended prematurely over recent weeks.",
        "Former women's world number one Iga Swiatek complained in September that the season is \"too long and too intense\" amid a string of injuries to players at the China Open.",
        "Bencic, meanwhile overcame American Sofia Kenin 7-6 (7-5) 3-6 6-2 to book her place in the final in the city where she won Olympic gold in 2021.",
        "Both players were strong on serve in the opening set before the Swiss won it on a tie-break.",
        "Former Australian Open champion Kenin then took the second set before Bencic dominated the decider - thanks in part to some sloppy play from Kenin - to progress.",
        "\"I think it was a very difficult match,\" said Bencic.",
        "\"I'm really exhausted at this point. I tried to shorten the points, take more risks and tried to go for it. Thankfully today it went my way.\"",
        "Bencic will be looking to win her second title of the season on Sunday, while Noskova - who lost in the China Open final to Amanda Anisimova at the start of the month - is aiming for her second WTA crown.",
        "Live scores, results and order of play",
        "Get tennis news sent straight to your phone"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/tennis/articles/c1d0r2x05e4o",
      "main_category": "sport",
      "detailed_category": "tennis",
      "topic": "Rybakina clinches last spot in WTA Finals",
      "content": [
        "Elena Rybakina has clinched the last spot for next month's WTA Finals by beating Victoria Mboko to reach the Pan Pacific Open semi-finals.The 2022 Wimbledon champion, who has won two WTA 500 titles this year, beat 19-year-old Mboko 6-3 7-6 (7-4) to seal her place in the end-of-season event.The WTA Finals, which features the top eight singles players and doubles teams of the year, starts on 1 November in Saudi Arabia.Kazakhstan's Rybakina needed to reach at least the semi-finals in Tokyo to pass Russian 18-year-old Mirra Andreeva in the race for the eighth and final spot.Her victory over Mboko means she will join Aryna Sabalenka, Iga Swiatek, Coco Gauff, Amanda Anisimova, Madison Keys, Jessica Pegula and Jasmine Paolini in Riyadh.",
        "\"It's great to qualify and play some more matches, especially against top players,\" Rybakina said.\"Last week I was focusing one match at a time and I knew that to qualify it's going to take a long road.\"Andreeva and fellow Russian Ekaterina Alexandrova, 30, are the first and second alternates for the Finals.Rybakina won her second title of the season at the Ningbo Open in China on Sunday to boost her chances of reaching the WTA Finals for a third successive year.The 26-year-old, who will rise to world number six when the rankings are updated on Monday, will face sixth seed Linda Noskova of the Czech Republic in the Tokyo semi-finals on Saturday.",
        "Rybakina has failed to advance past the round robin stage in her two previous appearances at the WTA Finals",
        "Elena Rybakina has clinched the last spot for next month's WTA Finals by beating Victoria Mboko to reach the Pan Pacific Open semi-finals.",
        "The 2022 Wimbledon champion, who has won two WTA 500 titles this year, beat 19-year-old Mboko 6-3 7-6 (7-4) to seal her place in the end-of-season event.",
        "The WTA Finals, which features the top eight singles players and doubles teams of the year, starts on 1 November in Saudi Arabia.",
        "Kazakhstan's Rybakina needed to reach at least the semi-finals in Tokyo to pass Russian 18-year-old Mirra Andreeva in the race for the eighth and final spot.",
        "Her victory over Mboko means she will join Aryna Sabalenka, Iga Swiatek, Coco Gauff, Amanda Anisimova, Madison Keys, Jessica Pegula and Jasmine Paolini in Riyadh.",
        "\"It's great to qualify and play some more matches, especially against top players,\" Rybakina said.",
        "\"Last week I was focusing one match at a time and I knew that to qualify it's going to take a long road.\"",
        "Andreeva and fellow Russian Ekaterina Alexandrova, 30, are the first and second alternates for the Finals.",
        "Rybakina won her second title of the season at the Ningbo Open in China on Sunday to boost her chances of reaching the WTA Finals for a third successive year.",
        "The 26-year-old, who will rise to world number six when the rankings are updated on Monday, will face sixth seed Linda Noskova of the Czech Republic in the Tokyo semi-finals on Saturday.",
        "Live scores, results and order of play",
        "Get tennis news sent straight to your phone"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/tennis/articles/cx24yg4pk7eo",
      "main_category": "sport",
      "detailed_category": "tennis",
      "topic": "Saudi Arabia to host new ATP tournament from 2028",
      "content": [
        "A new ATP Masters 1000 tournament will be added to the tennis calendar from 2028 - and staged in Saudi Arabia.A 56-man field will contest a one week event, most likely in February, in another sign of the increasing pulling power of the Gulf state.Saudi Arabia already hosts the WTA Finals and the Next Gen ATP Finals and its Public Investment Fund (PIF) is the official naming partner of both the ATP and WTA rankings.However, with players expressing so much concern about the length of the season and the number of events they play, the new tournament will not be mandatory.\"We are dealing with players who are independent contractors, so ultimately they are free to choose their own schedule,\" said ATP chairman Andrea Gaudenzi.\"They also play outside of the system and we saw this last week with the Six Kings Slam exhibition [in Saudi Arabia].\"I do agree the off season is too short and I don't think it's just too short for the players, but I also think it is too short for the fans - who at some point need to take a break from our sport.\"This is the first time the Masters 1000 category has been expanded since the birth of the concept in 1990.The Saudi Arabia event will join existing 1000 tournaments in Indian Wells, Miami, Monte Carlo, Madrid, Rome, Canada (which is rotated between Toronto and Montreal), Cincinnati, Shanghai and Paris.",
        "Monte Carlo is currently the only Masters 1000 which is not mandatory for the players. If a player skips the new Saudi event, his share of the annual bonus pool would not be affected and, under the current rules, he would have the opportunity to make up some of the ranking points conceded at another tournament.Seven of the existing nine Masters events are now staged over 12 days, which has proved unpopular with many players. The new Saudi tournament - at a venue still to be announced - will last just a week.It will form part of a 2028 schedule which will have a slightly different look and possibly finish at least a week earlier as the ATP tries to streamline the end of season tournaments.“Obviously to control the off season we need to be in the same room with the Grand Slams, and the ITF and the WTA - which is not the case, and is something I've been pushing for four years,” Gaudenzi continued.“I also have to notice that in today's world there's a lot more money, which means there is a lot more opportunity - and there is a lot more temptation of playing more and elsewhere. “But ultimately the top players in our sport have had the ability to say no and prioritise Slams, Masters and the ATP Finals mainly - that's how they are going to be remembered.\"Players have previously criticised the already congested tennis calendar, with Carlos Alcaraz saying in September 2024: \"They are going to kill us in some way.\"Earlier this month, British number one Jack Draper said the tour and the calendar has to \"adapt\" for players to achieve career longevity.His words came after Holger Rune became the latest high-profile player to have his season ended prematurely by injury, joining the likes of Britain's Emma Raducanu, Australia's Daria Kasatkina, Ukraine's Elina Svitolina and Spain's Paula Badosa on the women's WTA Tour.On Tuesday, Novak Djokovic pulled out of the upcoming Paris Masters, having been hampered by injury in his most recent ATP tournament, the Shanghai Masters.",
        "It is more than eighteen months since bidding invitations were issued to Saudi Arabia, Dubai, Doha, Abu Dhabi and Australia, with the decision to choose Saudi one of the worst kept secrets in the sport.A 10th Masters event was always envisaged but - until the rules were changed in a vote earlier this year - would have had to be staged in either the first week of the year or on grass before Wimbledon.Now, though, it could take place any time, and is expected to be staged in February, when the ATP already visits the Gulf region for events in Doha and Dubai.But the ATP is not confirming that publicly because the date is guaranteed to upset someone.Staging the tournament in Saudi Arabia in the first week of the year would be considered a hostile gesture by Tennis Australia, as most of its leading men would no longer play in the country in the lead up to the Australian Open.Scheduling it in February could divert players away from traditional clay court events in Rio de Janeiro and Buenos Aires, and European indoor tournaments like the one in Rotterdam.One favoured solution is to create two streams of February tournaments - one in the Middle East and the other in South America - with the European events moving to later in the year.It is not yet known how much prize money the Saudi tournament will offer, but the ATP sets a minimum prize money for all Masters 1000 events. Next week’s Paris Masters, which also has a 56-man field, is offering the minimum of 6,128,940 euros (£5,328,338).Tournaments are allowed to pay more in prize money - as long as the increase is distributed evenly throughout the draw. The Indian Wells Masters this year offered an extra $500,000 (£374,650), but it is rare for Masters 1000 events to offer more than the minimum required.",
        "There is as of yet no suggestion the new Saudi tournament will involve women and become a seventh ATP and WTA 1000 combined event.There are currently no further licences available for WTA 1000 events, and unless one was sold, existing owners - including those in Doha and Dubai - would have the ability to veto any expansion plans.But it is a possibility in future. “We're very cognisant of serving both the men's and women's game,“ said Danny Townsend, the chief executive of SURJ Sports Investment, which is a PIF company.“Obviously having them on at the same time, or at least in sequence, in Saudi Arabia would be great. That wasn't possible at this point in time, but we would certainly never say never and explore it if it's going to become an option.\"Saudi Arabia has invested huge amounts of money into football, golf, Formula 1 and boxing in recent years.But the nation has long been criticised for its poor human rights record, particularly about its treatment of women and criminalisation of homosexuality.The 2024 WTA Finals marked the first time Saudi Arabia has hosted a major women's sport event.",
        "Jannik Sinner won the 2025 Six Kings Slam, held in Riyadh, Saudi Arabia, earlier this month",
        "A new ATP Masters 1000 tournament will be added to the tennis calendar from 2028 - and staged in Saudi Arabia.",
        "A 56-man field will contest a one week event, most likely in February, in another sign of the increasing pulling power of the Gulf state.",
        "Saudi Arabia already hosts the WTA Finals and the Next Gen ATP Finals and its Public Investment Fund (PIF) is the official naming partner of both the ATP and WTA rankings.",
        "However, with players expressing so much concern about the length of the season and the number of events they play, the new tournament will not be mandatory.",
        "\"We are dealing with players who are independent contractors, so ultimately they are free to choose their own schedule,\" said ATP chairman Andrea Gaudenzi.",
        "\"They also play outside of the system and we saw this last week with the Six Kings Slam exhibition [in Saudi Arabia].",
        "\"I do agree the off season is too short and I don't think it's just too short for the players, but I also think it is too short for the fans - who at some point need to take a break from our sport.\"",
        "This is the first time the Masters 1000 category has been expanded since the birth of the concept in 1990.",
        "The Saudi Arabia event will join existing 1000 tournaments in Indian Wells, Miami, Monte Carlo, Madrid, Rome, Canada (which is rotated between Toronto and Montreal), Cincinnati, Shanghai and Paris.",
        "Saudi Arabia and Sport - The Explainer",
        "Monte Carlo is currently the only Masters 1000 which is not mandatory for the players.",
        "If a player skips the new Saudi event, his share of the annual bonus pool would not be affected and, under the current rules, he would have the opportunity to make up some of the ranking points conceded at another tournament.",
        "Seven of the existing nine Masters events are now staged over 12 days, which has proved unpopular with many players.",
        "The new Saudi tournament - at a venue still to be announced - will last just a week.",
        "It will form part of a 2028 schedule which will have a slightly different look and possibly finish at least a week earlier as the ATP tries to streamline the end of season tournaments.",
        "“Obviously to control the off season we need to be in the same room with the Grand Slams, and the ITF and the WTA - which is not the case, and is something I've been pushing for four years,” Gaudenzi continued.",
        "“I also have to notice that in today's world there's a lot more money, which means there is a lot more opportunity - and there is a lot more temptation of playing more and elsewhere.",
        "“But ultimately the top players in our sport have had the ability to say no and prioritise Slams, Masters and the ATP Finals mainly - that's how they are going to be remembered.\"",
        "Players have previously criticised the already congested tennis calendar, with Carlos Alcaraz saying in September 2024: \"They are going to kill us in some way.\"",
        "Earlier this month, British number one Jack Draper said the tour and the calendar has to \"adapt\" for players to achieve career longevity.",
        "His words came after Holger Rune became the latest high-profile player to have his season ended prematurely by injury, joining the likes of Britain's Emma Raducanu, Australia's Daria Kasatkina, Ukraine's Elina Svitolina and Spain's Paula Badosa on the women's WTA Tour.",
        "On Tuesday, Novak Djokovic pulled out of the upcoming Paris Masters, having been hampered by injury in his most recent ATP tournament, the Shanghai Masters.",
        "It is more than eighteen months since bidding invitations were issued to Saudi Arabia, Dubai, Doha, Abu Dhabi and Australia, with the decision to choose Saudi one of the worst kept secrets in the sport.",
        "A 10th Masters event was always envisaged but - until the rules were changed in a vote earlier this year - would have had to be staged in either the first week of the year or on grass before Wimbledon.",
        "Now, though, it could take place any time, and is expected to be staged in February, when the ATP already visits the Gulf region for events in Doha and Dubai.",
        "But the ATP is not confirming that publicly because the date is guaranteed to upset someone.",
        "Staging the tournament in Saudi Arabia in the first week of the year would be considered a hostile gesture by Tennis Australia, as most of its leading men would no longer play in the country in the lead up to the Australian Open.",
        "Scheduling it in February could divert players away from traditional clay court events in Rio de Janeiro and Buenos Aires, and European indoor tournaments like the one in Rotterdam.",
        "One favoured solution is to create two streams of February tournaments - one in the Middle East and the other in South America - with the European events moving to later in the year.",
        "It is not yet known how much prize money the Saudi tournament will offer, but the ATP sets a minimum prize money for all Masters 1000 events.",
        "Next week’s Paris Masters, which also has a 56-man field, is offering the minimum of 6,128,940 euros (£5,328,338).",
        "Tournaments are allowed to pay more in prize money - as long as the increase is distributed evenly throughout the draw.",
        "The Indian Wells Masters this year offered an extra $500,000 (£374,650), but it is rare for Masters 1000 events to offer more than the minimum required.",
        "There is as of yet no suggestion the new Saudi tournament will involve women and become a seventh ATP and WTA 1000 combined event.",
        "There are currently no further licences available for WTA 1000 events, and unless one was sold, existing owners - including those in Doha and Dubai - would have the ability to veto any expansion plans.",
        "But it is a possibility in future.",
        "“We're very cognisant of serving both the men's and women's game,“ said Danny Townsend, the chief executive of SURJ Sports Investment, which is a PIF company.",
        "“Obviously having them on at the same time, or at least in sequence, in Saudi Arabia would be great. That wasn't possible at this point in time, but we would certainly never say never and explore it if it's going to become an option.\"",
        "Saudi Arabia has invested huge amounts of money into football, golf, Formula 1 and boxing in recent years.",
        "But the nation has long been criticised for its poor human rights record, particularly about its treatment of women and criminalisation of homosexuality.",
        "The 2024 WTA Finals marked the first time Saudi Arabia has hosted a major women's sport event.",
        "Live scores, results and order of play",
        "Get tennis news sent straight to your phone"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/tennis/articles/c5yl0gzl505o",
      "main_category": "sport",
      "detailed_category": "tennis",
      "topic": "What next for Djokovic after Paris withdrawal?",
      "content": [
        "Novak Djokovic pulling out of the upcoming Paris Masters without giving an explicit reason provides more uncertainty about his plans for the rest of the season.The 38-year-old Serb was hampered by injury in his most recent ATP tournament, the Shanghai Masters, where he lost to qualifier Valentin Vacherot in the semi-finals.Djokovic also had to retire from his match against Taylor Fritz at the Six Kings Slam exhibition in Saudi Arabia last week.On Tuesday, the 24-time major champion announced he had decided to withdraw from the Paris Masters, the final ATP 1000 event of the season which starts next week.\"Dear Paris, unfortunately I'll not compete at this year's Paris Masters,\" Djokovic wrote on social media.\"I have amazing memories and great success over the years, especially being able to conquer the title seven times.\"",
        "Djokovic's statement did not offer any reason why exactly he is not playing, but he hinted in Saudi that he would skip Paris in order to potentially elongate his season.Appearing at an ATP 250 event in Athens - a tournament owned by his family and relocated from Belgrade - is Djokovic's main focus. It looks unlikely he will miss an event with such an emotional pull unless his physical problems are too great. Following that is the season-ending ATP Finals in Turin.Djokovic has qualified as the third best player on the men's tour, behind Carlos Alcaraz and Jannik Sinner, despite only showing up at only 12 tournaments this season.Skipping an event he has already won seven times might be a more logical decision for Djokovic, who has repeatedly emphasised how creating further \"history\" is his priority now.After pulling out of the Saudi match, Djokovic was non-committal about his upcoming schedule.\"Now it's rest and really addressing some of the issues I have with my body,\" said the world number five.\"Then hopefully playing the last couple of tournaments of the season, let's see.\"",
        "It has been clear throughout the season that Djokovic's ageing body is, understandably, not able to withstand the rigours needed to win the sport's biggest prizes as well as it used to.He still has the technical quality to challenge most of the ATP Tour, demonstrated by reaching the semi-finals at all four majors this year.Djokovic was not able to complete his Australian Open semi-final against Alexander Zverev, which came three days after he courageously beat Alcaraz while hampered by a leg injury.He also moved into the last four at the French Open and Wimbledon, but faded physically after being unable to break down Sinner.At last month's US Open, Djokovic acknowledged he \"ran out of gas\" in a three-set defeat by Alcaraz.Winning a 25th major - moving him clear of Australia's Margaret Court as the sole record holder - is the biggest priority in the twilight of his career.Achieving that goal at the season-starting Slam in Melbourne, where he is already a record 10-time men's champion, is his next key target.Now Djokovic has to decide whether prolonging - or curtailing - this season will help his ambitions in 2026.",
        "Novak Djokovic has played just 12 tournaments this season - but only trails Carlos Alcaraz and Jannik Sinner in the ATP race",
        "Novak Djokovic pulling out of the upcoming Paris Masters without giving an explicit reason provides more uncertainty about his plans for the rest of the season.",
        "The 38-year-old Serb was hampered by injury in his most recent ATP tournament, the Shanghai Masters, where he lost to qualifier Valentin Vacherot in the semi-finals.",
        "Djokovic also had to retire from his match against Taylor Fritz at the Six Kings Slam exhibition in Saudi Arabia last week.",
        "On Tuesday, the 24-time major champion announced he had decided to withdraw from the Paris Masters, the final ATP 1000 event of the season which starts next week.",
        "\"Dear Paris, unfortunately I'll not compete at this year's Paris Masters,\" Djokovic wrote on social media.",
        "\"I have amazing memories and great success over the years, especially being able to conquer the title seven times.\"",
        "LeBron, Ronaldo, Brady 'inspire' Djokovic to keep playing",
        "Djokovic 'not giving up on Slams' - but can body keep up?",
        "Djokovic's statement did not offer any reason why exactly he is not playing, but he hinted in Saudi that he would skip Paris in order to potentially elongate his season.",
        "Appearing at an ATP 250 event in Athens - a tournament owned by his family and relocated from Belgrade - is Djokovic's main focus.",
        "It looks unlikely he will miss an event with such an emotional pull unless his physical problems are too great.",
        "Following that is the season-ending ATP Finals in Turin.",
        "Djokovic has qualified as the third best player on the men's tour, behind Carlos Alcaraz and Jannik Sinner, despite only showing up at only 12 tournaments this season.",
        "Skipping an event he has already won seven times might be a more logical decision for Djokovic, who has repeatedly emphasised how creating further \"history\" is his priority now.",
        "After pulling out of the Saudi match, Djokovic was non-committal about his upcoming schedule.",
        "\"Now it's rest and really addressing some of the issues I have with my body,\" said the world number five.",
        "\"Then hopefully playing the last couple of tournaments of the season, let's see.\"",
        "It has been clear throughout the season that Djokovic's ageing body is, understandably, not able to withstand the rigours needed to win the sport's biggest prizes as well as it used to.",
        "He still has the technical quality to challenge most of the ATP Tour, demonstrated by reaching the semi-finals at all four majors this year.",
        "Djokovic was not able to complete his Australian Open semi-final against Alexander Zverev, which came three days after he courageously beat Alcaraz while hampered by a leg injury.",
        "He also moved into the last four at the French Open and Wimbledon, but faded physically after being unable to break down Sinner.",
        "At last month's US Open, Djokovic acknowledged he \"ran out of gas\" in a three-set defeat by Alcaraz.",
        "Winning a 25th major - moving him clear of Australia's Margaret Court as the sole record holder - is the biggest priority in the twilight of his career.",
        "Achieving that goal at the season-starting Slam in Melbourne, where he is already a record 10-time men's champion, is his next key target.",
        "Now Djokovic has to decide whether prolonging - or curtailing - this season will help his ambitions in 2026.",
        "Live scores, results and order of play",
        "Get tennis news sent straight to your phone"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/tennis/articles/c2emwwyl3eyo",
      "main_category": "sport",
      "detailed_category": "tennis",
      "topic": "Norrie beaten by Berrettini in Austria Open thriller",
      "content": [
        "British number two Cameron Norrie was knocked out of the Austria Open by Italy's Matteo Berrettini in a dramatic last-16 match. The world number 59 overcame Norrie in three hours and 16 minutes with a 7-6 (8-6) 6-7 (9-11) 6-4 victory in Vienna.Norrie let a 4-1 lead slip in the first set, and was punished in the tie-break as Berretini edged ahead. The second set was even tighter, with both players keeping serve throughout.The Italian squandered a match point in the tie-break, with Norrie taking his fourth set-point opportunity to level the match. But the 30-year-old could not build on his momentum in the deciding set and Berrettini sealed a crucial break in the ninth game to swing the match in his favour. Berrettini, 29, will face third seed and world number seven Alex de Minaur in the next round following the Australian's 6-4 6-4 victory over Filip Misolic. Italian world number two Jannik Sinner defeated compatriot Flavio Cobolli 6-2 7-6 (7-4).Germany's world number three Alexander Zverev also progressed, winning 6-4 6-4 against Italy's Matteo Arnaldi.But, four days after ending his 882-day wait to win a title, Russian Daniil Medvedev was beaten 7-6 (7-3) 6-4 by Frenchman Corentin Moutet - his opponent in Sunday's Almaty Open final.",
        "Cameron Norrie reached a career-high of world number eight in 2022",
        "British number two Cameron Norrie was knocked out of the Austria Open by Italy's Matteo Berrettini in a dramatic last-16 match.",
        "The world number 59 overcame Norrie in three hours and 16 minutes with a 7-6 (8-6) 6-7 (9-11) 6-4 victory in Vienna.",
        "Norrie let a 4-1 lead slip in the first set, and was punished in the tie-break as Berretini edged ahead.",
        "The second set was even tighter, with both players keeping serve throughout.",
        "The Italian squandered a match point in the tie-break, with Norrie taking his fourth set-point opportunity to level the match.",
        "But the 30-year-old could not build on his momentum in the deciding set and Berrettini sealed a crucial break in the ninth game to swing the match in his favour.",
        "Berrettini, 29, will face third seed and world number seven Alex de Minaur in the next round following the Australian's 6-4 6-4 victory over Filip Misolic.",
        "Italian world number two Jannik Sinner defeated compatriot Flavio Cobolli 6-2 7-6 (7-4).",
        "Germany's world number three Alexander Zverev also progressed, winning 6-4 6-4 against Italy's Matteo Arnaldi.",
        "But, four days after ending his 882-day wait to win a title, Russian Daniil Medvedev was beaten 7-6 (7-3) 6-4 by Frenchman Corentin Moutet - his opponent in Sunday's Almaty Open final.",
        "Live scores, results and order of play",
        "Get tennis news sent straight to your phone"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/tennis/articles/cnve1ery9p0o",
      "main_category": "sport",
      "detailed_category": "tennis",
      "topic": "Xu to face Stojsavljevic in Wrexham Open final",
      "content": [
        "Lexus Wrexham OpenVenue: Wrexham Tennis and Padel Centre Date: 21-26 OctoberCoverage: Watch live on BBC Sport online and BBC iPlayer",
        "Wales' Mimi Xu secured her place in the final of the Wrexham Open following victory over Lily Miyazaki in an all-British semi-final.Xu won the first set 6-2 but Miyazaki hit back to take the second set 6-4.But Xu, the 18-year-old from Swansea, came out firing in the decider as she broke Miyazaki twice and dropped just seven points on her way to closing out the victory 6-2.She will face fellow Brit Mika Stojsavljevic in Sunday's final.The 16-year-old reached her second successive ITF final with a 6-2, 6-0 win over Estonia's Elena Malygina.",
        "\"I came out and I was playing really well at the start and mostly through the second as well,” said Xu.\"Lily did a really good job of finding the pressure when I broke her and just making me work for each point, and she was the better player at the end of the second, but I think I did a really good job of just resetting and staying in the moment in the third set, and really happy to get through it.\"\"The supports means everything to me,\" Xu added. \"This is my biggest final that I've been in and just to do it in Wales, when I go out on court I really feel the support.”",
        "Xu and Stojsavljevic faced each in Birmingham last week when Stojsavljevic emerged a 3-6, 7-6, 6-2 winner in the quarter-finals on her way to becoming champion. “We both know each other well and hopefully it will be a great match, and I'm excited for it,” said Stojsavljevic, the former US Open junior champion.",
        "Xu will also feature in Sunday's doubles final after she and Ella McDonald secured a straight sets win over Miyazaki and Freya Christie, winning 6-3, 6-4.They will face Britain's Armani Banks and Valentina Ryser of Switzerland in the final.",
        "Mimi Xu faced Emma Raducanu on her Wimbledon singles debut",
        "Venue: Wrexham Tennis and Padel Centre Date: 21-26 October",
        "Coverage: Watch live on BBC Sport online and BBC iPlayer",
        "Wales' Mimi Xu secured her place in the final of the Wrexham Open following victory over Lily Miyazaki in an all-British semi-final.",
        "Xu won the first set 6-2 but Miyazaki hit back to take the second set 6-4.",
        "But Xu, the 18-year-old from Swansea, came out firing in the decider as she broke Miyazaki twice and dropped just seven points on her way to closing out the victory 6-2.",
        "She will face fellow Brit Mika Stojsavljevic in Sunday's final.",
        "The 16-year-old reached her second successive ITF final with a 6-2, 6-0 win over Estonia's Elena Malygina.",
        "Xu beats third seed Mikulskyte at Wrexham Open",
        "'My driving test was more stressful than Wimbledon'",
        "\"I came out and I was playing really well at the start and mostly through the second as well,” said Xu.",
        "\"Lily did a really good job of finding the pressure when I broke her and just making me work for each point, and she was the better player at the end of the second, but I think I did a really good job of just resetting and staying in the moment in the third set, and really happy to get through it.\"",
        "\"The supports means everything to me,\" Xu added.",
        "\"This is my biggest final that I've been in and just to do it in Wales, when I go out on court I really feel the support.”",
        "Xu and Stojsavljevic faced each in Birmingham last week when Stojsavljevic emerged a 3-6, 7-6, 6-2 winner in the quarter-finals on her way to becoming champion.",
        "“We both know each other well and hopefully it will be a great match, and I'm excited for it,” said Stojsavljevic, the former US Open junior champion.",
        "Xu will also feature in Sunday's doubles final after she and Ella McDonald secured a straight sets win over Miyazaki and Freya Christie, winning 6-3, 6-4.",
        "They will face Britain's Armani Banks and Valentina Ryser of Switzerland in the final."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/tennis/articles/ce8zgl03p00o",
      "main_category": "sport",
      "detailed_category": "tennis",
      "topic": "Sinner wins but host of players retire in Basel",
      "content": [
        "Jannik Sinner progressed to the semi-finals of the Vienna Open with a dominant straight-set win over Alexander Bublik.A single break of serve in both sets was enough for Italian world number two Sinner to maintain his pursuit of his fourth title of the year.Four-time Grand Slam champion Sinner, who lost only five points on serve during the entire match, will face Australia's Alex de Minaur for a place in the final. The 24-year-old, dethroned as the top-ranked men's player by Carlos Alcaraz following defeat by his rival in the US Open final, has won 60 of his past 66 matches.World number 16 Bublik beat Sinner in Halle in June, but the Kazakh was no match for the Australian Open and Wimbledon champion on Friday.Sinner never conceded more than one point in any of his service games, while applying consistent pressure on Bublik and managing to take two of his eight break points.Sinner is on a 19-match winning streak on indoor hard courts and a seven-match winning streak in Vienna, having won this title on his previous appearance in 2023.Semi-final opponent De Minaur progressed by defeating Italian Matteo Berrettini 6-1 7-6 (7-4).That was his 53rd win of the season - second only to world number one Alcaraz on the ATP Tour in 2025.",
        "German world number three Alexander Zverev is also through to the last four in Vienna after Dutchman Tallon Griekspoor withdrew from their quarter-final match.With that result, Zverev, seeded second in Vienna, joined Alcaraz, Sinner and Novak Djokovic as the first four players to qualify for the season-ending ATP Finals in November.Zverev will play Italian fourth seed Lorenzo Musetti or Frenchman Corentin Moutet in the other semi-final on Saturday.Meanwhile, at the Swiss Indoors, three of the four quarter-finals scheduled for Friday ended as walkovers.Norway's Casper Ruud decided he could not continue after losing a first-set tie-break against Spain's Alejandro Davidovich Fokina, and Canada's Felix Auger-Aliassime retired after Spaniard Jaume Munar won the first set 6-3.Canadian Denis Shapovalov shook hands with Joao Fonseca after falling 3-6 6-3 4-1 behind against the Brazilian.In the only match to be completed in Basel, Frenchman Ugo Humbert beat American Reilly Opelka 7-6 (7-0) 6-4.Several high-profile players have seen their seasons ended prematurely over recent weeks.Following a serious injury to Holger Rune, British number one Jack Draper called for the tennis calendar to be adapted if players are \"to achieve some sort of longevity\" earlier in October.Former women's world number one Iga Swiatek complained in September that the season is \"too long and too intense\" amid a string of injuries to players at the China Open.",
        "Jannik Sinner reached all four Grand Slam singles finals in 2025",
        "Jannik Sinner progressed to the semi-finals of the Vienna Open with a dominant straight-set win over Alexander Bublik.",
        "A single break of serve in both sets was enough for Italian world number two Sinner to maintain his pursuit of his fourth title of the year.",
        "Four-time Grand Slam champion Sinner, who lost only five points on serve during the entire match, will face Australia's Alex de Minaur for a place in the final.",
        "The 24-year-old, dethroned as the top-ranked men's player by Carlos Alcaraz following defeat by his rival in the US Open final, has won 60 of his past 66 matches.",
        "World number 16 Bublik beat Sinner in Halle in June, but the Kazakh was no match for the Australian Open and Wimbledon champion on Friday.",
        "Sinner never conceded more than one point in any of his service games, while applying consistent pressure on Bublik and managing to take two of his eight break points.",
        "Sinner is on a 19-match winning streak on indoor hard courts and a seven-match winning streak in Vienna, having won this title on his previous appearance in 2023.",
        "Semi-final opponent De Minaur progressed by defeating Italian Matteo Berrettini 6-1 7-6 (7-4).",
        "That was his 53rd win of the season - second only to world number one Alcaraz on the ATP Tour in 2025.",
        "German world number three Alexander Zverev is also through to the last four in Vienna after Dutchman Tallon Griekspoor withdrew from their quarter-final match.",
        "With that result, Zverev, seeded second in Vienna, joined Alcaraz, Sinner and Novak Djokovic as the first four players to qualify for the season-ending ATP Finals in November.",
        "Zverev will play Italian fourth seed Lorenzo Musetti or Frenchman Corentin Moutet in the other semi-final on Saturday.",
        "Meanwhile, at the Swiss Indoors, three of the four quarter-finals scheduled for Friday ended as walkovers.",
        "Norway's Casper Ruud decided he could not continue after losing a first-set tie-break against Spain's Alejandro Davidovich Fokina, and Canada's Felix Auger-Aliassime retired after Spaniard Jaume Munar won the first set 6-3.",
        "Canadian Denis Shapovalov shook hands with Joao Fonseca after falling 3-6 6-3 4-1 behind against the Brazilian.",
        "In the only match to be completed in Basel, Frenchman Ugo Humbert beat American Reilly Opelka 7-6 (7-0) 6-4.",
        "Several high-profile players have seen their seasons ended prematurely over recent weeks.",
        "Following a serious injury to Holger Rune, British number one Jack Draper called for the tennis calendar to be adapted if players are \"to achieve some sort of longevity\" earlier in October.",
        "Former women's world number one Iga Swiatek complained in September that the season is \"too long and too intense\" amid a string of injuries to players at the China Open.",
        "Live scores, results and order of play",
        "Get tennis news sent straight to your phone"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/tennis/articles/ckg4d39ydq0o",
      "main_category": "sport",
      "detailed_category": "tennis",
      "topic": "Norrie battles past Rublev to progress in Austria",
      "content": [
        "Britain's Cameron Norrie battled his way to victory over seventh seed Andrey Rublev to progress to the second round of the Erste Bank Open. World number 35 Norrie won the two-hour match 6-2 6-7 (5-7) 6-2 in Austria. Norrie, 30, started the match in fine fashion and took the opening set in just 34 minutes before breaking serve to move 2-0 up in the second. The Briton served for the match at 5-4, but Rublev landed his first break of serve to force a tie-break, which he won to set up a deciding set. Former world number eight Norrie regrouped to break Rublev's serve in the second game to take command of the third set. Norrie broke once more to book his spot in the next round, where he will face either Australia's Alexei Popyrin or Italy's Matteo Berrettini. \"It was all round a really good performance, I was moving well and able to dictate the points,\" said Norrie.\"I got a bit tight and tentative when I was serving for the match but credit to him staying in and competing.\"Meanwhile, there was heartbreak for British number three Jacob Fearnley who was beaten by second seed Alexander Zverev in the first round.After losing the first set, Fearnley, ranked 81st in the world, stunned the German to level the match and managed to force a third-set tie-break.However, Zverev won the hard-fought breaker to progress 6-4 1-6 7-6 (7-5) and will face Italian qualifier Matteo Arnaldi in the second round.",
        "Cameron Norrie made it to the semi-finals of Wimbledon in 2022",
        "Britain's Cameron Norrie battled his way to victory over seventh seed Andrey Rublev to progress to the second round of the Erste Bank Open.",
        "World number 35 Norrie won the two-hour match 6-2 6-7 (5-7) 6-2 in Austria.",
        "Norrie, 30, started the match in fine fashion and took the opening set in just 34 minutes before breaking serve to move 2-0 up in the second.",
        "The Briton served for the match at 5-4, but Rublev landed his first break of serve to force a tie-break, which he won to set up a deciding set.",
        "Former world number eight Norrie regrouped to break Rublev's serve in the second game to take command of the third set.",
        "Norrie broke once more to book his spot in the next round, where he will face either Australia's Alexei Popyrin or Italy's Matteo Berrettini.",
        "\"It was all round a really good performance, I was moving well and able to dictate the points,\" said Norrie.",
        "\"I got a bit tight and tentative when I was serving for the match but credit to him staying in and competing.\"",
        "Meanwhile, there was heartbreak for British number three Jacob Fearnley who was beaten by second seed Alexander Zverev in the first round.",
        "After losing the first set, Fearnley, ranked 81st in the world, stunned the German to level the match and managed to force a third-set tie-break.",
        "However, Zverev won the hard-fought breaker to progress 6-4 1-6 7-6 (7-5) and will face Italian qualifier Matteo Arnaldi in the second round.",
        "Live scores, results and order of play",
        "Get tennis news sent straight to your phone"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/tennis/articles/crl2klwrw7ro",
      "main_category": "sport",
      "detailed_category": "tennis",
      "topic": "'My driving test was more stressful than Wimbledon'",
      "content": [
        "Lexus Wrexham OpenVenue: Wrexham Tennis and Padel Centre Date: 20-26 OctoberCoverage: Watch live on BBC Sport online and BBC iPlayer",
        "Teenage tennis star Mimi Xu says her driving test was far more stressful than playing Emma Raducanu on her Wimbledon debut.Wildcard Xu won the hearts of the nation when she became the first Welsh player to enter the All England Club's main singles draw in 20 years.Xu drew British number one Raducanu in her first-round match and played in front of thousands on Court One.But the 18-year-old from Swansea says her practical driving test was much more of an ordeal.\"Leading up to the moment I passed, I was so tense, there was no way I could have driven back afterwards,\" she said.\"My mum doesn't trust me enough yet to drive on the big roads!\"",
        "Xu is one of 12 British hopes in the Wrexham Open, the biggest tennis event to come to Wales in almost 30 years.Fresh from winning a W35 doubles title in Birmingham and with a career-best singles ranking of 309, Xu is hopeful of having a good run in north Wales.She has been drawn against the number three seed, Lithuania's Justina Mikulskyte.\"I'm feeling confident in my game, I'm ready to go, ready to compete,\" Xu said.\"Everyone is at the level now where they can beat anyone on their day. Now that I'm 18 I get to play freely, there is always next week. \"I'm looking forward to carrying on developing my game, believing in myself, believing in my game, believing in all the hard work that I've put in and being confident to put it all out on the court, results will come if I do that.\"",
        "Xu has fond memories of playing in Wrexham as a junior, but this will be the first time she has played a major senior tournament on Welsh soil.\"I'm really excited to play in front of a home Welsh crowd, I'm used to playing in front of a British crowd, but not a Welsh crowd,\" she said.\"My first time here was 11 years ago, it's changed a lot since then, it's been revamped and I'm really looking forward to playing here.\"Xu is one of the main draws at Wrexham thanks to her Wimbledon exploits and she admits it feels a bit different going from an underdog to a contender.\"Both have their pressures, but as Billie Jean King said 'pressure is a privilege' and being able to have that home support will mean a lot to me, and that's what really helped me get through my Court One experience at Wimbledon.\"",
        "Mimi Xu enjoyed notable wins at tournaments in Birmingham, Ilkley and Nottingham last season",
        "Venue: Wrexham Tennis and Padel Centre Date: 20-26 October",
        "Coverage: Watch live on BBC Sport online and BBC iPlayer",
        "Teenage tennis star Mimi Xu says her driving test was far more stressful than playing Emma Raducanu on her Wimbledon debut.",
        "Wildcard Xu won the hearts of the nation when she became the first Welsh player to enter the All England Club's main singles draw in 20 years.",
        "Xu drew British number one Raducanu in her first-round match and played in front of thousands on Court One.",
        "But the 18-year-old from Swansea says her practical driving test was much more of an ordeal.",
        "\"Leading up to the moment I passed, I was so tense, there was no way I could have driven back afterwards,\" she said.",
        "\"My mum doesn't trust me enough yet to drive on the big roads!\"",
        "Wrexham to host north Wales' biggest tennis event",
        "Xu is one of 12 British hopes in the Wrexham Open, the biggest tennis event to come to Wales in almost 30 years.",
        "Fresh from winning a W35 doubles title in Birmingham and with a career-best singles ranking of 309, Xu is hopeful of having a good run in north Wales.",
        "She has been drawn against the number three seed, Lithuania's Justina Mikulskyte.",
        "\"I'm feeling confident in my game, I'm ready to go, ready to compete,\" Xu said.",
        "\"Everyone is at the level now where they can beat anyone on their day. Now that I'm 18 I get to play freely, there is always next week.",
        "\"I'm looking forward to carrying on developing my game, believing in myself, believing in my game, believing in all the hard work that I've put in and being confident to put it all out on the court, results will come if I do that.\"",
        "This video can not be played",
        "Elite tennis heads to Wales",
        "Xu has fond memories of playing in Wrexham as a junior, but this will be the first time she has played a major senior tournament on Welsh soil.",
        "\"I'm really excited to play in front of a home Welsh crowd, I'm used to playing in front of a British crowd, but not a Welsh crowd,\" she said.",
        "\"My first time here was 11 years ago, it's changed a lot since then, it's been revamped and I'm really looking forward to playing here.\"",
        "Xu is one of the main draws at Wrexham thanks to her Wimbledon exploits and she admits it feels a bit different going from an underdog to a contender.",
        "\"Both have their pressures, but as Billie Jean King said 'pressure is a privilege' and being able to have that home support will mean a lot to me, and that's what really helped me get through my Court One experience at Wimbledon.\"",
        "Live scores, results and order of play",
        "Get tennis news sent straight to your phone"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/tennis/articles/c4gj7v7ep61o",
      "main_category": "sport",
      "detailed_category": "tennis",
      "topic": "Sinner to miss Italy's Davis Cup title defence",
      "content": [
        "Four-time Grand Slam champion Jannik Sinner will not be part of the Italy team aiming to clinch a third consecutive Davis Cup title next month.The 24-year-old reached all four Grand Slam singles finals in 2025, winning the Australian Open and Wimbledon, and won the Six Kings Slam exhibition event in Saudi Arabia on Saturday.Sinner is scheduled to take part in the ATP Tour Finals in Turin from 9-16 November, but Italy captain Filippo Volandri said the world number two had \"not given his availability\" to play at the Davis Cup in Bologna from 18-23 November.World number one Carlos Alcaraz has been named in Spain's team.",
        "Sinner says he has taken the decision to miss the Davis Cup so he can have extra preparation time for the start of next season, with the Australian Open being the first Grand Slam of the year in January.\"It wasn't an easy decision, but after Turin, the goal is to get off on the right foot in Australia,\" Sinner told Sky Sport Italy. \"It may not seem like it, but a week of preparation during that period can make all the difference.\"We won the Davis Cup in 2023 and 2024, and this time we decided this with my team.\"Lorenzo Musetti and Flavio Cobolli, eighth and 22nd in the world respectively, will be the highest-ranked singles players on show for Italy, who face Austria in their quarter-final.Volandri said: \"The Davis Cup is, and will remain, always his home and I am sure that Jannik will soon be part of the team again.\"In the meantime, I can count on a group ready to fight and give everything for the blue jersey.\"",
        "Sinner's absence comes after several players voiced concerns about a demanding tennis calendar in recent weeks.After Holger Rune sustained a season-ending injury at the Nordic Open on Saturday, British number one Jack Draper posted on social media that \"the tour and the calendar have to adapt if any of us are going to achieve some sort of longevity\".Alcaraz said before the Six Kings Slam he feels players are misunderstood when they make such complaints but also play exhibition events - citing a reduced mental and physical toll at exhibitions compared with official ranking tournaments.",
        "Jannik Sinner was world number one until losing the US Open final to Carlos Alcaraz in September",
        "Four-time Grand Slam champion Jannik Sinner will not be part of the Italy team aiming to clinch a third consecutive Davis Cup title next month.",
        "The 24-year-old reached all four Grand Slam singles finals in 2025, winning the Australian Open and Wimbledon, and won the Six Kings Slam exhibition event in Saudi Arabia on Saturday.",
        "Sinner is scheduled to take part in the ATP Tour Finals in Turin from 9-16 November, but Italy captain Filippo Volandri said the world number two had \"not given his availability\" to play at the Davis Cup in Bologna from 18-23 November.",
        "World number one Carlos Alcaraz has been named in Spain's team.",
        "Sinner dominates Alcaraz at lucrative Six Kings Slam",
        "'Sport must adapt', says Draper after Rune injury",
        "Sinner says he has taken the decision to miss the Davis Cup so he can have extra preparation time for the start of next season, with the Australian Open being the first Grand Slam of the year in January.",
        "\"It wasn't an easy decision, but after Turin, the goal is to get off on the right foot in Australia,\" Sinner told Sky Sport Italy. \"It may not seem like it, but a week of preparation during that period can make all the difference.",
        "\"We won the Davis Cup in 2023 and 2024, and this time we decided this with my team.\"",
        "Lorenzo Musetti and Flavio Cobolli, eighth and 22nd in the world respectively, will be the highest-ranked singles players on show for Italy, who face Austria in their quarter-final.",
        "Volandri said: \"The Davis Cup is, and will remain, always his home and I am sure that Jannik will soon be part of the team again.",
        "\"In the meantime, I can count on a group ready to fight and give everything for the blue jersey.\"",
        "Sinner's absence comes after several players voiced concerns about a demanding tennis calendar in recent weeks.",
        "After Holger Rune sustained a season-ending injury at the Nordic Open on Saturday, British number one Jack Draper posted on social media that \"the tour and the calendar have to adapt if any of us are going to achieve some sort of longevity\".",
        "Alcaraz said before the Six Kings Slam he feels players are misunderstood when they make such complaints but also play exhibition events - citing a reduced mental and physical toll at exhibitions compared with official ranking tournaments.",
        "Live scores, results and order of play",
        "Get tennis news sent straight to your phone"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/tennis/articles/ce8zy3vrrl8o",
      "main_category": "sport",
      "detailed_category": "tennis",
      "topic": "Boulter's poor run continues with first-round loss",
      "content": [
        "British number three Katie Boulter's poor run of form continued with a straight-sets loss to world number 44 Eva Lys in the first round of the Pan Pacific Open in Tokyo.Boulter, 29, was beaten 6-2 6-1 in just one hour and 14 minutes by the 23-year-old German. After coming through two rounds of qualifying, she was the only British player in the main draw after Emma Raducanu withdrew, ending her season early through illness.The Briton was only able to win 50% of the points on her first serve and was broken five times by Lys.This latest defeat caps a disappointing run of form, which has seen the former world number 29 unable to progress beyond the second round of a tournament since the Nottingham Open in June. It also comes five days after the Briton lost in straight sets in the second round of the Japan Open by world number 51 Sorana Cirstea.Elsewhere, British number four Fran Jones was beaten in straight sets by China's Wang Xiyu in the first round of the Guangzhou Open. Seventh seed Jones was broken four times in the match as she lost 6-4 6-4 to the world number 163.",
        "Katie Boulter has not made it past the second round at a Grand Slam in 2025",
        "British number three Katie Boulter's poor run of form continued with a straight-sets loss to world number 44 Eva Lys in the first round of the Pan Pacific Open in Tokyo.",
        "Boulter, 29, was beaten 6-2 6-1 in just one hour and 14 minutes by the 23-year-old German.",
        "After coming through two rounds of qualifying, she was the only British player in the main draw after Emma Raducanu withdrew, ending her season early through illness.",
        "The Briton was only able to win 50% of the points on her first serve and was broken five times by Lys.",
        "This latest defeat caps a disappointing run of form, which has seen the former world number 29 unable to progress beyond the second round of a tournament since the Nottingham Open in June.",
        "It also comes five days after the Briton lost in straight sets in the second round of the Japan Open by world number 51 Sorana Cirstea.",
        "Elsewhere, British number four Fran Jones was beaten in straight sets by China's Wang Xiyu in the first round of the Guangzhou Open.",
        "Seventh seed Jones was broken four times in the match as she lost 6-4 6-4 to the world number 163.",
        "Live scores, results and order of play",
        "Get tennis news sent straight to your phone"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/tennis/articles/cn7emxek67lo",
      "main_category": "sport",
      "detailed_category": "tennis",
      "topic": "Draper & coach Trotman part ways after four years",
      "content": [
        "Jack Draper will no longer work with the man who coached him to the Indian Wells title as James Trotman wants to prioritise time with his family.The British number one has already hired Jamie Delgado as his head coach for next season but had been hoping there would also be a role for the man with whom he has enjoyed much success over the past four years.Trotman says it has become increasingly difficult to \"juggle\" Draper's career with his own family life.\"I've made the decision that four years has been a great run,\" Trotman told BBC Sport.\"I've thoroughly enjoyed it, but it was getting increasingly difficult for me juggling the demands Jack deserves as the player that he is - and also being a father and a husband.\"I need to start to get those energy levels back up and have a little bit more normality - watch my son play football on a Sunday, go on some family holidays, have a bit more of a normal life.\"Trotman says he first spoke to Draper about his future after Wimbledon, having felt mentally and physically tired over the previous year.The pair have been working together this week, with 23-year-old Draper returning to the practice court after resting the left arm injury that ended his season early.If the bruising in his arm heals as expected, Trotman will head to San Diego for some warm weather training with Draper and Delgado at the end of November.But after that, he will return to his job as an LTA men's national coach.",
        "\"My relationship with Jack is strong. We are extremely close,\" Trotman continued.\"We spent more time with each other than anybody else on the planet over the past four years.\"We are going to stay incredibly close and obviously I'll be following and supporting in any way I can from the sidelines.\"As well as winning the Masters 1000 event in Indian Wells in March, Draper hit a career-high world ranking of four in June.Last year, he reached the US Open semi-finals and won his first two ATP titles.\"Whatever Jack does in the future, I feel incredibly proud of the work that I've done,\" Trotman said.\"And where Jack is now, is not just as a result of me, it's a result of everybody that's worked with Jack and his family from a young age.\"",
        "Draper is due to make his comeback at the three-day UTS Grand Final in London in December, and is also expected to play an exhibition in Macau later that month.As the top-ranked British player, he will then have the opportunity to start next season by representing his country in the United Cup mixed team competition in Sydney and Perth.Delgado will be in full charge by then, and Trotman speaks highly of a man he has known since he was 12.\"One of the few people we could have worked really well together with was Jamie,\" Trotman added.\"I have a huge respect for him as a person and as a coach and the job that he has done with Gilles Muller, Andy [Murray] and more recently with Grigor [Dimitrov].\"",
        "James Trotman (right) has been an ever-present with Jack Draper over the past four years",
        "Jack Draper will no longer work with the man who coached him to the Indian Wells title as James Trotman wants to prioritise time with his family.",
        "The British number one has already hired Jamie Delgado as his head coach for next season but had been hoping there would also be a role for the man with whom he has enjoyed much success over the past four years.",
        "Trotman says it has become increasingly difficult to \"juggle\" Draper's career with his own family life.",
        "\"I've made the decision that four years has been a great run,\" Trotman told BBC Sport.",
        "\"I've thoroughly enjoyed it, but it was getting increasingly difficult for me juggling the demands Jack deserves as the player that he is - and also being a father and a husband.",
        "\"I need to start to get those energy levels back up and have a little bit more normality - watch my son play football on a Sunday, go on some family holidays, have a bit more of a normal life.\"",
        "Trotman says he first spoke to Draper about his future after Wimbledon, having felt mentally and physically tired over the previous year.",
        "The pair have been working together this week, with 23-year-old Draper returning to the practice court after resting the left arm injury that ended his season early.",
        "If the bruising in his arm heals as expected, Trotman will head to San Diego for some warm weather training with Draper and Delgado at the end of November.",
        "But after that, he will return to his job as an LTA men's national coach.",
        "\"My relationship with Jack is strong. We are extremely close,\" Trotman continued.",
        "\"We spent more time with each other than anybody else on the planet over the past four years.",
        "\"We are going to stay incredibly close and obviously I'll be following and supporting in any way I can from the sidelines.\"",
        "As well as winning the Masters 1000 event in Indian Wells in March, Draper hit a career-high world ranking of four in June.",
        "Last year, he reached the US Open semi-finals and won his first two ATP titles.",
        "\"Whatever Jack does in the future, I feel incredibly proud of the work that I've done,\" Trotman said.",
        "\"And where Jack is now, is not just as a result of me, it's a result of everybody that's worked with Jack and his family from a young age.\"",
        "Draper is due to make his comeback at the three-day UTS Grand Final in London in December, and is also expected to play an exhibition in Macau later that month.",
        "As the top-ranked British player, he will then have the opportunity to start next season by representing his country in the United Cup mixed team competition in Sydney and Perth.",
        "Delgado will be in full charge by then, and Trotman speaks highly of a man he has known since he was 12.",
        "\"One of the few people we could have worked really well together with was Jamie,\" Trotman added.",
        "\"I have a huge respect for him as a person and as a coach and the job that he has done with Gilles Muller, Andy [Murray] and more recently with Grigor [Dimitrov].\"",
        "Live scores, results and order of play",
        "Get tennis news sent straight to your phone"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/tennis/articles/cp975ld0x58o",
      "main_category": "sport",
      "detailed_category": "tennis",
      "topic": "Rating Raducanu's season - and what does future hold?",
      "content": [
        "Emma Raducanu completed a half-century of matches in a season for the first time in her career.They included a semi-final showing in Washington, plus a quarter-final in Miami and a last-16 appearance on the Rome clay at WTA 1000 level.There were also chastening defeats by the world's elite on the Grand Slam stage and a frustrating conclusion in Asia with illness, a bad back and missed match points.But the British number one's decision to curtail her season two weeks early, and miss events in Tokyo and Hong Kong because of lingering sickness, is a sound one.Raducanu has contested 22 tournaments this year, and was also in Auckland and set to play on New Year's Eve before withdrawing because of her back. That is more than enough.She now has 11 weeks to recover, rest and train for the 2026 season.Raducanu will not need to worry about a coach in that period, as she and Francisco Roig - who was part of Rafael Nadal's team for his 22 Grand Slam titles - have agreed to continue a partnership which began in August.",
        "The numbers underline this was Raducanu's best year since winning the 2021 US Open as a teenage qualifier in only her fourth tour-level event.",
        "Physically, the 22-year-old has proved a lot more robust - even if her back is becoming a familiar foe.It cost her vital preparation time last December and was a regular irritation on the clay and grass before stopping her in her tracks at the Ningbo Open this week.\"Structurally I'm more prone and susceptible to picking up things like this,\" Raducanu said of her back in May.There were many periods this summer when she looked a top-20 player. Her serve has become a more potent weapon, with the longer motion offering the potential for greater power and precision.Raducanu believes it is also now more reliable in tight moments, and she was generally very adept at saving break points this season.",
        "Of Raducanu's 22 defeats, only seven came against lower-ranked opponents, with three in the past month alone.But beating the very best, who often possess greater power, has proved beyond her so far.She lost 10 of her 11 matches against top-10 players in 2025, the exception being a victory over Emma Navarro in Miami in March.She was very competitive against world number one Aryna Sabalenka on Wimbledon's Centre Court - and took her to a third set tie-break in Cincinnati - but there was little room for encouragement elsewhere.After a 6-1 6-2 loss to ninth seed Elena Rybakina at the US Open, Raducanu reflected on where she needs to improve to change the narrative.\"My serve - it's been better, but I think it can get better [still],\" she told BBC Sport.\"The ball after the serve as well, so I'm ready for a fast return. I think that's where I still have some big work to do. \"I think starting the point is extremely important when you are playing at that kind of level.\"Raducanu developed an unfortunate habit in Asia of failing to convert match points.Last year's Wimbledon champion Barbora Krejcikova saved three against her in Seoul, and then world number five Jessica Pegula did exactly the same in Beijing a week later.More concerning, though, was the way Raducanu faded in the deciding set of those matches. Against Pegula, Raducanu went for broke and subsided quickly.This was not something you could have accused her of over the summer, and was perhaps a sign of a body and mind wearied by nine months on the road.",
        "Raducanu and Roig are planning a pre-season training block at the end of the year, and 2026 could begin with the United Cup team competition in Sydney and Perth.As Raducanu is now all but certain to finish the year as British number one, she and Jack Draper will be GB's team if they take up the opportunity to play in the tournament.Ranking points will be on offer and could yet be crucial as Raducanu, the current world number 29, tries to squeeze among the 32 seeds for the Australian Open later that month.As well as helping her learn how to conjugate Spanish verbs in the back of the car on the way to work, Raducanu has credited Roig with a \"confident and calm presence that rubs off when I am on court\".Time to work through changes on the practice court has been limited so far because of the sport's frenetic schedule.But there is now time to make some improvements and recharge before next season begins.",
        "Emma Raducanu is back inside the world's top 30 for the first time in three years",
        "Emma Raducanu completed a half-century of matches in a season for the first time in her career.",
        "They included a semi-final showing in Washington, plus a quarter-final in Miami and a last-16 appearance on the Rome clay at WTA 1000 level.",
        "There were also chastening defeats by the world's elite on the Grand Slam stage and a frustrating conclusion in Asia with illness, a bad back and missed match points.",
        "But the British number one's decision to curtail her season two weeks early, and miss events in Tokyo and Hong Kong because of lingering sickness, is a sound one.",
        "Raducanu has contested 22 tournaments this year, and was also in Auckland and set to play on New Year's Eve before withdrawing because of her back. That is more than enough.",
        "She now has 11 weeks to recover, rest and train for the 2026 season.",
        "Raducanu will not need to worry about a coach in that period, as she and Francisco Roig - who was part of Rafael Nadal's team for his 22 Grand Slam titles - have agreed to continue a partnership which began in August.",
        "The numbers underline this was Raducanu's best year since winning the 2021 US Open as a teenage qualifier in only her fourth tour-level event.",
        "Physically, the 22-year-old has proved a lot more robust - even if her back is becoming a familiar foe.",
        "It cost her vital preparation time last December and was a regular irritation on the clay and grass before stopping her in her tracks at the Ningbo Open this week.",
        "\"Structurally I'm more prone and susceptible to picking up things like this,\" Raducanu said of her back in May.",
        "There were many periods this summer when she looked a top-20 player. Her serve has become a more potent weapon, with the longer motion offering the potential for greater power and precision.",
        "Raducanu believes it is also now more reliable in tight moments, and she was generally very adept at saving break points this season.",
        "Of Raducanu's 22 defeats, only seven came against lower-ranked opponents, with three in the past month alone.",
        "But beating the very best, who often possess greater power, has proved beyond her so far.",
        "She lost 10 of her 11 matches against top-10 players in 2025, the exception being a victory over Emma Navarro in Miami in March.",
        "She was very competitive against world number one Aryna Sabalenka on Wimbledon's Centre Court - and took her to a third set tie-break in Cincinnati - but there was little room for encouragement elsewhere.",
        "After a 6-1 6-2 loss to ninth seed Elena Rybakina at the US Open, Raducanu reflected on where she needs to improve to change the narrative.",
        "\"My serve - it's been better, but I think it can get better [still],\" she told BBC Sport.",
        "\"The ball after the serve as well, so I'm ready for a fast return. I think that's where I still have some big work to do.",
        "\"I think starting the point is extremely important when you are playing at that kind of level.\"",
        "Raducanu developed an unfortunate habit in Asia of failing to convert match points.",
        "Last year's Wimbledon champion Barbora Krejcikova saved three against her in Seoul, and then world number five Jessica Pegula did exactly the same in Beijing a week later.",
        "More concerning, though, was the way Raducanu faded in the deciding set of those matches. Against Pegula, Raducanu went for broke and subsided quickly.",
        "This was not something you could have accused her of over the summer, and was perhaps a sign of a body and mind wearied by nine months on the road.",
        "Raducanu and Roig first teamed up at August's Cincinnati Open",
        "Raducanu and Roig are planning a pre-season training block at the end of the year, and 2026 could begin with the United Cup team competition in Sydney and Perth.",
        "As Raducanu is now all but certain to finish the year as British number one, she and Jack Draper will be GB's team if they take up the opportunity to play in the tournament.",
        "Ranking points will be on offer and could yet be crucial as Raducanu, the current world number 29, tries to squeeze among the 32 seeds for the Australian Open later that month.",
        "As well as helping her learn how to conjugate Spanish verbs in the back of the car on the way to work, Raducanu has credited Roig with a \"confident and calm presence that rubs off when I am on court\".",
        "Time to work through changes on the practice court has been limited so far because of the sport's frenetic schedule.",
        "But there is now time to make some improvements and recharge before next season begins.",
        "Live scores, results and order of play",
        "Get tennis news sent straight to your phone"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/tennis/articles/cvg760pgmmmo",
      "main_category": "sport",
      "detailed_category": "tennis",
      "topic": "Sinner dominates Alcaraz at lucrative Six Kings Slam",
      "content": [
        "Jannik Sinner claimed a commanding victory over rival Carlos Alcaraz to win the lucrative Six Kings Slam in Riyadh, Saudi Arabia.Sinner, replaced as world number one by Alcaraz following the US Open in September, exacted revenge for his defeat in the New York final with a 6-2 6-4 win.With his victory, the Italian, 24, earned a reported $6m (£4.5m) - including $4.5m (£3.4m) in prize money, in addition to a $1.5m (£1.1m) participation fee.While the pair split the four Grand Slam titles between them this season, Sinner was dominant from the outset against Alcaraz, who said his opponent was \"just too good\" on Saturday.Sinner broke Alcaraz's serve in the opening game and swiftly wrapped up the first set, with the Spaniard unable to gain a foothold against his opponent's clinical serving.He would go on to win the exhibition event for the second consecutive year after making the decisive breakthrough in the seventh game of the second set.\"I wish I could play like this everywhere,\" Sinner said in his on-court interview.\"This season we played many, many times and I also lost many times to Carlos. It is a huge pleasure and honour to share the court with him.\"At the same time, you want to get better as a player and you need rivalries in the sport. So it's nice to have a great rivalry and more importantly a great friendship off the court. \"We have a very special friendship and it's very nice.\"",
        "Six of the world's top men's players competed at the three-day exhibition event in Saudi Arabia, which was streamed on Netflix.Saudi Arabia has been accused of using its investment in sports and high-profile events to improve its image - known as 'sportswashing' - amid criticism over its human rights record.As an exhibition event, the results in Riyadh do not count towards the ATP rankings or in official head-to-head records.Alcaraz beat Taylor Fritz in straight sets to reach the final and Sinner overpowered joint-record 24-time major winner Novak Djokovic, who withdrew from his third-place play-off after losing the first set against Fritz earlier on Saturday.Together, Sinner and Alcaraz have won nine of the sport's past 10 majors and met in each of the last three slam finals in the early years of a burgeoning rivalry which has gripped the sport.\"When Jannik is playing at this level it is always difficult, today he was just too good,\" Alcaraz said.\"I always say when he plays such great tennis it gives me motivation to go to the practice court, give 100% and try to be better. Sometimes he is annoying, but he gives me extra motivation.\"On their relationship away from the court, Alcaraz added: \"A few times I wrote to him just to see how he's going or to congratulate him. We have a special relationship off the court, which is great.\"People think when two tennis players are competing for great things, giving their best on the court, they cannot have a great friendship off the court and I think we [have seen] it's possible.\"",
        "Jannik Sinner and Carlos Alcaraz have won all eight Grand Slam titles on offer in the past two seasons",
        "Jannik Sinner claimed a commanding victory over rival Carlos Alcaraz to win the lucrative Six Kings Slam in Riyadh, Saudi Arabia.",
        "Sinner, replaced as world number one by Alcaraz following the US Open in September, exacted revenge for his defeat in the New York final with a 6-2 6-4 win.",
        "With his victory, the Italian, 24, earned a reported $6m (£4.5m) - including $4.5m (£3.4m) in prize money, in addition to a $1.5m (£1.1m) participation fee.",
        "While the pair split the four Grand Slam titles between them this season, Sinner was dominant from the outset against Alcaraz, who said his opponent was \"just too good\" on Saturday.",
        "Sinner broke Alcaraz's serve in the opening game and swiftly wrapped up the first set, with the Spaniard unable to gain a foothold against his opponent's clinical serving.",
        "He would go on to win the exhibition event for the second consecutive year after making the decisive breakthrough in the seventh game of the second set.",
        "\"I wish I could play like this everywhere,\" Sinner said in his on-court interview.",
        "\"This season we played many, many times and I also lost many times to Carlos. It is a huge pleasure and honour to share the court with him.",
        "\"At the same time, you want to get better as a player and you need rivalries in the sport. So it's nice to have a great rivalry and more importantly a great friendship off the court.",
        "\"We have a very special friendship and it's very nice.\"",
        "'Devastated' Rune latest to have season cut short",
        "Osaka out of Japan Open as tennis casualty list grows",
        "Rating Raducanu's season - and what does future hold?",
        "Six of the world's top men's players competed at the three-day exhibition event in Saudi Arabia, which was streamed on Netflix.",
        "Saudi Arabia has been accused of using its investment in sports and high-profile events to improve its image - known as 'sportswashing' - amid criticism over its human rights record.",
        "As an exhibition event, the results in Riyadh do not count towards the ATP rankings or in official head-to-head records.",
        "Alcaraz beat Taylor Fritz in straight sets to reach the final and Sinner overpowered joint-record 24-time major winner Novak Djokovic, who withdrew from his third-place play-off after losing the first set against Fritz earlier on Saturday.",
        "Together, Sinner and Alcaraz have won nine of the sport's past 10 majors and met in each of the last three slam finals in the early years of a burgeoning rivalry which has gripped the sport.",
        "\"When Jannik is playing at this level it is always difficult, today he was just too good,\" Alcaraz said.",
        "\"I always say when he plays such great tennis it gives me motivation to go to the practice court, give 100% and try to be better. Sometimes he is annoying, but he gives me extra motivation.\"",
        "On their relationship away from the court, Alcaraz added: \"A few times I wrote to him just to see how he's going or to congratulate him. We have a special relationship off the court, which is great.",
        "\"People think when two tennis players are competing for great things, giving their best on the court, they cannot have a great friendship off the court and I think we [have seen] it's possible.\"",
        "Live scores, results and order of play",
        "Get tennis news sent straight to your phone"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/tennis/articles/c993xele2d3o",
      "main_category": "sport",
      "detailed_category": "tennis",
      "topic": "Resurgent Medvedev wins first title for 882 days",
      "content": [
        "A resurgent Daniil Medvedev claimed his first title for 882 days with victory over Corentin Moutet in the Almaty Open final.The Russian former world number one has had a torrid year, winning just one match at the Grand Slams and suffering a meltdown at the US Open.Medvedev's inconsistency on the ATP Tour - and struggles with his serve in particular - led to him dropping out of the world's top 10 and ultimately splitting with long-time coach Gilles Cervara.Now working with Thomas Johansson and Rohan Goetzke, Medvedev has steadily improved in the past month - culminating in a hard-fought 7-5 4-6 6-3 victory over Frenchman Moutet.It is Medvedev's first title since the 2023 Rome Masters and first on a hard court since March of that year.Victory also means Medvedev has won 21 titles at 21 different tournaments. \"It's the first time I'm at a tournament with my two daughters together, so to get a title is really nice,\" said world number 14 Medvedev.\"This title is in honour of my second daughter, Victoria, because the first title I got when my first daughter Alisa was born was for her.\"",
        "Medvedev, the 2021 US Open champion, had lost his past six finals, including in Halle earlier this year.His defensive play style and frequent outbursts on court had led some to wonder if his ability to compete at the top level was over.But the 29-year-old has made changes in recent weeks, making an effort to come to the net and play aggressively, backed up by an improved serve.He came back from a break down in the first set against the tricky Moutet, winning four of the final five games to take the lead.The pair exchanged breaks in the second set before Moutet, bidding for his first ATP Tour title, took control to force a decider.Moutet saved four early break points in a tight third set before Medvedev broke to 15 to serve for the match.Fittingly, Medvedev secured victory with a point at the net, with Moutet unable to control a volley after two hours and 38 minutes.",
        "Nineteen of Daniil Medvedev's 21 titles have been won on hard courts",
        "A resurgent Daniil Medvedev claimed his first title for 882 days with victory over Corentin Moutet in the Almaty Open final.",
        "The Russian former world number one has had a torrid year, winning just one match at the Grand Slams and suffering a meltdown at the US Open.",
        "Medvedev's inconsistency on the ATP Tour - and struggles with his serve in particular - led to him dropping out of the world's top 10 and ultimately splitting with long-time coach Gilles Cervara.",
        "Now working with Thomas Johansson and Rohan Goetzke, Medvedev has steadily improved in the past month - culminating in a hard-fought 7-5 4-6 6-3 victory over Frenchman Moutet.",
        "It is Medvedev's first title since the 2023 Rome Masters and first on a hard court since March of that year.",
        "Victory also means Medvedev has won 21 titles at 21 different tournaments.",
        "\"It's the first time I'm at a tournament with my two daughters together, so to get a title is really nice,\" said world number 14 Medvedev.",
        "\"This title is in honour of my second daughter, Victoria, because the first title I got when my first daughter Alisa was born was for her.\"",
        "'Sport must adapt', says Draper after Rune injury",
        "Osaka out of Japan Open as tennis casualty list grows",
        "Sinner dominates Alcaraz at lucrative Six Kings Slam",
        "Medvedev, the 2021 US Open champion, had lost his past six finals, including in Halle earlier this year.",
        "His defensive play style and frequent outbursts on court had led some to wonder if his ability to compete at the top level was over.",
        "But the 29-year-old has made changes in recent weeks, making an effort to come to the net and play aggressively, backed up by an improved serve.",
        "He came back from a break down in the first set against the tricky Moutet, winning four of the final five games to take the lead.",
        "The pair exchanged breaks in the second set before Moutet, bidding for his first ATP Tour title, took control to force a decider.",
        "Moutet saved four early break points in a tight third set before Medvedev broke to 15 to serve for the match.",
        "Fittingly, Medvedev secured victory with a point at the net, with Moutet unable to control a volley after two hours and 38 minutes.",
        "Live scores, results and order of play",
        "Get tennis news sent straight to your phone"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/tennis/articles/cwyn3dd5x24o",
      "main_category": "sport",
      "detailed_category": "tennis",
      "topic": "'Sport must adapt', says Draper after Rune injury",
      "content": [
        "British number one Jack Draper says the tennis calendar must be adapted after Holger Rune became the latest high-profile player to have his season ended prematurely.Danish 22-year-old Rune, set to return to the world's top 10 after reaching the semi-finals at the Nordic Open in Stockholm, was forced to retire with injury when leading Frenchman Ugo Humbert by a set.Rune's mother, Aneke, later told Danish newspaper BT that she had been informed by medical staff that her son's injury was \"very bad\".She said: \"They are completely sure that it is a torn Achilles tendon, so it's of course very bad. Holger is completely devastated. They say they can see it with the naked eye.\"Draper wrote on X: \"Injuries are going to happen… we are pushing our bodies to do things they aren't supposed to in elite sport. \"We have so many incredible younger guys on the tour right now and I'm proud to be a part of that.\"However, the tour and the calendar have to adapt if any of us are going to achieve some sort of longevity.\"",
        "Rune, nursing a hamstring issue coming into the match, appeared instantly aware of the severity of his injury and was emotional as he received treatment after hobbling to his chair.He had pulled up in pain after jumping to hit a ball at the back of the court, with the game level at 40-40 on Humbert's serve and Rune leading 6-4 2-2.Humbert said: \"It was not the way I wanted to win. I'm super disappointed for Holger, I hope he is going to be OK. \"I wish him a speedy recovery. It was a great match, he was playing a little bit better than me, but I'm really sorry for Holger.\"Later on Saturday, Novak Djokovic also retired after losing the first set of his third-place play-off against Taylor Fritz at the Six Kings Slam in Saudi Arabia - an exhibition event - having struggled with injury and sickness at last week's Shanghai Masters.Carlos Alcaraz, who finished runner-up to Jannik Sinner at the Saudi Arabia event which is not part of the ATP Tour, criticised the congested tennis calendar in September, saying \"they are going to kill us in some way\".",
        "Naomi Osaka became the latest high-profile player to withdraw from a tournament because of injury when she pulled out of the Japan Open with a leg problem before her quarter-final on Friday.Former women's world number one Iga Swiatek complained in September that the season is \"too long and too intense\" amid a string of injuries among players at the China Open.British number one Emma Raducanu called time on her season on Thursday after she was forced to retire from her two previous matches with illness.Australia's Daria Kasatkina, Ukraine's Elina Svitolina and Spain's Paula Badosa also ended their seasons earlier than planned in recent weeks, citing either injury or a need to take a break from the tour.",
        "Holger Rune has won five tour-level titles",
        "British number one Jack Draper says the tennis calendar must be adapted after Holger Rune became the latest high-profile player to have his season ended prematurely.",
        "Danish 22-year-old Rune, set to return to the world's top 10 after reaching the semi-finals at the Nordic Open in Stockholm, was forced to retire with injury when leading Frenchman Ugo Humbert by a set.",
        "Rune's mother, Aneke, later told Danish newspaper BT that she had been informed by medical staff that her son's injury was \"very bad\".",
        "She said: \"They are completely sure that it is a torn Achilles tendon, so it's of course very bad. Holger is completely devastated. They say they can see it with the naked eye.\"",
        "Draper wrote on X: \"Injuries are going to happen… we are pushing our bodies to do things they aren't supposed to in elite sport.",
        "\"We have so many incredible younger guys on the tour right now and I'm proud to be a part of that.",
        "\"However, the tour and the calendar have to adapt if any of us are going to achieve some sort of longevity.\"",
        "Rune, nursing a hamstring issue coming into the match, appeared instantly aware of the severity of his injury and was emotional as he received treatment after hobbling to his chair.",
        "He had pulled up in pain after jumping to hit a ball at the back of the court, with the game level at 40-40 on Humbert's serve and Rune leading 6-4 2-2.",
        "Humbert said: \"It was not the way I wanted to win. I'm super disappointed for Holger, I hope he is going to be OK.",
        "\"I wish him a speedy recovery. It was a great match, he was playing a little bit better than me, but I'm really sorry for Holger.\"",
        "Later on Saturday, Novak Djokovic also retired after losing the first set of his third-place play-off against Taylor Fritz at the Six Kings Slam in Saudi Arabia - an exhibition event - having struggled with injury and sickness at last week's Shanghai Masters.",
        "Carlos Alcaraz, who finished runner-up to Jannik Sinner at the Saudi Arabia event which is not part of the ATP Tour, criticised the congested tennis calendar in September, saying \"they are going to kill us in some way\".",
        "Naomi Osaka became the latest high-profile player to withdraw from a tournament because of injury when she pulled out of the Japan Open with a leg problem before her quarter-final on Friday.",
        "Former women's world number one Iga Swiatek complained in September that the season is \"too long and too intense\" amid a string of injuries among players at the China Open.",
        "British number one Emma Raducanu called time on her season on Thursday after she was forced to retire from her two previous matches with illness.",
        "Australia's Daria Kasatkina, Ukraine's Elina Svitolina and Spain's Paula Badosa also ended their seasons earlier than planned in recent weeks, citing either injury or a need to take a break from the tour.",
        "Live scores, results and order of play",
        "Get tennis news sent straight to your phone"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/tennis/articles/cn8vg7yrnpno",
      "main_category": "sport",
      "detailed_category": "tennis",
      "topic": "Osaka out of Japan Open as tennis casualty list grows",
      "content": [
        "Naomi Osaka has pulled out of the Japan Open before Friday's quarter-final because of a leg injury sustained in the second round.The former world number one held back tears and needed painkillers to come through a three-set last-16 win over defending champion Suzan Lamens on Wednesday.Top seed Osaka, who completed the match with strapping on her left thigh, was due to face Jaqueline Cristian in the last eight but the Romanian will instead progress to the semi-finals.The Japan Open made the announcement on X, saying: \"We regret to announce that Naomi Osaka has not recovered from a left leg injury sustained during the second round of this tournament and has withdrawn from the quarter-finals scheduled for today.\"It is not yet known whether Osaka will play in the Pan Pacific Open in Tokyo later this month.The four-time Grand Slam champion is the latest high-profile player to suffer late-season injury or health issues.In September, Iga Swiatek complained the season is \"too long and too intense\" following a string of injuries among players at the China Open.British number one Emma Raducanu called time on her season on Thursday after retiring from her two previous matches with illness.Australia's Daria Kasatkina, Ukraine's Elina Svitolina and Spain's Paula Badosa also ended their seasons early in recent weeks, citing either injury or a pressing need to take a break from the tour.Across two tournaments in China last week, five players retired injured.",
        "Naomi Osaka's last Grand Slam trophy came at the Australian Open in 2021",
        "Naomi Osaka has pulled out of the Japan Open before Friday's quarter-final because of a leg injury sustained in the second round.",
        "The former world number one held back tears and needed painkillers to come through a three-set last-16 win over defending champion Suzan Lamens on Wednesday.",
        "Top seed Osaka, who completed the match with strapping on her left thigh, was due to face Jaqueline Cristian in the last eight but the Romanian will instead progress to the semi-finals.",
        "The Japan Open made the announcement on X, saying: \"We regret to announce that Naomi Osaka has not recovered from a left leg injury sustained during the second round of this tournament and has withdrawn from the quarter-finals scheduled for today.\"",
        "It is not yet known whether Osaka will play in the Pan Pacific Open in Tokyo later this month.",
        "The four-time Grand Slam champion is the latest high-profile player to suffer late-season injury or health issues.",
        "In September, Iga Swiatek complained the season is \"too long and too intense\" following a string of injuries among players at the China Open.",
        "British number one Emma Raducanu called time on her season on Thursday after retiring from her two previous matches with illness.",
        "Australia's Daria Kasatkina, Ukraine's Elina Svitolina and Spain's Paula Badosa also ended their seasons early in recent weeks, citing either injury or a pressing need to take a break from the tour.",
        "Across two tournaments in China last week, five players retired injured.",
        "'Do you want a player to die on court?' - tennis in the heat"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/tennis/articles/clyzj1grnzeo",
      "main_category": "sport",
      "detailed_category": "tennis",
      "topic": "LeBron, Ronaldo, Brady 'inspire' Djokovic to keep playing",
      "content": [
        "Novak Djokovic wants to follow sporting greats such as LeBron James, Cristiano Ronaldo and Tom Brady by playing in his 40s and help shape the future of tennis.The 24-time Grand Slam champion, 38, reached the semi-finals of all four major tournaments this year.Djokovic has been chasing one more to move clear of Australian Margaret Court for the most Grand Slam singles titles in history.However, his last came at the 2023 US Open when he was 36 - the same age his great rivals Roger Federer and Rafael Nadal also won their final majors.Carlos Alcaraz and Jannik Sinner won two each this year, with Djokovic losing to world number two Sinner in the last four at Wimbledon and the French Open, and Spaniard Alcaraz at the US Open.The Serb retired from his Australian Open semi-final against Alexander Zverev with injury, having beat Alcaraz in the previous round.",
        "Every tournament exit has led to questions about his future, but Djokovic said he had no plans to retire and took inspiration from stars in other sports who have defied age to play at the top.Speaking at a conference at Joy Forum in Riyadh, Djokovic said: \"Longevity is one of my biggest motivations.\"I really want to see how far I can go. If you see across all the global sports, Lebron James he is still going strong, he is 40, Cristiano Ronaldo, Tom Brady played until he was 40-something years old, it is unbelievable.\"They are inspiring me.\"In the next couple of years tennis is a sport that can be greatly transformed and I want to be part of that change.\"I want to be playing when we rejuvenate our sport and set the new platform that is going to go on for decades to come.\"Leading players are pushing the Grand Slams for a greater share of revenue, while the Professional Tennis Players Association - co-founded by Djokovic - launched lawsuits against tennis' governing bodies earlier this year in an effort to force through changes.Djokovic was speaking in Saudi Arabia for the Six Kings Slam exhibition tournament, where he and six-time major champion Alcaraz have been given byes to the semi-finals.There is a reported $4.5m (£3.4m) in prize money on offer, with some players also likely to have been paid seven-figure sums to appear.Reports say the winner could take home up to $6m (£4.5m).Djokovic lost 6-4 6-2 to the event's defending champion Sinner on Thursday night.The Italian, 24, will face rival Alcaraz in the final for a second year in a row after the world number one overcame America's Taylor Fritz 6-4 6-2.",
        "Novak Djokovic turned professional in 2003 but has no intention of retirement yet",
        "Novak Djokovic wants to follow sporting greats such as LeBron James, Cristiano Ronaldo and Tom Brady by playing in his 40s and help shape the future of tennis.",
        "The 24-time Grand Slam champion, 38, reached the semi-finals of all four major tournaments this year.",
        "Djokovic has been chasing one more to move clear of Australian Margaret Court for the most Grand Slam singles titles in history.",
        "However, his last came at the 2023 US Open when he was 36 - the same age his great rivals Roger Federer and Rafael Nadal also won their final majors.",
        "Carlos Alcaraz and Jannik Sinner won two each this year, with Djokovic losing to world number two Sinner in the last four at Wimbledon and the French Open, and Spaniard Alcaraz at the US Open.",
        "The Serb retired from his Australian Open semi-final against Alexander Zverev with injury, having beat Alcaraz in the previous round.",
        "Every tournament exit has led to questions about his future, but Djokovic said he had no plans to retire and took inspiration from stars in other sports who have defied age to play at the top.",
        "Speaking at a conference at Joy Forum in Riyadh, Djokovic said: \"Longevity is one of my biggest motivations.",
        "\"I really want to see how far I can go. If you see across all the global sports, Lebron James he is still going strong, he is 40, Cristiano Ronaldo, Tom Brady played until he was 40-something years old, it is unbelievable.",
        "\"They are inspiring me.",
        "\"In the next couple of years tennis is a sport that can be greatly transformed and I want to be part of that change.",
        "\"I want to be playing when we rejuvenate our sport and set the new platform that is going to go on for decades to come.\"",
        "Leading players are pushing the Grand Slams for a greater share of revenue, while the Professional Tennis Players Association - co-founded by Djokovic - launched lawsuits against tennis' governing bodies earlier this year in an effort to force through changes.",
        "Djokovic was speaking in Saudi Arabia for the Six Kings Slam exhibition tournament, where he and six-time major champion Alcaraz have been given byes to the semi-finals.",
        "There is a reported $4.5m (£3.4m) in prize money on offer, with some players also likely to have been paid seven-figure sums to appear.",
        "Reports say the winner could take home up to $6m (£4.5m).",
        "Djokovic lost 6-4 6-2 to the event's defending champion Sinner on Thursday night.",
        "The Italian, 24, will face rival Alcaraz in the final for a second year in a row after the world number one overcame America's Taylor Fritz 6-4 6-2.",
        "What is lucrative Six Kings Slam & who is playing?",
        "Live scores, results and order of play",
        "Get tennis news sent straight to your phone"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/tennis/articles/cwy19kd113zo",
      "main_category": "sport",
      "detailed_category": "tennis",
      "topic": "Players 'misunderstood' over exhibition criticisms",
      "content": [
        "World number one Carlos Alcaraz says players are misunderstood when they want to play in exhibition tournaments alongside the demanding tennis calendar.Alcaraz, 22, was among those critical of the workload in Asia, where some players struggled physically, with the Spaniard saying he would consider skipping mandatory events to prioritise his health.He is top seed at this week's lucrative Six Kings Slam in Saudi Arabia, a six-man tournament from 15 to 18 October that also includes Jannik Sinner, Novak Djokovic, Alexander Zverev, Taylor Fritz and Stefanos Tsitsipas.There is a reported $4.5m (£3.4m) in prize money on offer at the exhibition, with some players also likely to have been paid seven-figure sums to appear.Reports say the winner could take home up to $6m (£4.5m).But Alcaraz feels that shorter-format events such as the Six Kings Slam are less gruelling than tour competitions, and therefore make fewer demands on the players.He said: \"A lot of players are talking about the calendar, how tight it is with a lot of tournaments, tournaments of two weeks, and then making excuses with exhibitions.\"It's a different format, different situation playing exhibitions than the official tournaments, 15, 16 days in row, having such a high focus and demanding physically.\"We're just having fun for one or two days and playing some tennis, and that's great, and why we choose the exhibitions.\"I understand [the criticism], but sometimes people don't understand us, our opinions. It's not really demanding mentally [compared with] when we're having such long events like two weeks or two and a half weeks.\"Alcaraz won his eighth title of the season in Tokyo last month despite an ankle injury sustained in his opening match that prompted him to pull out of the Shanghai Masters.He will play in Saudi Arabia despite the injury not being fully healed. \"Everything's OK,\" said Alcaraz. \"I've been recovering the ankle as much as I can.\"I don't feel 100% - the doubts are there when I'm moving on court, but it improved a lot and I'm going to compete and perform well in the Six Kings Slam.\"Alcaraz has a bye to the semi-finals of the event, which will be broadcast on Netflix, where he will face Fritz on Thursday after the American gained a 6-3 6-4 victory over Zverev.In Wednesday's other quarter-final, world number two Sinner beat Tsitsipas 6-2 6-3 and will face Djokovic in the semi-finals.",
        "Carlos Alcaraz has won eight tournaments this season",
        "World number one Carlos Alcaraz says players are misunderstood when they want to play in exhibition tournaments alongside the demanding tennis calendar.",
        "Alcaraz, 22, was among those critical of the workload in Asia, where some players struggled physically, with the Spaniard saying he would consider skipping mandatory events to prioritise his health.",
        "He is top seed at this week's lucrative Six Kings Slam in Saudi Arabia, a six-man tournament from 15 to 18 October that also includes Jannik Sinner, Novak Djokovic, Alexander Zverev, Taylor Fritz and Stefanos Tsitsipas.",
        "There is a reported $4.5m (£3.4m) in prize money on offer at the exhibition, with some players also likely to have been paid seven-figure sums to appear.",
        "Reports say the winner could take home up to $6m (£4.5m).",
        "But Alcaraz feels that shorter-format events such as the Six Kings Slam are less gruelling than tour competitions, and therefore make fewer demands on the players.",
        "He said: \"A lot of players are talking about the calendar, how tight it is with a lot of tournaments, tournaments of two weeks, and then making excuses with exhibitions.",
        "\"It's a different format, different situation playing exhibitions than the official tournaments, 15, 16 days in row, having such a high focus and demanding physically.",
        "\"We're just having fun for one or two days and playing some tennis, and that's great, and why we choose the exhibitions.",
        "\"I understand [the criticism], but sometimes people don't understand us, our opinions. It's not really demanding mentally [compared with] when we're having such long events like two weeks or two and a half weeks.\"",
        "Alcaraz won his eighth title of the season in Tokyo last month despite an ankle injury sustained in his opening match that prompted him to pull out of the Shanghai Masters.",
        "He will play in Saudi Arabia despite the injury not being fully healed. \"Everything's OK,\" said Alcaraz. \"I've been recovering the ankle as much as I can.",
        "\"I don't feel 100% - the doubts are there when I'm moving on court, but it improved a lot and I'm going to compete and perform well in the Six Kings Slam.\"",
        "Alcaraz has a bye to the semi-finals of the event, which will be broadcast on Netflix, where he will face Fritz on Thursday after the American gained a 6-3 6-4 victory over Zverev.",
        "In Wednesday's other quarter-final, world number two Sinner beat Tsitsipas 6-2 6-3 and will face Djokovic in the semi-finals.",
        "Carlos Alcaraz during a practice session in Saudi Arabia",
        "Live scores, results and order of play",
        "Get tennis news sent straight to your phone"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/tennis/articles/cjek3pp34ljo",
      "main_category": "sport",
      "detailed_category": "tennis",
      "topic": "Raducanu ends season and will keep coach for 2026",
      "content": [
        "Britain's Emma Raducanu has withdrawn from her final two events of the year because of the illness she has been battling over the past 10 days.The 22-year-old was due to play in Tokyo and Hong Kong but has decided to fly home to recover before starting her preparations for 2026.Those preparations will include coach Francisco Roig, as the pair have agreed to work together again next season.Raducanu had her blood pressure taken during her first-round match with Ann Li in Wuhan last week and retired when trailing 6-1 4-1 on an oppressively humid day.She again required a visit from the doctor at this week's Ningbo Open, where she lost in three sets to Chinese wildcard Zhu Lin in the opening round.Raducanu was also moving far from freely in the deciding set against Zhu because of the lower back problem that has troubled her at times this year.Those results meant an encouraging season, in which Raducanu rose into the world's top 30 for the first time in more than three years, ended with three successive defeats.Raducanu had three match points before losing to Jessica Pegula in the third round in Beijing last month.",
        "Raducanu won 28 matches this year and reached the semi-finals in Washington, but her most impressive week was at the Miami Open in March.The British number one reached the quarter-finals of the WTA 1000 event, beating eighth seed Emma Navarro on the way before losing in three sets to fourth-ranked Pegula.She was coached by Mark Petchey from Miami until Wimbledon, with Roig taking over in time for the US Open.The initial agreement with Rafael Nadal's former coach was until the end of the season but the partnership will continue, with a training block pencilled in for the end of the year.Raducanu told BBC Sport her three-day trial with Roig after Wimbledon was like a \"black ops mission\" as they tried to keep the meeting secret.She came very close to beating world number one Aryna Sabalenka at their first tournament together in Cincinnati in August.Roig was also with Raducanu in New York, where she reached the third round before being beaten by 2022 Wimbledon champion Elena Rybakina.",
        "Emma Raducanu reached the third round of three of the four Grand Slams this year",
        "Britain's Emma Raducanu has withdrawn from her final two events of the year because of the illness she has been battling over the past 10 days.",
        "The 22-year-old was due to play in Tokyo and Hong Kong but has decided to fly home to recover before starting her preparations for 2026.",
        "Those preparations will include coach Francisco Roig, as the pair have agreed to work together again next season.",
        "Raducanu had her blood pressure taken during her first-round match with Ann Li in Wuhan last week and retired when trailing 6-1 4-1 on an oppressively humid day.",
        "She again required a visit from the doctor at this week's Ningbo Open, where she lost in three sets to Chinese wildcard Zhu Lin in the opening round.",
        "Raducanu was also moving far from freely in the deciding set against Zhu because of the lower back problem that has troubled her at times this year.",
        "Those results meant an encouraging season, in which Raducanu rose into the world's top 30 for the first time in more than three years, ended with three successive defeats.",
        "Raducanu had three match points before losing to Jessica Pegula in the third round in Beijing last month.",
        "Players 'misunderstood' over exhibition criticisms",
        "Boulter out of Japan Open in second round",
        "Vacherot beats cousin for historic Shanghai title",
        "Raducanu won 28 matches this year and reached the semi-finals in Washington, but her most impressive week was at the Miami Open in March.",
        "The British number one reached the quarter-finals of the WTA 1000 event, beating eighth seed Emma Navarro on the way before losing in three sets to fourth-ranked Pegula.",
        "She was coached by Mark Petchey from Miami until Wimbledon, with Roig taking over in time for the US Open.",
        "The initial agreement with Rafael Nadal's former coach was until the end of the season but the partnership will continue, with a training block pencilled in for the end of the year.",
        "Raducanu told BBC Sport her three-day trial with Roig after Wimbledon was like a \"black ops mission\" as they tried to keep the meeting secret.",
        "She came very close to beating world number one Aryna Sabalenka at their first tournament together in Cincinnati in August.",
        "Roig was also with Raducanu in New York, where she reached the third round before being beaten by 2022 Wimbledon champion Elena Rybakina.",
        "Live scores, results and order of play",
        "Get tennis news sent straight to your phone"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/tennis/articles/c2kzev7wvj3o",
      "main_category": "sport",
      "detailed_category": "tennis",
      "topic": "How can Raducanu close gap on top players?",
      "content": [
        "There is some solace for Emma Raducanu following another brutal Grand Slam exit.All four of her defeats at this year's major tournaments have come against the world's leading stars - who Raducanu believes have extra motivation to beat her.On Friday, the British number one claimed just three games as she was demolished by 2022 Wimbledon champion Elena Rybakina in the US Open third round.That followed similar one-sided defeats by six-time major champion Iga Swiatek at the Australian Open and French Open, although Raducanu did test world number one Aryna Sabalenka at Wimbledon before falling in straight sets.\"I think when the very top players play against me, they have a point to prove that they're at the top, and they're there for a reason,\" said 36th-ranked Raducanu, who recently appointed Rafael Nadal's ex-coach Francisco Roig.\"I think every time I've played one, they've kind of shown that.\"So while I'm improving, doing better, gaining maybe some more respect around, I think the top have definitely raised their game.\"So, with the Grand Slams over for another season, how does Raducanu close the gap over the coming months?",
        "The revolving door of coaches employed by Raducanu since her US Open win has brought intense scrutiny.Raducanu likes to learn and once put her high turnover of coaches down to asking \"provoking\" questions of them.Bringing in Roig – a wily Spaniard who helped Nadal win each of his 22 Grand Slam titles - feels like a longer-term bet.According to those with inside knowledge of working with him, the 57-year-old Catalan has a technical knowledge which is unparalleled.The plan remains for the pair to work together until the end of the season. \"It's only been three weeks, but it's been a pretty successful three weeks in a sense that we've made good improvements.\" said Raducanu, who plans to return to competitive action when the Asian hard-court swing starts next month.\"Today my weaknesses were highlighted, but he can't really work miracles.\"Former British number one Annabel Croft thinks it is already clear that Roig is an \"excellent appointment\".",
        "\"He is very tactical, very demanding and very vocal,\" said Croft, who watched Raducanu's defeat as part of the BBC Radio 5 Live commentary team.\"I think she likes that and she will respond to it. You couldn't get better than someone who has worked with such a great champion for a number of years.\"Raducanu's serve has become a more potent weapon over the season, illustrated by the way she did not drop serve in her opening two matches in New York.But her first-serve percentage dropped alarmingly against Rybakina and she was punished severely.\"Developing my serve is important - it has got better but I think it can be even better,\" said Raducanu.\"The ball after the serve as well, so I'm ready for a fast return, that's where I have some big work to do.\"Once I'm in the rally I feel OK but against Elena I barely felt I was in a rally. \"Starting the point is extremely important at that level.\"",
        "Raducanu came into the New York encounter against Rybakina riding a wave of optimism.A productive season, where she has spent more time on court and looked increasingly resilient, has put her on the verge of climbing back into the world's top 30.Raducanu's ranking has not been higher since September 2022 - when her mountain of points for winning the US Open fell off.But she fell just short of earning a seeding at Flushing Meadows, which left her open to facing a highly-ranked player early in the draw.\"I've lost to Iga twice, Aryna, and Elena, so it's tough,\" Raducanu said.\"But at the same time, that's where I'm at with my ranking. I can play top opponents in the first, second, or third round. \"So I've just got to do my best in the next few months until Australia to just keep working to try and close the gap.\"Twice pushing Sabalenka - taking her to three sets in Cincinnati less than a month after their Wimbledon meeting - were further signs of encouragement.However, the chastening defeat by world number nine Rybakina, who hit the Briton off court with a flurry of excoriating winners, was a reminder of how she still needs to improve.It meant Raducanu has now won just three of her 18 career matches against top-10 opponents.\"Depending on the day, depending on how we match up, I think I'm getting better overall,\" she said.\"I think I'm improving for sure in the last few months. I just need to keep consistent and put this one behind.\"",
        "Raducanu's defeat was another example of how her game can struggle to hold up against the power players.While she was able to push Sabalenka in Cincinnati, Raducanu was helped by an erratic performance from her opponent and a lack of consistent examination.Rybakina's all-out attack was a different proposition.The 26-year-old Kazakh only landed 47% of her first serves but when she did they were effective - winning 81% of those points - and claimed 63% of her second-serve points.In the baseline exchanges, Raducanu was regularly pinned back behind the baseline in defensive positions and unable to drag Rybakina out to the wings.\"Against top players, you have to have your strategy right from the start of the match,\" American former world number six Chanda Rubin, also analysing for 5 Live,  said.\"If you get behind or start trying to figure out in real time how to play them, it is so difficult because everything is against you.\"Raducanu isn't going to be a huge hitter but I think she could have gone bigger and taken more risks.\"To improve her ability to cope with pace, Croft believes Raducanu might benefit from practice sessions between tournaments with male opponents.\"I once had the privilege of training with Steffi Graf and she did all of her training with blokes - everything was coming at her so fast, hard and flat,\" said Croft.\"I don't know how much Raducanu trains with men, but when you see her not coping with the pace of a shot, it makes me think that all of her training has to be done with power players.\"",
        "Until this year, Emma Raducanu had not won a US Open match since her 2021 title victory",
        "There is some solace for Emma Raducanu following another brutal Grand Slam exit.",
        "All four of her defeats at this year's major tournaments have come against the world's leading stars - who Raducanu believes have extra motivation to beat her.",
        "On Friday, the British number one claimed just three games as she was demolished by 2022 Wimbledon champion Elena Rybakina in the US Open third round.",
        "That followed similar one-sided defeats by six-time major champion Iga Swiatek at the Australian Open and French Open, although Raducanu did test world number one Aryna Sabalenka at Wimbledon before falling in straight sets.",
        "\"I think when the very top players play against me, they have a point to prove that they're at the top, and they're there for a reason,\" said 36th-ranked Raducanu, who recently appointed Rafael Nadal's ex-coach Francisco Roig.",
        "\"I think every time I've played one, they've kind of shown that.",
        "\"So while I'm improving, doing better, gaining maybe some more respect around, I think the top have definitely raised their game.\"",
        "So, with the Grand Slams over for another season, how does Raducanu close the gap over the coming months?",
        "Raducanu outclassed by Rybakina in US Open exit",
        "British top seeds Cash & Glasspool out in first round",
        "Pegula holds off Azarenka fightback to win",
        "The revolving door of coaches employed by Raducanu since her US Open win has brought intense scrutiny.",
        "Raducanu likes to learn and once put her high turnover of coaches down to asking \"provoking\" questions of them.",
        "Bringing in Roig – a wily Spaniard who helped Nadal win each of his 22 Grand Slam titles - feels like a longer-term bet.",
        "According to those with inside knowledge of working with him, the 57-year-old Catalan has a technical knowledge which is unparalleled.",
        "The plan remains for the pair to work together until the end of the season.",
        "\"It's only been three weeks, but it's been a pretty successful three weeks in a sense that we've made good improvements.\" said Raducanu, who plans to return to competitive action when the Asian hard-court swing starts next month.",
        "\"Today my weaknesses were highlighted, but he can't really work miracles.\"",
        "Former British number one Annabel Croft thinks it is already clear that Roig is an \"excellent appointment\".",
        "Roig, a former ATP Tour player, has provided a vocal presence on the practice courts and from the stands",
        "\"He is very tactical, very demanding and very vocal,\" said Croft, who watched Raducanu's defeat as part of the BBC Radio 5 Live commentary team.",
        "\"I think she likes that and she will respond to it. You couldn't get better than someone who has worked with such a great champion for a number of years.\"",
        "Raducanu's serve has become a more potent weapon over the season, illustrated by the way she did not drop serve in her opening two matches in New York.",
        "But her first-serve percentage dropped alarmingly against Rybakina and she was punished severely.",
        "\"Developing my serve is important - it has got better but I think it can be even better,\" said Raducanu.",
        "\"The ball after the serve as well, so I'm ready for a fast return, that's where I have some big work to do.",
        "\"Once I'm in the rally I feel OK but against Elena I barely felt I was in a rally.",
        "\"Starting the point is extremely important at that level.\"",
        "'He fixes what needs fixing' - why Raducanu turned to Nadal's ex-coach",
        "Raducanu came into the New York encounter against Rybakina riding a wave of optimism.",
        "A productive season, where she has spent more time on court and looked increasingly resilient, has put her on the verge of climbing back into the world's top 30.",
        "Raducanu's ranking has not been higher since September 2022 - when her mountain of points for winning the US Open fell off.",
        "But she fell just short of earning a seeding at Flushing Meadows, which left her open to facing a highly-ranked player early in the draw.",
        "\"I've lost to Iga twice, Aryna, and Elena, so it's tough,\" Raducanu said.",
        "\"But at the same time, that's where I'm at with my ranking. I can play top opponents in the first, second, or third round.",
        "\"So I've just got to do my best in the next few months until Australia to just keep working to try and close the gap.\"",
        "Twice pushing Sabalenka - taking her to three sets in Cincinnati less than a month after their Wimbledon meeting - were further signs of encouragement.",
        "However, the chastening defeat by world number nine Rybakina, who hit the Briton off court with a flurry of excoriating winners, was a reminder of how she still needs to improve.",
        "It meant Raducanu has now won just three of her 18 career matches against top-10 opponents.",
        "\"Depending on the day, depending on how we match up, I think I'm getting better overall,\" she said.",
        "\"I think I'm improving for sure in the last few months. I just need to keep consistent and put this one behind.\"",
        "Raducanu's defeat was another example of how her game can struggle to hold up against the power players.",
        "While she was able to push Sabalenka in Cincinnati, Raducanu was helped by an erratic performance from her opponent and a lack of consistent examination.",
        "Rybakina's all-out attack was a different proposition.",
        "The 26-year-old Kazakh only landed 47% of her first serves but when she did they were effective - winning 81% of those points - and claimed 63% of her second-serve points.",
        "In the baseline exchanges, Raducanu was regularly pinned back behind the baseline in defensive positions and unable to drag Rybakina out to the wings.",
        "\"Against top players, you have to have your strategy right from the start of the match,\" American former world number six Chanda Rubin, also analysing for 5 Live,  said.",
        "\"If you get behind or start trying to figure out in real time how to play them, it is so difficult because everything is against you.",
        "\"Raducanu isn't going to be a huge hitter but I think she could have gone bigger and taken more risks.\"",
        "To improve her ability to cope with pace, Croft believes Raducanu might benefit from practice sessions between tournaments with male opponents.",
        "\"I once had the privilege of training with Steffi Graf and she did all of her training with blokes - everything was coming at her so fast, hard and flat,\" said Croft.",
        "\"I don't know how much Raducanu trains with men, but when you see her not coping with the pace of a shot, it makes me think that all of her training has to be done with power players.\"",
        "Live scores, results and order of play",
        "Get tennis news sent straight to your phone"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/tennis/articles/c4gzgv1mg2ro",
      "main_category": "sport",
      "detailed_category": "tennis",
      "topic": "Electric New York energy reignites etiquette debate",
      "content": [
        "US Open 2025Venue: Flushing Meadows, New York Dates: 24 August-7 SeptemberCoverage: Live radio commentaries across 5 Live Sport and BBC Sounds, plus live text commentaries on the BBC Sport website & app",
        "The constant noise from horn-honking taxis and sirens. The dazzling lights of the Manhattan skyline. The buzz of millions wandering around 'The City That Never Sleeps'.The pulsating energy of New York is like no other.So it is perhaps not surprising there has been a charged atmosphere at this year's US Open.\"New York City tends to bring out a lot of drama,\" said American fourth seed Jessica Pegula.\"The crowds are pretty crazy. They kind of get everyone riled up.\"And it's the last Grand Slam of the season - your last chance to go deep for a while.\"The tension has led to arguments over on-court etiquette - or the lack of it - with net cords, underarm serves and body shots all under scrutiny.BBC Sport examines the contentious incidents that have sparked debate at Flushing Meadows - and you can tell us what you think about them.",
        "When former French Open champion Jelena Ostapenko accused Taylor Townsend of not saying sorry for a net cord that went in her favour, the perceived lack of etiquette - as well as Ostapenko's reaction - turned into a heated row.A net-cord winner is when a player wins a point because their shot hits the tape of the net and falls out of reach of their helpless opponent.Usually the scenario brings an apologetic raise of the hand from the player who has benefitted.\"In this case, there was actually a couple more shots that happened before the end of the point,\" Chanda Rubin, a former world number six and BBC Radio 5 Live analyst, said.\"So I don't think it was a big faux pas on Taylor's part, even if you just consider common courtesy.\"We actually call it a faux-pology, because it's not real anyway.\"",
        "Not apologising for net cords is not seen as a big deal in the United States.Italy's Fabio Fognini found that out when American Jenson Brooksby failed to apologise in an Auckland Open match in 2022.\"I was taught that it's not really luck-based,\" Brooksby shrugged afterwards.Britain's Cameron Norrie - schooled in the cut-throat world of the US college system - also does not find a lack of an apology rude.\"Even just acknowledging a little bit is the right etiquette, but for me, honestly, I don't care,\" the world number 35 told BBC Sport. \"If a guy hits a dead net cord and doesn't say anything, I don’t care at all.\"",
        "Another ploy that is not against the rules - but riles up many - is the underarm serve.Nick Kyrgios and Alexander Bublik are notable proponents of the move. They see it as a legitimate tactic against an opponent who is stood deep behind the baseline.Others argue it shows a lack of professionalism and is disrespectful, particularly if used against an ailing opponent - like France's Corentin Moutet did against home favourite Alexei Popyrin at this year's Australian Open.Greece's Stefanos Tsitsipas clearly dislikes them.The two-time major finalist was incensed by opponent Daniel Altmaier serving underarm during their second-round match, leading to a terse handshake and an animated discussion following the German's win.Some US Open fans have shown they agree.",
        "A portion of the Arthur Ashe Stadium crowd jeered when Bublik and Arthur Rinderknech unsuccessfully went underarm in one-sided fourth-round defeats by Jannik Sinner and Carlos Alcaraz respectively.\"Sometimes we have off-days where certain things doesn't work,\" Sinner, the men's world number one, said.\"At the end of the day, we try to make the sport as interesting as possible.\"Never afraid to do things differently, the unorthodox Bublik was also booed when he started drop-shotting a hampered Tommy Paul towards the end of their third-round match.",
        "Hitting an inviting short ball at an opponent who has moved towards the net is another common flashpoint.Tsitsipas, regularly at the centre of drama, decided tagging Altmaier was fair game following his opponent's underarm serve.\"Next time, don't wonder why I hit you, OK? I'm just saying, if you serve underarm…\" Tsitsipas told Altmaier at the net.It is not the first time Tsitsipas has drawn ire for trying this tactic.Targeting Arthur Fils' body in Rome earlier this year did not pay off, as the incident fuelled the Frenchman on his way to victory. Doubles player Andrea Vavassori was less pleased in Monte Carlo when he was struck in the ribs by American opponent Ben Shelton - who then labelled the Italian \"soft\".Norrie thinks hitting a ball at an opponent is fair game.\"Obviously you apologise but I think that's a perfectly good play - it’s usually the best option to go middle,\" he said.\"It’s good to acknowledge what you’ve done but you move on, man.\"If you're hit with a tennis ball it's not the end of the world - it's not like we’re playing rugby.\"",
        "One notable flashpoint at this year's US Open came between Germany's Daniel Altmaier and Greece's Stefanos Tsitsipas",
        "Venue: Flushing Meadows, New York Dates: 24 August-7 September",
        "Coverage: Live radio commentaries across 5 Live Sport and BBC Sounds, plus live text commentaries on the BBC Sport website & app",
        "The constant noise from horn-honking taxis and sirens. The dazzling lights of the Manhattan skyline. The buzz of millions wandering around 'The City That Never Sleeps'.",
        "The pulsating energy of New York is like no other.",
        "So it is perhaps not surprising there has been a charged atmosphere at this year's US Open.",
        "\"New York City tends to bring out a lot of drama,\" said American fourth seed Jessica Pegula.",
        "\"The crowds are pretty crazy. They kind of get everyone riled up.",
        "\"And it's the last Grand Slam of the season - your last chance to go deep for a while.\"",
        "The tension has led to arguments over on-court etiquette - or the lack of it - with net cords, underarm serves and body shots all under scrutiny.",
        "BBC Sport examines the contentious incidents that have sparked debate at Flushing Meadows - and you can tell us what you think about them.",
        "When former French Open champion Jelena Ostapenko accused Taylor Townsend of not saying sorry for a net cord that went in her favour, the perceived lack of etiquette - as well as Ostapenko's reaction - turned into a heated row.",
        "A net-cord winner is when a player wins a point because their shot hits the tape of the net and falls out of reach of their helpless opponent.",
        "Usually the scenario brings an apologetic raise of the hand from the player who has benefitted.",
        "\"In this case, there was actually a couple more shots that happened before the end of the point,\" Chanda Rubin, a former world number six and BBC Radio 5 Live analyst, said.",
        "\"So I don't think it was a big faux pas on Taylor's part, even if you just consider common courtesy.",
        "\"We actually call it a faux-pology, because it's not real anyway.\"",
        "Ostapenko accused Townsend of breaking a \"rule\" by not apologising for a net cord - although it is only an unwritten one",
        "Not apologising for net cords is not seen as a big deal in the United States.",
        "Italy's Fabio Fognini found that out when American Jenson Brooksby failed to apologise in an Auckland Open match in 2022.",
        "\"I was taught that it's not really luck-based,\" Brooksby shrugged afterwards.",
        "Britain's Cameron Norrie - schooled in the cut-throat world of the US college system - also does not find a lack of an apology rude.",
        "\"Even just acknowledging a little bit is the right etiquette, but for me, honestly, I don't care,\" the world number 35 told BBC Sport.",
        "\"If a guy hits a dead net cord and doesn't say anything, I don’t care at all.\"",
        "Another ploy that is not against the rules - but riles up many - is the underarm serve.",
        "Nick Kyrgios and Alexander Bublik are notable proponents of the move. They see it as a legitimate tactic against an opponent who is stood deep behind the baseline.",
        "Others argue it shows a lack of professionalism and is disrespectful, particularly if used against an ailing opponent - like France's Corentin Moutet did against home favourite Alexei Popyrin at this year's Australian Open.",
        "Greece's Stefanos Tsitsipas clearly dislikes them.",
        "The two-time major finalist was incensed by opponent Daniel Altmaier serving underarm during their second-round match, leading to a terse handshake and an animated discussion following the German's win.",
        "Some US Open fans have shown they agree.",
        "France's Arthur Rinderknech hit an underarm serve into the net as he served to stay in the second set against Alcaraz",
        "A portion of the Arthur Ashe Stadium crowd jeered when Bublik and Arthur Rinderknech unsuccessfully went underarm in one-sided fourth-round defeats by Jannik Sinner and Carlos Alcaraz respectively.",
        "\"Sometimes we have off-days where certain things doesn't work,\" Sinner, the men's world number one, said.",
        "\"At the end of the day, we try to make the sport as interesting as possible.\"",
        "Never afraid to do things differently, the unorthodox Bublik was also booed when he started drop-shotting a hampered Tommy Paul towards the end of their third-round match.",
        "Hitting an inviting short ball at an opponent who has moved towards the net is another common flashpoint.",
        "Tsitsipas, regularly at the centre of drama, decided tagging Altmaier was fair game following his opponent's underarm serve.",
        "\"Next time, don't wonder why I hit you, OK? I'm just saying, if you serve underarm…\" Tsitsipas told Altmaier at the net.",
        "It is not the first time Tsitsipas has drawn ire for trying this tactic.",
        "Targeting Arthur Fils' body in Rome earlier this year did not pay off, as the incident fuelled the Frenchman on his way to victory.",
        "Doubles player Andrea Vavassori was less pleased in Monte Carlo when he was struck in the ribs by American opponent Ben Shelton - who then labelled the Italian \"soft\".",
        "Norrie thinks hitting a ball at an opponent is fair game.",
        "\"Obviously you apologise but I think that's a perfectly good play - it’s usually the best option to go middle,\" he said.",
        "\"It’s good to acknowledge what you’ve done but you move on, man.",
        "\"If you're hit with a tennis ball it's not the end of the world - it's not like we’re playing rugby.\"",
        "Live scores, results and order of play",
        "Get tennis news sent straight to your phone"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/tennis/articles/c93kxgy33w1o",
      "main_category": "sport",
      "detailed_category": "tennis",
      "topic": "From drugs bans to Wimbledon champions - how did we get here?",
      "content": [
        "Jannik Sinner says his and Iga Swiatek's singles title wins at Wimbledon were made \"very special\" following the doping cases involving them over the past year.For the first time in Wimbledon history, both the men's and women's champions have served suspensions for banned substances, ensuring that their celebrations have been accompanied by controversy.With the authorities accepting both players' insistence that the cases were caused by contamination of medication, many are clearly willing to look past the short bans.But others are concerned about the impact it could have on the image of tennis.\"I don't think it's a good look for the sport,\" said Australian Nick Kyrgios, when previewing both Wimbledon finals.Indeed, minutes after Sinner's victory on Sunday, the 2022 finalist posted a cryptic asterisk on social media, widely seen as a reflection of the mixed feelings some have about the men's world number one winning just over two months after completing a doping ban.When asked by BBC Sport on Monday about those who may feel uneasy about him and Swiatek winning, Sinner said, \"Well, me and Iga, we actually talked yesterday about this, and we've been celebrating in a way even more, because it was a very difficult time for her and also for me, and only me and my team and the people who are close to me know exactly how it went.\"There are always going to be some people who believe in you and [who] do not, but this is in everything. So yeah, in a way, it's very special, because it was very, very stressful the time on the last four or five months.\"Speaking after her victory on Saturday, Swiatek also hinted at the scrutiny she had been under. \"The past months, how the media sometimes described me, how they treated me and my team, it wasn't really pleasant\", she said. \"I hope they will just leave me alone and let me do my job.\"So, what were the details of their cases? How did it all get resolved so they could return to action so soon? How do players and officials feel about it? Does it detract from their achievements? And what does it mean for Wimbledon, and the sport more widely?",
        "The six-time Grand Slam winner tested positive for heart medication trimetazidine (TMZ) in an out-of-competition sample in August 2024, and served a one-month suspension, which ended in early December. Commonly used to treat problems such as angina, TMZ increases blood flow to the heart and stimulates the metabolism of glucose, which can improve endurance, which is why it is a banned substance in elite sport. Russian figure skater Kamila Valieva was given a four-year ban last year after testing positive for TMZ in a sample before she competed at the 2022 Winter Olympics.Swiatek's level of fault was considered to be at the lowest end of the range, as the International Tennis Integrity Agency (ITIA) accepted it was caused by contamination of a regulated non-prescription medicine, manufactured and sold in Poland, which she said she took for jet lag and sleep issues.",
        "Sinner twice tested positive for low levels of the banned anabolic steroid clostebol - which can be used to build muscle mass - in March 2024, so was given two provisional bans, which he successfully appealed against and had lifted within one and three days respectively.As with Swiatek, authorities accepted it was caused by the use of an over-the-counter medication and he was cleared of any wrongdoing by an independent tribunal, which decided not to suspend him.  It accepted he had been inadvertently contaminated by his physiotherapist, who was treating a cut on his own hand with an over-the-counter spray, which was later found to contain the banned substance, before then carrying out treatments on Sinner.Significantly, however, the World Anti-Doping Agency (Wada) appealed against the panel's ruling that Sinner \"bore no fault or negligence\", and said it was seeking a ban of between one and two years.A hearing at the Court of Arbitration for Sport (Cas) was set for April - but in February, shortly after retaining his Australian Open title, it was announced that Sinner and Wada had reached a controversial settlement, with the Italian then serving just a three-month ban. It meant he did not miss any Grand Slam tournaments, and was back in time for the French Open, prompting accusations of favouritism, with some players openly questioning their faith in clean sport. There have also been questions over why Sinner's former physio and trainer - who were both deemed responsible for the clostebol entering his system - could have made such a mistake, and why they have not faced any action from the authorities.",
        "Wada had felt the independent tribunal should have punished Sinner for strict liability - that he was ultimately responsible for failing the two drugs tests.However, it also accepted that Sinner \"did not intend to cheat\", that the drug \"did not provide any performance-enhancing benefit\" and this happened \"without his knowledge as the result of negligence of members of his entourage\". On this basis, it was prepared to reach a settlement with Sinner, rather than go to Cas where the outcome would have either been a ban of at least a year or Sinner being cleared.\"This was a case that was a million miles away from doping,\" Wada's general counsel Ross Wenzel told BBC Sport.Similar case resolutions have been allowed since 2021, and Wenzel said Wada had since struck 67 agreements. The code is set to change from 2027, meaning cases where players have failed tests but were deemed not to be at fault - like Sinner - could be punished from just a reprimand to a two-year ban.In Swiatek's case, Wada did not appeal against her one-month suspension, claiming that its scientific experts \"confirmed the specific contaminated melatonin scenario… is plausible and that there would be no scientific grounds to challenge it at Cas\".Speaking about the cases in December, ITIA chief executive Karen Moorhouse said: \"These aren't cases of intentional doping. We're dealing with inadvertent breaches of the rules. So I don't think this is a cause for concern for tennis fans. We're being clearly open, transparent, and it shows the breadth and depth of our anti-doping programme.\"",
        "In the wake of Swiatek's punishment, Simona Halep was one of several players who questioned the differences in how doping cases were treated. In 2023, the Romanian had received a four-year ban for two anti-doping violations, later reduced to nine months after an appeal.Reflecting on both cases in December, Kyrgios said: \"I think people are trying to sweep it under the rug. I just think that it's been handled horrifically in our sport. Two world number ones both getting done for doping is disgusting for our sport. It's a horrible look.\"In the wake of Sinner's suspension, Spanish legend Rafael Nadal said he was \"100%\" sure that the Italian was innocent, but former British number one Tim Henman claimed the ban was \"too convenient\" and left tennis fans with a \"pretty sour taste\".\"When you're dealing with drugs in sport it very much has to be black and white, it's binary, it's positive or negative, you're banned or you're not banned\" he told Sky Sports. \"When you start reading words like settlement or agreement, it feels like there's been a negotiation and I don't think that will sit well with the player cohort and the fans of the sport.\" Serena Williams said she would have been banned for 20 years and had some of her Grand Slam titles taken away if she had committed the same anti-doping offence as men's world number one Sinner. British player Tara Moore, who was provisionally banned for two years while challenging a doping charge of which she was eventually cleared after 19 months, also suggested top players were \"treated differently\", with their image prioritised.Accusations of preferential treatment and double standards were firmly disputed by the ITIA and Wada.The ITIA has also highlighted a 26% increase in anti-doping tests in 2024 compared to the previous year, and says educating players about anti-doping rules is a priority.But many believe both players have benefitted from being able to pay top lawyers to act quickly.\"A majority of the players don't feel that it's fair,\" said 24-time Grand Slam champion Novak Djokovic. \"It appears that you can almost affect the outcome if you are a top player, if you have access to the top lawyers.\"The Professional Tennis Players' Association (PTPA) - an organisation co-founded by Djokovic which aims to increase player power - said there is a lack of \"transparency\", \"process\" and \"consistency\" in the system.Three-time Grand Slam champion Stan Wawrinka, writing on social media, said he did not \"believe in a clean sport any more\".",
        "Former British number one Greg Rusedski seemed to speak for many in the sport when he told BBC Sport: \"I think you have to give them the benefit of the doubt, look at the tennis they have played in this last year, and I think this will all go away in time.\"Certainly there seemed little concern from those present at Wimbledon - or the millions watching and listening on - about the backstory of the pair of champions, with the focus on the quality of their play and the ruthlessness of their respective performances.Perhaps this should come as no surprise, given that doping controversies are far from unusual in tennis. Indeed, fellow Wimbledon winners Halep, Maria Sharapova, Martina Hingis and Andre Agassi also all had positive drugs tests, albeit after winning the championship, rather than before.\"It's a little embarrassing for the sport and, by extension, for Wimbledon, it's a unique and unwelcome double\" says public relations expert Tim Jotischky, of the PHA Group.\"However, the evidence suggests that fellow professionals are more upset than the viewing public… the Alcaraz-Sinner rivalry has captured the imagination of sports fans and, whilst Alcaraz is the more popular player, Sinner has never been targeted by spectators.\"That might be because many don't follow the sport closely enough to be aware of the details, but the main reason is probably because tennis still looks like a clean sport, where performance-enhancing drugs have a minimum impact, in a way that athletics and cycling often do not.\"Iga Swiatek's Wimbledon triumph followed a slump in form… that may have helped divert attention away from her ban.\"But tennis cannot be complacent or ignore the concerns of leading professionals. The rules around drugs offences need to be transparent and implemented consistently, regardless of a player's box office appeal.\"The All England Lawn Tennis Club has been approached for comment.",
        "Sinner is now a four-time Grand Slam winner",
        "Jannik Sinner says his and Iga Swiatek's singles title wins at Wimbledon were made \"very special\" following the doping cases involving them over the past year.",
        "For the first time in Wimbledon history, both the men's and women's champions have served suspensions for banned substances, ensuring that their celebrations have been accompanied by controversy.",
        "With the authorities accepting both players' insistence that the cases were caused by contamination of medication, many are clearly willing to look past the short bans.",
        "But others are concerned about the impact it could have on the image of tennis.",
        "\"I don't think it's a good look for the sport,\" said Australian Nick Kyrgios, when previewing both Wimbledon finals.",
        "Indeed, minutes after Sinner's victory on Sunday, the 2022 finalist posted a cryptic asterisk on social media, widely seen as a reflection of the mixed feelings some have about the men's world number one winning just over two months after completing a doping ban.",
        "When asked by BBC Sport on Monday about those who may feel uneasy about him and Swiatek winning, Sinner said, \"Well, me and Iga, we actually talked yesterday about this, and we've been celebrating in a way even more, because it was a very difficult time for her and also for me, and only me and my team and the people who are close to me know exactly how it went.",
        "\"There are always going to be some people who believe in you and [who] do not, but this is in everything. So yeah, in a way, it's very special, because it was very, very stressful the time on the last four or five months.\"",
        "Speaking after her victory on Saturday, Swiatek also hinted at the scrutiny she had been under.",
        "\"The past months, how the media sometimes described me, how they treated me and my team, it wasn't really pleasant\", she said. \"I hope they will just leave me alone and let me do my job.\"",
        "So, what were the details of their cases? How did it all get resolved so they could return to action so soon? How do players and officials feel about it? Does it detract from their achievements? And what does it mean for Wimbledon, and the sport more widely?",
        "Swiatek's previous best performance at Wimbledon was reaching the quarter-final in 2023",
        "The six-time Grand Slam winner tested positive for heart medication trimetazidine (TMZ) in an out-of-competition sample in August 2024, and served a one-month suspension, which ended in early December.",
        "Commonly used to treat problems such as angina, TMZ increases blood flow to the heart and stimulates the metabolism of glucose, which can improve endurance, which is why it is a banned substance in elite sport.",
        "Russian figure skater Kamila Valieva was given a four-year ban last year after testing positive for TMZ in a sample before she competed at the 2022 Winter Olympics.",
        "Swiatek's level of fault was considered to be at the lowest end of the range, as the International Tennis Integrity Agency (ITIA) accepted it was caused by contamination of a regulated non-prescription medicine, manufactured and sold in Poland, which she said she took for jet lag and sleep issues.",
        "This video can not be played",
        "Brilliant Sinner becomes first Italian Wimbledon champion",
        "Sinner twice tested positive for low levels of the banned anabolic steroid clostebol - which can be used to build muscle mass - in March 2024, so was given two provisional bans, which he successfully appealed against and had lifted within one and three days respectively.",
        "As with Swiatek, authorities accepted it was caused by the use of an over-the-counter medication and he was cleared of any wrongdoing by an independent tribunal, which decided not to suspend him.  It accepted he had been inadvertently contaminated by his physiotherapist, who was treating a cut on his own hand with an over-the-counter spray, which was later found to contain the banned substance, before then carrying out treatments on Sinner.",
        "Significantly, however, the World Anti-Doping Agency (Wada) appealed against the panel's ruling that Sinner \"bore no fault or negligence\", and said it was seeking a ban of between one and two years.",
        "A hearing at the Court of Arbitration for Sport (Cas) was set for April - but in February, shortly after retaining his Australian Open title, it was announced that Sinner and Wada had reached a controversial settlement, with the Italian then serving just a three-month ban.",
        "It meant he did not miss any Grand Slam tournaments, and was back in time for the French Open, prompting accusations of favouritism, with some players openly questioning their faith in clean sport.",
        "There have also been questions over why Sinner's former physio and trainer - who were both deemed responsible for the clostebol entering his system - could have made such a mistake, and why they have not faced any action from the authorities.",
        "This video can not be played",
        "Swiatek dominates Anisimova to win first Wimbledon title",
        "Wada had felt the independent tribunal should have punished Sinner for strict liability - that he was ultimately responsible for failing the two drugs tests.",
        "However, it also accepted that Sinner \"did not intend to cheat\", that the drug \"did not provide any performance-enhancing benefit\" and this happened \"without his knowledge as the result of negligence of members of his entourage\". On this basis, it was prepared to reach a settlement with Sinner, rather than go to Cas where the outcome would have either been a ban of at least a year or Sinner being cleared.",
        "\"This was a case that was a million miles away from doping,\" Wada's general counsel Ross Wenzel told BBC Sport.",
        "Similar case resolutions have been allowed since 2021, and Wenzel said Wada had since struck 67 agreements. The code is set to change from 2027, meaning cases where players have failed tests but were deemed not to be at fault - like Sinner - could be punished from just a reprimand to a two-year ban.",
        "In Swiatek's case, Wada did not appeal against her one-month suspension, claiming that its scientific experts \"confirmed the specific contaminated melatonin scenario… is plausible and that there would be no scientific grounds to challenge it at Cas\".",
        "Speaking about the cases in December, ITIA chief executive Karen Moorhouse said: \"These aren't cases of intentional doping. We're dealing with inadvertent breaches of the rules. So I don't think this is a cause for concern for tennis fans. We're being clearly open, transparent, and it shows the breadth and depth of our anti-doping programme.\"",
        "Sinner beats Alcaraz to win first Wimbledon title",
        "Swiatek inflicts 6-0 6-0 defeat on Anisimova to win Wimbledon",
        "Numbers behind Swiatek's dominant Wimbledon win",
        "In the wake of Swiatek's punishment, Simona Halep was one of several players who questioned the differences in how doping cases were treated.",
        "In 2023, the Romanian had received a four-year ban for two anti-doping violations, later reduced to nine months after an appeal.",
        "Reflecting on both cases in December, Kyrgios said: \"I think people are trying to sweep it under the rug. I just think that it's been handled horrifically in our sport. Two world number ones both getting done for doping is disgusting for our sport. It's a horrible look.\"",
        "In the wake of Sinner's suspension, Spanish legend Rafael Nadal said he was \"100%\" sure that the Italian was innocent, but former British number one Tim Henman claimed the ban was \"too convenient\" and left tennis fans with a \"pretty sour taste\".",
        "\"When you're dealing with drugs in sport it very much has to be black and white, it's binary, it's positive or negative, you're banned or you're not banned\" he told Sky Sports.",
        "\"When you start reading words like settlement or agreement, it feels like there's been a negotiation and I don't think that will sit well with the player cohort and the fans of the sport.\"",
        "Serena Williams said she would have been banned for 20 years and had some of her Grand Slam titles taken away if she had committed the same anti-doping offence as men's world number one Sinner.",
        "British player Tara Moore, who was provisionally banned for two years while challenging a doping charge of which she was eventually cleared after 19 months, also suggested top players were \"treated differently\", with their image prioritised.",
        "Accusations of preferential treatment and double standards were firmly disputed by the ITIA and Wada.",
        "The ITIA has also highlighted a 26% increase in anti-doping tests in 2024 compared to the previous year, and says educating players about anti-doping rules is a priority.",
        "But many believe both players have benefitted from being able to pay top lawyers to act quickly.",
        "\"A majority of the players don't feel that it's fair,\" said 24-time Grand Slam champion Novak Djokovic. \"It appears that you can almost affect the outcome if you are a top player, if you have access to the top lawyers.\"",
        "The Professional Tennis Players' Association (PTPA) - an organisation co-founded by Djokovic which aims to increase player power - said there is a lack of \"transparency\", \"process\" and \"consistency\" in the system.",
        "Three-time Grand Slam champion Stan Wawrinka, writing on social media, said he did not \"believe in a clean sport any more\".",
        "'Everything except easy' - how Sinner bounced back to win Wimbledon",
        "Sinner-Alcaraz rivalry 'a gift to our sport'",
        "Four times more online abuse of Wimbledon players detected",
        "Former British number one Greg Rusedski seemed to speak for many in the sport when he told BBC Sport: \"I think you have to give them the benefit of the doubt, look at the tennis they have played in this last year, and I think this will all go away in time.\"",
        "Certainly there seemed little concern from those present at Wimbledon - or the millions watching and listening on - about the backstory of the pair of champions, with the focus on the quality of their play and the ruthlessness of their respective performances.",
        "Perhaps this should come as no surprise, given that doping controversies are far from unusual in tennis. Indeed, fellow Wimbledon winners Halep, Maria Sharapova, Martina Hingis and Andre Agassi also all had positive drugs tests, albeit after winning the championship, rather than before.",
        "\"It's a little embarrassing for the sport and, by extension, for Wimbledon, it's a unique and unwelcome double\" says public relations expert Tim Jotischky, of the PHA Group.",
        "\"However, the evidence suggests that fellow professionals are more upset than the viewing public… the Alcaraz-Sinner rivalry has captured the imagination of sports fans and, whilst Alcaraz is the more popular player, Sinner has never been targeted by spectators.",
        "\"That might be because many don't follow the sport closely enough to be aware of the details, but the main reason is probably because tennis still looks like a clean sport, where performance-enhancing drugs have a minimum impact, in a way that athletics and cycling often do not.",
        "\"Iga Swiatek's Wimbledon triumph followed a slump in form… that may have helped divert attention away from her ban.",
        "\"But tennis cannot be complacent or ignore the concerns of leading professionals. The rules around drugs offences need to be transparent and implemented consistently, regardless of a player's box office appeal.\"",
        "The All England Lawn Tennis Club has been approached for comment.",
        "Live scores, results and order of play",
        "Get tennis news sent straight to your phone"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/tennis/articles/cly178zkkg5o",
      "main_category": "sport",
      "detailed_category": "tennis",
      "topic": "Alcaraz and the art of court positioning",
      "content": [
        "Whether it is forehand, backhand or a slice, knowing what type of shot to play and when is key to winning tennis matches.But so too is a player's position on the court - with the very best in the world knowing where to be to anticipate a return, or to gain a few more valuable seconds to plan their next move.Few are better masters of this art than Carlos Alcaraz, who is proving to be one of the most complete players on the tour at the moment.Having won the French Open in his final match of the clay season, the 22-year-old Spaniard transitioned to grass seamlessly by winning Queen's for the second time last week.It sets him up perfectly for the pursuit of a third title in a row at Wimbledon, where his dominance of the court will once again come to the fore.\"He is so exciting,\" former British number one John Lloyd told BBC Sport.\"He is so quick, lightning quick, groundstrokes are huge both sides. He has one of the best volleys on the tour, his serves are getting better and better.\"He is a showman and a great entertainer.\"",
        "To understand a bit more about why five-time Grand Slam champion Alcaraz is so good it is worth checking back on how tennis has changed over the years.Playing styles have gone from almost every part of the court being covered by a player to the game now being predominantly fought out from behind the baseline.Although improvements in grass maintenance will undoubtedly have played a part, this evolution can be seen in images from Wimbledon over the years, with more patches of wear evident on more areas of the grass in the 1970s and 1980s compared to more recent years.The statistics that show the decline of the serve-and-volley game do seem to correspond with the changes to where grass wear at Wimbledon can be seen.In 2002, serve-and-volley points in the men's draw accounted for 32.6% of total service points won, but by 2018 that figure was down to 6.93%.Evolution of the equipment used will have contributed to this eventual drop, with the development of modern racquets and strings making it easier to hit powerful groundstrokes from the baseline.",
        "The above detail is relevant because Alcaraz has shown he is adept at both styles of play.In last year's men's final at Wimbledon, the old and the new guard were matched up for the second year in a row as Alcaraz faced 24-time Grand Slam champion Novak Djokovic.There, Alcaraz dictated play with his speed and movement, causing Djokovic to lose confidence in his ability to live with his opponent from the back of the court and instead rush to the net.It was a trap that worked as Djokovic won just 50.9% of his points at the net, compared to 72.7% for Alcaraz.But the younger man was just as strong when staying on the baseline where once again his quick movement and powerful ball striking was too much for Djokovic, who was placed under near constant pressure by Alcaraz.\"In that final, Djokovic was only able to generate three break points and won one, whereas Alcaraz was able to generate 14 break points and won five, so there was constant pressure on him,\" says Craig O'Shannessy, tennis analyst and founder of Brain Game Tennis, who has worked with Djokovic.\"And from the ground stroke department Alcaraz had too much firepower from the back, hitting 21 forehand winners while Djokovic hit six.\"With the backhand, Alcaraz hit 10 winners compared to three for Djokovic. The offence was very much controlled by Alcaraz in that final.\"",
        "Alcaraz's dominance of the court was once again on show at Queen's and, at 22, he has already won four grass-court titles - as many as compatriot Rafael Nadal secured in his career.Nadal, of course, was the 'King of Clay' given his brilliance on that surface, but Alcaraz is showing proficiency on all court types.\"It is never a letdown with this player,\" said former British number one Andrew Castle, who was commentating on the Queen's tournament.\"Expectation every time he plays is always high and it is just supreme performances lately week in and week out.\"\"His movement is incredible,\" adds O'Shannessy.\"His acceleration from the first two or three steps helps him get to balls other players can't, and then also his recovery out of the shot is incredibly fast as well.\"When I saw him up close and personal for the very first time, I was blown away. I didn't think people could move that well on a tennis court.\"He takes the tour to new levels with what's possible with movement on a court.\"",
        "Being able to anticipate a player's movement on the court and the type of shots they will probably play is key to securing victory, which is why someone as unpredictable as Alcaraz is so hard to play against.Most players fall into familiar patterns of play and studying those becomes important in attempting to secure the edge.\"Gabriel Diallo is a guy I work with and he was playing in Majorca recently, and for his match with Jaume Munar I sent a detailed game plan to him on how to face him,\" says O'Shannessy.\"Things I'll usually show will include where the serve's going, what kind of serve he likes to hit, and then where on the court he's more vulnerable to make errors, particularly forehand errors. Because they happen more often than anything else.\"Another important battleground can be the warm-up. Rather than being - as it may seem to those watching - just two players getting ready for the match, it also presents an opportunity to see how the opponent will react to certain types of shots.\"In the warm-up you may want to disguise the type of shots you want to hit,\" adds O'Shannessy.“I think it's probably more of an advantage at the club level because you don't necessarily know the opponent or have scouting on them.\"So it's a really good time to hit them some different balls, some high balls, some low balls, some fast balls, some slice, and then monitor where they hit that.\"",
        "Alcaraz heads to Wimbledon looking to complete a hat-trick of titles and, having won his past 18 matches in a row, he is in a strong position to do just that.World number one Jannik Sinner - who lost out to Alcaraz in an epic French Open final earlier this month - will be looking to stop him, as well as Djokovic, the runner-up in the past two Wimbledon finals.But they will know they face a tough task against a player in form.\"When he's on it, he is the most complete player of his age I have ever seen,\" Lloyd says of Alcaraz.\"You look at him already and he's the finished package.\"Castle is similarly impressed, adding: \"He is setting new standards along with Jannik Sinner, the current number one.\"The game is in good hands.\"",
        "Alcaraz and the art of court positioning",
        "Whether it is forehand, backhand or a slice, knowing what type of shot to play and when is key to winning tennis matches.",
        "But so too is a player's position on the court - with the very best in the world knowing where to be to anticipate a return, or to gain a few more valuable seconds to plan their next move.",
        "Few are better masters of this art than Carlos Alcaraz, who is proving to be one of the most complete players on the tour at the moment.",
        "Having won the French Open in his final match of the clay season, the 22-year-old Spaniard transitioned to grass seamlessly by winning Queen's for the second time last week.",
        "It sets him up perfectly for the pursuit of a third title in a row at Wimbledon, where his dominance of the court will once again come to the fore.",
        "\"He is so exciting,\" former British number one John Lloyd told BBC Sport.",
        "\"He is so quick, lightning quick, groundstrokes are huge both sides. He has one of the best volleys on the tour, his serves are getting better and better.",
        "\"He is a showman and a great entertainer.\"",
        "To understand a bit more about why five-time Grand Slam champion Alcaraz is so good it is worth checking back on how tennis has changed over the years.",
        "Playing styles have gone from almost every part of the court being covered by a player to the game now being predominantly fought out from behind the baseline.",
        "Although improvements in grass maintenance will undoubtedly have played a part, this evolution can be seen in images from Wimbledon over the years, with more patches of wear evident on more areas of the grass in the 1970s and 1980s compared to more recent years.",
        "The statistics that show the decline of the serve-and-volley game do seem to correspond with the changes to where grass wear at Wimbledon can be seen.",
        "In 2002, serve-and-volley points in the men's draw accounted for 32.6% of total service points won, but by 2018 that figure was down to 6.93%.",
        "Evolution of the equipment used will have contributed to this eventual drop, with the development of modern racquets and strings making it easier to hit powerful groundstrokes from the baseline.",
        "In 1990 most areas of the court showed signs of wear at Wimbledon",
        "By 2000 the wear on the baseline was more pronounced but there was still a clear 'T' in the middle",
        "In 2013, when Andy Murray won, almost all the visible wear was around the baseline by the time of the final",
        "Little has changed since 2013 with the significant amount of wear by 2024 once again around the baseline",
        "The above detail is relevant because Alcaraz has shown he is adept at both styles of play.",
        "In last year's men's final at Wimbledon, the old and the new guard were matched up for the second year in a row as Alcaraz faced 24-time Grand Slam champion Novak Djokovic.",
        "There, Alcaraz dictated play with his speed and movement, causing Djokovic to lose confidence in his ability to live with his opponent from the back of the court and instead rush to the net.",
        "It was a trap that worked as Djokovic won just 50.9% of his points at the net, compared to 72.7% for Alcaraz.",
        "But the younger man was just as strong when staying on the baseline where once again his quick movement and powerful ball striking was too much for Djokovic, who was placed under near constant pressure by Alcaraz.",
        "\"In that final, Djokovic was only able to generate three break points and won one, whereas Alcaraz was able to generate 14 break points and won five, so there was constant pressure on him,\" says Craig O'Shannessy, tennis analyst and founder of Brain Game Tennis, who has worked with Djokovic.",
        "\"And from the ground stroke department Alcaraz had too much firepower from the back, hitting 21 forehand winners while Djokovic hit six.",
        "\"With the backhand, Alcaraz hit 10 winners compared to three for Djokovic. The offence was very much controlled by Alcaraz in that final.\"",
        "In the 2024 Wimbledon final, Alcaraz highlighted his excellent range of shots and court movement",
        "He showed great ability with the serve and volley, giving Novak Djokovic no time to react to his push to the net after returning serve",
        "He would also often lure Djokovic up to the net while he stayed deep",
        "But Alcaraz would then use his speed to rapidly get to Djokovic's short return and send it down the line with his opponent out of position",
        "As Djokovic struggled to beat Alcaraz at the baseline he would continue to approach the net",
        "But once again Alcaraz's anticipation and movement from a central position enabled him to catch out the former world number one",
        "Alcaraz's dominance of the court was once again on show at Queen's and, at 22, he has already won four grass-court titles - as many as compatriot Rafael Nadal secured in his career.",
        "Nadal, of course, was the 'King of Clay' given his brilliance on that surface, but Alcaraz is showing proficiency on all court types.",
        "\"It is never a letdown with this player,\" said former British number one Andrew Castle, who was commentating on the Queen's tournament.",
        "\"Expectation every time he plays is always high and it is just supreme performances lately week in and week out.\"",
        "\"His movement is incredible,\" adds O'Shannessy.",
        "\"His acceleration from the first two or three steps helps him get to balls other players can't, and then also his recovery out of the shot is incredibly fast as well.",
        "\"When I saw him up close and personal for the very first time, I was blown away. I didn't think people could move that well on a tennis court.",
        "\"He takes the tour to new levels with what's possible with movement on a court.\"",
        "Being able to anticipate a player's movement on the court and the type of shots they will probably play is key to securing victory, which is why someone as unpredictable as Alcaraz is so hard to play against.",
        "Most players fall into familiar patterns of play and studying those becomes important in attempting to secure the edge.",
        "\"Gabriel Diallo is a guy I work with and he was playing in Majorca recently, and for his match with Jaume Munar I sent a detailed game plan to him on how to face him,\" says O'Shannessy.",
        "\"Things I'll usually show will include where the serve's going, what kind of serve he likes to hit, and then where on the court he's more vulnerable to make errors, particularly forehand errors. Because they happen more often than anything else.\"",
        "Another important battleground can be the warm-up.",
        "Rather than being - as it may seem to those watching - just two players getting ready for the match, it also presents an opportunity to see how the opponent will react to certain types of shots.",
        "\"In the warm-up you may want to disguise the type of shots you want to hit,\" adds O'Shannessy.",
        "“I think it's probably more of an advantage at the club level because you don't necessarily know the opponent or have scouting on them.",
        "\"So it's a really good time to hit them some different balls, some high balls, some low balls, some fast balls, some slice, and then monitor where they hit that.\"",
        "Alcaraz heads to Wimbledon looking to complete a hat-trick of titles and, having won his past 18 matches in a row, he is in a strong position to do just that.",
        "World number one Jannik Sinner - who lost out to Alcaraz in an epic French Open final earlier this month - will be looking to stop him, as well as Djokovic, the runner-up in the past two Wimbledon finals.",
        "But they will know they face a tough task against a player in form.",
        "\"When he's on it, he is the most complete player of his age I have ever seen,\" Lloyd says of Alcaraz.",
        "\"You look at him already and he's the finished package.\"",
        "Castle is similarly impressed, adding: \"He is setting new standards along with Jannik Sinner, the current number one.",
        "\"The game is in good hands.\"",
        "Live scores, results and order of play",
        "Get tennis news sent straight to your phone"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/tennis/articles/cgjyjjxzvydo",
      "main_category": "sport",
      "detailed_category": "tennis",
      "topic": "What is US Open prize money?",
      "content": [
        "The winner of the men's and women's singles at the US Open will each pocket £3.74m ($5m) in prize money from the 2025 tournament in New York.The prize pot has been boosted by 39% since 2024, when Jannik Sinner and Aryna Sabalenka each received £2.84m ($3.6m) for winning at Flushing Meadows.The US Open has the biggest total prize money on offer of any Grand Slam, with £67.3m ($90m) shared out between the men's, women's, doubles and wheelchair competitors.The other Grand Slams in 2025 have awarded £53.5m in prize money at Wimbledon, £47m at the Australian Open, and £49m at the French Open.",
        "The US Open singles draw prize money:Winner: £3.73mRunner-up: £1.87mSemi-final: £943,000Quarter-final: £494,000Round four: £299,000Round three: £177,000Round two: £115,000Round one: £82,000The 2025 US Open started with a new stand-alone mixed doubles championship, with Sara Errani and Andrea Vavassori taking home £736,880 ($1m) between them for beating Casper Ruud and Iga Swiatek in the final.Men's and women's doubles pairs will bank close to £750,000 for winning.A total of £1.2m will be shared out across the wheelchair competition.This article is the latest from BBC Sport's Ask Me Anything team.",
        "Ask Me Anything is a service dedicated to answering your questions.We want to reward your time by telling you things you do not know and reminding you of things you do.The team will find out everything you need to know and be able to call upon a network of contacts including our experts and pundits.We will be answering your questions from the heart of the BBC Sport newsroom, and going behind the scenes at some of the world's biggest sporting events.Our coverage will span the BBC Sport website, app, social media and YouTube accounts, plus BBC TV and radio.",
        "What is the new US Open mixed doubles format?How do tennis rankings work?What is the prize money per round at Wimbledon?",
        "The winner of the men's and women's singles at the US Open will each pocket £3.74m ($5m) in prize money from the 2025 tournament in New York.",
        "The prize pot has been boosted by 39% since 2024, when Jannik Sinner and Aryna Sabalenka each received £2.84m ($3.6m) for winning at Flushing Meadows.",
        "The US Open has the biggest total prize money on offer of any Grand Slam, with £67.3m ($90m) shared out between the men's, women's, doubles and wheelchair competitors.",
        "The other Grand Slams in 2025 have awarded £53.5m in prize money at Wimbledon, £47m at the Australian Open, and £49m at the French Open.",
        "Send us your questions",
        "The US Open singles draw prize money:",
        "Quarter-final: £494,000",
        "Round three: £177,000",
        "The 2025 US Open started with a new stand-alone mixed doubles championship, with Sara Errani and Andrea Vavassori taking home £736,880 ($1m) between them for beating Casper Ruud and Iga Swiatek in the final.",
        "Men's and women's doubles pairs will bank close to £750,000 for winning.",
        "A total of £1.2m will be shared out across the wheelchair competition.",
        "This article is the latest from BBC Sport's Ask Me Anything team.",
        "Ask Me Anything is a service dedicated to answering your questions.",
        "We want to reward your time by telling you things you do not know and reminding you of things you do.",
        "The team will find out everything you need to know and be able to call upon a network of contacts including our experts and pundits.",
        "We will be answering your questions from the heart of the BBC Sport newsroom, and going behind the scenes at some of the world's biggest sporting events.",
        "Our coverage will span the BBC Sport website, app, social media and YouTube accounts, plus BBC TV and radio.",
        "What is the new US Open mixed doubles format?",
        "How do tennis rankings work?",
        "What is the prize money per round at Wimbledon?"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/tennis/articles/ckg3v72er4zo",
      "main_category": "sport",
      "detailed_category": "tennis",
      "topic": "Why is there a pineapple on Wimbledon's men's trophy?",
      "content": [
        "It is believed a pineapple is on the top of Wimbledon's men's singles trophy because of the rarity of the fruit making it a status symbol.The Wimbledon championships started in 1877 and in the latter half of the 19th century, pineapples were prized as an exclusive fruit despite being first being brought back to Europe by Christopher Columbus almost 400 years earlier.In the early 1900s in Hawaii pineapples were first commercially produced in order to import and grow in western Europe. Because of that, the serving of pineapples was deemed as being of a higher status.The current men's singles trophy, including the pineapple, is the third iteration of the trophy.The trophy is made of silver gilt and is 18 inches (46 centimetres) tall.Every winner of the men's singles trophy since 1877, the first being Spencer Gore, is engraved on the trophy. All winners since 1949 have also been given a replica of the trophy to keep.",
        "The winner of the women's singles at Wimbledon is given the Venus Rosewater Dish, first awarded in 1886.A rosewater dish is traditionally used to catch rosewater from jugs and is then poured over people's hands to wash them in a daily ceremony.The dish is slightly taller than the men's trophy and is a partially gilded sterling silver salver.The first recipient of this ceremonial platter was Blanche Bingley.This article is the latest from BBC Sport's Ask Me Anything team.",
        "Ask Me Anything is a service dedicated to answering your questions. This question was sent in by a number of you, including Farrukh in London. Thank you for your question.We want to reward your time by telling you things you do not know and reminding you of things you do.The team will find out everything you need to know and be able to call upon a network of contacts including our experts and pundits.We will be answering your questions from the heart of the BBC Sport newsroom, and going behind the scenes at some of the world's biggest sporting events.Our coverage will span the BBC Sport website, app, social media and YouTube accounts, plus BBC TV and radio.",
        "What is the prize money per round at Wimbledon?What is Wimbledon's Last 8 Club?How are famous faces invited into Wimbledon's royal box?Courts and toilet breaks - your Wimbledon questions answered",
        "It is believed a pineapple is on the top of Wimbledon's men's singles trophy because of the rarity of the fruit making it a status symbol.",
        "The Wimbledon championships started in 1877 and in the latter half of the 19th century, pineapples were prized as an exclusive fruit despite being first being brought back to Europe by Christopher Columbus almost 400 years earlier.",
        "In the early 1900s in Hawaii pineapples were first commercially produced in order to import and grow in western Europe.",
        "Because of that, the serving of pineapples was deemed as being of a higher status.",
        "The current men's singles trophy, including the pineapple, is the third iteration of the trophy.",
        "The trophy is made of silver gilt and is 18 inches (46 centimetres) tall.",
        "Every winner of the men's singles trophy since 1877, the first being Spencer Gore, is engraved on the trophy.",
        "All winners since 1949 have also been given a replica of the trophy to keep.",
        "Send us your questions",
        "The winner of the women's singles at Wimbledon is given the Venus Rosewater Dish, first awarded in 1886.",
        "A rosewater dish is traditionally used to catch rosewater from jugs and is then poured over people's hands to wash them in a daily ceremony.",
        "The dish is slightly taller than the men's trophy and is a partially gilded sterling silver salver.",
        "The first recipient of this ceremonial platter was Blanche Bingley.",
        "This article is the latest from BBC Sport's Ask Me Anything team.",
        "Ask Me Anything is a service dedicated to answering your questions. This question was sent in by a number of you, including Farrukh in London. Thank you for your question.",
        "We want to reward your time by telling you things you do not know and reminding you of things you do.",
        "The team will find out everything you need to know and be able to call upon a network of contacts including our experts and pundits.",
        "We will be answering your questions from the heart of the BBC Sport newsroom, and going behind the scenes at some of the world's biggest sporting events.",
        "Our coverage will span the BBC Sport website, app, social media and YouTube accounts, plus BBC TV and radio.",
        "What is the prize money per round at Wimbledon?",
        "What is Wimbledon's Last 8 Club?",
        "How are famous faces invited into Wimbledon's royal box?",
        "Courts and toilet breaks - your Wimbledon questions answered"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/tennis/articles/cvg7zqyewyqo",
      "main_category": "sport",
      "detailed_category": "tennis",
      "topic": "Will there be line judges at Wimbledon 2025?",
      "content": [
        "No, line judges will not be used at Wimbledon this summer.Instead, the grass-court tournament will rely solely on electronic line calling, ending its 147-year use of line judges.A familiar sight around the edges of the courts for decades, the men and women who shout \"out\" and \"fault\" will be replaced by technology.This technology will be in place for qualifying and the main draw.Electronic line calling uses cameras, computers and sensors to track a ball and is used by tennis umpires to judge whether a ball is in or out.This season the men's tour - the ATP - has adopted the technology across all of its events, while the WTA - the women's tour - has also been using it at many of its events. The ATP said the move to electronic line calling was to \"optimise accuracy and consistency across tournaments, match courts and surfaces\".A combined men's and women's event offers an easy opportunity for the technology to be used across the two tournaments.",
        "There will be a range of voices used for electronic line calling at Wimbledon this year.The voices will be from those who work behind the scenes at the Championship, including tour guides at the grounds and museum.\"We will use different voices on different courts so there is no confusion across courts that are close together,\" said Eloise Tyson - head of communications at Wimbledon.Wimbledon have also said they are not looking to make individuals the face of electronic line calling.",
        "The courts at Queen's Club have already implemented the use of electronic line calling. The Australian Open and US Open adopted electronic line calling in 2021 and 2022 respectively.Roland Garros is the only Grand Slam tournament that still uses line judges and players are not allowed to use electronic replays to challenge human decision.The French Open say they want to maintain traditions synonymous with the 134-year-old tournament and are unwilling to lose human control.This article is the latest from BBC Sport's Ask Me Anything team.",
        "Ask Me Anything is a service dedicated to answering your questions.We want to reward your time by telling you things you do not know and reminding you of things you do.The team will find out everything you need to know and be able to call upon a network of contacts including our experts and pundits.We will be answering your questions from the heart of the BBC Sport newsroom, and going behind the scenes at some of the world's biggest sporting events.Our coverage will span the BBC Sport website, app, social media and YouTube accounts, plus BBC TV and radio.",
        "How are Wimbledon wildcards decided?When does the tennis grass court season begin?Why does French Open not have electronic line calling?",
        "No, line judges will not be used at Wimbledon this summer.",
        "Instead, the grass-court tournament will rely solely on electronic line calling, ending its 147-year use of line judges.",
        "A familiar sight around the edges of the courts for decades, the men and women who shout \"out\" and \"fault\" will be replaced by technology.",
        "This technology will be in place for qualifying and the main draw.",
        "Electronic line calling uses cameras, computers and sensors to track a ball and is used by tennis umpires to judge whether a ball is in or out.",
        "This season the men's tour - the ATP - has adopted the technology across all of its events, while the WTA - the women's tour - has also been using it at many of its events.",
        "The ATP said the move to electronic line calling was to \"optimise accuracy and consistency across tournaments, match courts and surfaces\".",
        "A combined men's and women's event offers an easy opportunity for the technology to be used across the two tournaments.",
        "Send us your questions",
        "There will be a range of voices used for electronic line calling at Wimbledon this year.",
        "The voices will be from those who work behind the scenes at the Championship, including tour guides at the grounds and museum.",
        "\"We will use different voices on different courts so there is no confusion across courts that are close together,\" said Eloise Tyson - head of communications at Wimbledon.",
        "Wimbledon have also said they are not looking to make individuals the face of electronic line calling.",
        "The courts at Queen's Club have already implemented the use of electronic line calling.",
        "The Australian Open and US Open adopted electronic line calling in 2021 and 2022 respectively.",
        "Roland Garros is the only Grand Slam tournament that still uses line judges and players are not allowed to use electronic replays to challenge human decision.",
        "The French Open say they want to maintain traditions synonymous with the 134-year-old tournament and are unwilling to lose human control.",
        "This article is the latest from BBC Sport's Ask Me Anything team.",
        "Ask Me Anything is a service dedicated to answering your questions.",
        "We want to reward your time by telling you things you do not know and reminding you of things you do.",
        "The team will find out everything you need to know and be able to call upon a network of contacts including our experts and pundits.",
        "We will be answering your questions from the heart of the BBC Sport newsroom, and going behind the scenes at some of the world's biggest sporting events.",
        "Our coverage will span the BBC Sport website, app, social media and YouTube accounts, plus BBC TV and radio.",
        "How are Wimbledon wildcards decided?",
        "When does the tennis grass court season begin?",
        "Why does French Open not have electronic line calling?"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/tennis/articles/c1e6l90p2vxo",
      "main_category": "sport",
      "detailed_category": "tennis",
      "topic": "Why female tennis players are returning to Queen's after half a century",
      "content": [
        "There are several reasons why female players will return to Queen's for the first time in 52 years, including an ongoing commitment to the growth of women's tennis, and the success of an event at Eastbourne.The Lawn Tennis Association - the sport's governing body in Britain - hopes the tournament will raise the profile of the women's game and increase the visibility of the sport at the beginning of the grass-court season.\"This year fans will be able to enjoy both men's and women's tennis on the biggest stages that we can offer,\" said LTA chief executive Scott Lloyd.\"We want to develop the tournaments so that the women's events deliver a path to profitability and greater visibility for the sport.\"Queen's will host the Women's Tennis Association (WTA) 500 event that was previously at Eastbourne, which will now stage a 250 event in the build-up to Wimbledon, with Emma Raducanu on the entry list.\"Essentially, in 1974 the LTA decided to move the women's event at Queen's to Eastbourne,\" Queen's tournament director Laura Robson told BBC Sport. \"It did extremely well and eventually became a combined event in one week. At Queens, logistically it wasn't possible. However, we can now create a two-week festival of tennis, which we know the fans want. This model is popular at other tour events when you can't combine simultaneously.\"Montreal/Toronto is probably the best example of having a combined event that's across different cities.\"The WTA Tour includes 250, 500 and 1000-level events - the categories denoting the number of ranking points awarded to the champion. Grand Slams award 2,000 points to the winner.",
        "Both men's and women's tournaments were held at Queen's under the name the London Grass Court Championship until 1973.The women's tournament was then discontinued, and the men's event was not held at the venue from 1974-1976.That returned in 1977 as the Queen's Club Championships.The draw has since grown from 32 players to 64, while the women's event found a new home in Eastbourne.This summer, however, there will be a new women's singles champion at Queen's for the first time since Olga Morozova won in 1973.",
        "Male players have raised concerns about the quality of grass they will compete on after the women's tournament ends, and also there being fewer courts available for those who arrive early to prepare.The women's tournament will take place from 9-15 June, with the men's event following from 16-22 June.The LTA has agreed to undertake a review after this year's events.It has voluntarily increased the standard prize money for the women's event to £1.043m. With minimum prize money levels set by the tours, the men's event will offer a total prize fund of £2.122m.The LTA has pledged to introduce equal prize money at the grass-court tournaments at Queen's and Eastbourne no later than 2029.",
        "The tournament will feature a strong line-up, with 10 of the world's top 20 in action. Qinwen Zheng (China)Madison Keys (US)Emma Navarro (US)Elena Rybakina (Kaz)Diana Shnaider*Karolina Muchova (Cze)Barbora Krejcikova (Cze) Amanda Anisimova (US)Daria Kasatkina (Aus)Donna Vekic (Cro) Beatriz Haddad Maia (Bra)Magdalena Frech (Pol) Leylah Fernandez (Can)Anna Kalinskaya*Yulia Putintseva (Kaz)Katie Boulter (GB)Emma Raducanu (GB) Petra Kvitova (Cze)Sonay Kartal (GB)Francesca Jones (GB)Jodie Burrage (GB)* Russian players currently compete as neutral athletes",
        "This article is the latest from BBC Sport's Ask Me Anything team.",
        "Ask Me Anything is a service dedicated to answering your questions.We want to reward your time by telling you things you do not know and reminding you of things you do.The team will find out everything you need to know and be able to call upon a network of contacts including our experts and pundits.We will be answering your questions from the heart of the BBC Sport newsroom, and going behind the scenes at some of the world's biggest sporting events.Our coverage will span the BBC Sport website, app, social media and YouTube accounts, plus BBC TV and radio.",
        "When does the tennis grass court season begin?Why does French Open not have electronic line calling?Who was Roland Garros?",
        "There are several reasons why female players will return to Queen's for the first time in 52 years, including an ongoing commitment to the growth of women's tennis, and the success of an event at Eastbourne.",
        "The Lawn Tennis Association - the sport's governing body in Britain - hopes the tournament will raise the profile of the women's game and increase the visibility of the sport at the beginning of the grass-court season.",
        "\"This year fans will be able to enjoy both men's and women's tennis on the biggest stages that we can offer,\" said LTA chief executive Scott Lloyd.",
        "\"We want to develop the tournaments so that the women's events deliver a path to profitability and greater visibility for the sport.\"",
        "Queen's will host the Women's Tennis Association (WTA) 500 event that was previously at Eastbourne, which will now stage a 250 event in the build-up to Wimbledon, with Emma Raducanu on the entry list.",
        "\"Essentially, in 1974 the LTA decided to move the women's event at Queen's to Eastbourne,\" Queen's tournament director Laura Robson told BBC Sport.",
        "\"It did extremely well and eventually became a combined event in one week. At Queens, logistically it wasn't possible. However, we can now create a two-week festival of tennis, which we know the fans want. This model is popular at other tour events when you can't combine simultaneously.",
        "\"Montreal/Toronto is probably the best example of having a combined event that's across different cities.\"",
        "The WTA Tour includes 250, 500 and 1000-level events - the categories denoting the number of ranking points awarded to the champion. Grand Slams award 2,000 points to the winner.",
        "Send us your questions",
        "Both men's and women's tournaments were held at Queen's under the name the London Grass Court Championship until 1973.",
        "The women's tournament was then discontinued, and the men's event was not held at the venue from 1974-1976.",
        "That returned in 1977 as the Queen's Club Championships.",
        "The draw has since grown from 32 players to 64, while the women's event found a new home in Eastbourne.",
        "This summer, however, there will be a new women's singles champion at Queen's for the first time since Olga Morozova won in 1973.",
        "Olga Morozova beat Evonne Goolagong in the 1973 Queen's final",
        "Male players have raised concerns about the quality of grass they will compete on after the women's tournament ends, and also there being fewer courts available for those who arrive early to prepare.",
        "The women's tournament will take place from 9-15 June, with the men's event following from 16-22 June.",
        "The LTA has agreed to undertake a review after this year's events.",
        "It has voluntarily increased the standard prize money for the women's event to £1.043m. With minimum prize money levels set by the tours, the men's event will offer a total prize fund of £2.122m.",
        "The LTA has pledged to introduce equal prize money at the grass-court tournaments at Queen's and Eastbourne no later than 2029.",
        "The tournament will feature a strong line-up, with 10 of the world's top 20 in action.",
        "Karolina Muchova (Cze)",
        "Barbora Krejcikova (Cze)",
        "Amanda Anisimova (US)",
        "Daria Kasatkina (Aus)",
        "Beatriz Haddad Maia (Bra)",
        "Magdalena Frech (Pol)",
        "Leylah Fernandez (Can)",
        "Yulia Putintseva (Kaz)",
        "* Russian players currently compete as neutral athletes",
        "This article is the latest from BBC Sport's Ask Me Anything team.",
        "Ask Me Anything is a service dedicated to answering your questions.",
        "We want to reward your time by telling you things you do not know and reminding you of things you do.",
        "The team will find out everything you need to know and be able to call upon a network of contacts including our experts and pundits.",
        "We will be answering your questions from the heart of the BBC Sport newsroom, and going behind the scenes at some of the world's biggest sporting events.",
        "Our coverage will span the BBC Sport website, app, social media and YouTube accounts, plus BBC TV and radio.",
        "When does the tennis grass court season begin?",
        "Why does French Open not have electronic line calling?",
        "Who was Roland Garros?"
      ]
    }
  ]
}