{
  "scraped_at": "2025-10-27T18:56:59.773547",
  "total_articles": 9,
  "category": "curling",
  "articles_per_category": 100,
  "articles": [
    {
      "url": "https://www.bbc.com/sport/articles/c7v8e25z1v6o",
      "main_category": "sport",
      "detailed_category": "curling",
      "topic": "Scotland's Team Mouat win curling's Tour Challenge",
      "content": [
        "Bruce Mouat's rink secured their first Grand Slam victory of the curling season with a 5-2 victory over Matt Dunstone's team in the final of the Tour Challenge in Nisku, Alberta.Team Dunstone won the first Grand Slam event of the season at last month's Masters, beating Scotland's Ross Whyte in the final, but were unable to repeat the feat this time around.The Scottish rink of Mouat, Hammy McMillan, Bobby Lamie and Grant Hardie went two points ahead thanks to a superb finish to the opening end and never relinquished control in a one-sided final.Another deuce in the fourth end put Mouat's team further ahead before Team Dunstone missed a huge opportunity in the fifth end to take at least two points, as a poor final stone allowed Mouat's rink to pinch a point and move 5-1 in front.Despite Canadian Dunstone scoring a point in the seventh and final end, Mouat's rink secured a deserved victory - their 11th Grand Slam title in total.\"It feels very good,\" said Mouat, who also captured the Canadian Open almost a year ago at the Silent Ice Center.\"After last season, we wanted to come back and prove that it wasn't like a fluke that we won four. We wanted to continue the momentum that we built from last year, and it's exactly what we did this week.\"We played really well, especially in the play-offs. We're back to our old selves, which was really nice to see.\"I don't know what it is about Nisku, but people seem to like us and support us, so that's really nice. \"We're obviously encouraging the crowd to have a great time as well. We just want to put on a bit of a show for them.\"",
        "Team Mouat secured their 11th Grand Slam title",
        "Bruce Mouat's rink secured their first Grand Slam victory of the curling season with a 5-2 victory over Matt Dunstone's team in the final of the Tour Challenge in Nisku, Alberta.",
        "Team Dunstone won the first Grand Slam event of the season at last month's Masters, beating Scotland's Ross Whyte in the final, but were unable to repeat the feat this time around.",
        "The Scottish rink of Mouat, Hammy McMillan, Bobby Lamie and Grant Hardie went two points ahead thanks to a superb finish to the opening end and never relinquished control in a one-sided final.",
        "Another deuce in the fourth end put Mouat's team further ahead before Team Dunstone missed a huge opportunity in the fifth end to take at least two points, as a poor final stone allowed Mouat's rink to pinch a point and move 5-1 in front.",
        "Despite Canadian Dunstone scoring a point in the seventh and final end, Mouat's rink secured a deserved victory - their 11th Grand Slam title in total.",
        "\"It feels very good,\" said Mouat, who also captured the Canadian Open almost a year ago at the Silent Ice Center.",
        "\"After last season, we wanted to come back and prove that it wasn't like a fluke that we won four. We wanted to continue the momentum that we built from last year, and it's exactly what we did this week.",
        "\"We played really well, especially in the play-offs. We're back to our old selves, which was really nice to see.",
        "\"I don't know what it is about Nisku, but people seem to like us and support us, so that's really nice.",
        "\"We're obviously encouraging the crowd to have a great time as well. We just want to put on a bit of a show for them.\""
      ]
    },
    {
      "url": "https://www.bbc.com/sport/articles/c0qpe5ekwpeo",
      "main_category": "sport",
      "detailed_category": "curling",
      "topic": "'Grand Slam in Scotland would be amazing' - Mouat",
      "content": [
        "World champion skip Bruce Mouat is sure Scotland would be a great choice to host a curling Grand Slam as the tournament series prepares to shift out of Canada for the first time.Lake Tahoe in the United States is to host November's event this year, with the organisation's new ownership open to taking future slams to Europe.\"I think that would be amazing,\" said Mouat when asked about the possibility of one of the five elite contests coming to Scotland.\"We've got a lot of teams doing really well at the minute. The boys and I are ranked number one in the world, Team Whyte [skip Ross Whyte] are now top five and we've also got Team Waddle [skip Kyle Waddle]. \"That's three teams in the top 16 in the men's side and on the women's side Team Morrison [skip Rebecca Morrison] are doing really well to be knocking on the door for the slams.\"If the slams did come to Scotland, we would run the event very well and get a lot of spectators in the door.\"Team Mouat made history in April by becoming the first rink to win four of the five slams in a single season, with Team Whyte picking up the other prize.This time, all five events will be played before the Milan-Cortina Olympics in February.Mouat, along with Hammy McMillan, Bobby Lamie and Grant Hardie, are preparing for this week's Tour Challenge in Nisku, Alberta, having reached the semi-finals in London, Ontario, last month.\"Building momentum is important,\" added Mouat, who has led Scotland to six world titles and five European gold medals.\"These are really good events to get time on the ice against the best opposition. At the slams we play on arena ice, similar conditions to the Olympics.\"",
        "Team Mouat have Olympic silver medals following a 5-4 final defeat to Sweden in 2022 and the burning ambition is to go one better in Italy next year.\"We've been together for nine seasons,\" explained Mouat. \"We knew in the first two months that we'd found something special.\"The main thing is our communication. We are very open and honest. We can have the tough conversations we need to have. No matter what we say, we know it's always constructive.\"We are four very different individuals but we all have similar goals in curling and when you have four like-minded people it makes the team work better.\"The journey has been amazing but we've got one more goal and hopefully that's going to happen for us in February. We're putting a bit of pressure on ourselves to get that gold that we were so close to last time.\"",
        "Bruce Mouat's rink won four of the five Grand Slams last season",
        "World champion skip Bruce Mouat is sure Scotland would be a great choice to host a curling Grand Slam as the tournament series prepares to shift out of Canada for the first time.",
        "Lake Tahoe in the United States is to host November's event this year, with the organisation's new ownership open to taking future slams to Europe.",
        "\"I think that would be amazing,\" said Mouat when asked about the possibility of one of the five elite contests coming to Scotland.",
        "\"We've got a lot of teams doing really well at the minute. The boys and I are ranked number one in the world, Team Whyte [skip Ross Whyte] are now top five and we've also got Team Waddle [skip Kyle Waddle].",
        "\"That's three teams in the top 16 in the men's side and on the women's side Team Morrison [skip Rebecca Morrison] are doing really well to be knocking on the door for the slams.",
        "\"If the slams did come to Scotland, we would run the event very well and get a lot of spectators in the door.\"",
        "Team Mouat made history in April by becoming the first rink to win four of the five slams in a single season, with Team Whyte picking up the other prize.",
        "This time, all five events will be played before the Milan-Cortina Olympics in February.",
        "Mouat, along with Hammy McMillan, Bobby Lamie and Grant Hardie, are preparing for this week's Tour Challenge in Nisku, Alberta, having reached the semi-finals in London, Ontario, last month.",
        "\"Building momentum is important,\" added Mouat, who has led Scotland to six world titles and five European gold medals.",
        "\"These are really good events to get time on the ice against the best opposition. At the slams we play on arena ice, similar conditions to the Olympics.\"",
        "Team Mouat have Olympic silver medals following a 5-4 final defeat to Sweden in 2022 and the burning ambition is to go one better in Italy next year.",
        "\"We've been together for nine seasons,\" explained Mouat. \"We knew in the first two months that we'd found something special.",
        "\"The main thing is our communication. We are very open and honest. We can have the tough conversations we need to have. No matter what we say, we know it's always constructive.",
        "\"We are four very different individuals but we all have similar goals in curling and when you have four like-minded people it makes the team work better.",
        "\"The journey has been amazing but we've got one more goal and hopefully that's going to happen for us in February. We're putting a bit of pressure on ourselves to get that gold that we were so close to last time.\""
      ]
    },
    {
      "url": "https://www.bbc.com/sport/articles/c62qpd9yz84o",
      "main_category": "sport",
      "detailed_category": "curling",
      "topic": "World Curling embraces professional Rock League",
      "content": [
        "Moves to create a professional curling league have been welcomed by the secretary general of the sport's governing body, World Curling, saying \"if we don't choose change, change will choose us\" .It was announced earlier this year that the inaugural Rock League will get under way in April.The six-week event, which is the brainchild of The Curling Group, will feature six mixed-gender teams of 10 players, with each being organised by region.Scotland's Bruce Mouat, the current world champion, will captain one of the two European sides taking part.World Curling's Colin Grahamslaw told BBC Scotland: \"I don't think we should fear change. I think we have got to embrace change and, if we don't choose change, change will choose us.",
        "\"So we need to be ready for it. We need to be able to shape it and we need to be able to work it so that it is a positive benefit for the whole sport, not just the few players that are going to play in the Rock League.\"The Curling Group, a sports business venture \"dedicated to revolutionising the sport of curling\", acquired the prestigious Grand Slam of Curling series last year.\"They are disrupters - in a positive way,\" Grahamslaw said. \"They are looking to do things in a different way and we welcome that.\"It is people that have come in with new ideas, new ways of doing things, bringing ideas from different industries, different sports – there are big connections to American Football. \"A lot of the investors into The Curling Group come from that professional sports background.\"Next year's Rock League is a further sign of the wind of change blowing through the sport, including \"trialling new rules to improve the playing experience, to improve the spectating experience\".\"I think taking some of those ideas on board and giving us a chance to look at how we can implement them in a very traditional sport is interesting,\" Grahamslaw said.\"The idea that we can bring new money in to the sport, money that can help the athletes maintain a full-time athletic lifestyle, is positive.\"World Curling and The Curling Group \"talk on a regular basis\" to co-ordinate calendars for the next four years.Curling's global appeal is clear with Grahamslaw saying that, since 2010, the number of countries playing it has \"almost doubled\".He also points to the fact it draws a huge worldwide audience every four years when it takes centre stage at the Winter Olympics.Maintaining that level of international appeal outwith the Olympic window remains the big challenge.\"I think we are clear that there are things we maybe need to do to improve the pace of play, to keep spectators engaged, both in the venue and when they are watching on television at home,\" Grahamslaw added.",
        "Bruce Mouat will captain one of the Rock League franchises",
        "Moves to create a professional curling league have been welcomed by the secretary general of the sport's governing body, World Curling, saying \"if we don't choose change, change will choose us\" .",
        "It was announced earlier this year that the inaugural Rock League will get under way in April.",
        "The six-week event, which is the brainchild of The Curling Group, will feature six mixed-gender teams of 10 players, with each being organised by region.",
        "Scotland's Bruce Mouat, the current world champion, will captain one of the two European sides taking part.",
        "World Curling's Colin Grahamslaw told BBC Scotland: \"I don't think we should fear change. I think we have got to embrace change and, if we don't choose change, change will choose us.",
        "GB Winter Olympic medal hope banned for two years",
        "Dodds & Mouat set sights on Winter Olympic gold",
        "\"So we need to be ready for it. We need to be able to shape it and we need to be able to work it so that it is a positive benefit for the whole sport, not just the few players that are going to play in the Rock League.\"",
        "The Curling Group, a sports business venture \"dedicated to revolutionising the sport of curling\", acquired the prestigious Grand Slam of Curling series last year.",
        "\"They are disrupters - in a positive way,\" Grahamslaw said. \"They are looking to do things in a different way and we welcome that.",
        "\"It is people that have come in with new ideas, new ways of doing things, bringing ideas from different industries, different sports – there are big connections to American Football.",
        "\"A lot of the investors into The Curling Group come from that professional sports background.\"",
        "Next year's Rock League is a further sign of the wind of change blowing through the sport, including \"trialling new rules to improve the playing experience, to improve the spectating experience\".",
        "\"I think taking some of those ideas on board and giving us a chance to look at how we can implement them in a very traditional sport is interesting,\" Grahamslaw said.",
        "\"The idea that we can bring new money in to the sport, money that can help the athletes maintain a full-time athletic lifestyle, is positive.\"",
        "World Curling and The Curling Group \"talk on a regular basis\" to co-ordinate calendars for the next four years.",
        "Curling's global appeal is clear with Grahamslaw saying that, since 2010, the number of countries playing it has \"almost doubled\".",
        "He also points to the fact it draws a huge worldwide audience every four years when it takes centre stage at the Winter Olympics.",
        "Maintaining that level of international appeal outwith the Olympic window remains the big challenge.",
        "\"I think we are clear that there are things we maybe need to do to improve the pace of play, to keep spectators engaged, both in the venue and when they are watching on television at home,\" Grahamslaw added."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/articles/c70xwgpe5dvo",
      "main_category": "sport",
      "detailed_category": "curling",
      "topic": "Dodds & Mouat set sights on Winter Olympic gold",
      "content": [
        "Jennifer Dodds is aiming for back-to-back Winter Olympic gold medals, with the curling teams the first officially confirmed Team GB athletes for Milan-Cortina 2026.And, with a silver medal on their debut, Bruce Mouat and his rink are aiming to go one better in Italy next year.Mouat, along with Grant Hardie, Bobby Lammie and Hammy McMillan Jr, were narrowly beaten by Sweden in the 2022 final.Dodds teamed up with Eve Muirhead, Vicky Wright and Hailey Duff in Beijing as Britain topped the podium for the first time in 20 years.This time, she will be joined by Rebecca Morrison, Sophie Sinclair and skip Sophie Jackson.\"Winning gold last time was a dream come true, so I'm excited to get back there, obviously with a new team,\" Dodds told BBC Scotland.\"We've been building a lot over the last couple of seasons and I'm excited to see where the trajectory of our performance can go over the next eight months.\"I've known a couple of the girls for quite a while, but that's the thing, we probably had to build that teamwork, build the friendships and I feel like we've done that really well. I think you can see in our performances, our teamwork has improved, and a big part of that is communication and understanding each other.''Mouat's Scotland rink won World Championship gold for a second time this year, having been European champions on four occasions.Now the Edinburgh curler wants to add Olympic gold to their list of achievements.\"We were close last time,\" he said. \"It came down to a matter of centimetres in the final. It was tough at the time but we've really bounced back and got our two world championships and now we've got 10 Grand Slam titles, so we have a lot of momentum.\"",
        "Mouat and Dodds will team up again to compete in the mixed doubles, having lost out in the 2022 bronze medal match.\"We're friends first and foremost, but we are team-mates as well,\" explained Dodds. \"He can be intense on the ice but he's one of the funniest people I know off the ice. He always puts a smile on my face.\"We had the World Championships in April, and we got silver there, and I felt like that was kind of where we were, back to where we were from a couple of years ago. What we're wanting to go and strive for, is that gold medal at the Olympics.''Mouat added: \"Jen and I are great friends and we have been since we were about eight or nine. It's just so much fun to get to go back to one of the pinnacles of our sport and play with someone that you've played with for such a long time. \"In Beijing we were very close to winning a medal. We were up in our semi-final and then we ended up just throwing it away unfortunately, but we learned a lot from that experience.\"The 25th edition of the Winter Games will take place between 6-22 February 2026, across 16 disciplines.",
        "Jennifer Dodds shows off her Olympic gold medal at Beijing 2022",
        "Jennifer Dodds is aiming for back-to-back Winter Olympic gold medals, with the curling teams the first officially confirmed Team GB athletes for Milan-Cortina 2026.",
        "And, with a silver medal on their debut, Bruce Mouat and his rink are aiming to go one better in Italy next year.",
        "Mouat, along with Grant Hardie, Bobby Lammie and Hammy McMillan Jr, were narrowly beaten by Sweden in the 2022 final.",
        "Dodds teamed up with Eve Muirhead, Vicky Wright and Hailey Duff in Beijing as Britain topped the podium for the first time in 20 years.",
        "This time, she will be joined by Rebecca Morrison, Sophie Sinclair and skip Sophie Jackson.",
        "\"Winning gold last time was a dream come true, so I'm excited to get back there, obviously with a new team,\" Dodds told BBC Scotland.",
        "\"We've been building a lot over the last couple of seasons and I'm excited to see where the trajectory of our performance can go over the next eight months.",
        "\"I've known a couple of the girls for quite a while, but that's the thing, we probably had to build that teamwork, build the friendships and I feel like we've done that really well. I think you can see in our performances, our teamwork has improved, and a big part of that is communication and understanding each other.''",
        "Mouat's Scotland rink won World Championship gold for a second time this year, having been European champions on four occasions.",
        "Now the Edinburgh curler wants to add Olympic gold to their list of achievements.",
        "\"We were close last time,\" he said. \"It came down to a matter of centimetres in the final. It was tough at the time but we've really bounced back and got our two world championships and now we've got 10 Grand Slam titles, so we have a lot of momentum.\"",
        "Mouat and Dodds will team up again to compete in the mixed doubles, having lost out in the 2022 bronze medal match.",
        "\"We're friends first and foremost, but we are team-mates as well,\" explained Dodds. \"He can be intense on the ice but he's one of the funniest people I know off the ice. He always puts a smile on my face.",
        "\"We had the World Championships in April, and we got silver there, and I felt like that was kind of where we were, back to where we were from a couple of years ago. What we're wanting to go and strive for, is that gold medal at the Olympics.''",
        "Mouat added: \"Jen and I are great friends and we have been since we were about eight or nine. It's just so much fun to get to go back to one of the pinnacles of our sport and play with someone that you've played with for such a long time.",
        "\"In Beijing we were very close to winning a medal. We were up in our semi-final and then we ended up just throwing it away unfortunately, but we learned a lot from that experience.\"",
        "The 25th edition of the Winter Games will take place between 6-22 February 2026, across 16 disciplines."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/articles/cz79xv8dl05o",
      "main_category": "sport",
      "detailed_category": "curling",
      "topic": "Italy beat Scotland in world mixed doubles curling final",
      "content": [
        "Scotland's Bruce Mouat and Jen Dodds had to settle for silver as they were beaten 9-4 by Olympic champions Amos Mosaner and Stefania Constantini of Italy in the final of the World Mixed Doubles Curling Championship.Mouat, who skipped Scotland's rink to the world men's title this year, and Dodds won the title in 2021.But a four at the seventh end proved decisive for the Italians in Fredericton, Canada, coming immediately after the Scots scored three at the sixth to raise hopes of a comeback.Reflecting on a season in which the Scottish pair have reached the final of all four international tournaments they have played together, Mouat said: \"We're a bit gutted not to get across the line there, but we're very proud of our week that we managed to get to the final again.\"We didn't play our best in the final unfortunately, which can happen. The ice felt like it changed slightly, but we weren't quick enough to pick up on it.\"The Italians had also beaten the Scots 7-4 in the round-robin as they finished top of the standings with nine consecutive victories to progress directly to the semi-finals.Scotland had to beat the United States and Australia to reach the final, while the Italians defeated Estonia's Marie Kaldvee and Harri Lill, who are ranked first in the world to reach the final.\"We'll be back and hopefully next year we'll come back firing, but we're looking forward to some down time,\" Mouat admitted. \"It's been an incredible six weeks for me and I really enjoyed myself.\"Meanwhile, Australia's Tahli Gill and Dean Hewitt beat Estonia 9-2 in the third-place match to claim a historic first world curling medal.",
        "Bruce Mouat and Jen Dodds had won the title in 2021",
        "Scotland's Bruce Mouat and Jen Dodds had to settle for silver as they were beaten 9-4 by Olympic champions Amos Mosaner and Stefania Constantini of Italy in the final of the World Mixed Doubles Curling Championship.",
        "Mouat, who skipped Scotland's rink to the world men's title this year, and Dodds won the title in 2021.",
        "But a four at the seventh end proved decisive for the Italians in Fredericton, Canada, coming immediately after the Scots scored three at the sixth to raise hopes of a comeback.",
        "Reflecting on a season in which the Scottish pair have reached the final of all four international tournaments they have played together, Mouat said: \"We're a bit gutted not to get across the line there, but we're very proud of our week that we managed to get to the final again.",
        "\"We didn't play our best in the final unfortunately, which can happen. The ice felt like it changed slightly, but we weren't quick enough to pick up on it.\"",
        "The Italians had also beaten the Scots 7-4 in the round-robin as they finished top of the standings with nine consecutive victories to progress directly to the semi-finals.",
        "Scotland had to beat the United States and Australia to reach the final, while the Italians defeated Estonia's Marie Kaldvee and Harri Lill, who are ranked first in the world to reach the final.",
        "\"We'll be back and hopefully next year we'll come back firing, but we're looking forward to some down time,\" Mouat admitted. \"It's been an incredible six weeks for me and I really enjoyed myself.\"",
        "Meanwhile, Australia's Tahli Gill and Dean Hewitt beat Estonia 9-2 in the third-place match to claim a historic first world curling medal.",
        "'Emotional' Mouat makes history with fourth Grand Slam title of season"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/articles/cn5xk15v65lo",
      "main_category": "sport",
      "detailed_category": "curling",
      "topic": "'Emotional' Mouat makes history with fourth Grand Slam title of season",
      "content": [
        "Bruce Mouat's world champions completed an \"unbelievable\" season by beating Team Schwaller to win the Players Championship and become the first rink ever to win four Grand Slams in one season.With Ross Whyte's rink winning the other Grand Slam event, it means that all five titles have gone to Scottish rinks.Team Mouat's 6-5 success was their third victory in a week over Yannick Schwaller's rink, having beaten the Swiss in last Sunday's World Men's Curling Championship final and then in the group stage in Toronto.Mouat said: \"We obviously put in the hard work, but we can't believe the season we have just had.\"That was the best possible finish to the season for us to win the Players and get four Slams in one season. The history stuff is pretty special.\"Asked what is the secret to their success, he added: \"We trust each other. Being away from home most of the time, we have to support one another.\"The Swiss had qualified directly for the semi-finals by topping Pool A ahead of Mouat, whose only defeat came at the hands of Whyte's rink.It meant Team Mouat had to face world number two rink Team Jacobs, but they came through that challenge 6-2 as Schwaller's third-ranked Swiss dispatching the other Canadian semi-finalists, fourth-ranked Team Dunstone.In the final, Schwaller took singles at the opening end and third, but the Scots hit back to lead 5-3 going into the eighth end, only for the Swiss to score two and force an extra end.The Swiss were lying one as Mouat prepared to throw the final stone of the Grand Slam of Curling season and he played a perfect shot against his rival's guard and on to his own stone to score the winning shot.\"Knowing that we're the only team to have done this is amazing, so it's a pretty incredible feeling and I'm a little overwhelmed with all the emotions, which I think I showed in that last shot,\" Mouat added.",
        "Bruce Mouat's team became the first rink ever to win four Grand Slams in one season",
        "Bruce Mouat's world champions completed an \"unbelievable\" season by beating Team Schwaller to win the Players Championship and become the first rink ever to win four Grand Slams in one season.",
        "With Ross Whyte's rink winning the other Grand Slam event, it means that all five titles have gone to Scottish rinks.",
        "Team Mouat's 6-5 success was their third victory in a week over Yannick Schwaller's rink, having beaten the Swiss in last Sunday's World Men's Curling Championship final and then in the group stage in Toronto.",
        "Mouat said: \"We obviously put in the hard work, but we can't believe the season we have just had.",
        "\"That was the best possible finish to the season for us to win the Players and get four Slams in one season. The history stuff is pretty special.\"",
        "Asked what is the secret to their success, he added: \"We trust each other. Being away from home most of the time, we have to support one another.\"",
        "The Swiss had qualified directly for the semi-finals by topping Pool A ahead of Mouat, whose only defeat came at the hands of Whyte's rink.",
        "It meant Team Mouat had to face world number two rink Team Jacobs, but they came through that challenge 6-2 as Schwaller's third-ranked Swiss dispatching the other Canadian semi-finalists, fourth-ranked Team Dunstone.",
        "In the final, Schwaller took singles at the opening end and third, but the Scots hit back to lead 5-3 going into the eighth end, only for the Swiss to score two and force an extra end.",
        "The Swiss were lying one as Mouat prepared to throw the final stone of the Grand Slam of Curling season and he played a perfect shot against his rival's guard and on to his own stone to score the winning shot.",
        "\"Knowing that we're the only team to have done this is amazing, so it's a pretty incredible feeling and I'm a little overwhelmed with all the emotions, which I think I showed in that last shot,\" Mouat added."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/articles/crm3km8pz0go",
      "main_category": "sport",
      "detailed_category": "curling",
      "topic": "Team Mouat through to Grand Slam semi-finals",
      "content": [
        "Team Mouat have reached the semi-finals of the Players Championship - and their final appearance will be shown live on the BBC Sport website and app if they progress in Toronto, Canada.The Scots, crowned world champions last week, will play the winner of Canadian sides Team Epping and Team Jacobs, who are ranked two in the world, on Sunday (00:30 BST) at the final Grand Slam event of the season.Team Schwaller, the Swiss side beaten by Mouat in the world final, are also through to the last four and will face Matt Dunsmore's rink after they defeated fellow Canadians Team McEwen in the quarter-finals.Yannick Schwaller's rink finished above Team Mouat in Pool A, with both teams winning four and losing once.Ross Whyte's rink were the only team to defeat their follow Scots at the pool stage  but failed to reach the play-offs.The final will be played at 21:00 on Sunday.",
        "Bruce Mouat is through to another semi-final",
        "Team Mouat have reached the semi-finals of the Players Championship - and their final appearance will be shown live on the BBC Sport website and app if they progress in Toronto, Canada.",
        "The Scots, crowned world champions last week, will play the winner of Canadian sides Team Epping and Team Jacobs, who are ranked two in the world, on Sunday (00:30 BST) at the final Grand Slam event of the season.",
        "Team Schwaller, the Swiss side beaten by Mouat in the world final, are also through to the last four and will face Matt Dunsmore's rink after they defeated fellow Canadians Team McEwen in the quarter-finals.",
        "Yannick Schwaller's rink finished above Team Mouat in Pool A, with both teams winning four and losing once.",
        "Ross Whyte's rink were the only team to defeat their follow Scots at the pool stage  but failed to reach the play-offs.",
        "The final will be played at 21:00 on Sunday.",
        "Whyte sees off world champion Mouat at Players Championship"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/articles/cn05gee8dq8o",
      "main_category": "sport",
      "detailed_category": "curling",
      "topic": "Whyte sees off world champion Mouat at Players Championship",
      "content": [
        "Team Whyte eased to a 6-2 victory over newly crowned world champions Team Mouat after only six ends in the group stage of the Players Championship in Toronto.The early advantage went the way of Team Whyte, comprised of three Scots and skipped by England-born Ross Whyte, with a double score in the first end and a single in the second.Bruce Mouat grabbed a single back at the third end, but Whyte's rink restored their dominance with a double in the fourth and a single in the fifth.Despite recording a score in the sixth end, it was not enough to prevent the world champions suffering their first defeat after four rounds in Pool A.Swiss world number four Yannick Schwaller, who Mouat beat in last week's world final, is level at the top of the group along with the world champion after three wins and one defeat, while Whyte is on two wins and two draws.The event at Mattamy Athletic Centre is the final Grand Slam of the curling season, with Mouat having won three of them and Whyte winning the other.Should either win Sunday's final in Toronto, it will be the first time that Scottish rinks have won all five slam events in the one season.",
        "Bruce Mouat won the world title for a second time last week",
        "Team Whyte eased to a 6-2 victory over newly crowned world champions Team Mouat after only six ends in the group stage of the Players Championship in Toronto.",
        "The early advantage went the way of Team Whyte, comprised of three Scots and skipped by England-born Ross Whyte, with a double score in the first end and a single in the second.",
        "Bruce Mouat grabbed a single back at the third end, but Whyte's rink restored their dominance with a double in the fourth and a single in the fifth.",
        "Despite recording a score in the sixth end, it was not enough to prevent the world champions suffering their first defeat after four rounds in Pool A.",
        "Swiss world number four Yannick Schwaller, who Mouat beat in last week's world final, is level at the top of the group along with the world champion after three wins and one defeat, while Whyte is on two wins and two draws.",
        "The event at Mattamy Athletic Centre is the final Grand Slam of the curling season, with Mouat having won three of them and Whyte winning the other.",
        "Should either win Sunday's final in Toronto, it will be the first time that Scottish rinks have won all five slam events in the one season."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/articles/ckg251n8q0jo",
      "main_category": "sport",
      "detailed_category": "curling",
      "topic": "'Top-tier' Scotland beat Swiss to take historic World Curling gold",
      "content": [
        "Bruce Mouat's \"amazing\" Scotland secured the World Men's Curling Championship title for a second time in historic fashion after a dramatic 5-4 victory over Switzerland in Moose Jaw, Canada.The Scots had to confirm their world number one ranking the hard way, becoming the first team ever to win gold after coming through a quarter-final, having only finished fifth in the round-robin.They edged past reigning champions Sweden, skipped by seven-time winner Niklas Edin, 8-7 in the play-off, avenging a 10-4 round-robin loss to the current Olympic champion.Mouat's side followed that with a fine 7-4 win over Brad Jacobs' third-ranked hosts, who had topped the round-robin with only one defeat - also by the Scots.That set up a repeat of the 2021 European Championship final against Yannick Schwaller's fourth-ranked Swiss, who had also beaten the Scots in the round robin.But Mouat's team prevailed once more to add to a season in which they have already recorded a hat-trick of wins in the first three Grand Slam of Curling events of the season.\"Amazing, it's been an interesting season,\" Mouat said. \"We have had some amazing highs and lows, but this is the highest of the highs. \"It's top tier. I have described it as like Wimbledon for us.\"As against the Swedes and Canadians, the Scots had the disadvantage of starting the final with their opponents having last stone advantage.For the third match in a row, Mouat forced his opponents to score one at the opening end and, after three consecutive blank ends, the Scots scored two in the fifth end to edge in front.Their opponents retook a narrow lead with a two of their own in the sixth, but the momentum - and the lead - changed hands again with a two for Scotland before Switzerland levelled the scores in the eighth end.A blank ninth end set up a tense finish, but the Scots held their nerve to come out on top in an epic encounter as Mouat celebrated on the ice with teammates Grant Hardie, Bobby Lammie and Hammy McMillan after he curled a stone into the middle of the house to take the title.\"It was a bit of a pinch me moment to get to draw the four foot to win a World Championship,\" the 30-year-old Scotland skip added. \"That's something I've dreamt of for a long time.\"Playing in Canada is unbelievable, the crowds you get.\"For Mouat, who first won the world title two years ago, it was the sixth win in nine major championship finals.His rink now join fellow Scots Team Whyte, who won The Masters in January, at the the final Grand Slam of Curling event of the season this week in Toronto looking to complete a full set of wins by Scottish teams in the major men's competitions this season.The curtain raiser to that will be a first-ever Battle of the Sexes match against Rachel Homan's women's world champions from Canada.",
        "Bruce Mouat's rink claimed their second world title after their 2023 triumph in Ottawa",
        "Bruce Mouat's \"amazing\" Scotland secured the World Men's Curling Championship title for a second time in historic fashion after a dramatic 5-4 victory over Switzerland in Moose Jaw, Canada.",
        "The Scots had to confirm their world number one ranking the hard way, becoming the first team ever to win gold after coming through a quarter-final, having only finished fifth in the round-robin.",
        "They edged past reigning champions Sweden, skipped by seven-time winner Niklas Edin, 8-7 in the play-off, avenging a 10-4 round-robin loss to the current Olympic champion.",
        "Mouat's side followed that with a fine 7-4 win over Brad Jacobs' third-ranked hosts, who had topped the round-robin with only one defeat - also by the Scots.",
        "That set up a repeat of the 2021 European Championship final against Yannick Schwaller's fourth-ranked Swiss, who had also beaten the Scots in the round robin.",
        "But Mouat's team prevailed once more to add to a season in which they have already recorded a hat-trick of wins in the first three Grand Slam of Curling events of the season.",
        "\"Amazing, it's been an interesting season,\" Mouat said. \"We have had some amazing highs and lows, but this is the highest of the highs.",
        "\"It's top tier. I have described it as like Wimbledon for us.\"",
        "As against the Swedes and Canadians, the Scots had the disadvantage of starting the final with their opponents having last stone advantage.",
        "For the third match in a row, Mouat forced his opponents to score one at the opening end and, after three consecutive blank ends, the Scots scored two in the fifth end to edge in front.",
        "Their opponents retook a narrow lead with a two of their own in the sixth, but the momentum - and the lead - changed hands again with a two for Scotland before Switzerland levelled the scores in the eighth end.",
        "A blank ninth end set up a tense finish, but the Scots held their nerve to come out on top in an epic encounter as Mouat celebrated on the ice with teammates Grant Hardie, Bobby Lammie and Hammy McMillan after he curled a stone into the middle of the house to take the title.",
        "\"It was a bit of a pinch me moment to get to draw the four foot to win a World Championship,\" the 30-year-old Scotland skip added. \"That's something I've dreamt of for a long time.",
        "\"Playing in Canada is unbelievable, the crowds you get.\"",
        "For Mouat, who first won the world title two years ago, it was the sixth win in nine major championship finals.",
        "His rink now join fellow Scots Team Whyte, who won The Masters in January, at the the final Grand Slam of Curling event of the season this week in Toronto looking to complete a full set of wins by Scottish teams in the major men's competitions this season.",
        "The curtain raiser to that will be a first-ever Battle of the Sexes match against Rachel Homan's women's world champions from Canada."
      ]
    }
  ]
}