{
  "scraped_at": "2025-10-27T18:56:59.823546",
  "total_articles": 9,
  "category": "winter-sports",
  "articles_per_category": 100,
  "articles": [
    {
      "url": "https://www.bbc.com/sport/articles/c5yk188e7jno",
      "main_category": "sport",
      "detailed_category": "winter-sports",
      "topic": "GB Winter Olympic medal hope banned for two years",
      "content": [
        "Great Britain bobsleigh athlete Arran Gulliver will miss the 2026 Winter Olympics after being given a two-year doping ban.The 28-year-old was provisionally suspended earlier this year by the International Testing Agency (ITA) when a drugs test returned an \"adverse\" result for the banned substance ostarine.Ostarine, a similar substance to testosterone, can enhance performance by promoting lean muscle growth and improving strength. The ITA said on Thursday that Gulliver did not challenge the finding and had \"accepted\" a two-year ban running until March 2027, with the agency adding that \"the anti-doping rule violation was not intentional\".Gulliver said he did not knowingly take the substance and that \"extensive, controlled testing\" had confirmed a supplement he consumed had been contaminated. \"With all the power of hindsight I would have done a few things differently and I will regret that for the rest of my life,\" Gulliver told BBC Sport.\"I've been training really hard to get into a position of competing in the Olympics and to win a medal for Great Britain, to miss out on that is incredibly difficult. \"Now I know the length of the ban it's a bit of a weight off my shoulders. I'm devastated to miss the Olympics but in terms of getting my head around it and being able to plan for the future it makes things a little bit easier.\"As well as the ban, Gulliver's bronze that he earned in the four-man bobsleigh at the World Championships in March has been disqualified. The team result, however, stands. He can appeal against the decision through the World Anti-Doping Agency (Wada) and UK Anti-Doping.The British Bobsleigh & Skeleton Association says it is \"committed to the eradication of doping\" and \"fully supports\" the ITA's decision, adding the adverse result was down to \"contamination\". \"We note Arran's decision to accept the verdict handed down by the ITA and to take full responsibility for his actions and the consequences that have arisen as a result,\" it said. Gulliver, from Bewdley in Worcestershire, is a two-time World Championship medallist in the four-man bobsleigh and has won 12 World Cup medals in the British sled.The Winter Olympics will be held in Milan and Cortina d'Ampezzo in northern Italy from 6 February to 22 February 2026.",
        "Arran Gulliver joined the British bobsleigh team in 2022",
        "Great Britain bobsleigh athlete Arran Gulliver will miss the 2026 Winter Olympics after being given a two-year doping ban.",
        "The 28-year-old was provisionally suspended earlier this year by the International Testing Agency (ITA) when a drugs test returned an \"adverse\" result for the banned substance ostarine.",
        "Ostarine, a similar substance to testosterone, can enhance performance by promoting lean muscle growth and improving strength.",
        "The ITA said on Thursday that Gulliver did not challenge the finding and had \"accepted\" a two-year ban running until March 2027, with the agency adding that \"the anti-doping rule violation was not intentional\".",
        "Gulliver said he did not knowingly take the substance and that \"extensive, controlled testing\" had confirmed a supplement he consumed had been contaminated.",
        "\"With all the power of hindsight I would have done a few things differently and I will regret that for the rest of my life,\" Gulliver told BBC Sport.",
        "\"I've been training really hard to get into a position of competing in the Olympics and to win a medal for Great Britain, to miss out on that is incredibly difficult.",
        "\"Now I know the length of the ban it's a bit of a weight off my shoulders. I'm devastated to miss the Olympics but in terms of getting my head around it and being able to plan for the future it makes things a little bit easier.\"",
        "As well as the ban, Gulliver's bronze that he earned in the four-man bobsleigh at the World Championships in March has been disqualified. The team result, however, stands.",
        "He can appeal against the decision through the World Anti-Doping Agency (Wada) and UK Anti-Doping.",
        "The British Bobsleigh & Skeleton Association says it is \"committed to the eradication of doping\" and \"fully supports\" the ITA's decision, adding the adverse result was down to \"contamination\".",
        "\"We note Arran's decision to accept the verdict handed down by the ITA and to take full responsibility for his actions and the consequences that have arisen as a result,\" it said.",
        "Gulliver, from Bewdley in Worcestershire, is a two-time World Championship medallist in the four-man bobsleigh and has won 12 World Cup medals in the British sled.",
        "The Winter Olympics will be held in Milan and Cortina d'Ampezzo in northern Italy from 6 February to 22 February 2026."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/articles/c99gl4pyn02o",
      "main_category": "sport",
      "detailed_category": "winter-sports",
      "topic": "Paralympic chief expects 'reaction' to Russia ban lift",
      "content": [
        "The president of the International Paralympic Committee says he knows \"there will be a reaction\" from other countries over the decision to lift a ban on Russian and Belarusian athletes.IPC members voted on Saturday to lift a partial ban, meaning the athletes can compete under their nation's flags at future international events - such as the 2026 Winter Paralympics.The partial ban - allowing athletes to compete as neutrals - was introduced in 2023, replacing a full ban after the 2022 Russian invasion of Ukraine.IPC boss Andrew Parsons told BBC Sport countries have \"the right to not like the decision made, and I do understand it. But we are a democratic organisation and our membership has spoken, knowing there will be reaction, knowing it's a controversial topic\".The Ukrainian National Paralympic Committee said the IPC had allowed Russia and Belarus to \"raise their flags, drenched in the blood of hundreds of thousands of people\".",
        "It added: \"[We] condemn this disgraceful decision of the IPC general assembly, which discredits the International Paralympic Committee, and call on all national Paralympic committees worldwide against the admission of those who encroach upon the fundamental human right - the right to life.\"Despite the IPC vote, athletes will still need their individual sporting federations to lift their own bans in order to represent their countries.For example, while the IPC decision would allow Russian and Belarusian athletes to compete under their own flags at the Winter Paralympics in Milan and Cortina d'Ampezzo in March 2026, the bans from the international bodies that govern the six sports on the schedule in Italy would currently prevent them from doing so.Parsons, who was speaking at the Para Athletics World Championships in New Delhi, India, added: \"Decisions made by the general assembly are made by more than 200 members. They took the decision - my job is to implement that decision.\"Many people know my personal position. I don't think it's worth mentioning now. I work for the IPC; I need to follow what is decided by the membership.\"History will tell - I don't think we are on one side or the other; we are sports organisations. It's something I don't think is fair that only the world of sport has to be the one trying to solve issues when it comes to politics. \"I think politicians and world leaders have the power to make it happen, not us. Not sport administrators, not athletes.\"",
        "Russian and Belarusian athletes were able to compete at the Paris Paralympics as neutrals",
        "The president of the International Paralympic Committee says he knows \"there will be a reaction\" from other countries over the decision to lift a ban on Russian and Belarusian athletes.",
        "IPC members voted on Saturday to lift a partial ban, meaning the athletes can compete under their nation's flags at future international events - such as the 2026 Winter Paralympics.",
        "The partial ban - allowing athletes to compete as neutrals - was introduced in 2023, replacing a full ban after the 2022 Russian invasion of Ukraine.",
        "IPC boss Andrew Parsons told BBC Sport countries have \"the right to not like the decision made, and I do understand it. But we are a democratic organisation and our membership has spoken, knowing there will be reaction, knowing it's a controversial topic\".",
        "The Ukrainian National Paralympic Committee said the IPC had allowed Russia and Belarus to \"raise their flags, drenched in the blood of hundreds of thousands of people\".",
        "Russia & Belarus could use own flags as ban lifted",
        "It added: \"[We] condemn this disgraceful decision of the IPC general assembly, which discredits the International Paralympic Committee, and call on all national Paralympic committees worldwide against the admission of those who encroach upon the fundamental human right - the right to life.\"",
        "Despite the IPC vote, athletes will still need their individual sporting federations to lift their own bans in order to represent their countries.",
        "For example, while the IPC decision would allow Russian and Belarusian athletes to compete under their own flags at the Winter Paralympics in Milan and Cortina d'Ampezzo in March 2026, the bans from the international bodies that govern the six sports on the schedule in Italy would currently prevent them from doing so.",
        "Parsons, who was speaking at the Para Athletics World Championships in New Delhi, India, added: \"Decisions made by the general assembly are made by more than 200 members. They took the decision - my job is to implement that decision.",
        "\"Many people know my personal position. I don't think it's worth mentioning now. I work for the IPC; I need to follow what is decided by the membership.",
        "\"History will tell - I don't think we are on one side or the other; we are sports organisations. It's something I don't think is fair that only the world of sport has to be the one trying to solve issues when it comes to politics.",
        "\"I think politicians and world leaders have the power to make it happen, not us. Not sport administrators, not athletes.\""
      ]
    },
    {
      "url": "https://www.bbc.com/sport/articles/c62q0pey051o",
      "main_category": "sport",
      "detailed_category": "winter-sports",
      "topic": "Russia & Belarus could use own flags as ban lifted",
      "content": [
        "Russian and Belarusian athletes could compete under their own flag at the Paralympics and World Para-sport events after their partial suspensions by the International Paralympic Committee were lifted.Both countries had been suspended from Paralympic competition since Russia's invasion of Ukraine in 2022. Belarus is a close ally of Russia.But their athletes competed at the Paris Paralympics as neutrals after officials decided against a full ban and instead voted for a partial suspension in 2023.On Saturday,  IPC member organisations voted to not to maintain the sanctions on the countries at the general assembly in Seoul, and Russia and Belarus will now regain the full rights and privileges of IPC membership.While the IPC ban has been lifted, athletes will also need individual sporting federations to lift their own bans in order to be allowed to represent their countries rather than enter as neutral competitors.So, while the IPC decision would allow Russian and Belarusian athletes to compete under their own flags at the Winter Paralympics in Milan and Cortina d'Ampezzo in March 2026, the bans from the international bodies that govern the six sports on the schedule in Italy would currently prevent them from doing so.Ukraine's sports minister Matviy Bidnyi accused those who voted to lift the ban of betraying \"their conscience and the Olympic values\".\"We call on our European partners, who will host the upcoming Winter Paralympic Games, not to allow the flag of the aggressor state to be raised over the free and democratic space while the war of aggression continues.He added that Ukraine's decision on whether to participate in Italy will be \"made collectively at a later stage\".The UK government said it was \"hugely disappointed in the IPC decision\".A spokesperson added: \"Our unequivocal position remains that there should be no Russian or Belarusian state representation in international sport while the war against Ukraine continues given the breaches of the Olympic Charter.\"We will assess the implications of today's vote, and urge the IPC to consider consider the message it sends.\"ParalympicsGB said in a statement that it supported the IPC motion to suspend  Russia.\"However, the IPC membership made the decision to reinstate NPC Russia and we have to respect the decision of the IPC membership. We continue to express our solidarity with the people of Ukraine and our friends at NPC Ukraine,\" it added.Last week, the International Olympic Committee said it would allow Russian and Belarusian athletes to compete at the upcoming Winter Olympics under a neutral flag and strict conditions, as they did at the Paris Olympics.Confirming the return of full IPC membership rights, the Paralympic sport governing body said: \"The IPC will work with the two members involved [Russia and Belarus] to put practical arrangements in place for this as soon as reasonably possible.\"The Russian Paralympic Committee said it was a \"fair decision\".\"This is an important contribution to the development of the international Paralympic movement and an example that the rights of athletes must be protected without discrimination on national and political grounds,\" it said.Russian athletes are currently competing at the World Para Athletics Championships in New Delhi as neutrals.At the Seoul summit, IPC member organisations voted 111-55 against a motion to fully suspend Russia with 11 abstentions, and then voted 91-77 against a motion to partially suspend the country with eight abstentions.With regards to Belarus, members voted 119-48 against motions to fully suspend the country, with nine abstentions, and 103-63 against a partial suspension, with 10 abstentions.",
        "This was a vote taken by the IPC's entire membership, and I am told that many countries felt that because the Paralympics is all about inclusion, it had become unfair to prevent innocent Para-athletes from Russia and Belarus from competing. Some also felt that given the countries had not competed properly as nations (ie not as neutrals) since Sochi 2014, they had been sufficiently punished.It is also worth noting that Russia had not been suspended by the IPC because it had invaded Ukraine. Rather, it was because it had used some sports events to promote the war in Ukraine, which is against the IPC's constitution.",
        "The Winter Paralympics take place from 6-15 March with about 600 athletes competing in 79 medal events across six sports",
        "Russian and Belarusian athletes could compete under their own flag at the Paralympics and World Para-sport events after their partial suspensions by the International Paralympic Committee were lifted.",
        "Both countries had been suspended from Paralympic competition since Russia's invasion of Ukraine in 2022. Belarus is a close ally of Russia.",
        "But their athletes competed at the Paris Paralympics as neutrals after officials decided against a full ban and instead voted for a partial suspension in 2023.",
        "On Saturday,  IPC member organisations voted to not to maintain the sanctions on the countries at the general assembly in Seoul, and Russia and Belarus will now regain the full rights and privileges of IPC membership.",
        "While the IPC ban has been lifted, athletes will also need individual sporting federations to lift their own bans in order to be allowed to represent their countries rather than enter as neutral competitors.",
        "So, while the IPC decision would allow Russian and Belarusian athletes to compete under their own flags at the Winter Paralympics in Milan and Cortina d'Ampezzo in March 2026, the bans from the international bodies that govern the six sports on the schedule in Italy would currently prevent them from doing so.",
        "Ukraine's sports minister Matviy Bidnyi accused those who voted to lift the ban of betraying \"their conscience and the Olympic values\".",
        "\"We call on our European partners, who will host the upcoming Winter Paralympic Games, not to allow the flag of the aggressor state to be raised over the free and democratic space while the war of aggression continues.",
        "He added that Ukraine's decision on whether to participate in Italy will be \"made collectively at a later stage\".",
        "The UK government said it was \"hugely disappointed in the IPC decision\".",
        "A spokesperson added: \"Our unequivocal position remains that there should be no Russian or Belarusian state representation in international sport while the war against Ukraine continues given the breaches of the Olympic Charter.",
        "\"We will assess the implications of today's vote, and urge the IPC to consider consider the message it sends.\"",
        "ParalympicsGB said in a statement that it supported the IPC motion to suspend  Russia.",
        "\"However, the IPC membership made the decision to reinstate NPC Russia and we have to respect the decision of the IPC membership. We continue to express our solidarity with the people of Ukraine and our friends at NPC Ukraine,\" it added.",
        "Last week, the International Olympic Committee said it would allow Russian and Belarusian athletes to compete at the upcoming Winter Olympics under a neutral flag and strict conditions, as they did at the Paris Olympics.",
        "Confirming the return of full IPC membership rights, the Paralympic sport governing body said: \"The IPC will work with the two members involved [Russia and Belarus] to put practical arrangements in place for this as soon as reasonably possible.\"",
        "The Russian Paralympic Committee said it was a \"fair decision\".",
        "\"This is an important contribution to the development of the international Paralympic movement and an example that the rights of athletes must be protected without discrimination on national and political grounds,\" it said.",
        "Russian athletes are currently competing at the World Para Athletics Championships in New Delhi as neutrals.",
        "At the Seoul summit, IPC member organisations voted 111-55 against a motion to fully suspend Russia with 11 abstentions, and then voted 91-77 against a motion to partially suspend the country with eight abstentions.",
        "With regards to Belarus, members voted 119-48 against motions to fully suspend the country, with nine abstentions, and 103-63 against a partial suspension, with 10 abstentions.",
        "This was a vote taken by the IPC's entire membership, and I am told that many countries felt that because the Paralympics is all about inclusion, it had become unfair to prevent innocent Para-athletes from Russia and Belarus from competing.",
        "Some also felt that given the countries had not competed properly as nations (ie not as neutrals) since Sochi 2014, they had been sufficiently punished.",
        "It is also worth noting that Russia had not been suspended by the IPC because it had invaded Ukraine. Rather, it was because it had used some sports events to promote the war in Ukraine, which is against the IPC's constitution."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/olympics/articles/clyqq4qynw8o",
      "main_category": "sport",
      "detailed_category": "winter-sports",
      "topic": "Russian figure skaters secure Winter Olympics spots",
      "content": [
        "Russian figure skaters Adeliia Petrosian and Viktoriia Safonova have secured places at next year's Winter Olympic Games in Milan and Cortina but will have to compete as Individual Neutral Athletes (AINs).Petrosian, 18, won a qualifying event in Beijing while Safonova moved up from seventh to fourth place with a strong performance to earn her place in Italy.AINs - athletes with a Russian or Belarusian passport - have been banned from many sports since the war against Ukraine began in 2022, including cross-country skiing and biathlon.The International Olympic Committee (IOC) confirmed on Friday that AINs would be able to compete at the 2026 Winter Olympics under the same strict conditions they did at last year's Paris Games.An IOC statement said: \"The IOC executive board considered the experience of the Olympic Games in Paris, during which 32 athletes with a Russian or Belarusian passport from 10 different sports took part, without any incident on or off the field of play.\"The IOC also ruled teams of athletes with a Russian or Belarusian passport will not be considered and individual athletes who actively support the war will not be eligible to be entered or compete. AINs will also not participate in the opening ceremony and their medals will not feature on the medal table.Athletes from both countries competed at the Paris Olympics last year, when 15 neutral Russians and 17 neutral Belarusians accepted an Olympic invitation.",
        "The 2026 Winter Olympics begins on 6 February 2026",
        "Russian figure skaters Adeliia Petrosian and Viktoriia Safonova have secured places at next year's Winter Olympic Games in Milan and Cortina but will have to compete as Individual Neutral Athletes (AINs).",
        "Petrosian, 18, won a qualifying event in Beijing while Safonova moved up from seventh to fourth place with a strong performance to earn her place in Italy.",
        "AINs - athletes with a Russian or Belarusian passport - have been banned from many sports since the war against Ukraine began in 2022, including cross-country skiing and biathlon.",
        "The International Olympic Committee (IOC) confirmed on Friday that AINs would be able to compete at the 2026 Winter Olympics under the same strict conditions they did at last year's Paris Games.",
        "An IOC statement said: \"The IOC executive board considered the experience of the Olympic Games in Paris, during which 32 athletes with a Russian or Belarusian passport from 10 different sports took part, without any incident on or off the field of play.\"",
        "The IOC also ruled teams of athletes with a Russian or Belarusian passport will not be considered and individual athletes who actively support the war will not be eligible to be entered or compete.",
        "AINs will also not participate in the opening ceremony and their medals will not feature on the medal table.",
        "Athletes from both countries competed at the Paris Olympics last year, when 15 neutral Russians and 17 neutral Belarusians accepted an Olympic invitation."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/articles/c4g27en91rko",
      "main_category": "sport",
      "detailed_category": "winter-sports",
      "topic": "Italian skier Franzoso dies after training crash",
      "content": [
        "Italian skier Matteo Franzoso has died following a training crash in Chile on Saturday.He had been placed in a medically induced coma in a Santiago hospital after suffering a head injury in a collision with a fence in La Parva.Franzoso, who would have celebrated his 26th birthday on Tuesday, made his World Cup debut in December 2021.He made 17 World Cup starts, with his best performance a 28th-place finish in the super-G at Cortina d'Ampezzo in northern Italy in 2023.\"This is a tragedy for his family and for our sport,\" said Italian winter sports federation (FISI) president Flavio Roda.Franzoso's death comes almost a year after Italian junior champion and Europa Cup racer Matilde Lorenzi died after a fall at the Italian ski resort of Val Senales.\"It is absolutely necessary to do everything possible so that such incidents are not repeated,\" Roda added.The International Ski and Snowboard Federation (FIS) said it was \"deeply saddened\" by Franzoso's death.",
        "Matteo Franzoso made 17 World Cup starts across downhill and super-G events",
        "Italian skier Matteo Franzoso has died following a training crash in Chile on Saturday.",
        "He had been placed in a medically induced coma in a Santiago hospital after suffering a head injury in a collision with a fence in La Parva.",
        "Franzoso, who would have celebrated his 26th birthday on Tuesday, made his World Cup debut in December 2021.",
        "He made 17 World Cup starts, with his best performance a 28th-place finish in the super-G at Cortina d'Ampezzo in northern Italy in 2023.",
        "\"This is a tragedy for his family and for our sport,\" said Italian winter sports federation (FISI) president Flavio Roda.",
        "Franzoso's death comes almost a year after Italian junior champion and Europa Cup racer Matilde Lorenzi died after a fall at the Italian ski resort of Val Senales.",
        "\"It is absolutely necessary to do everything possible so that such incidents are not repeated,\" Roda added.",
        "The International Ski and Snowboard Federation (FIS) said it was \"deeply saddened\" by Franzoso's death."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/ice-hockey/articles/ce83x51j293o",
      "main_category": "sport",
      "detailed_category": "winter-sports",
      "topic": "GB win opener at inaugural Women's World Championships",
      "content": [
        "Great Britain made history by winning their opening game at Para-ice hockey's inaugural Women's World Championships.Felicity Gregory scored twice in a 2-1 win over Team World, either side of a strike by Akari Fukunishi of Japan - one of nine nationalities represented in her team at the tournament in Slovakia.GB play their next Group B round-robin game against Canada on Thursday.\"The team is really thrilled. It's a great day for GB Para-ice hockey, especially for women. We're really excited about today and looking forward for the competition,\" Gregory said. \"We gave it all. We had some new additions to the team, they were making their debut as well in the first Women's World Championships, so it was a real motivational day.\"The United States, Norway and Australia make up Group A at the World Championships, which also features an all-female officiating crew.While Para-ice hockey is a mixed sport, only three women have ever played at a Winter Paralympics - the sport's pinnacle.Since the Beijing 2022 Games, the sport's international governing body has launched a women's development pathway to bring more female athletes on to the ice, with the hope of future inclusion at the Paralympics.In the three years since Beijing, the proportion of female to male athletes playing the sport has risen from less than one percent to more than 20 percent.",
        "Felicity Gregory (pictured) scored both goals for Great Britain",
        "Great Britain made history by winning their opening game at Para-ice hockey's inaugural Women's World Championships.",
        "Felicity Gregory scored twice in a 2-1 win over Team World, either side of a strike by Akari Fukunishi of Japan - one of nine nationalities represented in her team at the tournament in Slovakia.",
        "GB play their next Group B round-robin game against Canada on Thursday.",
        "\"The team is really thrilled. It's a great day for GB Para-ice hockey, especially for women. We're really excited about today and looking forward for the competition,\" Gregory said.",
        "\"We gave it all. We had some new additions to the team, they were making their debut as well in the first Women's World Championships, so it was a real motivational day.\"",
        "The United States, Norway and Australia make up Group A at the World Championships, which also features an all-female officiating crew.",
        "While Para-ice hockey is a mixed sport, only three women have ever played at a Winter Paralympics - the sport's pinnacle.",
        "Since the Beijing 2022 Games, the sport's international governing body has launched a women's development pathway to bring more female athletes on to the ice, with the hope of future inclusion at the Paralympics.",
        "In the three years since Beijing, the proportion of female to male athletes playing the sport has risen from less than one percent to more than 20 percent.",
        "Van der Poll swaps surf for ice at historic World Champs"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/articles/cedvpzyp2wlo",
      "main_category": "sport",
      "detailed_category": "winter-sports",
      "topic": "Norwegian ski jumpers banned over 'cheat' suits",
      "content": [
        "Two Norwegian ski jumpers have accepted three-month suspensions for their part in the tampering of ski suits during a competition, the International Ski Federation (FIS) has said.Olympic medallists Marius Lindvik and Johann Andre Forfang were accused of equipment manipulation in the men's large hill event at the World Ski Championships in Trondheim, Norway, in March.The pair, and three team officials, were charged by the sport's governing body earlier this month.Speaking when the manipulation was uncovered in a routine equipment check, FIS general manager Jan-Erik Aalbu said the team had \"tried to cheat the system\" by putting reinforced thread in the jumpsuits of Lindvik and Forfang.Lindvik, 27, had originally finished second in the men's large hill event while 30-year-old compatriot Forfang came fourth, but both were disqualified after the equipment inspection.They were provisionally suspended in March pending an investigation.When the athletes were charged, Aalbu said Lindvik and Forfang were unaware of the reinforced thread.\"They were not charged with actual knowledge of the manipulations,\" the FIS Ethics Commission said on Saturday, adding they had admitted to breaching competition rules.\"They also agree that they should have checked and asked questions about the night-time adjustments.\"Johann Forfang and Marius Lindvik are therefore willing to accept the proposed sanctions of a period of ineligibility of three months, from which the period of the provisional suspension already served shall be deducted.\"They have also been ordered to pay a 2,000 Swiss franc (£1,845) contribution to the cost of the proceedings.Their lawyers said the case \"shows that routines for communication between the support staff handling equipment and suits, and the athletes, should be improved to prevent similar situations from occurring in the future\".The Winter Olympics in Milan-Cortina starts in February, when Lindvik will aim to be defending his large hill title.Forfang won the large hill team gold and normal hill individual silver at the 2018 Olympics.",
        "Marius Lindvik (left) and Johann Andre Forfang have represented Norway in individual and team events",
        "Two Norwegian ski jumpers have accepted three-month suspensions for their part in the tampering of ski suits during a competition, the International Ski Federation (FIS) has said.",
        "Olympic medallists Marius Lindvik and Johann Andre Forfang were accused of equipment manipulation in the men's large hill event at the World Ski Championships in Trondheim, Norway, in March.",
        "The pair, and three team officials, were charged by the sport's governing body earlier this month.",
        "Speaking when the manipulation was uncovered in a routine equipment check, FIS general manager Jan-Erik Aalbu said the team had \"tried to cheat the system\" by putting reinforced thread in the jumpsuits of Lindvik and Forfang.",
        "Lindvik, 27, had originally finished second in the men's large hill event while 30-year-old compatriot Forfang came fourth, but both were disqualified after the equipment inspection.",
        "They were provisionally suspended in March pending an investigation.",
        "When the athletes were charged, Aalbu said Lindvik and Forfang were unaware of the reinforced thread.",
        "\"They were not charged with actual knowledge of the manipulations,\" the FIS Ethics Commission said on Saturday, adding they had admitted to breaching competition rules.",
        "\"They also agree that they should have checked and asked questions about the night-time adjustments.",
        "\"Johann Forfang and Marius Lindvik are therefore willing to accept the proposed sanctions of a period of ineligibility of three months, from which the period of the provisional suspension already served shall be deducted.\"",
        "They have also been ordered to pay a 2,000 Swiss franc (£1,845) contribution to the cost of the proceedings.",
        "Their lawyers said the case \"shows that routines for communication between the support staff handling equipment and suits, and the athletes, should be improved to prevent similar situations from occurring in the future\".",
        "The Winter Olympics in Milan-Cortina starts in February, when Lindvik will aim to be defending his large hill title.",
        "Forfang won the large hill team gold and normal hill individual silver at the 2018 Olympics."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/articles/cdj237ly4g9o",
      "main_category": "sport",
      "detailed_category": "winter-sports",
      "topic": "Olympic star Dahlmeier dead after climbing accident",
      "content": [
        "Double Olympic biathlon champion Laura Dahlmeier has died after a mountaineering accident in Pakistan.The 31-year-old German was caught in a rockfall during an expedition in the Karakoram mountains on Monday. Her climbing partner, Marina Eva, called emergency services after the accident, which occurred at about 5,700 metres (18,700 feet) altitude. Rescue teams, containing expert climbers from Germany and the United States, immediately began a rescue mission but their searches were hindered by adverse weather conditions.Dahlmeier's management company said on Wednesday that it is likely she died on 28 July - the day of the accident.\"It was Laura's clear and written wishes that in an instance such as this, no one should risk their own lives in order to rescue her,\" a statement posted to Dahlmeier's Instagram read.\"Her wish was that in this case her body should be left behind on the mountain.\"This is also in line with the express wishes of the relatives, who have requested Laura's last wishes be respected.\"",
        "A recovery operation was launched before being called off on the evening of 29 July.\"The recovery of the body under the current prevailing conditions of rockfalls and changeable weather on Laila Peak is attached to a high risk and not achievable,\" the statement continued.\"Laura enriched the lives of many with her warm and straightforward manner.\"She showed us that it is worth standing up for your dreams and goals and always staying true to yourself.\"The German Olympic Sports Confederation said Dahlmeier was \"more than an Olympic champion - she was someone with heart, attitude and vision\".International Olympic Committee president Kirsty Coventry said Dahlmeier's death is \"deeply shocking for all of us in the Olympic movement\".She added: \"She lost her life in her beloved mountains. She will be remembered forever.\"German President Frank-Walter Steinmeier said Dahlmeier was an \"ambassador for our country around the world and a role model for peaceful, joyful and fair coexistence across borders\".Dahlmeier, an experienced mountaineer, represented Germany at two Winter Olympics, winning two golds and one bronze medal in Pyeongchang in 2018.She was the first woman to win the sprint and pursuit events at the same Games and won a further 15 medals, including seven gold, across five World Championships before retiring from competition in May 2019.",
        "Laura Dahlmeier won three medals at the 2018 Winter Olympics in Pyeongchang",
        "Double Olympic biathlon champion Laura Dahlmeier has died after a mountaineering accident in Pakistan.",
        "The 31-year-old German was caught in a rockfall during an expedition in the Karakoram mountains on Monday.",
        "Her climbing partner, Marina Eva, called emergency services after the accident, which occurred at about 5,700 metres (18,700 feet) altitude.",
        "Rescue teams, containing expert climbers from Germany and the United States, immediately began a rescue mission but their searches were hindered by adverse weather conditions.",
        "Dahlmeier's management company said on Wednesday that it is likely she died on 28 July - the day of the accident.",
        "\"It was Laura's clear and written wishes that in an instance such as this, no one should risk their own lives in order to rescue her,\" a statement posted to Dahlmeier's Instagram read.",
        "\"Her wish was that in this case her body should be left behind on the mountain.",
        "\"This is also in line with the express wishes of the relatives, who have requested Laura's last wishes be respected.\"",
        "A recovery operation was launched before being called off on the evening of 29 July.",
        "\"The recovery of the body under the current prevailing conditions of rockfalls and changeable weather on Laila Peak is attached to a high risk and not achievable,\" the statement continued.",
        "\"Laura enriched the lives of many with her warm and straightforward manner.",
        "\"She showed us that it is worth standing up for your dreams and goals and always staying true to yourself.\"",
        "The German Olympic Sports Confederation said Dahlmeier was \"more than an Olympic champion - she was someone with heart, attitude and vision\".",
        "International Olympic Committee president Kirsty Coventry said Dahlmeier's death is \"deeply shocking for all of us in the Olympic movement\".",
        "She added: \"She lost her life in her beloved mountains. She will be remembered forever.\"",
        "German President Frank-Walter Steinmeier said Dahlmeier was an \"ambassador for our country around the world and a role model for peaceful, joyful and fair coexistence across borders\".",
        "Dahlmeier, an experienced mountaineer, represented Germany at two Winter Olympics, winning two golds and one bronze medal in Pyeongchang in 2018.",
        "She was the first woman to win the sprint and pursuit events at the same Games and won a further 15 medals, including seven gold, across five World Championships before retiring from competition in May 2019."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/articles/cn41r0rkrklo",
      "main_category": "sport",
      "detailed_category": "winter-sports",
      "topic": "Former Norway skier dies after lightning strike",
      "content": [
        "Olympic medallist and former Norway skier Audun Groenvold has died aged 49 after being struck by lightning.The Norwegian Ski Federation (NSF) said Groenvold was struck by lightning during a cabin trip and, despite being taken to hospital, died on Tuesday night.Groenvold was part of Norway's Alpine skiing team before moving into freestyle and ski cross.He won ski cross bronze at the 2010 Winter Olympics in Vancouver.Following his professional skiing career, the NSF said Groenvold went on to become a national team coach and NSF board member.They federation said that it had lost \"an outstanding athlete\" and \"prominent figure\", adding \"our thoughts go out to Audun's family, friends and everyone who was close to him\".",
        "Groenvold won Olympic ski cross bronze in 2010",
        "Olympic medallist and former Norway skier Audun Groenvold has died aged 49 after being struck by lightning.",
        "The Norwegian Ski Federation (NSF) said Groenvold was struck by lightning during a cabin trip and, despite being taken to hospital, died on Tuesday night.",
        "Groenvold was part of Norway's Alpine skiing team before moving into freestyle and ski cross.",
        "He won ski cross bronze at the 2010 Winter Olympics in Vancouver.",
        "Following his professional skiing career, the NSF said Groenvold went on to become a national team coach and NSF board member.",
        "They federation said that it had lost \"an outstanding athlete\" and \"prominent figure\", adding \"our thoughts go out to Audun's family, friends and everyone who was close to him\"."
      ]
    }
  ]
}