{
  "scraped_at": "2025-10-27T18:56:59.797546",
  "total_articles": 9,
  "category": "judo",
  "articles_per_category": 100,
  "articles": [
    {
      "url": "https://www.bbc.com/sport/judo/articles/c98lvjrdyv0o",
      "main_category": "sport",
      "detailed_category": "judo",
      "topic": "Powell appointment 'fantastic' for Wales judo",
      "content": [
        "Natalie Powell's appointment to guide Wales' Commonwealth Games judo squad has been described as 'fantastic' by national coach Michael Horley.The former World number one has taken on the role as Commonwealth Games performance coach 11 months before the 2026 Glasgow games.Powell, 34, retired in 2024 after a career in which she won bronze medals at both World and European Championships, along with gold at the the 2014 Commonwealths - also staged in Glasgow.She also competed at two Olympic Games in Tokyo and Rio, where she finished seventh. \"This is a fantastic appointment for Welsh judo,\" said national coach Michael Horley.\"Natalie's experience on and off the mat will bring huge value to the programme.\"Our athletes will really benefit from her insight and I'm looking forward to working closely with her as we prepare for Glasgow 2026.\"",
        "Starting at the Irfon Judo Club in Builth Wells, Powell made her debut on the global stage at the 2012 Abu Dhabi Grand Prix, where she won silver.She went on to win nine Grand Slam medals on the International Judo Federation (IJF) World Tour, along with 21 Grand Prix medals and six at global championships.In 2017 she became Great Britain's first female world number one, topping the -78kg rankings following a gold medal at the Abu Dhabi Grand Slam.Powell, who also works as a pathway and high performance officer at Wales Golf, says she is excited to take up her new role.\"There's so much potential in the group of athletes,\" she added, \"and I'm looking forward to sharing my experience and supporting the team on their journey.\"",
        "Natalie Powell claimed bronze at three consecutive European Championships, from 2016-2018, along with a World Championship bronze in 2017",
        "Natalie Powell's appointment to guide Wales' Commonwealth Games judo squad has been described as 'fantastic' by national coach Michael Horley.",
        "The former World number one has taken on the role as Commonwealth Games performance coach 11 months before the 2026 Glasgow games.",
        "Powell, 34, retired in 2024 after a career in which she won bronze medals at both World and European Championships, along with gold at the the 2014 Commonwealths - also staged in Glasgow.",
        "She also competed at two Olympic Games in Tokyo and Rio, where she finished seventh.",
        "\"This is a fantastic appointment for Welsh judo,\" said national coach Michael Horley.",
        "\"Natalie's experience on and off the mat will bring huge value to the programme.",
        "\"Our athletes will really benefit from her insight and I'm looking forward to working closely with her as we prepare for Glasgow 2026.\"",
        "Olympian Powell swaps judo for golf",
        "Former world judo number one Powell retires",
        "Starting at the Irfon Judo Club in Builth Wells, Powell made her debut on the global stage at the 2012 Abu Dhabi Grand Prix, where she won silver.",
        "She went on to win nine Grand Slam medals on the International Judo Federation (IJF) World Tour, along with 21 Grand Prix medals and six at global championships.",
        "In 2017 she became Great Britain's first female world number one, topping the -78kg rankings following a gold medal at the Abu Dhabi Grand Slam.",
        "Powell, who also works as a pathway and high performance officer at Wales Golf, says she is excited to take up her new role.",
        "\"There's so much potential in the group of athletes,\" she added, \"and I'm looking forward to sharing my experience and supporting the team on their journey.\""
      ]
    },
    {
      "url": "https://www.bbc.com/sport/articles/c8xvql1ydzko",
      "main_category": "sport",
      "detailed_category": "judo",
      "topic": "Olympian Powell swaps judo for golf",
      "content": [
        "As sporting transitions go, swapping judo for golf is not the most obvious change that springs to mind - and Natalie Powell acknowledges that.The 34-year-old former world judo number one works as a pathway and high performance officer at Wales Golf, the national governing body of amateur golf in Wales.Quite a contrast from her previous sporting life, but Merthyr-born Powell knows a thing or two about elite sport.As an Olympian, as well as a world and European medallist, she has been tasked with helping push through the next generation of Welsh golfers, though admits her own skill on the course is still a work in progress.\"I've never been a golfer, but I am closer to being a golfer now than I ever was,\" said Powell.\"I've been to the driving range a few times in the last few weeks and we actually had a wellbeing day with the Wales Golf team which was really nice, my first experience on a proper golf course. I can definitely see how people get the bug for it.\"Powell started with Wales Golf 10 months ago and said she is \"really enjoying it\". \"It's such a great environment, the sport is great, the people are great and it's nice to do something different after doing judo for so many years,\" she added.\"It's definitely not something I would have predicted maybe a year, even 18 months ago. It is such a great second sport. \"With judo I couldn't fight forever, my body wouldn't allow me to do that, whereas with golf it's not so taxing on the body and a lot more taxing on the mind which I think makes it a perfect transition from high intensity sport\".",
        "In 2017, Powell became the first female British judoka to be ranked number one in the world by winning a gold medal at the Abu Dhabi judo Grand Slam.Powell sees this as her crowning achievement, in addition to winning Commonwealth gold at the Glasgow games in 2014, as well as world and European bronze medals.And while the passion for judo still burns brightly - she coaches youngsters at the Cardiff Judo Academy - Powell remembers the moment when she realised that her competitive career was coming to an end.It was the Tokyo Olympics in 2021, the \"Covid games\" which should have taken place a year prior, where Powell failed to achieve a podium place.\"I think the transition probably started after Tokyo. I put my heart and soul into Tokyo and it didn't pan out the way I'd hoped,\" said Powell.\"The year following Tokyo, I was very much one foot in, one foot out and I probably didn't want it as much as I previously had done. It had always been judo, judo, judo, that was it, that was life and I think after Tokyo, I had the kind of realisation that maybe it's time to step into something else.\"Having achieved a degree in biomedical science and a masters in advanced coaching Powell said her focus was shifting.\"I was starting to get experiences in terms of doing talks in schools and starting to broaden my horizons outside of the judo and then I was very fortunate with my coach Darren [Warner], he was always thinking about that too, so he was always thinking how he could help me and having the conversations early.\"I think by the time it came I was very much ready to make that step. For 26 years my life has very much been judo, and in the last 15 it's been intensely judo, so the transition was definitely scary but I was really lucky that I had such great support from my coach, my family and my friends.\"I coach Cardiff Judo Academy and run classes two or three nights a week so it's really good and really nice to still be connected with the judo community because that's given me so much\".",
        "Powell has joined Wales Golf at an exciting time. The female game in Wales will no doubt be boosted by the arrival of the world's best players in July, with the Women's Open at Royal Porthcawl.With Porthcawl member Darcey Harry qualifying for the tournament by winning the 2025 Belgian Ladies Open, Powell and her Wales Golf colleagues hope the 22-year-old is the first of many promising young Welsh talents coming through.\"It's incredible and Darcy winning [in Belgium] that's just the icing on the cake really. To see her perform in Porthcawl is going to be incredible for golf, Wales golf and everybody involved really,\" enthused Powell who says she has three different projects.\"We're trying to do a coaching programme at the moment to upskill the level of coaches in the country, which is really exciting. \"Putting a pathway in place to give the kids the best chance of getting from club level right up to the elite Welsh national team.\"And then acting as a mentor with some of the former players and hopefully helping them with my experience and giving them someone to talk to and get advice from.\"I think it's just really nice to give back and not escape the sporting world because that's always been my passion\".",
        "Natalie Powell is a former world judo number one",
        "As sporting transitions go, swapping judo for golf is not the most obvious change that springs to mind - and Natalie Powell acknowledges that.",
        "The 34-year-old former world judo number one works as a pathway and high performance officer at Wales Golf, the national governing body of amateur golf in Wales.",
        "Quite a contrast from her previous sporting life, but Merthyr-born Powell knows a thing or two about elite sport.",
        "As an Olympian, as well as a world and European medallist, she has been tasked with helping push through the next generation of Welsh golfers, though admits her own skill on the course is still a work in progress.",
        "\"I've never been a golfer, but I am closer to being a golfer now than I ever was,\" said Powell.",
        "\"I've been to the driving range a few times in the last few weeks and we actually had a wellbeing day with the Wales Golf team which was really nice, my first experience on a proper golf course. I can definitely see how people get the bug for it.\"",
        "Powell started with Wales Golf 10 months ago and said she is \"really enjoying it\".",
        "\"It's such a great environment, the sport is great, the people are great and it's nice to do something different after doing judo for so many years,\" she added.",
        "\"It's definitely not something I would have predicted maybe a year, even 18 months ago. It is such a great second sport.",
        "\"With judo I couldn't fight forever, my body wouldn't allow me to do that, whereas with golf it's not so taxing on the body and a lot more taxing on the mind which I think makes it a perfect transition from high intensity sport\".",
        "In 2017, Powell became the first female British judoka to be ranked number one in the world by winning a gold medal at the Abu Dhabi judo Grand Slam.",
        "Powell sees this as her crowning achievement, in addition to winning Commonwealth gold at the Glasgow games in 2014, as well as world and European bronze medals.",
        "And while the passion for judo still burns brightly - she coaches youngsters at the Cardiff Judo Academy - Powell remembers the moment when she realised that her competitive career was coming to an end.",
        "It was the Tokyo Olympics in 2021, the \"Covid games\" which should have taken place a year prior, where Powell failed to achieve a podium place.",
        "\"I think the transition probably started after Tokyo. I put my heart and soul into Tokyo and it didn't pan out the way I'd hoped,\" said Powell.",
        "\"The year following Tokyo, I was very much one foot in, one foot out and I probably didn't want it as much as I previously had done. It had always been judo, judo, judo, that was it, that was life and I think after Tokyo, I had the kind of realisation that maybe it's time to step into something else.\"",
        "Having achieved a degree in biomedical science and a masters in advanced coaching Powell said her focus was shifting.",
        "\"I was starting to get experiences in terms of doing talks in schools and starting to broaden my horizons outside of the judo and then I was very fortunate with my coach Darren [Warner], he was always thinking about that too, so he was always thinking how he could help me and having the conversations early.",
        "\"I think by the time it came I was very much ready to make that step. For 26 years my life has very much been judo, and in the last 15 it's been intensely judo, so the transition was definitely scary but I was really lucky that I had such great support from my coach, my family and my friends.",
        "\"I coach Cardiff Judo Academy and run classes two or three nights a week so it's really good and really nice to still be connected with the judo community because that's given me so much\".",
        "Powell has joined Wales Golf at an exciting time. The female game in Wales will no doubt be boosted by the arrival of the world's best players in July, with the Women's Open at Royal Porthcawl.",
        "With Porthcawl member Darcey Harry qualifying for the tournament by winning the 2025 Belgian Ladies Open, Powell and her Wales Golf colleagues hope the 22-year-old is the first of many promising young Welsh talents coming through.",
        "\"It's incredible and Darcy winning [in Belgium] that's just the icing on the cake really. To see her perform in Porthcawl is going to be incredible for golf, Wales golf and everybody involved really,\" enthused Powell who says she has three different projects.",
        "\"We're trying to do a coaching programme at the moment to upskill the level of coaches in the country, which is really exciting.",
        "\"Putting a pathway in place to give the kids the best chance of getting from club level right up to the elite Welsh national team.",
        "\"And then acting as a mentor with some of the former players and hopefully helping them with my experience and giving them someone to talk to and get advice from.",
        "\"I think it's just really nice to give back and not escape the sporting world because that's always been my passion\"."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/judo/articles/cn4wm07v0z2o",
      "main_category": "sport",
      "detailed_category": "judo",
      "topic": "British Judo suspends coach over bullying allegations",
      "content": [
        "British Judo coach Jamie Johnson has been temporarily suspended pending the results of an independent investigation into bullying allegations.Johnson, who is a five-time national champion, oversaw the women's team at the 2024 Olympics in Paris.\"British Judo takes any allegations of any form of inappropriate behaviour extremely seriously,\" British Judo chief executive Andrew Scoular said.\"All of our athletes are encouraged to report any safeguarding concerns, including any instances of bullying via our internal teams, which are then fully investigated using external independent investigators.\"He added: \"We will not be commenting on any ongoing independent investigations.\"Johnson previously faced an allegation of bullying from former British judoka Lubjana Piovesana, but the 52-year-old said he was cleared of any misconduct.\"The historical investigation was upheld five years ago and no wrongdoing was found,\" Johnson said in a statement.\"The recent allegations are ongoing, so I am unable to comment at this time, but one thing I will say is, there are two sides to every story.\"",
        "British Judo coach Jamie Johnson won five national titles between 1993 and 2000",
        "British Judo coach Jamie Johnson has been temporarily suspended pending the results of an independent investigation into bullying allegations.",
        "Johnson, who is a five-time national champion, oversaw the women's team at the 2024 Olympics in Paris.",
        "\"British Judo takes any allegations of any form of inappropriate behaviour extremely seriously,\" British Judo chief executive Andrew Scoular said.",
        "\"All of our athletes are encouraged to report any safeguarding concerns, including any instances of bullying via our internal teams, which are then fully investigated using external independent investigators.\"",
        "He added: \"We will not be commenting on any ongoing independent investigations.\"",
        "Johnson previously faced an allegation of bullying from former British judoka Lubjana Piovesana, but the 52-year-old said he was cleared of any misconduct.",
        "\"The historical investigation was upheld five years ago and no wrongdoing was found,\" Johnson said in a statement.",
        "\"The recent allegations are ongoing, so I am unable to comment at this time, but one thing I will say is, there are two sides to every story.\""
      ]
    },
    {
      "url": "https://www.bbc.com/sport/judo/articles/c5yr2pplre7o",
      "main_category": "sport",
      "detailed_category": "judo",
      "topic": "From Trinidad to Alloa via Hungary & Buckingham Palace",
      "content": [
        "It is going to be quite the week for Gabriella Wood.First thing on Monday, she flies to London to be at Buckingham Palace as Trinidad and Tobago's representative in the first leg of the King's Baton Relay.That night, the 27-year-old judoka returns to Scotland and will be back coaching kids at Judo Club Esprit in Alloa the next day.Then the week will conclude with Wood hoping to complete a hat-trick of British University Championship successes in Birmingham in the +78 kg division.\"It's going to be some week. I'm just going to try and enjoy it all,\" she says.The events at Buckingham Palace start the official countdown to the Glasgow 2026 Commonwealth Games, which begins in 500 days.Each of the 74 competing nations will have their own version of the baton, with University of Stirling student Wood invited to represent her Caribbean homeland.\"It is definitely not something I thought I'd be doing in my lifetime,\" adds Wood, who admits to still being a little in the dark about what her relay duties will involve. \"I'm just going to turn up, be given a baton, then walk around and see what happens. \"I thought it was going to be a dress code, but they said there's tracksuits we'll wear for the day, so that makes my life easy. I hope I get to keep it as a souvenir.\"",
        "Having the tracksuit is one thing, but what Wood really covets is a Commonwealth Games medal.After first taking up judo in primary school and quickly making her name in the sport, she stopped in Edinburgh to visit family on the way home from a training camp in Hungary in late 2020 - and never left.Wood moved to Alloa, earned a place studying sport in Stirling, and developed a love of steak pie, all while becoming Trinidad and Tobago's first female Olympic Games judoka in Tokyo.She finished fifth at the Birmingham Commonwealth Games in 2022 after coming through the repechage - losing to Scotland's double gold medallist Sarah Adlington in the opening round - but is determined to improve upon that in 2026.\"A medal is definitely the target in Glasgow,\" says Wood, who narrowly missed out on the Paris Olympics last summer. \"Fifth place gutted me. Me, my training partner, my coach - we couldn't even talk to each other.\"The kids at the club pretty much every week ask 'are you going to fight in Glasgow, I want to come and see you'. \"So a medal this time would be huge, in front of the kids and the judo community that I've been part of for so long. That would make it just that bit more special.\"",
        "Gabriella Wood finished fifth in the 2022 Commonwealth Games",
        "It is going to be quite the week for Gabriella Wood.",
        "First thing on Monday, she flies to London to be at Buckingham Palace as Trinidad and Tobago's representative in the first leg of the King's Baton Relay.",
        "That night, the 27-year-old judoka returns to Scotland and will be back coaching kids at Judo Club Esprit in Alloa the next day.",
        "Then the week will conclude with Wood hoping to complete a hat-trick of British University Championship successes in Birmingham in the +78 kg division.",
        "\"It's going to be some week. I'm just going to try and enjoy it all,\" she says.",
        "The events at Buckingham Palace start the official countdown to the Glasgow 2026 Commonwealth Games, which begins in 500 days.",
        "Each of the 74 competing nations will have their own version of the baton, with University of Stirling student Wood invited to represent her Caribbean homeland.",
        "\"It is definitely not something I thought I'd be doing in my lifetime,\" adds Wood, who admits to still being a little in the dark about what her relay duties will involve.",
        "\"I'm just going to turn up, be given a baton, then walk around and see what happens.",
        "\"I thought it was going to be a dress code, but they said there's tracksuits we'll wear for the day, so that makes my life easy. I hope I get to keep it as a souvenir.\"",
        "Mile races will be among more than 200 Glasgow 2026 golds",
        "'Big names hugely positive about Commonwealth Games'",
        "Why is it so special to be part of Team Scotland?",
        "Having the tracksuit is one thing, but what Wood really covets is a Commonwealth Games medal.",
        "After first taking up judo in primary school and quickly making her name in the sport, she stopped in Edinburgh to visit family on the way home from a training camp in Hungary in late 2020 - and never left.",
        "Wood moved to Alloa, earned a place studying sport in Stirling, and developed a love of steak pie, all while becoming Trinidad and Tobago's first female Olympic Games judoka in Tokyo.",
        "She finished fifth at the Birmingham Commonwealth Games in 2022 after coming through the repechage - losing to Scotland's double gold medallist Sarah Adlington in the opening round - but is determined to improve upon that in 2026.",
        "\"A medal is definitely the target in Glasgow,\" says Wood, who narrowly missed out on the Paris Olympics last summer. \"Fifth place gutted me. Me, my training partner, my coach - we couldn't even talk to each other.",
        "\"The kids at the club pretty much every week ask 'are you going to fight in Glasgow, I want to come and see you'.",
        "\"So a medal this time would be huge, in front of the kids and the judo community that I've been part of for so long. That would make it just that bit more special.\""
      ]
    },
    {
      "url": "https://www.bbc.com/sport/olympics/articles/cd7e3xlwgeno",
      "main_category": "sport",
      "detailed_category": "judo",
      "topic": "'They shot my dad in front of me' - African refugees eye Olympics",
      "content": [
        "A scar on the right side of James Lokidichi's head serves as a permanent reminder of the conflict he fled when he was a child, carrying his younger brother with him.Yet pain remains buried deeper inside as, holding back tears, he recounts the day in 2011 that family members were killed by armed men and he was forced from his home in what is now South Sudan.\"They shot my dad and my uncle in front of me,\" the 23-year-old told BBC Sport Africa.\"They burnt the house and I got burnt too while I was crying for my dad and uncle. They shot my mum in the hand. She ran away and left us.\"I grabbed my brother when my mum ran away. They [the fighters] said 'Leave these boys'.\"The pair have not seen their mother since.",
        "The brothers eventually found their way to neighbouring Kenya, and Lokidichi is now one of almost 300,000 residents in the Kakuma Refugee Camp., externalAfter his childhood trauma, he believes sport can be a stepping stone to a better life and is chasing a place in the Refugee Olympic Team (ROT).The middle-distance runner was among over 100 attendees at trials at the Lornah Kiplagat Sports Academy on the outskirts of Iten last week, when the International Olympic Committee (IOC) was scouting talented runners, judokas and taekwondo athletes to support via scholarships.Lokidichi, inspired by Kenyan marathon great Eliud Kipchoge, hopes to provide motivation for fellow residents in the refugee camp in the north-west of the country.\"When we get successful, we will go assist those who remained behind. We will advise others in the camp,\" he said.\"We will demonstrate to them there is help and hope for the future. We keep on fighting together as a team.\"",
        "The ROT made their inaugural appearance at the Rio de Janeiro Olympic Games in 2016.Cameroon-born Cindy Ngamba became the team's first medal winner when she took bronze in the women's middleweight boxing at Paris 2024.A refugee squad is now being assembled for the Dakar 2026 Youth Olympics - the first major IOC event to be staged on African soil.Teenager Laurence Namukiza hopes to secure a place among that group, and her three taekwondo victories at the trials could help her achieve that aim.The 15-year-old is a student at a school in Kakuma that was established by and named after Hollywood actor Angelina Jolie, a United Nations Refugee Agency (UNHCR) goodwill ambassador.The hardship of life in the camp - where monthly handouts to residents were reduced from 1,500 Kenyan shillings ($11.60, £9.20) to 950 Ksh ($7.40, £5.80) per month - compelled Namukiza to take up the discipline when it was introduced to her school in the middle of last year.\"I promised myself I will perform well so that I am able to assist my family,\" she said.\"You will find a family of 16 but the food distributed is for five people.\"Getting work is difficult if you do not have a formal education and certificates. My mum [is] suffering to feed us.\"When I am successful, I will get them out of Kakuma to a better place.\"",
        "Namukiza was still a baby when her family were forced to leave their home in Uvira, DR Congo, in 2010.The fourth-born in a family of nine children, taekwondo has instilled the values of discipline and resilience.It has also helped her challenge gender stereotypes and provided self-defence skills.\"I remember people telling me 'Why are you taking up this sport? It's for boys',\" she recalled.\"With taekwondo training, now I know how to fight. I believe in myself and I can protect myself against anyone who wants to harm me, and I can also help other girls in Kakuma.\"But I am here to prove that sports is for all.\"",
        "The ROT trials were held in collaboration with Kenya's National Olympic Committee (NOC), Athletics Kenya and the UNHCR as well as World Athletics and corresponding judo and taekwondo federations.A range of emotions were on show amid a competitive atmosphere, with anticipation, anxiety and resilience etched on faces.There was also an overwhelming sense of freedom.\"When we remove them for one day or two days out of the Kakuma camp, they feel appreciated and validated,\" Paul Tergat, the president of Kenya's NOC, told BBC Sport Africa.\"That is why it's very important to give them the opportunity and exposure.\"Former 800m world champion Janeth Jepkosgei, now an ROT coach with World Athletics, is well aware of the unifying power of sport.\"I would like to take these athletes to the next Olympics and I would love to see them reach the finals,\" the 41-year-old said.\"We would like to change that sad moment to happiness when they cross the line and be winners.\"The latest figures released by the UNHCR show that Kenya is home to over 820,000 registered refugees and asylum seekers.With a civil war continuing in Sudan and fighting escalating in eastern DRC, that figure could grow.\"No-one wants to be a refugee,\" Tergat said.\"We want to use sports to give them dignity and honour. They are our brothers and sisters, so we need to give them this opportunity to grow their talent and encourage them.\"At the end of the trials, the winners were recognised but one thing was clear - that victory did not mean automatic selection for an IOC scholarship.The athletes returned to Kakuma and wait to see whether fate will shine on them.Until then, they are holding on to hope.",
        "After fleeing conflict in South Sudan, James Lokidichi hopes to race over 1500m or 5,000m at the Los Angeles 2028 Olympic Games",
        "A scar on the right side of James Lokidichi's head serves as a permanent reminder of the conflict he fled when he was a child, carrying his younger brother with him.",
        "Yet pain remains buried deeper inside as, holding back tears, he recounts the day in 2011 that family members were killed by armed men and he was forced from his home in what is now South Sudan.",
        "\"They shot my dad and my uncle in front of me,\" the 23-year-old told BBC Sport Africa.",
        "\"They burnt the house and I got burnt too while I was crying for my dad and uncle. They shot my mum in the hand. She ran away and left us.",
        "\"I grabbed my brother when my mum ran away. They [the fighters] said 'Leave these boys'.\"",
        "The pair have not seen their mother since.",
        "The brothers eventually found their way to neighbouring Kenya, and Lokidichi is now one of almost 300,000 residents in the Kakuma Refugee Camp., external",
        "After his childhood trauma, he believes sport can be a stepping stone to a better life and is chasing a place in the Refugee Olympic Team (ROT).",
        "The middle-distance runner was among over 100 attendees at trials at the Lornah Kiplagat Sports Academy on the outskirts of Iten last week, when the International Olympic Committee (IOC) was scouting talented runners, judokas and taekwondo athletes to support via scholarships.",
        "Lokidichi, inspired by Kenyan marathon great Eliud Kipchoge, hopes to provide motivation for fellow residents in the refugee camp in the north-west of the country.",
        "\"When we get successful, we will go assist those who remained behind. We will advise others in the camp,\" he said.",
        "\"We will demonstrate to them there is help and hope for the future. We keep on fighting together as a team.\"",
        "Laurence Namukiza, originally from DR Congo, wants to represent the Refugee Olympic Team in Senegal next year and also aspires to become a pilot",
        "The ROT made their inaugural appearance at the Rio de Janeiro Olympic Games in 2016.",
        "Cameroon-born Cindy Ngamba became the team's first medal winner when she took bronze in the women's middleweight boxing at Paris 2024.",
        "A refugee squad is now being assembled for the Dakar 2026 Youth Olympics - the first major IOC event to be staged on African soil.",
        "Teenager Laurence Namukiza hopes to secure a place among that group, and her three taekwondo victories at the trials could help her achieve that aim.",
        "The 15-year-old is a student at a school in Kakuma that was established by and named after Hollywood actor Angelina Jolie, a United Nations Refugee Agency (UNHCR) goodwill ambassador.",
        "The hardship of life in the camp - where monthly handouts to residents were reduced from 1,500 Kenyan shillings ($11.60, £9.20) to 950 Ksh ($7.40, £5.80) per month - compelled Namukiza to take up the discipline when it was introduced to her school in the middle of last year.",
        "\"I promised myself I will perform well so that I am able to assist my family,\" she said.",
        "\"You will find a family of 16 but the food distributed is for five people.",
        "\"Getting work is difficult if you do not have a formal education and certificates. My mum [is] suffering to feed us.",
        "\"When I am successful, I will get them out of Kakuma to a better place.\"",
        "Namukiza won all three of her matches in the girls' 54kg category with calculated attacks",
        "Namukiza was still a baby when her family were forced to leave their home in Uvira, DR Congo, in 2010.",
        "The fourth-born in a family of nine children, taekwondo has instilled the values of discipline and resilience.",
        "It has also helped her challenge gender stereotypes and provided self-defence skills.",
        "\"I remember people telling me 'Why are you taking up this sport? It's for boys',\" she recalled.",
        "\"With taekwondo training, now I know how to fight. I believe in myself and I can protect myself against anyone who wants to harm me, and I can also help other girls in Kakuma.",
        "\"But I am here to prove that sports is for all.\"",
        "ROT scouts ran the rule over taekwondo and judo contests as well as races on the track in Kamariny on the outskirts of Iten",
        "The ROT trials were held in collaboration with Kenya's National Olympic Committee (NOC), Athletics Kenya and the UNHCR as well as World Athletics and corresponding judo and taekwondo federations.",
        "A range of emotions were on show amid a competitive atmosphere, with anticipation, anxiety and resilience etched on faces.",
        "There was also an overwhelming sense of freedom.",
        "\"When we remove them for one day or two days out of the Kakuma camp, they feel appreciated and validated,\" Paul Tergat, the president of Kenya's NOC, told BBC Sport Africa.",
        "\"That is why it's very important to give them the opportunity and exposure.\"",
        "Former 800m world champion Janeth Jepkosgei, now an ROT coach with World Athletics, is well aware of the unifying power of sport.",
        "\"I would like to take these athletes to the next Olympics and I would love to see them reach the finals,\" the 41-year-old said.",
        "\"We would like to change that sad moment to happiness when they cross the line and be winners.\"",
        "The latest figures released by the UNHCR show that Kenya is home to over 820,000 registered refugees and asylum seekers.",
        "With a civil war continuing in Sudan and fighting escalating in eastern DRC, that figure could grow.",
        "\"No-one wants to be a refugee,\" Tergat said.",
        "\"We want to use sports to give them dignity and honour. They are our brothers and sisters, so we need to give them this opportunity to grow their talent and encourage them.\"",
        "At the end of the trials, the winners were recognised but one thing was clear - that victory did not mean automatic selection for an IOC scholarship.",
        "The athletes returned to Kakuma and wait to see whether fate will shine on them.",
        "Until then, they are holding on to hope.",
        "The orphaned refugee planning to make Olympic history",
        "Refugees competed as 'equal human beings'"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/judo/articles/cn8xn35rg8do",
      "main_category": "sport",
      "detailed_category": "judo",
      "topic": "'Judo saved me' - Paralympic gold medallist Skelley retires",
      "content": [
        "Two-time Paralympic medallist Chris Skelley has announced his retirement from judo.The 31-year-old, who is visually impaired, won gold in the -100kg event in Tokyo in 2021 and followed that up with bronze in the +90kg division in Paris last year.\"It's a tough decision but the right decision\" he said. \"I've had an amazing time doing the sport that I love.\"Judo has saved me. It has given me purpose and the life I have always wanted and I will always be grateful.\"Skelley, who was born in Nottingham but raised in Hull, took up judo aged five. He started to lose his sight aged 17, forcing him to end his apprenticeship as a mechanic.He joined the British Judo set-up aged 19 and won European and world titles before his Paralympic triumph.",
        "Skelley made his Paralympic debut in Rio in 2016",
        "Two-time Paralympic medallist Chris Skelley has announced his retirement from judo.",
        "The 31-year-old, who is visually impaired, won gold in the -100kg event in Tokyo in 2021 and followed that up with bronze in the +90kg division in Paris last year.",
        "\"It's a tough decision but the right decision\" he said. \"I've had an amazing time doing the sport that I love.",
        "\"Judo has saved me. It has given me purpose and the life I have always wanted and I will always be grateful.\"",
        "Skelley, who was born in Nottingham but raised in Hull, took up judo aged five. He started to lose his sight aged 17, forcing him to end his apprenticeship as a mechanic.",
        "He joined the British Judo set-up aged 19 and won European and world titles before his Paralympic triumph."
      ]
    },
    {
      "url": "https://www.bbc.com/sport/judo/articles/c4g5l43l8q9o",
      "main_category": "sport",
      "detailed_category": "judo",
      "topic": "Former world judo number one Powell retires",
      "content": [
        "Wales' most successful judoka, Natalie Powell, has brought an end to a career which saw her win medals at every major championship other than the Olympic Games.Powell, 33, won bronze medals at both World and European Championships, along with gold at the the 2014 Commonwealth Games.In 2017 she became Great Britain's first female world number one, topping the  -78kg rankings following a gold medal at the Abu Dhabi Grand Slam.She finished seventh at the 2016 Olympic Games in Rio and also competed at the Tokyo Olympics in 2021.\"Having spent over 20 incredible years travelling the world as part of the British and Welsh Judo team, the time has come for me to hang up my judogi and step into the next chapter,\" said Powell.",
        "Starting at the Irfon Judo Club in Builth Wells, Powell made her debut on the global stage at the 2012 Abu Dhabi Grand Prix, where she won silver.She went on to win nine Grand Slam medals on the International Judo Federation (IJF) World Tour, along with 21 Grand Prix medals and six at global championships.She won three European bronzes and another in the World Championship as well as her 2014 Glasgow Commonwealth gold, plus a silver for Wales in Birmingham 2022. \"Putting my journey into words feels impossible,\" Powell added. \"From being a kid dreaming of going to the Olympics one day, to stepping on the mat in Rio and Tokyo.\"From the highs of winning World and European medals to the training days (some of which I'd rather forget) that pushed me to my physical and mental limits. \"Judo has taught me that I’m capable of much more than I ever believed. It has given me experiences and lifelong friendships far beyond what I ever dreamed.\"",
        "Powell thanked all her coaches and British Judo staff, paying particular tribute to four-time Olympian Kate Howey MBE, who worked with her throughout her career.\"A special thank you to Kate,\" she said. \"You have been there for me no matter what, you’ve picked me up when I’ve been at my lowest and celebrated with me at my highest. \"Both on and off the mat you’ve supported me and that is a big part of why I can look back on my career so fondly.\"Howey, the only British woman to have won two Olympic judo medals, said: “I have worked with Natalie for a very long time and have had the pleasure of coaching her when she won various World and European medals and ultimately [at] two Olympic Games.“There have been many highs and some lows in the past 12 years but ultimately through it all, good and bad, I feel privileged to have been part of her judo journey. I wish her all the best for whatever is next in her life.”",
        "Natalie Powell claimed bronze at three consecutive European Championships, from 2016-2018, along with a World Championship bronze in 2017",
        "Wales' most successful judoka, Natalie Powell, has brought an end to a career which saw her win medals at every major championship other than the Olympic Games.",
        "Powell, 33, won bronze medals at both World and European Championships, along with gold at the the 2014 Commonwealth Games.",
        "In 2017 she became Great Britain's first female world number one, topping the  -78kg rankings following a gold medal at the Abu Dhabi Grand Slam.",
        "She finished seventh at the 2016 Olympic Games in Rio and also competed at the Tokyo Olympics in 2021.",
        "\"Having spent over 20 incredible years travelling the world as part of the British and Welsh Judo team, the time has come for me to hang up my judogi and step into the next chapter,\" said Powell.",
        "Starting at the Irfon Judo Club in Builth Wells, Powell made her debut on the global stage at the 2012 Abu Dhabi Grand Prix, where she won silver.",
        "She went on to win nine Grand Slam medals on the International Judo Federation (IJF) World Tour, along with 21 Grand Prix medals and six at global championships.",
        "She won three European bronzes and another in the World Championship as well as her 2014 Glasgow Commonwealth gold, plus a silver for Wales in Birmingham 2022.",
        "\"Putting my journey into words feels impossible,\" Powell added.",
        "\"From being a kid dreaming of going to the Olympics one day, to stepping on the mat in Rio and Tokyo.",
        "\"From the highs of winning World and European medals to the training days (some of which I'd rather forget) that pushed me to my physical and mental limits.",
        "\"Judo has taught me that I’m capable of much more than I ever believed. It has given me experiences and lifelong friendships far beyond what I ever dreamed.\"",
        "Powell was unable to defend her 2014 gold when judo was left out of the Gold Coast Commonwealth Games, but went on to win silver in 2022",
        "Powell thanked all her coaches and British Judo staff, paying particular tribute to four-time Olympian Kate Howey MBE, who worked with her throughout her career.",
        "\"A special thank you to Kate,\" she said.",
        "\"You have been there for me no matter what, you’ve picked me up when I’ve been at my lowest and celebrated with me at my highest.",
        "\"Both on and off the mat you’ve supported me and that is a big part of why I can look back on my career so fondly.\"",
        "Howey, the only British woman to have won two Olympic judo medals, said: “I have worked with Natalie for a very long time and have had the pleasure of coaching her when she won various World and European medals and ultimately [at] two Olympic Games.",
        "“There have been many highs and some lows in the past 12 years but ultimately through it all, good and bad, I feel privileged to have been part of her judo journey. I wish her all the best for whatever is next in her life.”"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/judo/articles/c9d1w06vd58o",
      "main_category": "sport",
      "detailed_category": "judo",
      "topic": "Powell wins judo silver after 'going through hell'",
      "content": [
        "Britain’s Dan Powell said his first Paralympic judo medal was a reward for going through \"hell\" over the past 16 years.The 33-year-old, who made his debut at London 2012 and then competed at Tokyo 2020, lost by ippon to Brazil’s Arthur Cavalcante da Silva in the -90kg J1 final in Paris with one minute and 12 seconds of the bout remaining.But he was still delighted to come away from his third Games with a medal.\"This is 16 years in the making,\" he said.\"It has been hell - winning, losing, breaking my body, breaking my head and coming back again - and doing it today means so much.\"Later, Chris Skelley won bronze in the +90kg J2 category, to add to the gold he won in the 100kg event in Tokyo.",
        "Liverpudlian Powell is an all-around sportsman who shot to fame in 2018 when he appeared on ITV show Ninja Warrior UK, becoming the first person with a visual impairment to take part.After finishing seventh in Para-judo in Tokyo, he took up rowing, impressing there too.But with the judo classification changing to include separate divisions for blind and visually-impaired fighters in Paris, he made the decision to concentrate his efforts on it again.\"This a million per cent justifies the decision to come back to the sport,\" he said.\"I love fighting, I love judo, I love competing, and being able to fly around the world and compete is the most amazing feeling, and especially to be watched here by my little boy, Edward.\"As well as the silver medal, which sees him surpass the achievements of his father Terry, who won bronze medals in judo at the Seoul and Atlanta Games in 1988 and 96 respectively, he will also take pride from his dramatic golden-point semi-final win over French legend and home-crowd favourite Cyril Jonard.\"I loved beating the Frenchman in his back yard,\" Powell said. \"I have a lot of respect for the guy. He is a 10-time world champion. But for me, to be able to do that is why I do it.\"It was difficult physically in the final. I popped my rib in the semi-final so I had to shrug that off and calm down after that and not let my body get stiff and recover in a couple of hours.\"That is the hardest part, so I’m delighted I could come back, get warmed up and ready and give a show for myself in the final and win another medal for the Powell household.\"",
        "Powell also spent time as a Para-athlete",
        "Britain’s Dan Powell said his first Paralympic judo medal was a reward for going through \"hell\" over the past 16 years.",
        "The 33-year-old, who made his debut at London 2012 and then competed at Tokyo 2020, lost by ippon to Brazil’s Arthur Cavalcante da Silva in the -90kg J1 final in Paris with one minute and 12 seconds of the bout remaining.",
        "But he was still delighted to come away from his third Games with a medal.",
        "\"This is 16 years in the making,\" he said.",
        "\"It has been hell - winning, losing, breaking my body, breaking my head and coming back again - and doing it today means so much.\"",
        "Later, Chris Skelley won bronze in the +90kg J2 category, to add to the gold he won in the 100kg event in Tokyo.",
        "Liverpudlian Powell is an all-around sportsman who shot to fame in 2018 when he appeared on ITV show Ninja Warrior UK, becoming the first person with a visual impairment to take part.",
        "After finishing seventh in Para-judo in Tokyo, he took up rowing, impressing there too.",
        "But with the judo classification changing to include separate divisions for blind and visually-impaired fighters in Paris, he made the decision to concentrate his efforts on it again.",
        "\"This a million per cent justifies the decision to come back to the sport,\" he said.",
        "\"I love fighting, I love judo, I love competing, and being able to fly around the world and compete is the most amazing feeling, and especially to be watched here by my little boy, Edward.\"",
        "As well as the silver medal, which sees him surpass the achievements of his father Terry, who won bronze medals in judo at the Seoul and Atlanta Games in 1988 and 96 respectively, he will also take pride from his dramatic golden-point semi-final win over French legend and home-crowd favourite Cyril Jonard.",
        "\"I loved beating the Frenchman in his back yard,\" Powell said. \"I have a lot of respect for the guy. He is a 10-time world champion. But for me, to be able to do that is why I do it.",
        "\"It was difficult physically in the final. I popped my rib in the semi-final so I had to shrug that off and calm down after that and not let my body get stiff and recover in a couple of hours.",
        "\"That is the hardest part, so I’m delighted I could come back, get warmed up and ready and give a show for myself in the final and win another medal for the Powell household.\"",
        "What's happening and when at the Paris Paralympics?",
        "Paris 2024 Paralympics medal table",
        "All you need to know about the Paris Paralympics",
        "Sport-by-sport guide to Paris 2024 Paralympics",
        "Paralympics 2024: What you need to know about classification",
        "Paralympics 2024: Who has been selected for the GB team?",
        "Paris 2024 Paralympics"
      ]
    },
    {
      "url": "https://www.bbc.com/sport/judo/articles/c1dmmx1xg03o",
      "main_category": "sport",
      "detailed_category": "judo",
      "topic": "Paralympics 2024: A guide to Para-judo at the Paris Games",
      "content": [
        "Dates: 5-7 SeptemberVenue: Champ-de-Mars ArenaGold medals on offer: 16",
        "Judo at the Paralympics is only open to athletes with a visual impairment. The rules are the same as for Olympic judo, except that the fighters start the bout gripped up.The sport's classification and weight divisions have been changed since Tokyo.Now, there are two categories of visual impairment: J1 and J2 rather than fighters competing together. In J1, athletes may have varying degrees of vision impairment, from some vision to fully blind. They wear a red circle to let others know that they may need guided support before, during and after a match. J2 athletes are partially sighted.Both the J1 and J2 categories now have four weight categories for men and women - men's 60kg, -73kg, -90kg and +90kg and women's 48kg, -57kg, -70kg and +70kg rather than the seven men's and six women's divisions in Tokyo.If an athlete has a yellow circle on their kit, it indicates that athlete is deaf as well as having a visual impairment.Contests take place over four minutes, not including breaks.Scores of varying degrees are awarded for throws, holding techniques or submissions with judokas bidding for an ippon to end the contest.However, if neither achieves an ippon, the player who has accumulated the greatest number of points, achieved through throws and holds such as a yuko and a waza-ari, by the end of the bout is declared the winner. Two waza-ari also make an ippon.Penalties (or shidos) are also given to the athletes for a range of reasons and can ultimately lead to victory and/or disqualification. Collecting four penalties can award victory to their opponent.If both judoka are tied on scores or penalties at the end of their contest, it goes to a 'golden score', where the first person to score wins, with no time limit.",
        "Chris Skelley claimed Britain's first judo gold at a Paralympics since 1996 when he triumphed in the -100kg event in Tokyo.Following the sport's classification and weight changes he now competes in the J2+90kg category and the world number four will be hoping to come away with another Paralympic medal.Like Skelley, Dan Powell is competing at his third Games while Evan Molloy will make his Paralympic debut.Powell was inspired to take up the sport by his father Terry, a two-time Paralympic judo bronze medallist, and has won world and European silver medals in the J1-90kg event while Molloy goes in the J2 -90kg event.",
        "Azerbaijan topped the medal table at the last Paralympics with eight medals, including six golds, but failed to land a title at either the 2022 Worlds on home soil or the 2023 Ibsa World Games.China and Iran are traditionally strong along with Turkey. Brazil are also perennial challengers - Willians De Araujo has dominated the J1 +90kg division while Rosicleide De Andrade (J1 -48kg) and Brenda Souza De Freitas (J1 -70kg) could figure on the women's side.And Ukraine, who managed a silver and four bronzes in Tokyo, will be hoping to win what would surely be an emotional gold - their best hope could be Anastasiia Harnyk in the J1 +70kg.",
        "One of France's leading medal hopes in the sport is Helios Latchoumanaya who won bronze in the -90kg event in Tokyo and this time will be chasing success in the J2 -90kg competition.Since Tokyo, Latchoumanaya has gone from strength to strength and won gold at the 2022 Worlds and the 2023 Ibsa World Games in Birmingham and is also European champion.Like four-time Olympic champion Teddy Riner, he is of Guadeloupe descent, leading to comparisons between the pair, and he will be keen to match Riner's Paris 2024 achievement and land gold for the hosts.",
        "One gold (Chris Skelley) and one silver (Elliot Stewart)",
        "Judo was first included in the Paralympic programme in Seoul in 1988",
        "Venue: Champ-de-Mars Arena",
        "Gold medals on offer: 16",
        "Judo at the Paralympics is only open to athletes with a visual impairment. The rules are the same as for Olympic judo, except that the fighters start the bout gripped up.",
        "The sport's classification and weight divisions have been changed since Tokyo.",
        "Now, there are two categories of visual impairment: J1 and J2 rather than fighters competing together.",
        "In J1, athletes may have varying degrees of vision impairment, from some vision to fully blind. They wear a red circle to let others know that they may need guided support before, during and after a match. J2 athletes are partially sighted.",
        "Both the J1 and J2 categories now have four weight categories for men and women - men's 60kg, -73kg, -90kg and +90kg and women's 48kg, -57kg, -70kg and +70kg rather than the seven men's and six women's divisions in Tokyo.",
        "If an athlete has a yellow circle on their kit, it indicates that athlete is deaf as well as having a visual impairment.",
        "Contests take place over four minutes, not including breaks.",
        "Scores of varying degrees are awarded for throws, holding techniques or submissions with judokas bidding for an ippon to end the contest.",
        "However, if neither achieves an ippon, the player who has accumulated the greatest number of points, achieved through throws and holds such as a yuko and a waza-ari, by the end of the bout is declared the winner. Two waza-ari also make an ippon.",
        "Penalties (or shidos) are also given to the athletes for a range of reasons and can ultimately lead to victory and/or disqualification. Collecting four penalties can award victory to their opponent.",
        "If both judoka are tied on scores or penalties at the end of their contest, it goes to a 'golden score', where the first person to score wins, with no time limit.",
        "Chris Skelley claimed Britain's first judo gold at a Paralympics since 1996 when he triumphed in the -100kg event in Tokyo.",
        "Following the sport's classification and weight changes he now competes in the J2+90kg category and the world number four will be hoping to come away with another Paralympic medal.",
        "Like Skelley, Dan Powell is competing at his third Games while Evan Molloy will make his Paralympic debut.",
        "Powell was inspired to take up the sport by his father Terry, a two-time Paralympic judo bronze medallist, and has won world and European silver medals in the J1-90kg event while Molloy goes in the J2 -90kg event.",
        "Azerbaijan topped the medal table at the last Paralympics with eight medals, including six golds, but failed to land a title at either the 2022 Worlds on home soil or the 2023 Ibsa World Games.",
        "China and Iran are traditionally strong along with Turkey. Brazil are also perennial challengers - Willians De Araujo has dominated the J1 +90kg division while Rosicleide De Andrade (J1 -48kg) and Brenda Souza De Freitas (J1 -70kg) could figure on the women's side.",
        "And Ukraine, who managed a silver and four bronzes in Tokyo, will be hoping to win what would surely be an emotional gold - their best hope could be Anastasiia Harnyk in the J1 +70kg.",
        "One of France's leading medal hopes in the sport is Helios Latchoumanaya who won bronze in the -90kg event in Tokyo and this time will be chasing success in the J2 -90kg competition.",
        "Since Tokyo, Latchoumanaya has gone from strength to strength and won gold at the 2022 Worlds and the 2023 Ibsa World Games in Birmingham and is also European champion.",
        "Like four-time Olympic champion Teddy Riner, he is of Guadeloupe descent, leading to comparisons between the pair, and he will be keen to match Riner's Paris 2024 achievement and land gold for the hosts.",
        "One gold (Chris Skelley) and one silver (Elliot Stewart)"
      ]
    }
  ]
}